{"author":"By Brian Meechan","title":"South Wales Metro rollout faces 'marginal' delay from Covid pandemic","news_category":"general","content":"This video can not be playedThese are the trains you will soon be catching in WalesThe rollout of a £750m integrated public transport network across south Wales faces a \"marginal\" delay due to the coronavirus crisis, its boss says.James Price of Transport for Wales (TfW) said the South Wales Metro project, set to be completed in 2023, will be delayed for \"months not years\".He said work on lines, funded by the Welsh Government and European Union, had already started.It comes as TfW is nationalised <https:\/\/www.bbc.co.uk\/news\/uk-wales-54635421> after a drop in passenger numbers during Covid.The Welsh Government has taken control two-and-a-half years after KeolisAmey won the £5bn Wales and Borders franchise contract <https:\/\/www.bbc.co.uk\/news\/uk-wales-44221184>.Ministers have spent £167m to keep TfW afloat <https:\/\/www.bbc.co.uk\/news\/uk-wales-54803261> due to a loss of revenue during the pandemic.The government-owned organisation will now take on the day-to-day running of services - which are currently only used bypassengers whose journey is \"essential\" <https:\/\/gov.wales\/coronavirus-travel>.\"The good news is that the Metro has been secured through government and EU funding and that continues,\" said Mr Price, TfW's chief executive.South Wales' inspiration is what happens in London - an integrated public transport network.The idea is passengers can use the same ticket or travel card across south Wales and the old Valleys Lines network using rail, tram and bus services - with Cardiff as the focal hub.Metro bosses have promised reduced journey times, greater passenger capacity on trains, more frequent and reliable services and better connections.TfW took ownership of much of the Valley Lines infrastructure from Network Rail in March 2020 as they worked towards a 2023 completion date - then Covid hit and lockdowns have affected progress.Work on upgrading track in \"preparation for electrification\" north of Cardiff started this year but the timeline has been hit.\"So the Metro work continues the new trains are on order as well so all the new trains are locked in,\"said Mr Price.\"People will see that there's been a marginal delay to timelines. I can't exactly say what that delay is yet because Covid obviously hasn't completely finished.\"The drop in passenger numbers and fall in income due to Covid has been so significant that KeolisAmey has been bailed out by the Welsh taxpayer as a \"last resort\"The company said last autumn it could not run the service as Covid meant the contract was no longer viable. It will continue to be involved in infrastructure, including upgrading the lines and trains.However, no-one - not even TfW - knows what the long-term impact of Covid on rail travel will be.Will people working from home because of coronavirus want to return to the office? Or are they happy working from their kitchen table?\"We think that whilst there'll be a short-term implication... certainly the times a day that people travel and some of the patterns will change, the fundamental need is still there and the demand will come back,\" Mr Price said.The Welsh Government has said it wants 30% of people to work from home long-term but it will be for businesses and workers to decide on that.Sustrans Cymru, a charity that encourages walking and cycling, thinks a good public transport system will still be \"essential\" after the pandemic.\"People going forward want to have a blended approach,\" director Christine Boston said.\"Nobody wants to work from home on their own for evermore and I think we've always needed to encourage people where possible to work more local.Sustrans feels the public transport network will be needed to take the pressure off the congested road network at peak times, especially on the M4 motorway and A470.\"We need people to work differently to create more space on public transport, so more people can travel more sustainably,\" added Ms Boston.\"There are lots of jobs that can't be done from home, there are lots of people who still want to go to a place of work when they can - it just means that fewer people will be forced to make those journeys every day at peak time."}