{"author":"","title":"Cornwall: 'Unbearable' stench of sewage on beauty spot beach","news_category":"general","content":"This video can not be playedThe sea is turned brown at Trevaunance CoveA lifeguard has described the \"unbearable\" stench of what he said was raw sewage which flowed on to a Cornish beauty spot beach.A video showing a slick of polluted water was filmed at Trevaunance Cove near St Agnes on Sunday.Local lifeguard Joel Henthorn said: \"The water was grey and frothing and smelled of sewage.\"South West Water (SWW) said a storm overflow was \"triggered briefly\" and other factors were also to blame.Mr Henthorn, chair of St Agnes Surf Lifesaving Club, said there were toilet roll remains flowing on to the beach after the pollution started at about 09:30 GMT.\"It was horrible, the smell was unbearable,\" he said.\"The beach was in a really bad state so we red-flagged it for people's safety.\"Children and families on half-term holidays had to leave the sea, he said.\"It's such a sad situation, especially in a place like this which was thought of as a safe place to swim,\" he said.An SWW spokesperson said the storm overflow \"triggered briefly following heavy rain\".It said: \"This was a short duration spill and is unlikely to have caused the level of discolouration shown in the video.\"On this occasion, we believe there were other factors which contributed to the discolouration, such as mud in the water dislodged by the heavy rain flowing into the area from a nearby stream and run off from agricultural land.\"The firm said it continued to \"increase investment in the region's infrastructure as part of our ongoing commitment to protecting and enhancing the natural environment\".\"As well as prolonged periods of extremely hot weather, we have seen heavy localised rainfall which hasn't been able to permeate into the dry ground, meaning significant volumes run into our network, which can cause our storm overflows to trigger.\"Storm overflows are designed to release excess storm water into rivers and seas when a prolonged rainfall occurs to prevent the risk of sewage backing up and flooding homes.Environmental campaigner Hugo Tagholm said: \"This is more of the same from the water companies, it's environmental vandalism.\"The government really needs to force the water companies to take action.\"Mark Spencer, Minister of State at the Department for Environment, Food and Rural Affairs, told BBC Breakfast: \"One incident is one too many and that's where we need to get to.\"It is not acceptable, we don't want that to happen and we are working with the water companies to prevent it in as short a time as possible.\"Nick Jones, who captured it on camera, said he hoped it would \"shock people into doing something\".\"We know enough to know better and hopefully this will shock people into doing something,\" he said.Mark Nason, chair of St Agnes Parish Council's Environment and Property Committee, said the pollution was \"unacceptable\" and it had asked SWW to appear at the next council meeting.Follow BBC News South West on Twitter <https:\/\/twitter.com\/BBCSpotlight>, Facebook <https:\/\/www.facebook.com\/bbcspotlight> and Instagram <https:\/\/instagram.com\/bbcspotlight>. Send your story ideas to spotlight@bbc.co.uk <mailto:spotlight@bbc.co.uk>."}