{"author":"By Malu Cursino & Emily McGarvey","title":"Dover delays: Long waits despite extra ferries overnight","news_category":"general","content":"Passengers arriving at Dover for the Easter getaway to France face lengthy waits despite extra ferries being laid on overnight to clear a backlog.Some passengers who arrived on Saturday were still stuck on Sunday morning.The port of Dover estimated waits of between six and eight hours for coach passengers, depending on the ferry operator.Officials cite slower border processing and a higher-than-expected number of coaches as causes of the delays.The port said 111 coaches were waiting to cross the English Channel on Sunday afternoon. More than 300 coaches departed from the port on Saturday.Disruption and delays were first reported on Friday night, and continued throughout Saturday.On Sunday morning, the port said roads to the port were cleared and cars were taking roughly one hour to get through - but coach passengers remain particularly badly affected.P&O Ferries said on Sunday afternoon that coaches faced a four-hour wait on arrival at the cruise terminal and a further six-hour wait after being called to a \"buffer zone\" at the port.Some coach passengers told the BBC their journey had been \"carnage\". One driver taking a group from Cardiff to Austria said they had been in the vehicle for 14 hours.On Saturday evening, holidaymaker Jennifer Fee said her coach was \"turning around and going back to London\" having been told there was \"no chance of a ferry today\".Ms Fee sent the BBC footage of passengers camped out on the floor of a service station in nearby Folkestone - where coaches had been \"stacked up\" due to delays at the port.The government has said it is in close contact with port authorities.In an interview with the BBC's Sunday with Laura Kuenssberg show, Home Secretary Suella Braverman said the delays were a result of a \"combination of factors\", including the high volume of coaches.She said she sympathised with families and school children trying to get away on Easter holidays, and expected the problems to ease soon.Labour's shadow levelling-up secretary, Lisa Nandy, told Sky News issues like the port delays could have been avoided \"if the government got a grip, got down to brass tacks and started doing the actual job\".Officials have explained that long border processing times were partly to blame for delays - and ferry companies said bad weather had disrupted some journeys.The port said ferry companies received 15% more coach bookings for the Easter period than what had been expected. Boarding coachloads of passengers is much slower than boarding cars.Responding to claims of lengthy delays in border checks, officials in northern France said on Saturday that there were \"no difficulties that we know of,\" but that many coaches had arrived to travel at around the same time.All border checkpoints were operational and border police had switched some car checkpoints into slots for coaches, French officials added.Simon Calder, travel correspondent at the Independent, said processing times since the UK left the EU had increased sharply \"and that would seem to explain the delays\".An EU border at Dover meant things were \"gumming up\", as each individual passport had to be inspected and stamped after Brexit, he told the BBC on Saturday.Asked whether the delays were a result of Brexit, Labour's Ms Nandy said: \"The point is not whether we left the European Union or not... the point was that we left with a government that made big promises and once again didn't deliver.\"And speaking to Sky News, Ms Braverman said viewing delays at the port as \"an adverse effect of Brexit\" would not be a fair assessment.Many coaches stuck in Dover have been carrying schoolchildren from across the UK on school trips abroad.Schoolteacher Sarah Dalby tells the BBC her group began their journey from Nottinghamshire nearly 24 hours ago, and are still in the queue for passport control at Dover.\"Nobody has been to speak to us in the whole time. There is no information available. No food or water,\" the head of science at Worksop College added.The port apologised for \"prolonged delays\" and said the tailbacks were being cleared.Although long delays have persisted, additional overnight services were put in place by ferry operators to clear the backlog, the port's chief executive, Doug Bannister, said last night.Have you been affected by the delays? Share your experiences by emailing haveyoursay@bbc.co.uk <mailto:haveyoursay@bbc.co.uk?subject=Dover65151700>.Please include a contact number if you are willing to speak to a BBC journalist. You can also get in touch in the following ways:If you are reading this page and can't see the form you will need to visit the mobile version of theBBC website <https:\/\/www.bbc.co.uk\/news> to submit your question or comment or you can email us atHaveYourSay@bbc.co.uk <mailto:Haveyoursay@bbc.co.uk>. Please include your name, age and location with any submission."}