{"author":"","title":"A mother shares her IVF, perimenopause and PMDD journey","news_category":"general","content":"It took Kim Ovel and her husband 12 years to have their first child, and another two to have their second.Despite the years of heartache, disappointment and £85,000 spent on IVF, the couple from Billericay in Essex refused to give up on their dream of having a family.When the boys finally arrived, they wanted to enjoy their time together but Kim's health took another turn.She was diagnosed with perimenopause, a phase that can last for 10 years before the menopause itself, and later premenstrual dysphoric disorder (PMDD).PMDD is an extreme form of premenstrual syndrome (PMS) and women can fall into severe depression and experience suicidal thoughts and feelings of being out of control in the run up to their period <https:\/\/www.bbc.co.uk\/news\/av\/health-53559904>.It is often argued not enough is known about the condition, which is currently being highlighted in the ITV soap Emmerdale.Here, in her own words, Kim explains her determination to help other women going through similar experiences.I had a difficult time growing up in Upminster but I eventually met Mark when I was 25 and after we got married in Portugal, we decided we wanted to try for children.I got pregnant naturally when I was 26 but we lost the baby at seven weeks. That was traumatic and after that things escalated.We started IVF but that was like a postcode lottery. Initially we were offered three cycles of the treatment but that was withdrawn at the first failed attempt so we decided to go private.We ended up having six courses of IVF privately.It took us 12 years to have our first child. For all those years, it was like a tunnel, we were so focussed on it. It was the toughest time and I was in and out of hospital.I had an ectopic pregnancy at a private hospital in Brentwood when I was 31 which almost ended my life.The hospital sent me home for the weekend after I was told the pregnancy in the womb had failed and there was no heartbeat but I also had a pregnancy in the tube which I had to have removed on the Monday.I remember sitting on my sofa and my family watched me go yellow and lethargic. By Monday, I was taken to Basildon Hospital and the anaesthetist asked me if I was always \"this colour\" and I started to lose consciousness.I remember my Dad phoning and me saying \"Daddy, I don't feel well\" and then I do not remember anything else until I woke up in the recovery room.But we did not want to stop trying for children. We had come this far and we did not want to give up, however hard it was.We took a break from trying for three to four months, and I ended up talking to a doctor who specialises in blood.After speaking to him, we had another go at IVF but unfortunately we lost the baby again.The doctor implied to me that my eggs had depleted early so the chances of us having a successful pregnancy were very slim.We were recommended a different avenue, which we took, but Mark said to me, if that didn't work, we would have to consider a surrogate.I said \"no, you have to give me one more chance, it's a no deal if you take that away from me\".Fortunately it worked and eventually through IVF Jacob was born in 2014 when I was 40 and we had Callum in 2016 when I was 42. They are my miracle boys.I had no problems at all after Jacob was born and was happy being a mum, but after Callum was born, I had a hormonal crash.While it is normal for women to have a hormonal crash after having a baby, mine never stopped.I was very insular, I became overwhelmed with mum life and the fluctuations and I was trying to breast feed whilst having psychosis episodes. Feelings of rage and sadness overwhelmed me.I didn't want to be a mum, I felt like my life was over and I felt resentful that being a mum was not what everyone made it out to be.When I sought help from my GP, I was told I had post-natal depression.I told them I was not depressed, I told them I'm a happy-go-lucky person and I have gone through a mammoth fight to have my children and I want to enjoy them.I carried on fighting on my own until I eventually found specialist Dr Jo Josson McConnell and she saved my life.She diagnosed me with perimenopause and she gave me testosterone and oestrogen. It literally changed my life, my mental health got better and I was able to enjoy my family and friends.But I started to feel low again, I felt really depressed. I went back to the doctor. It was happening on certain days of my luteal phase, from days six to 16. They were the worst two weeks of my life.Dr McConnell diagnosed me with PMDD when I was 44 and told me I could do with some help with the serotonin pathway receptors in my brain. But I felt like I was being labelled as depressed and I had fear and anxiety around this.We went back a long way to when I started my periods and we started to link things together from as early as 13 years old.My psychosis got worse and life became very tricky for everyone including my young children.Mark said \"Kimmy we need to try the medication\" and after two years of suffering, I tried it and it was an instant change of personality especially around the luteal phase.When this was all going on, I felt more women needed to be able to talk about it. From that I opened a hub in a local church, which later became anonline support group <https:\/\/www.instagram.com\/essex_menopause_pmdd_chat_hub\/>.I would never, ever want anyone to feel the way I felt, never. If you are not getting that support, it feels soul destroying, it's crazy how it affects your life.I carry on researching and learning, I have my own personal training business <https:\/\/www.instagram.com\/khf_kimshealthfitness\/> and I'm studying for a menopause diploma and a degree in nutrition.It's been the most amazing journey in some respects but it's been the biggest eye opener for how life is.It's a spiritual thing for me to give back to people. People need to know about this so they can identify it and get the right help, and know that there is help out there.Not everyone can afford private care; this is why we need to share the knowledge so that ladies and families have options.I have to have an oestrogen implant every three months and a testosterone pump. I am progesterone intolerant so I can only take one tablet of progesterone once every three months.My knowledge around PMDD has expanded working alongside my medical team. I have been having a therapy called EMDR (eye movement desensitisation and reprocessing) therapy that helps with the trauma of lots of different things including the loss of my child, failed attempts of IVF and ectopic pregnancies that left me fighting for my life.More needs to be known about PMDD though, it needs to be talked about.It's amazing that Emmerdale has addressed it for the younger generation and I applaud them - more knowledge means more power to get things changed for the better.I'm now 49 and I'm stable at the moment but this is the last of line treatment, I need to have my ovaries taken out and a hysterectomy but I've got to wait 18 months to see a consultant.I need to be the best person I can be for my kids, I don't want my children to deal with my issues.Mark has been an absolute rock, he is very understanding, listens and rarely makes judgements. I'm really grateful that I've got such a good support network and I'm just trying to live the best life I can.As told to Kate Scotter.Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}