{"author":"By Steffan Powell","title":"Call of Duty: The twins who 'stole' grandad's internet now playing for millions","news_category":"general","content":"Life wasn't easy for Bradley and Matthew Marshall growing up.The twins' parents split when they were 10 years old, money was so tight they couldn't get online and other kids in school teased them for being poor.\"At some points we had nothing, wearing the same school shoes for three years straight,\" Bradley tells Radio 1 Newsbeat.Today, aged 23, they're two of the best Call of Duty players in the world. They live in the US, their shoes are designer and they play for millions.Representing the London Royal Ravens they're in with a chance of being crowned world champions this month.The Call of Duty league playoffs have started, with 12 teams from across America and Europe competing virtually to be the best in the world and win a slice of a £3m prize pool.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.\"I remember we didn't have any internet so we were using our grandad's next door to play,\" laughs Matthew - better known in the CoD scene as Skrapz.\"He would be knocking on the wall going mad!\"We loved playing Call of Duty, it's what we did to stay off the streets and out of trouble, which was hard to do where we're from.\"When Matthew and brother Bradley (who competes under the name of Wuskin) did manage to get online they would play for money late at night against American players to perfect their skills.\"Grandad's internet came in clutch for us for years!\"In the end grandad cut them off and they \"begged\" their mum to set them up on the internet, but she couldn't always pay for it.\"We'd have to wait a week sometimes until payday for it to come back on so we could play - but she always made ends meet.\"The twins say they'd never have been able to become professional Call of Duty players without the support of their mum.\"She always made sure things were right with us and when my dad wasn't there, she played both roles,\" says Matthew.\"It got hard at times but she always made it look easy.\"This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.The twins' talent and skill started to shine and in 2016 Matthew qualified for the World Championships and travelled to play in Los Angeles.\"I stopped playing as much at one point,\" says Bradley. \"Then Matty ended up going to the World Championships in LA.\"\"This was the first time I'd seen what an event was really like, once I'd seen him do it I was like, what am I doing? I need to do this properly.\"The twins have competed at the top level of the game since then. They've lived in the US for two years and now they're two of the best known players in competitive Call of Duty.Bradley is deadly with a sniper rifle and Matthew is known for his aggressive style of play - getting up close and personal with opponents.There are around 75 million Call of Duty players worldwide, for a sense of scale of their achievement. Twelve teams play in the recently restructured Call of Duty League with on average only five players representing a team during a match.The Call of Duty League is trying to grow and compete with the other big esports titles out there. Top of the agenda is to use the experience of people like Bradley and Matthew to turn the millions of casual players into followers of the competitive scene.Johanna Faries, Commissioner of Call of Duty Esports tells us: \"We have stories to tell and a new pitch to make to the world.\"We've tried many different things to market to different parts of the player base, some of them work, some of them don't.\"We've seen incredible growth in our digital channels and on YouTube, so I think we're starting to learn. It's an everyday job, an everyday challenge.\"As for the twins they're focused on trying to be crowned world champions as the end of season playoffs begin. <https:\/\/callofdutyleague.com\/en-us\/schedule?utm_source=cdlweb&utm_medium=navigationbar&utm_campaign=general>The team's form this season has been inconsistent and they lost their first playoff match, but if they play to their potential, the London Royal Ravens have a shot at winning big.They're competing for a prize pool worth £3m.And now, they're also reflecting on how life has changed for them. \"I'll never forget the feeling when people used to take the mickey. It's nice to now be able to basically buy whatever I want - that feeling will never ever get old,\" says Bradley.\"Playing Call of Duty, representing London and getting paid to do it, what more can you ask for in life?\" says Matthew.Bradley adds: \"If it wasn't for Call of Duty, who knows where I'd be? It's a lot deeper than what a lot of people think.\"It's put me in a position where I can help my mum, and give back to her in a way I never thought I'd be able to.\"To see where we've come from to where we are now - it's a great feeling.\"Follow Newsbeat on Instagram <https:\/\/www.instagram.com\/bbcnewsbeat\/>, Facebook <https:\/\/www.facebook.com\/bbcnewsbeat\/>, Twitter <https:\/\/twitter.com\/BBCNewsbeat> and YouTube <https:\/\/www.youtube.com\/channel\/UCe1Ef-K5jpnRsmVY5hCBhOw>.Listen to Newsbeat live <https:\/\/www.bbc.co.uk\/sounds\/play\/live:bbc_radio_one> at 12:45 and 17:45 weekdays - or listen backhere <http:\/\/www.bbc.co.uk\/programmes\/b006wkry\/episodes\/player>. "}