{"author":"","title":"April Fool's Day: 10 stories that look like pranks but aren't","news_category":"general","content":"April Fool's Day is a time when people across the UK indulge in their silly side and trick family, friends, colleagues, and complete strangers - to the enjoyment of some, and the irritation of many.The tradition is also a chance for trusted broadcasters and newspapers to hoodwink a nation, like in 1957 when the BBC's Panorama programme put out the spoof documentary onSwitzerland's \"annual spaghetti harvest\", presented by Richard Dimbleby. <http:\/\/www.bbc.co.uk\/news\/av\/magazine-26723188\/is-this-the-best-april-fool-s-ever>So on 1 April, can the British public trust the more far-fetched stories in the papers?Here is a round-up of the more suspicious, but actually true, stories. 1. Road signs warning drivers not to run over hedgehogs could be rolled out across Britain. The population of the prickly creatures has plummeted and Parliament's official Hedgehog Champion (who is also the transport secretary) wants to help save them.More details (The Mail on Sunday <http:\/\/www.dailymail.co.uk\/news\/article-5566253\/Signs-warning-drivers-aware-wildlife-appear-UK.html>)2. A man who was stabbed in the back during a pub brawl returned to the bar to have another beer. The victim's knife was still in his back when he returned to the pub in Queensland, Australia, and went to hospital later. He is in a stable condition.More details (Sunshine Coast Daily <https:\/\/www.sunshinecoastdaily.com.au\/news\/man-stabbed-heads-to-pub-with-knife-sticking-out-h\/3376033\/>)3. A film about \"middle-aged men in Lycra\" is being released in UK cinemas next week. That's right - the unlikely hero of a new documentary is the so-called \"Mamil\", also known as men who cycle.More details (The Guardian <https:\/\/www.theguardian.com\/lifeandstyle\/2018\/mar\/31\/mamil-documentary-men-middle-age-cycling-lycra-health>)You might also like:4. A jigsaw fan said his marriage nearly fell apart while taking two years to complete a 33,600-piece puzzle. He worked on the 6m jigsaw for up to four hours a day. The ex-lorry driver said: \"I nearly got divorced because of the time I spent on it.\"More details (The Sunday Express <https:\/\/www.express.co.uk\/news\/uk\/938756\/Jigsaw-addict-completes-34000-piece-puzzle-two-years>)5. A homeowner in California has tried to ban Trump supporters from buying her house. The woman is selling up but has told her estate agent to filter out potential buyers based on their politics.More details (CBS Sacramento <http:\/\/sacramento.cbslocal.com\/2018\/03\/28\/no-trump-buyers\/>)6. Plans to name a bin after Nick Clegg have been scrapped. Manchester University's Students Union said the former deputy PM will not be granted the honour of being made Order of the Bin.More details (The Sunday Times <https:\/\/www.thetimes.co.uk\/edition\/comment\/corbyn-called-out-by-guess-who-0xggx39hh>)7. An 11ft alligator was caught bathing in a family's swimming pool in Florida. Authorities in Sarasota County in Florida shared pictures of the reptile along with the words: \"Just no.\" Video taken by the Sheriff's office shows the alligator appearing to enjoy himself as he does a quick lap.More details (Here <http:\/\/www.bbc.co.uk\/news\/world-us-canada-43610086>)8. People were asked to wear every item in their wardrobe for a photo project. Canadian photographer Libby Oliver's series aimed to explore how people express themselves through clothes, but she said: \"I have to move quickly, because those piles of fabric are quite suffocating.\"More details (The Guardian <https:\/\/www.theguardian.com\/artanddesign\/gallery\/2018\/mar\/31\/dressed-in-excess-people-put-on-all-their-clothes-in-pictures>)9. A group of artists released rats inside a Trump hotel room in New York as part of an exhibit. The group, who are not fans of the US President, spent 24 hours turning the hotel room into a jail cell.More details (New York Daily News <http:\/\/www.nydailynews.com\/news\/politics\/artists-turn-room-trump-nyc-hotel-rat-filled-exhibit-article-1.3907763>)10. A woman was fined nearly £1,100 for oil leaking out of her car. It sounds like a ludicrous proposition, but a Chislehurst resident was taken to court by Bexley Council after not resolving the issue because it was damaging the road surface.Found in the Sunday Mirror (more details in the Bromley Times <http:\/\/www.bromleytimes.co.uk\/news\/chislehurst-resident-fined-after-spilling-oil-1-5454795>)Compiled by Francesca Gillett, Rebecca Seales, and Alex Regan "}