{"author":"","title":"The TikTok fears and their impact on Africa","news_category":"general","content":"In our series of letters from African journalists, Kenyan broadcaster Waihiga Mwaura considers whether African governments should be joining in with the rising chorus of concern over TikTok.A sense of panic seems to be rising in some quarters about TikTok. Governments in the West are beginning to take action especially when it comes to data security, but there has been little official comment in Africa so far.The app's hypnotic format has taken the world by storm - and this continent is no different.The endless scrolling, the quickfire nuggets of information, the algorithm that seems to know what you want to see better than you do, serve to draw the user in. Before long, seconds turn to minutes, which can then turn to hours.A TikTok-induced headache might then follow, in which things are only understandable as long as they are presented in meme form.But resisting this onslaught might be fruitless and we, on the continent, should be paying attention.The 2022 Reuters Institute Digital News Report showed Africa to be a priority market for TikTok, with ever more young people using it to get the latest news.The social media app, owned by Chinese company ByteDance, is now offering support and a platform for creators across Africa who are beginning to find a voice that has been excluded elsewhere.They are challenging the more mainstream narratives about the continent and presenting the world with a different view.However, concerns have been expressed in many parts of the globe over its security features.TikTok has recently been in the firing line, not least from US lawmakers who grilled CEO Shou Zi Chew for over four hours in what was described as a \"Congress showdown\".The focus was over suspicions that user data gathered by the app could be accessed by the Chinese government.Fears over TikTok are not exclusive to the US - several countries are now banning the use of the app together with other social media platforms on government employees' phones because of insufficient data security measures.But there has been silence from African governments. No country on the continent has yet taken measures against TikTok.Speaking to some experts here in Kenya, there is the feeling that while data security is an issue, TikTok should not be the sole focus of attention.Kennedy Kachwanya, chair of the Bloggers Association of Kenya (Bake), reminds us of the accusations that UK-based Cambridge Analytica harvested user data in Kenya to help manipulate the outcome of elections in 2013 and 2017.The company, which has now folded, said in 2018 that it was employed as a marketing agency and was simply using social media to help its client to win.\"The issue of Cambridge Analytica was highly discussed in the US and UK but what they did in Kenya for example, back in the 2013 election was barely mentioned,\" Mr Kachwanya says.\"It is my feeling that Kenya and Nigeria were the testing grounds for them before the big use in the US and UK.\"For him allegations of what Cambridge Analytica could do indicated how user information could be used by third parties, either for commercial purposes, interference with the democratic process or to help with state surveillance.There are also allegations that anti-TikTok headlines reflect the concerns that its rivals are losing market share.James Wamathai, also from Bake, believes the targeting of Tiktok is fuelled by American hysteria and propaganda.The digital strategist says that \"US companies collect way more data\" and argues that they are frustrated as they appear to be \"unable to compete with TikTok\".There is also another concern over the safety of users and the potential for them to be exposed to inappropriate material.Gift Mirie, a manager at a Nairobi-based digital firm that handles social media influencers, closely followed the session with the TikTok CEO at the US Congress. He was surprised at how the 40-year-old was so forthcoming with information about the inner workings of the platform.His greatest issue however was that guarantees that Shou Zi Chew made about the safety of American teenagers were not extended elsewhere.\"We've seen how African youth quickly jump on global trends - what is the consideration for their safety in this algorithm protection plan?\" Mr Mirie asked.This week also saw a Senegalese lobby group, known as Restic, appeal to the regulator there to help control what young people can see.\"Unfortunately, the content on TikTok is very violent and some features in this context are not allowed by our traditions here in Africa,\" Resitc's Moustapha Diakhate told the BBC's Focus on Africa programme.\"We definitely want to see how we protect our kids who interact with this social media.\"All those I spoke to felt that data security and online safety should be a top consideration - regardless of where the parent company of the social media app in question is based.They challenge African governments to demand the same guarantees from technology companies that their counterparts in the West are receiving.Data that is freely offered up by users can be used for innocent marketing purposes. But in the wrong hands, whether that is an overbearing state or a foreign power, the information could be used for something more nefarious.Follow us on Twitter @BBCAfrica <https:\/\/twitter.com\/BBCAfrica>, on Facebook atBBC Africa <https:\/\/www.facebook.com\/BBCnewsAfrica> or on Instagram at bbcafrica <https:\/\/www.instagram.com\/bbcafrica\/>"}