{"author":"","title":"Umbrellas up at Lowestoft church to avoid bird droppings","news_category":"general","content":"People have taken to putting up umbrellas as they enter a church to protect themselves from bird droppings.About 200 kittiwakes have made their home on the tower of Our Lady Star of the Sea, in Lowestoft, Suffolk.Deacon Steve Pomeroy said some find the protected species a nuisance, but he considered them a \"blessing\".The church has been burning more incense to cover the smell of the droppings outside - \"being Catholics, we love our incense\", he said.The birds arrived about five years ago, the deacon said. \"It was a small colony of about 100, but they've found it more and more to their liking,\" he added.The kittiwake is on the conservation \"red list\" <https:\/\/www.rspb.org.uk\/birds-and-wildlife\/wildlife-guides\/uk-conservation-status-explained\/>, meaning the species has the highest conservation priority, requiring urgent action.\"From a distance you can see this ring of white around the tower where the birds are roosting, but not all the parishioners love them,\" said the deacon.\"And they do make a very interesting smell inside.\"As the seabirds have made their home above the entrance to the church, the deacon said: \"Some parishioners do come with their umbrellas.\"He admitted the exterior of the church was often covered in droppings, but he said the rain usually washed that off when the birds left in the autumn.Volunteers have been cleaning up at ground level so those attending services do not need to side-step the mess.But the deacon sees many advantages to having the gulls at the church.\"It makes for a lovely mass - we're not allowed singing at the moment so what we get instead is the kittiwakes calling,\" he said.\"There is a lovely piece of scripture that says something to the effect of 'blessed are those where the swallows nest above the altar of the Lord'.\"Well, some people would say these are like sea swallows - so maybe we are blessed in more ways than one.\"And we do feel we are doing our bit for caring for creation.\"Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}