{"author":"","title":"Coronavirus: Watchdog threatens legal action on holiday refunds","news_category":"general","content":"Firms that fail to refund people for holidays and weddings cancelled because of the coronavirus outbreak could face legal action by the consumer watchdog.The Competition and Markets Authority (CMA) says it will take companies to court if they flout the law.It says four out of five complaints made to its Covid-19 Taskforce are about cancellations and refunds.Issues include holidaymakers being pressured to take vouchers instead of refunds for accommodation.Meanwhile, some wedding venues are refusing to refund any money. The CMA said the holiday vouchers being offered can only be used during a more expensive period, while wedding venues are telling people to claim on their insurance.At the same time, the CMA said some nurseries were asking people to pay very high sums in order to keep a place open for their child.This video can not be played'We've saved so hard for so long for it, it's beyond belief almost'Consumer law requires that a full refund is offered if a business has cancelled a contract without providing any of the promised goods or services.This includes if no service is provided because of restrictions during the current lockdown or if a consumer cancels because of the restrictions.The CMA warning covers UK holiday accommodation and private events, but not the issue of refunds for cancelled flights - a subject that has caused widespread anger. That issue is regulated by the Civil Aviation Authority.Alice Jordan paid more than £1,800 for a special family holiday over Easter in a cottage on the Isle of Wight.Then she saw her plans thrown into chaos by the coronavirus outbreak.But she was also told that if she cancelled she would lose all her money. The agent was not cancelling the booking, but allowing customers to rebook instead, without incurring normal amendment fees.Initially, that was impossible, but the agent would not give her a refund. Later, when the cottage became available again, she discovered it would cost her £49 to secure it for the same period next year.Adam French, consumer rights expert at Which?, welcomed the CMA's move.\"We've heard from many distressed people who risk being left out of pocket for significant sums of money as they struggle to get refunds for cancelled weddings, private events, or holiday accommodation,\" he said.\"It's right the CMA investigates sectors that are skirting their legal responsibilities on refunds and cancellations by trying to rely on unfair and unenforceable terms and conditions.\"The regulator must be prepared to step in and take strong action against any businesses found to be breaching consumer law and taking advantage of consumers during these unprecedented times.\"The message from the CMA is that you cannot get away with flouting consumer law, even if you are struggling to deal with the impact of the virus.It takes a dim view of businesses which avoid paying refunds and, at the same time, apply for financial help from the government.The aim is to spark a rapid change in behaviour by making a big noise with these warnings, because clamping down can be a lengthy process.The body would have to force offenders to give an undertaking to address concerns, then take them to court if they broke the agreement.Nurseries will be covered by the investigation, but providers say some have been forced to go to parents for financial support.\"Nurseries are being put between a rock and a hard place during this crisis. They are being asked to remain open and run at a loss to provide emergency childcare, while those who can't open still face staffing and other costs which the government's support doesn't fully cover,\" said Purnima Tanuku, chief executive of the National Day Nurseries Association.\"As a result of a lack of insurance cover, delays to government support schemes and chronic underfunding of childcare places we know that some nurseries have asked parents for contributions to keep their businesses afloat.\""}