{"author":"By Faisal Islam","title":"Is UK being left behind in global fight for investment?","news_category":"general","content":"When the US Congress passed Joe Biden's Inflation Reduction Act last summer, the bill seemed built on good intentions. Designed to boost America's green economy and tackle climate change, the act included billions of dollars of subsidies for the purchase of electric cars and other eco-friendly products.But a provision that those subsidies will only be available to consumers who buy American-made products has enraged many European nations. They see it as a thinly-disguised attempt to grab a share of Europe's high tech manufacturing sector, including Britain's, by luring European companies to relocate factories to the US.Welcome to the global race for dominance of green technology, where the future of the planet and the global economy are entwined in a potentially risky geopolitical game.It is the US and the EU at loggerheads, but some East Asian nations are registering their displeasure too, and some in British business are wondering exactly where the UK stands in this growing row.While most countries subsidise green technology, it was Joe Biden's specific targeting of funds solely for North American-made cars that spooked many allies. People who buy passenger vehicles assembled in America now qualify for a tax credit of up to $7,500 (£6,000) .Many European firms were on the list of investors in US car production read out by Joe Biden when he unveiled the Inflation Reduction Act. But it isn't just cars that will be affected.Svein Tore Holsether, the boss of Norwegian fertiliser manufacturer Yara, told me: \"The US is putting in place a system that provides rewards for sequestering carbon and also for switching to green production at a level that really incentivises and drives investment.\"Questions are being asked in many [European] companies right now. Where are the incentives? Businesses are shutting down. New investments are being made in the US.\"Meanwhile, the French finance minister Bruno Le Maire told me: \"We shouldn't underestimate the impact of the Inflation Reduction Act... [French President Emmanuel] Macron has been very clear... First of all, we want to get some concessions from the US administration. We are friends and allies so we want to get some exemptions.\"Mr Le Maire said he would go to Washington with his German counterpart soon to raise these concerns. In fact, German Chancellor Olaf Scholz has already held direct discussions with top US senators and members of Congress over the Inflation Reduction Act.Mr Le Maire also wouldn't rule out the idea of Europe launching its own \"Buy European\" subsidies for green tech in response.\"Everyone understands that at some point in strategic sectors like green industry, there is a need to invest more and to have a kind of European buyback.\"Leo Varadkar, leader of Ireland, traditionally the closest US ally in Europe, was more direct. He said his country was \"not happy\" about the Inflation Reduction Act.\"There will have to be a response from the European Union and that will almost certainly involve providing state aid and subsidies to European businesses. The difficulty with that is you end up in a subsidy war, a subsidy competition,\" he said.What is clear is that the EU is about to respond to the massive American plan, despite concerns among members about sparking a trade war. And the White House is aware of the issues, having set up a US-EU task force to consider them.Where the UK stands in all of this is less certain. While the BBC understands that both the Business and Trade Secretaries have raised their concerns with their US counterparts, their precise demands are unclear. The Business Secretary Grant Shapps says the UK doesn't need a US-style package of green incentives, because the UK is already \"ahead of the game\".\"Actually we've done our investment to get renewable energy, which is what the US Inflation Reduction Act is all about. We've done it a decade ago,\" he told me.\"Which is why we don't just have the world's largest offshore windfarm, we've got the second largest and the third, the fourth and we've got another coming along that's bigger still.\"He's also confident the UK won't be overlooked in what may end up being an EU-US carve-up on this issue.He said he had also spoken to his opposite number in the Biden ministry, Climate Envoy John Kerry, and Mr Shapps says much of what the US is doing is welcome. \"The bits that actually could affect us, the protectionist bit, they're the edges that need to come off [this new bill].\"The current line from leaders that have discussed the Inflation Reduction Act with their US counterparts is that this was all an accident, and in drafting this legislation the US \"just forgot\" about Europe and committed an economic \"half aggression\".The reassurance has been that this was all aimed at China, not Europe. But there is no doubt that the heads of major European manufacturers are being turned. And while the needs of net zero do tend towards more of Europe's manufacturing being done in Europe, and likewise for North America, there is a red line that shouldn't be crossed, according to one European leader.If European export production, investment and jobs start to migrate over the Atlantic, things could get sticky, they told me.There's also concern this won't end with \"green technologies\". The supply chain bottlenecks sparked by the pandemic have made countries rethink their reliance on East Asia, and not just China, for manufactured goods.Spades are going into the ground across the EU and the US on new facilities for the production of microchips, with major western tech manufacturers attracting huge subsidies. Europe calls this \"strategic autonomy\", the Americans call it \"friend shoring\" or the restoring of supply chains to friendly nations.It signals the redirection of massive flows of investment away from their existing homes at a time when many industries are undergoing huge transformative change. This process could change the landscape of world manufacturing for a generation.Some in British industry fear an EU-US carve-up not just over electric cars, but microchips and other critical technologies. And it is clear that the \"globe\" which \"global Britain\" sought to engage after Brexit has changed significantly, raising quite fundamental strategic questions about Britain's future in the midst of it all."}