{"author":"By Reality Check","title":"Afghanistan: How many people has the UK resettled?","news_category":"general","content":"The government has announced new funding to relocate more than 8,000 Afghans who are currently living in hotels in the UK.The government says this will help move refugees into permanent homes, but critics say it risks making some Afghans homeless.The government says that more than 24,000 Afghans had arrived in the UK as of December 2022. Of these, more than 21,000 have been resettled under refugee schemes.Most came as part of Operation Pitting, the British military operation starting in August 2021 to evacuate British nationals and Afghans from Kabul.In written evidence to the Foreign Affairs Committee <https:\/\/committees.parliament.uk\/writtenevidence\/41257\/html\/>, Raphael Marshall, who previously worked on the Foreign Office's Afghanistan crisis response, estimated that between 75,000 and 150,000 people had applied for evacuation in August 2021.He estimated that 5% of these received assistance. The Home Office said another 1,400 former staff and their families had already been relocated since 2013 underan earlier scheme <https:\/\/www.gov.uk\/government\/publications\/afghanistan-locally-employed-staff-ex-gratia-scheme>.In April 2021 - before the Taliban took control of Afghanistan - the government launchedthe Afghan Relocations and Assistance Policy (ARAP) <https:\/\/www.gov.uk\/government\/publications\/afghan-relocations-and-assistance-policy\/afghan-relocations-and-assistance-policy-information-and-guidance> scheme.Under the scheme, Afghans who worked for the British military and UK government - for example, as interpreters - could apply to settle permanently in the UK, rather get five years' residency which was previously offered.The government also opened the Afghan Citizens' Resettlement Scheme  <https:\/\/www.gov.uk\/guidance\/afghan-citizens-resettlement-scheme>(ACRS) in January 2022, which it says will allow up to 20,000 refugees to settle in the UK.This scheme focuses on women and children as well as religious and other minorities in danger from the Taliban.Immediate family members of those eligible under either the ACRS or ARAP schemes are also eligible for resettlement in the UK.In 2022, 4,629 Afghans were resettled under these schemes but most are people who worked for the UK before Kabul fell in August 2021. Only 22 were brought in because they were vulnerable or at risk refugees.As part of an initiative called \"Operation Warm Welcome <https:\/\/www.local.gov.uk\/topics\/communities\/refugees-and-asylum-seekers\/council-support-afghan-resettlement>\", local councils have been allocated funding packages of £20,520 per person over three years.The funding will help refugees to enrol in education, find work and integrate in their new communities.The government is providing an additional £10m in the first year for housing costs, then £5m and £2m in the two following years.The government has announced a new £35m fund to help local authorities move around 8,000 Afghans out of hotels and into permanent homes across the UK. It will also add a further £250m to the local authority housing fund.The refugees will be given three months to vacate their hotels for relocation. The Refugee Council has expressed concerned that some Afghans may be left homeless by the new measures.The Home Office says that more than 9,000 Afghan refugees are still living in hotels <https:\/\/www.gov.uk\/government\/publications\/afghan-resettlement-programme-operational-data\/afghan-resettlement-programme-operational-data>while another 9,000 have either been moved to a permanent home or are waiting to move in.In February 2022, the Home Office said that accommodating Afghan refugees in hotelscost £1.2m per day <https:\/\/www.bbc.co.uk\/news\/uk-60249130>.They can come through the UK Resettlement Scheme which prioritises refugees from regions in conflict. In 2022, 36 Afghans came through this route.The other main way to settle is to seek asylum after arriving in the UK. However, proposed changes to the UK immigration system mean that people deemed to have arrived illegallycould be sent to Rwanda for processing <https:\/\/www.bbc.co.uk\/news\/explainers-53734793>.The number of Afghans arriving in the UK on small boats  <https:\/\/www.gov.uk\/government\/statistics\/irregular-migration-to-the-uk-year-ending-december-2022\/irregular-migration-to-the-uk-year-ending-december-2022>having crossed the English Channel has increased sharply:Home Office statistics also show <https:\/\/www.gov.uk\/government\/statistics\/immigration-system-statistics-year-ending-december-2022\/how-many-people-do-we-grant-protection-to#asylum-applications> that nearly 11,000 Afghans and their dependents applied for asylum in 2022.The US evacuated the largest number of people from Afghanistan after the Taliban seized power.From 14 August to 28 August 2021, it got 113,500 people out <https:\/\/apnews.com\/article\/middle-east-afghanistan-qatar-6c1e9e4ef1a9f0c3d19eac20b9321339>.Other countries evacuated much smaller numbers over that period, according to official statements and press releases:Since August 2021, some countries have continued to carry out occasional evacuations. On December 3 of that year, France announced that it had evacuated 258 people from Afghanistan.There was also an increase in the number of Afghans who applied for asylum in some EU countries such as Greece, France and Germany.What claims do you want BBC Reality Check to investigate? Get in touch <http:\/\/www.bbc.co.uk\/news\/uk-41928747>Read more from Reality Check <http:\/\/www.bbc.co.uk\/realitycheck>Follow us on Twitter <https:\/\/twitter.com\/bbcrealitycheck>"}