{"author":"","title":"Grant Shapps says Biden's green subsidies could hit world trade","news_category":"general","content":"Business Secretary Grant Shapps has warned that US President Joe Biden's green subsidies could herald a \"dangerous\" slide into protectionism.The $430bn (£350bn) scheme includes tax credits for green technologies aimed at attracting investment to the US.Last month International Trade Secretary Kemi Badenoch wrote to her US counterpart complaining it would \"harm multiple economies across the world\".The EU, Canada and South Korea have all argued it breaches world trade rules.Under the Inflation Reduction Act <https:\/\/www.bbc.co.uk\/news\/world-us-canada-62457386>, American consumers will get incentives to buy new and second-hand electric cars, to warm their homes with heat pumps, and to cook using electric induction.But the European Union has described the package as anti-competitive and a threat to European jobs <https:\/\/www.bbc.co.uk\/news\/world-europe-63852394>, particularly in the energy and auto sectors.Taking part in a panel discussion at the World Economic Forum in Davos, Switzerland, Mr Shapps said he did not believe the Act was designed to be protectionist, but that could be the result if it was not amended.Protectionist measures have the effect of restricting imports from other countries through tariffs or quotas on imported goods, or other regulations - generally with the aim of shielding domestic businesses and workers from foreign competition.Critics argue that protectionism reduces global trade and increases prices for consumers.Mr Shapps said: \"We are great global traders. We want the world to be as open as possible. It is very, very important that we don't slip into protectionism.\"That is where, at the edges, the Inflation Reduction Act in the US is dangerous because it could slip into protectionism... I think that's where we have to be really careful.\"However, speaking during a separate session in Davos, Labour leader Sir Keir Starmer said the Biden administration's green subsidies should be seen not as a challenge - but as \"the single biggest opportunity\" for a new economic strategy in the UK.He described the US scheme as a \"catalyst for all of us... to transition to take the jobs and opportunities of the future\".In September, Sir Keir announced plans to create a publicly-owned renewable energy company <https:\/\/www.bbc.co.uk\/news\/uk-politics-63046067>, Great British Energy, if Labour won the next general election.In December, Ms Badenoch warned the Act would adversely affect supply chains in batteries, electric vehicles and wider renewables.Also last month, European Commission President Ursula von der Leyen said the EU had to work with the US \"to address some of the most concerning aspects of the law\".She called on the EU to adjust its own rules on state aid to spur public investment in green technologies.This latest transatlantic spat comes after US labour secretary Marty Walsh criticised the UK government's bill <https:\/\/www.bbc.co.uk\/news\/64313013> imposing minimum service levels during strikes in some sectors, including the ambulance and fire services, and the railways.Under the bill <https:\/\/www.bbc.co.uk\/news\/uk-politics-64229196>, outlined in the Commons by Mr Shapps, some employees would be required to work during a strike and could be sacked if they refuse.Speaking in Davos on Wednesday, Mr Walsh told the BBC: \"I would not support anything that would take away from workers.\"Downing Street responded by saying the Strikes (Minimum Service Levels) Bill did not inhibit the ability of unions to strike - whereas, in the US, President Biden had taken action to block a walkout by rail workers."}