{"author":"By Alan Haslam","title":"EU funds: Community groups 'will suffer if money lost'","news_category":"general","content":"The most vulnerable people in society will suffer if community services lose funding at the end of March, organisations have warned.Money from the European Social Fund (ESF) is due to stop on 31 March as a result of Brexit.The UK government has promised to fill the void left by the removal of EU funds by 2024.But hundreds of charity and community group staff members have already been put on notice.BBC News NI has spoken to some groups about their concerns.Based in County Tyrone, Butterlope Farm provides education and training for adults with learning disabilities and people recovering from or experiencing mental health problems.It offers people the opportunity to gain farming and land management qualifications.The scheme is part-funded by the ESF, with funding matched by Stormont's Department for Agriculture, Environment and Rural Affairs (Daera).Annie Mullan, manager and tutor at the farm, said it would lose hundreds of thousands of pounds when EU funding stops.\"We can't provide the same course again,\" she said.\"People with disabilities are used to getting out, they have a right to these services and we will no longer be able to provide them.\"Ms Mullan said the farm was asked to present a new business plan to Daera to apply for funding.But with only weeks until funding stops, she said no decision has been made.The ESF has provided about £40m a year to community and charity groups, to which Stormont added another 35% of that figure.But the lack of a Stormont executive to make funding decisions could mean some groups will be forced to close or reduce services.Síofra Healy of the Community Foundation Northern Ireland, which arranges funding for community groups, said there were about 17,000 beneficiaries of ESF money across Northern Ireland.She said vulnerable people will suffer if funding does not materialise.\"The purpose of the ESF was to deal with poverty and economic inactivity - particularly for vulnerable groups,\" she told BBC News NI.\"Take that support away and the social impact in the long-run is huge.\"Ms Healy said there was no sign of help from Stormont, despite the imminent loss of jobs and services.\"We may be sleepwalking into this,\" she said.\"If we had all of our MLAs and MPs aligned on this they could be making a case to Treasury for some sort of interim arrangement - there really is no other solution.\"With an aim of promoting access to education and employment for women from disadvantaged communities, the Women's Centre Derry has provided services to 254 people over the last year.But staff may not have jobs next month.\"There's an awful atmosphere,\" said centre director Catherine Barr.\"Our staff are still here working to the max but with no idea what will happen in a few weeks.\"Having previously received funding from the Department of Health (DoH), the Department of Justice (DoJ) and the Department for the Economy (DfE), which matched funds provided by the ESF, the centre is now facing the possibility of closure.Ms Barr said she does not feel confident funding will be secured.\"It's a disgrace,\" she said.\"This funding was meant to be here in June last year but it feels like the government have been dragging their heels.\"We have skilled people doing great work and we don't want to lose them - some of them are single parents or have mortgages.\"Ms Barr said many of the centre's clients have mental health problems or caring responsibilities.\"Services for them have just stopped,\" she said.For more than 40 years, Include Youth has provided training and education for young people from disadvantaged backgrounds, some of whom are grew up in care.It works with more than 400 young people across Northern Ireland every year and, until now, has been funded by the ESF and the DfE.But director Paddy Mooney said the organisation had received no clarity over funding after the end of March.\"This is now beyond urgent,\" he said.\"Over 30 of our highly experienced staff are at risk of losing their job.\"Mr Mooney called for \"full support\" from government departments to ensure services can continue to operate.\"This is not the position we or any other organisations within the sector should be facing,\" he said.A DfE spokesperson said it empathised with the concerns of the entire sector but has no ability to finance their work beyond the end of March.It said the UK government had made clear that decisions made and allocations to projects \"will be made solely by the Department for Levelling Up, Housing and Communities (DLUHC)\".\"ESF funding support was due to end in 2022 but the DfE extended that support to March 2023 to avoid the cliff edge and give DLUHC time to put replacement funding in place,\" the spokesperson added.The DLUHC - which will oversee the replacement of EU funding - said the UK Shared Prosperity Fund (UKSPF) \"will, at a minimum, match previous EU funding in Northern Ireland\".\"As EU projects come to an end, funding from UKSPF will increase, reaching over £50m for Northern Ireland in 2023-24 and £74m in 2024-25,\" it said.A Daera spokesperson told BBC News NI: \"Daera does not provide funding to community groups through ESF.\"Whilst Daera has been able to provide some support to rural community groups in 2022-23 through the Tackling Rural Poverty and Social Isolation Framework, it is not yet clear whether funding will be available in 2023-24 to continue to do so until budgets for that year have been agreed.\""}