{"author":"","title":"Baby loss: Parents navigate difficult questions after losing a child","news_category":"general","content":"How many children do you have?It's a question that seems simple enough to some but can be incredibly challenging for a bereaved parent or carer. BBC journalist Alexandra Bassingham has been hearing from parents about how they navigate the difficult topic following the death of a child.When Charlotte Churchill's first child Jacob died just days after he was born, she found some people hid when they saw her.She believes this was to avoid potentially awkward conversations.Warning: this story contains images that some people may find distressing.If you are affected by issues raised in this article help and support is available via theBBC Action Line <http:\/\/www.bbc.co.uk\/actionline>.If you or someone you know needs support for issues relating to bereavement <https:\/\/www.bbc.co.uk\/programmes\/articles\/4MmhHDSbdDmTpVJhBs2v4Py\/information-and-support-bereavement> and emotional distress,these organisations may be also able to help. <https:\/\/www.bbc.co.uk\/programmes\/articles\/4WLs5NlwrySXJR2n8Snszdg\/emotional-distress-information-and-support>Jacob was a 9.5lb (4.3kg) \"healthy baby\" until complications during labour meant he was delivered with serious medical problems.He died five days later on 2 February 1999.The 49-year-old, from Somerset, said she understands friends can struggle to know what to say in such a tragic situation.\"Some people said things like 'it's God's will' or 'don't worry you're young enough to have another one',\" she said.\"It comes from a good place, I do believe that, but it's not helpful.\"Ms Churchill, who had two more children after Jacob, said: \"Being asked how many children I have is the hardest question, no matter how many years pass.\"Her advice to friends of the bereaved is to acknowledge the \"magnitude of what people have been through, the best thing to do is to be transparent, [because] you're showing you care\".\"The best thing is just to say 'I don't know what to say' or 'I don't have the words',\" she said.She said she felt lucky to have known Jacob for five days as it \"validated him\" but added that many people \"aren't that lucky\".\"People can feel uncomfortable saying Jacob's name but to a bereaved parent hearing their name is powerful... feeling your child is forgotten is really painful.\"Keith Le Grange, 36, and his wife Natalie, 34, had a \"normal pregnancy\" until she was exposed to parvovirus.The infection, also known as slapped cheek because of the face rash that develops, can be fatal for unborn babies.Tests showed baby Aurora had been \"severely affected\" by the virus and she was stillborn on 24 March 2018 at 24 weeks.Mr Le Grange, from Weston-super-Mare, said: \"There are people my wife felt were close friends who had been with her during her pregnancy [but] when she saw them after, they basically blanked her.\"They were too afraid to talk about it, or didn't know how to, but no matter how they were feeling, we were feeling worse.\"He said he wants people to know that if the person who has lost their baby does not want to talk about it \"they'll let you know\", but that \"silence was the worst thing\".Mr Le Grange said that for his wife, being asked how many children she had was something she struggled with for a while.\"Sometimes we say we have three children but lost one or we have three and then we say Eric's three, Rose is one and Aurora would be four.\"He said before Rose was born, he would occasionally say he had one child, as would his wife.\"Then she would beat herself up about it for days,\" he added.Denise Byrom was 27 weeks pregnant with her and husband Peter's eldest son, Thomas, when doctors discovered his heart had stopped.Mr Byrom, 46, said at that moment \"everything stops... then it tears you apart\".Thomas was \"born asleep\" on 5 January 2004.\"You've been planning what to get, what school they might go to and then you have to leave that behind you and just walk out of hospital,\" he added.\"I just remember holding the door open for a guy carrying a car seat.\"Mr Byrom, from Weston-super-Mare, now works as a mental health wellbeing coordinator and set up the Stillbirth and Neonatal Death Charity (Sands) United Bristol Football Club in 2019 to support bereaved dads and any man affected by baby loss.He said being asked how many children he has is a question he has answered \"in so many different ways\".\"Sometimes I'd say we have two, one was born sleeping, but then you see the face of the person you're talking to and realise 'I'm going to have to counsel you through this now because you don't know what to say'.\"\"I didn't ever want to be mean but I realised I had to say what I said to be gentle to myself and acknowledge I had two sons, Harrison, 17, and Thomas.\"A Sands spokesman said the issue of how to answer the question often arose at counselling sessions.Jen Coates, Director of Bereavement Support Services at Sands, said: \"For the most part, bereaved parents really want to talk about their baby, like any other children they may have; they are all part of their family, regardless of how much time has passed.\"It may be more upsetting for a bereaved parent if their baby isn't acknowledged, or someone doesn't ask about them or ask their name.\"Both Ms Churchill and Mr Byrom were inspired to help others dealing with bereavement following their own experiences.Ms Churchill is specialised in bereavement training and works with local authorities supporting families.She said bereavement is like \"walking along the beach and everything is still and calm but every now and again a huge waves comes and crashes over you\".\"It comes from nowhere,\" she said.\"That's the analogy I use to explain my grief.\"Follow BBC West on Facebook <https:\/\/www.facebook.com\/pointswest>, Twitter <https:\/\/twitter.com\/bbcbristol> and Instagram <https:\/\/www.instagram.com\/bbcwest>. Send your story ideas to: bristol@bbc.co.uk <mailto:bristol@bbc.co.uk>"}