{"author":"","title":"Suzy Lamplugh: Body find hope for 'closure'","news_category":"general","content":"The sister of a murdered estate agent hopes her body will be found so the family can \"finally have closure\".Suzy Lamplugh, 25, from London, disappeared in July 1986 and was declared dead, presumed murdered, in 1994. A body has never been found.Police have been searching the back garden of a house once owned by the mother of prime suspect John Cannan in Sutton Coldfield, Birmingham.Lizzie Bingham said the family were \"cautious\" about the latest search.A fourth forensic tent was erected closer to the house, in the garden, of the property on Wednesday.Ms Bingham told the BBC's Victoria Derbyshire programme: \"We have seen various police searches over the years so we are cautious.\"But we hope Suzy's body will be found and we can have the closure we really need.\"This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Owner Phillip Carey bought the home in Shipton Road from the mother of Cannan, a convicted killer.Mr Carey, 52, told the BBC he was yet to discuss with police whether he and his family would have to move out of the semi-detached house as the search entered day three.He said police were interested in what was underneath concrete where a garage once stood and the iron structure was dismantled by police.The Metropolitan Police is leading the operation, supported by officers from the West Midlands force.It was reported by The Sun that police allegedly missed the chance to catch the estate agent's killer because a senior detective fell out with her mother. <https:\/\/www.thesun.co.uk\/news\/7622791\/suzy-lamplugh-murder-suspect-missed-opportunities\/>The Met Police said a review was carried out in 2000 \"in line with its murder investigation policy at that time\".The review led to a reinvestigation, a spokesman said.A reinvestigation of the case has also drawn criticism when the back garden currently being searched was not dug up in 2003.Jim Dickie, a former Met Police deputy chief inspector who led a review of the case between 2000 and 2006, told the BBC: \"I don't think we did an extensive search there.\"The reason for that was that we had no evidence or intelligence to lead us to believe that John Cannan may have secreted Suzy's body there or indeed there was any other evidence which would assist with our review of the murder.\"He believed cold case detectives were likely acting on \"new evidence\".Ms Lamplugh disappeared after going to meet a client in Fulham. He was known only as \"Mr Kipper\" and was never traced.No-one has ever been charged in connection with the disappearance, but in 2002 police named Cannan as the only suspect.He always denied any involvement and no prosecution has ever been brought, with police citing insufficient evidence.Three days before Ms Lamplugh's disappearance, Cannan, now aged 64, was released from prison, where he had been serving a six-year sentence for rape.He bore a strong resemblance to an e-fit of a man with whom the estate agent was seen talking on the day she went missing - thought to be the mysterious Mr Kipper.According to reports, Cannan was nicknamed Kipper while serving his earlier sentence.In 1989, Cannan was jailed for life for the abduction and murder of Bristol newlywed Shirley Banks and two further rapes.Two sites in Worcestershire - a former Army barracks and a field outside the village of Drakes Broughton <https:\/\/www.bbc.co.uk\/news\/uk-england-london-10923257> - and a woodland in the Quantock Hills, Somerset, have also been searched in the hunt for Ms Lamplugh's body."}