{"author":"By James Melley","title":"Cost of living: Care workers going hungry for their job","news_category":"general","content":"Samantha Howe has been working in care for 12 years, travelling around the sprawling suburbs east of central Leeds delivering vital help to vulnerable adults.Across the country, this highly skilled job often pays the legal minimum. This year, Samantha and her colleagues have been given an 11% boost to their hourly pay rate, up to about £11 per hour.But despite this, the cost-of-living crisis is taking its toll, and the 32-year-old has had to ask her parents for help with her food bills.\"It's literally cereal and bed, or toast and bed. If I need to go to bed hungry, I will go to bed hungry.\"I'm living on my own supporting myself to be an independent person. But then to have to, at my age, ask my mum and dad for money, it feels degrading.\"Her colleague Melissa Senior is also struggling. \"Realistically, you should be able to afford to buy your own stuff, when you've got a full-time job,\" she said.\"You shouldn't be having to go home then and maybe eat cereal. I do stay because I do actually love the job, but sometimes you do think 'is it worth it'?\"Across England, the directors who run council care services warn they are facing the most challenging time they have ever known.They say the combination of the staffing crisis and rising costs is leaving vulnerable people short of the help that they need as demand rises.Samantha and Melissa work for Leeds-based Springfield Health Care, which provides care in people's own homes and runs care homes across Yorkshire and the north of England.Boss Graeme Lee says they have lost 10% of their staff since April. \"It's costing (staff) sometimes in excess of £30-£40 a week in order to be able to drive to their clients to deliver the quality service that they want to deliver... but some of them just can't afford to do it.\"Three-quarters of Springfield's work is paid for by local authorities, and in Leeds they've received a 10% increase, which they've passed on to staff.But Graeme says in other areas they have been offered as little as 3%.\"In the 28 years that I've been providing care services in Leeds, I'd say this is the most worrying time for the sector,\" he says.A new survey by the Association of Directors of Adult Social Services (Adass) of its members is warning that the rapidly rising cost of basic things is making already challenging conditions in social care much worse.Almost three-quarters of social care directors in England are reporting increasing requests for help.But as demand is increasing, the capacity to meet it is falling.A total of 82% of Adass members said they were worried about the stability of the care market by 2023\/24.Already, almost seven in 10 directors say that care providers are closing, ceasing trading or handing back contracts as they struggle with staff numbers.It can mean vulnerable people missing out on having their care needs met and delays for patients being discharged from hospital who need care at home.Sunnyside Nursing Home in Leeds is registered as having 36 beds, but eight are currently unfilled. One wing of the home is empty.\"We have referrals come through on our NHS email, at least 10 a week. We could fill every bed twice over,\" says owner Julie Brown.She adds that if they filled the rooms with local authority-funded residents, they would lose money because of the high cost of heating the rooms and the difficulties of recruiting staff.\"To fill the empty beds with people that were publicly funded, we will be £150-a-week short of costs. That's eight beds at £150, which is not really doable.\"Situations like this are causing concern in town halls across England, where councils have responsibility for providing most adult social care.In one day, three people who between them have decades of experience of the workings of different parts of the care system told me they had never been more worried than they are now.When that happens, you heed the warning. We've been talking about the care system that supports older and disabled people being in crisis for a long time.The government has promised to fix it, but their plan for the future does not change the reality of the situation now.Staff shortages and rising costs mean there will be people who don't get the care they need.Maybe it's a woman in her 80s, who needs some help to eat and drink properly. Without it she becomes dehydrated and disorientated, and has a fall. She then gets stuck in hospital because she now needs much more support to return home.Or there is the husband exhausted from caring for his wife of many years, who has dementia.Unable to get respite care, he does more and more until he breaks down, his own physical and mental health ruined.When we see a queue of ambulances outside a hospital, we take that as a sign of the pressures on the NHS, but it is also a sign of a wider health and care system that is not working.If families, the NHS and social care are to cope in the coming months, then that will take a care system that is able to recruit, retain and value the care staff it needs.Adass says without \"immediate and substantial help\" from the government, the current situation will become much worse when coupled with the increasing demand for services which is always seen in the winter months.The government said they were investing £5.4 billion to reform adult social care over the next three years. They said they valued the social care workforce, which is why they had provided an extra £500 million of funding for training and career development.Cath Roff, the director for adult social care at Leeds City Council, says in her experience, the current situation has never been so desperate.\"The need is now - it is immediate. We are on a burning platform, we are going into winter in one of the most vulnerable situations we have ever been.\"It's almost like a game of chicken, although it's not a game, is it?\" she says."}