{"author":"By Kate Scotter","title":"Perimenopause: 'I went from triathlon training to needing naps'","news_category":"general","content":"At 39, Emily Barclay was hit with irregular periods, crushing fatigue and mood swings. It took four years before she was diagnosed with perimenopause - a phase that can last for 10 years before the menopause itself, with similar debilitating symptoms.\"Everything was just wrong.\"That's how Emily felt when she started gaining weight, feeling exhausted all the time and \"totally out of control\".She couldn't understand it - she was fit, healthy and training six times a week for long-distance triathlons. But within three months, she went from preparing for Ironman events to \"needing a snooze every single day\".The personal trainer went to the doctor several times over the following four years and was repeatedly given conflicting advice.\"I just wasn't getting any answers. I was told I was stressed, that they needed to change what [contraceptive] I'm on, I needed to exercise more, I needed to lose weight.\"Emily says not knowing what was wrong with her was \"scary\" and that every couple of months, she would have \"episodes\" where she didn't feel like herself.\"I didn't understand what was happening and I was really scared about why I wasn't me any more,\" she says.\"I had episodes of just being psycho... It wasn't just being a bit ratty but proper angry and I would keep going back for arguments. Then afterwards, I would feel totally wiped out.\"It was terrifying, as I felt totally out of control. It's like you've been body-snatched and you're watching another person.\"Emily had \"endless\" hormone tests that all came back normal. She ended up conducting her own research and told the doctor she thought she either had chronic fatigue syndrome or perimenopause.Together, they identified that her symptoms seemed to run in conjunction with her menstrual cycle and at 42, she was finally diagnosed with perimenopause - a phase thatcan last up to 10 years <http:\/\/www.bridgewater.nhs.uk\/wp-content\/uploads\/2014\/02\/The-Menopause-what-to-expect-when-you-are-expecting-the-menopause.pdf> and cause hot flushes, night sweats and mood swings, similar to the menopause.\"I didn't know perimenopause even existed [but] I felt such a relief because I now knew what was going on,\" she says.\"I didn't know there was this transition, I just thought you toddled along happily and one day you had a few hot flushes, your periods finished and you were done.\"For most women in the UK, the average age of reaching the menopause is 51, but decreasing levels of oestrogen can cause perimenopausal symptoms.Emily struggled at first with the impact of the condition. She had been used to training for 12 to 15 hours a week through swimming, cycling and running, but felt too tired to exercise - something that had brought her social benefits as well as fitness.Many of her friends were from the Norwich-based triathlon club Tri-Anglia and the Bungay Black Dog running club, so she saw them less frequently.She also didn't finish the 2017 Outlaw Half Holkham - an event consisting of a 1.2-mile (1,900m) swim, 56-mile (90km) bike and 13.1-mile (21km) run - due to her symptoms and she pulled out of Ironman Vichy in France as the distances were double and she felt \"there was simply no point\" going.\"A huge part of [training] was socialising and catching up with people; I would run with one of my friends which was an opportunity to chat and I would do long runs with my dogs,\" she says.\"I felt lost not being able to do that.\"Source: Dr Susanna Unsworth from Cambridge Women's HealthThe 43-year-old decided not to take medication and instead adapted her lifestyle to \"allow for fatigue\". Cardiovascular exercise still \"wipes me out for days\" so instead she has taken up power-lifting.\"Now I know what it is, I feel happy to ride it out,\" she says. \"I don't take PT clients in the evening any longer, I allow time for naps, I make sure I get early nights when I need to.\"She has also channelled the years she spent trying to get answers into an online support service calledPerimenopause Hub <https:\/\/perimenopausehub.com\/>, where women with the condition all over the world can find out more about symptoms and get support.It has a Facebook group with more than 1,200 members and experts on hand to give advice. Emily, who says the project has \"grown and grown\", will also be hosting a three-day online summit on 20-22 March.\"The feedback has been phenomenal. People have been in contact and said they feel they are 'no longer alone', 'I'm not different', 'I'm not the only one going through this',\" she says.\"It's been lovely creating this community. It's like I've given permission to people to talk about it and that's really cool.\""}