{"author":"","title":"Pokémon 25: Woman with most memorabilia says brand is 'great escape'","news_category":"general","content":"As Pokémon celebrates its 25th anniversary, a woman with the world's largest collection of memorabilia says the brand still provides her with \"a great escape\".Lisa Courtney, from Hertfordshire, claimed the Guinness World Record in 2016 with 17,127 items of Pokémon memorabilia.Her collection has since increased to more than 21,000 items.On 27 February 1996, the games Pokémon Red and Blue were released in Japan.Since then, the brand has ventured into trading cards, television, manga, films and toys - with Miss Courtney eager to experience it all.The 33-year-old first discovered Pokémon when she read about a preview of its Japan release in a Nintendo magazine.\"I fell in love with it there and then,\" she said.Miss Courtney said she was \"over the moon\" when she heard it was coming to the UK.\"For me it provided, and still does provide, a great escape,\" she said.\"I was bullied at school and being able to come home and just sort of go into the world of Pokémon by playing the video games and reading the manga really helped me a lot.\"Miss Courtney said she had been collecting memorabilia for about 24 years.She has a vast range of items including plush toys, action figures, posters, books and even toilet paper.Miss Courtney gained the Guinness World Record after reading about the size of the previous holder's collection.\"I thought I probably had more than that,\" she said.After spending three weeks counting and photographing every unique item in her collection, the world record was approved.\"I had approximately double the amount of items as the previous record holder,\" she said.Miss Courtney said Pokémon had helped her become a more social person.\"I've met some of my best friends through it,\" she said.\"I'm not really on social media and I'm an introvert but Pokémon has helped me come out of my shell.\"The super-fan also credits Pokémon for broadening her horizons.\"I visited Japan which was great,\" she said.\"I did go over just to buy Pokémon but the country was incredible; everyone was so nice and the culture was fantastic.\"I'm now trying to learn Japanese while also studying computer game programming.\"Miss Courtney said she was looking forward to special merchandise being released for the 25th anniversary and believes there are many more years left for the brand the thrive.Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk"}