{"author":"","title":"Welsh police detentions under Mental Health Act rise","news_category":"general","content":"Detentions by Welsh police forces under the Mental Health Act increased by 20% in a year, new figures have revealed.In the 12 months to March 2017, a total of 1,825 people were detained in Wales compared to 1,500 the year before.Welsh police forces said they were working with partners to ensure people with mental health problems were given appropriate support.Charities have supported calls for earlier intervention to help those who are suffering a mental health crisis.Home Office figures in 2017 showed South Wales Police had Wales' highest number of mental health detentions at 679 followed by North Wales Police at 589.Gwent Police detained 287 people and Dyfed-Powys recorded 270. Mind Cymru director Sara Moseley said: \"There needs to be a greater focus on prevention, earlier intervention and recovery for people with mental health problems.\"We need to keep a focus on making sure that people get the right help and support when they need it, and wherever possible are prevented from getting to a crisis situation.\"Swansea-based mental health charity Hafal backed the calls for support for people in crisis situations.A spokesman said \"retaining independence and promoting the patient's recovery\" should be central to all interventions.South Wales, North Wales and Dyfed-Powys Police forces said they were all working to help people in a mental health crisis receive the appropriate care.South Wales Police said: \"Of the 679 people who were detained under S136 of the Mental Health Act 1983, 654 were taken to a health-based place of safety or A&E.\"North Wales Police Det Sgt Dave Brennan said: \"North Wales Police is continuing to work with its partners to identify the issues individuals are experiencing with a hope of preventing them falling in to crisis.\"More importantly, how we can assist individuals to better manage their own mental health needs.\"Dyfed-Powys Police Chief Constable Mark Collins said forces were responding to an increased level of demand relating to mental health-related incidents.He said: \"Police officers are still spending more time than they should be waiting for people in crisis to be admitted for treatment because of understaffing in NHS services.\"We will continue to work closely with our NHS partners with the ultimate aim of ending the practice of using police cells for those who are unwell.\"Both the Home Office and Gwent Police were also contacted for comment."}