{"author":"","title":"Mongolia country profile","news_category":"general","content":"Vast quantities of untapped mineral wealth have made Mongolia a target for foreign investors, transforming the country's tiny but fast-growing economy.In 1990, Mongolia abandoned its 70-year-old Soviet-style one-party system in favour of political and economic reforms and multiparty elections.This rapid change has taken place against a backdrop of political wrangling and government pledges to tighten control over the country's assets.Once the heartland of an empire stretching to Europe under Genghis Khan, Mongolia is a landlocked country dominated by sparsely populated steppe and semi-desert.A third of the population lives in the capital, while around 40% of the country's workforce is nomadic, herding livestock in the extensive pasturelands.President: Ukhnaagiin KhürelsükhUkhnaagiin Khürelsükh has been Mongolia's president since June 2021 after winning the presidential elections. He had previously been prime minister between 2017 and 2021.One of Khürelsükh's largest projects has been Mongolia's new oil refinery in Dornogobi province, built with support from India. When fully operational it will be capable of processing 1.5 million tonnes of crude oil per year - enough to cover domestic demand.Previously, as prime minister, he signed a series of new aid agreements with China, and oversaw Mongolia and US becoming strategic partners in 2019. He has also served as a mediator between Japan and North Korea, as well as contributing to bilateral relations with South Korea.Television is the most popular media, accounting for at least 60% of the market. Mongolian National Broadcaster, the only public service media group, is one of the most watched and listened to media in the country.Press freedom is generally respected, says the US-based NGO Freedom House, but media ownership is opaque and many journalists self-censor to avoid offending political or business interests.Some key dates in Mongolia's history:1206-63 - Genghis Khan unites Mongol tribes and launches a campaign of conquest which eventually results in the world's biggest land empire.1267-1368 - Weakened by disunity, the empire implodes. Ming troops oust the Mongols from Dadu - present-day Beijing.1380 - The Golden Horde is defeated by the Russian Prince Dmitriy Donskoy. Ming troops destroy the Mongol capital, Karakorum.1636 - The Manchu (Qing) empire conquers the southern Mongols, creating Inner Mongolia.1691 - The Qing empire offers protection to the northern Mongols, creating Outer Mongolia.1727 - The Treaty of Kyakhta fixes the western border between the Russian and Manchu empires, confirming Qing dominion over Mongolia and Tuva.1911 - The Qing dynasty falls and Outer Mongolia declares its independence. Russia and the Republic of China recognise its autonomy.1919 - The Chinese army occupies Outer Mongolia. 1921 - With Red Army support, Mongolian revolutionaries drive out Chinese and Tsarist forces and install the Mongolian \"people's government\".1924 - The People's Party chooses Lenin's \"road to socialism bypassing capitalism\" and renames itself the Mongolian People's Revolutionary Party (MPRP). The Mongolian People's Republic is proclaimed.1937 - Mongolian Prime Minister Genden is arrested in the USSR and shot for spying for Japan. The Minister of War Marshal Demid is poisoned aboard a Trans-Siberian train. Monasteries are destroyed and lamas murdered.1939 - Mongolian and Soviet troops commanded by General Zhukov defeat an invasion by Japanese and Manchukuo forces in the Battle of Khalkhin Gol\/Nomonhan.1945-46 - Yalta conference agrees to preserve the status quo - Soviet control - in Mongolia. Mongolians vote for independence in a UN plebiscite. Mongolia is recognised by the Republic of China.1966 - Soviet leader Leonid Brezhnev signs a friendship treaty allowing secret stationing of Soviet troops in Mongolia.1986 - A key speech by Soviet leader Mikhail Gorbachev in Vladivostokh opens the way to detente with China and the withdrawal of Soviet troops from Mongolia.1990 - Mongolia holds its first free multiparty elections.2002 - Dalai Lama visits. China denounces trip and warns Mongolian leaders not to meet the Tibetan spiritual leader.2005 - President George W Bush becomes the first serving US leader to visit Mongolia.2016 - Mongolia says it will not allow future visits by the Dalai Lama after China opposed a visit in November."}