{"author":"","title":"Children from Ukrainian family in businessman's home start school","news_category":"general","content":"Two Ukrainian children who fled the city of Kharkiv with their family have started school in the UK.The pair are part of a four-generation family of 10 which moved to a village near Cambourne, Cambridgeshireoffered by a businessman <https:\/\/www.bbc.co.uk\/news\/uk-england-cambridgeshire-60846632>.They came to the UK under the Ukraine Family Scheme <https:\/\/www.gov.uk\/guidance\/apply-for-a-ukraine-family-scheme-visa>, helped by a relative who is a British citizen.The mother of one of the children said she was \"very emotional\" about their first day at Caldecote Primary School.The family, ranging in age from 10 to 90, arrived in the UK last month. Eight of them took a flight from Albania to London Luton Airport, while two came by car and ferry, arriving four days later with their belongings and two dogs.They moved into a property provided by Mick Swinhoe, 52, who said he bought it as a \"project\" but offered it to provide refuge to a Ukrainian family saying it was \"better use\".One of the children's mothers, Valeriia, 37, said the pair were given worksheets in English, with Ukrainian translations, as they arrived at the school and hung up their coats and bags.\"It's like the first day ever at school for them,\" she said.\"They're really scared, but it's alright.\"Valeriia added that they were \"nervous\" but she hoped they would soon pick up English.\"My hopes are that it will be easy for them,\" she said.She added they had been worried because they were not allowed to use mobile phones and therefore could not use a translating app but \"prepared themselves a little bit\" by writing out common phrases.Valeriia said the children had also been concerned about school uniforms because in Ukraine they could wear whatever they wanted.\"They cried about this, they didn't want to wear uniforms, they wanted to have personality,\" she said.\"But then I explained it has to be done, everyone is wearing that.\"Valeriia's 12-year-old daughter is due to start at Comberton Village College secondary school near Cambridge in the coming days.She said the community had donated much of what they needed - including stationery, notebooks and lunchboxes and said she was \"so grateful\" for the help.Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk"}