{"author":"","title":"Hemsby residents fear cliff collapse as storms hit coast","news_category":"general","content":"Winter storms which led to about 20ft (6.1m) of erosion to sand dunes protecting a coastal village have left a lifeboat service unable to launch and one homeowner \"hanging on by my teeth\".Hemsby Lifeboat's coxswain Daniel Hurd said the \"shocking\" erosion in Norfolk could result in a large collapse.Lance Martin said he barely slept on Monday night amid fears his house could be washed away.Great Yarmouth Borough Council said it was finalising plans for sea defences.Mr Hurd said the independent lifeboat service was currently unable to launch due to a drop of several feet from its station to the beach.\"I've notified coastguards that if we are tasked to any job they may have to call another station, or wait for us to get shovels out and get a slip-way put in,\" he said.\"It's relentless at the moment.\"Mr Hurd said there was a sheer drop down the dune face.\"You've got kids running up and down there. There's going to be a collapse and I don't want kids to be trapped,\" he said.Mr Martin's home is the only one in a row of clifftop houses to survive 2018's Beast from the East storm <https:\/\/www.bbc.co.uk\/news\/uk-england-norfolk-43486116>.The former soldier said: \"It's an ever-shifting beach. I'm very worried about it.\"Last year, he hired a digger to shore up sea defences <https:\/\/www.bbc.co.uk\/news\/uk-england-norfolk-51479157> and he has previously moved his timber bungalow back 10 metres (32ft) from the cliff edge to save it <https:\/\/www.bbc.co.uk\/news\/av\/uk-england-norfolk-44010329>.On Monday night, he mounted a solar light on a pole at the end of his clifftop plot, vowing if that went he would leave the property.He now plans to use additional self-made sea defences to shore up the coastline.\"I'm hanging on by my teeth,\" he said.\"If we don't get something done this weekend, I don't think I'll be here by mid-week next week.\"Next week's tides are forecast to be 1-1.5m higher.Chairwoman of the council's environment committee, Penny Carpenter, said the borough was working with \"communities like Hemsby who are at the front line of climate change impacts\".She said preparations to consult on the design of a rock berm - a protective ridge - were being finalised \"to help reduce the rate of erosion\".Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}