{"author":"By Andrey Kozenko","title":"Alexei Navalny: How his team found Novichok bottle evidence in Tomsk","news_category":"general","content":"Russia's foremost opposition figure Alexei Navalny is now on the mend. He has left hospital in Berlin after a month of treatment for nerve agent poisoning in Siberia in August.Initially, suspicion focused on the cup of tea he had drunk at Tomsk airport. But it was the swift response of a member of his team that convinced German investigators that the Novichok agent had been administered earlier than that.As news emerged that he had fallen into a coma, Maria Pevchikh knew she had to act fast. She rushed to the hotel room he had checked out of that morning.\"It was not a decision we had to think about - it was obvious and it was the only way we could act in that situation,\" she told BBC Russian.Mr Navalny, 44, had been heading back to Moscow, leaving members of his FBK anti-corruption foundation behind in the Tomsk hotel to finish working on a local investigation.Maria Pevchikh runs his team. They have released many detailed reports alleging corruption and abuse of power at various levels of the Russian political and business establishment.\"Alexei was a healthy man, we had been with him for the past several days, first in Novosibirsk and then in Tomsk.\"\"Healthy people do not fall into a coma for no reason. We knew something was very wrong. And, of course, this is Russia. To my horror, poisoning here is almost the norm.\"If he had been poisoned, she reasoned there would have to be traces.A member of staff went with them to the room once the Navalny team explained what had happened, she said.\"Initially, they would not let us in, so we guarded the door to make sure no-one else got in first. We literally placed a chair in front of the door and took turns sitting on it.\"They had not planned what to do but as they entered the room they filmed everything <https:\/\/www.instagram.com\/p\/CFOnffrHZ0d\/?utm_source=ig_web_copy_link> as they went, later posting what they saw on Instagram.\"We walked in, we had the sense to bring rubber gloves, thanks to coronavirus we always have them with us now.\"Anything the opposition leader might have touched was collected.\"We collected everything he may have touched.\"In the video, members of Navalny team can be seen packing various objects, including three plastic water bottles, into blue plastic bags.The voice of a hotel staff member can be heard: \"If you are taking anything, you need police permission for that, I have been told by the (hotel) director.\"A Navalny staffer replies: \"Unfortunately, we cannot fulfil this demand.\"Maria Pevchikh and her colleagues assumed there was little chance they would find anything useful. As for being able to remove what they had collected, smuggle it out and pass it on for examination, the hope of that was \"even more microscopic\".There are no direct flights from Tomsk to Omsk. Alexei Navalny's plane had only landed in Omsk in an emergency.\"We drove to Novosibirsk and flew to Omsk from there,\" said Ms Pevchikh.Everything they had gathered from the room, including the three water bottles, was \"strategically placed\" in the team's luggage, to attract as little attention as possible.When Russian authorities eventually allowed the comatose opposition leader and his closest family and colleagues to fly from Omsk to Berlin, she too was on that flight.\"Had we not taken those bottles out of Tomsk, they would have disappeared without trace by now,\" she insists.That act of taking the bottle out of the hotel room, then taking the long route to Berlin, has provided significant evidence that he was poisoned before he reached Tomsk airport, she believes. But the bottle was not the source of the poison itself.Throughout this time, Mr Navalny was in a coma. German scientists said they had established \"unequivocal proof\" that he was poisoned by a Novichok nerve agent, and their findings have been backed up by laboratories in France and Sweden.But the Kremlin says tests on samples taken from him in Omsk have identified no toxic substances in his body. Although Russia does not completely reject the idea that he was poisoned, Kremlin spokesman Dmitry Peskov says Germany needs to hand over information \"which unfortunately has so far been denied to us.\"What is not known is how and when Alexei Navalny was poisoned, and whether anyone else was at risk either of poisoning or contamination.Biological weapons expert Vladimir Uglev earlier told the BBC that he thought this Novichok case was more targeted than the poisoning of Sergei Skripal and his daughter Yulia in Salisbury in March 2018. While they were attacked by a liquid, the Tomsk attack was different and therefore less dangerous to others, he argues.While Mr Navalny's anti-corruption colleagues were careful to use gloves in the Tomsk hotel room, his press-secretary has said that the traces of Novichok were found only on one of the water bottles and not on any of his other belongings.German investigators have not had access to the clothes he was wearing on the day he collapsed, and Mr Navalny this week appealed for their return from Russia. Health officials told Tass news agency the clothing had been seized by Russian investigators and they no longer knew where they were.For now the Kremlin critic is to remain in Germany to complete his rehabilitation but intends to return home.\"I hope one day we find out how Alexei was poisoned,\" says the team's leader. \"Now we have no idea. And it is not up to us to investigate this.\"This video can not be playedLaura Foster explains how the Novichok nerve agent works"}