{"author":"By Christy Cooney & Becky Morton","title":"Matt Hancock disputes claim he rejected care home Covid advice","news_category":"general","content":"Former Health Secretary Matt Hancock has disputed claims he rejected expert advice on Covid tests for people going into care homes in England at the start of the pandemic.WhatsApp messages leaked to the Daily Telegraph newspaper <https:\/\/www.telegraph.co.uk\/news\/2023\/02\/28\/lockdown-files-matt-hancock-whatsapp-whitty-care-homes-covid\/> suggest Mr Hancock was told in April 2020 there should be \"testing of all going into care homes\".Government guidance later mandated tests only for those leaving hospital.A spokesman for Mr Hancock said the messages had been \"doctored\".\"These stolen messages have been doctored to create a false story that Matt rejected clinical advice on care home testing. This is flat wrong,\" he said in a statement.The BBC has not seen or independently verified the WhatsApp messages nor the context in which they were sent.The Telegraph has obtained more than 100,000 messages sent between Mr Hancock and other ministers and officials at the height of the pandemic.The texts were passed to the newspaper by journalist Isabel Oakeshott, who has been critical of lockdowns. Ms Oakeshott was given copies of the texts while helping Mr Hancock write his book, Pandemic Diaries.In one message, dated 14 April, Mr Hancock reportedly told aides that Prof Sir Chris Whitty, the chief medial officer for England, had conducted an \"evidence review\" and recommended \"testing of all going into care homes, and segregation whilst awaiting result\".The message came a day before the publication of Covid-19: Our Action Plan for Adult Social Care <https:\/\/assets.publishing.service.gov.uk\/government\/uploads\/system\/uploads\/attachment_data\/file\/879639\/covid-19-adult-social-care-action-plan.pdf>, a government document setting out plans to keep the care system functioning during the pandemic.Mr Hancock said the advice represented a \"good positive step\" and that \"we must put into the doc\", to which an aide responded that he had sent the request \"to action\".But later the same day, Mr Hancock messaged again saying he would rather \"leave out\" a commitment to test everyone entering care homes from the community and \"just commit to test & isolate ALL going into care from hospital\".\"I do not think the community commitment adds anything and it muddies the waters,\" he said.A spokesman for Mr Hancock said this followed an operational meeting, where he was advised it was not possible to test everyone entering care homes.When the care plan was published on 15 April, it said the government would \"institute a policy of testing all residents prior to admission to care homes\", but that that would \"begin with all those being discharged from hospital\".It said only that it would \"move to\" a policy of testing everyone entering care homes from the community.From March 2020 to January 2022, there were 43,256 deaths involving Covid-19 in care homes in England,according to the Office for National Statistics <https:\/\/www.ons.gov.uk\/peoplepopulationandcommunity\/birthsdeathsandmarriages\/deaths\/articles\/deathsinvolvingcovid19inthecaresectorenglandandwales\/deathsregisteredbetweenweekending20march2020andweekending21january2022>.Social Care Minister Helen Whately, who held the same role in 2020, said \"the importance of testing was never in doubt\" but \"tough decisions\" on prioritising the tests available had to be made.Responding to an urgent question from Labour in the Commons, she said \"selective snippets of WhatsApp conversations give a limited and at times misleading insight\".She pointed to an email at the time which said the government should \"press ahead straight away\" with hospitals testing patients being moved to care homes and that the government should \"aspire to, as soon as capacity allows\" for testing of everyone going into care homes.This video can not be playedMinister Helen Whately: Hancock leaked messages in press are \"very selective\".But Labour's shadow social care minister Liz Kendall questioned why care home residents were not prioritised and accused Mr Hancock of \"attempting to rewrite history\".A spokesman for Mr Hancock said the then-health secretary \"enthusiastically accepted\" advice from the chief medical officer on 14 April that testing was needed for people going into care homes.\"Later that day he convened an operational meeting on delivering testing for care homes where he was advised it was not currently possible to test everyone entering care homes, which he also accepted,\" he said.\"Matt concluded that the testing of people leaving hospital for care homes should be prioritised because of the higher risks of transmission, as it wasn't possible to mandate everyone going into care homes got tested.\"There is always the temptation to see things as black or white when it comes to Covid. This story is a classic example of a seemingly simple claim that does not have a straightforward answer. As Prof Sir Chris Whitty made clear in his December report on the pandemic, the problem the UK faced was that there was not enough tests available.By mid-April only around 20,000 tests a day were being done. It meant testing had to be strictly rationed - it was being used to test people with symptoms and only then if they were in vulnerable settings such as hospitals or care homes or they were key workers. A member of the public in the community who had symptoms could not access tests.The decision to test care home residents whether they had symptoms or not (so including asymptomatic testing) was a break from that.The judgement was taken that at first the asymptomatic testing would only be done for those admitted directly from hospital as those people were deemed at highest risk. Eventually people admitted to a care home from the community were tested as testing capacity expanded rapidly in May.But for it to be done any earlier it would have, it seems, meant tests not being made available for another key group.This does not mean there are no lessons to be learned or questions to answer on this issue.But what it does show is that when it comes to Covid there are very few issues that are as simple as they seem.Read more from Nick <https:\/\/www.bbc.co.uk\/news\/health-64810815>.Mr Hancock's spokesman accused the Telegraph of doctoring the messages by excluding a line from a text from one of his aides which \"demonstrates there was a meeting at which advice on deliverability was given\".The statement added: \"By omitting this, the messages imply Matt simply overruled clinical advice. That is categorically untrue. He went as far as was possible, as fast as possible, to expand testing and save lives.\"It said that the right place to analyse what happened during the pandemic was the public inquiry, which is now under way and is due to begin hearing evidence in June.Ms Oakeshott has defended her decision to release the messages, arguing it will be many years before the inquiry reaches any conclusions and we \"cannot wait any longer for answers\".During Prime Minister's Questions, Labour leader Sir Keir Starmer called for the inquiry to report by the end of the year with \"no more delays\".In response, Rishi Sunak said the inquiry was \"the right way for these things to be looked at\" and that he would not comment on \"piecemeal bits of information\".\"There is a proper process to these things. It is an independent inquiry. It has the resources it needs. It has the powers it needs and what we should all do in this House is let them get on and do their job,\" he said.The Liberal Democrats said the messages \"lay bare the chaos at the heart of the government during the pandemic, and the mistakes that led to countless lives being needlessly lost\"."}