{"author":"","title":"Welsh councils facing real-terms cuts to funding","news_category":"general","content":"This video can not be playedAlun Davies: People will find local services diminishing after a very difficult funding settlementAll councils in Wales are facing real terms cuts to their funding from the Welsh Government next year.The Isle of Anglesey, Conwy, Flintshire, Powys, Monmouthshire and Gwynedd are the worst hit.Six south Wales councils can expect more cash, but the increases are below the inflation <https:\/\/www.bbc.co.uk\/news\/business-45572856> rate of 2.7%.Conservative local government spokesman Mark Isherwood called the settlement a \"kick in the teeth for north, mid and west Wales\".Welsh Government funding forms the bulk of cash used by councils to fund services, including leisure centres, schools, waste and care provision.Alun Davies, Local Government Secretary, announced that overall council funding <https:\/\/gov.wales\/topics\/localgovernment\/finandfunding\/settlement\/lg-settlement-2019-20\/provisional-settlement-2019-20\/?lang=en> will be cut in cash terms by 0.3% to £4.21bn, equivalent to £13m.Local government reacted angrily to the announcement, with the Welsh Local Government Association saying the funding \"simply does not provide enough resources to fund local services\".It contrasts to the increase in health spending expected in next year's budget.The Isle of Anglesey, Conwy, Flintshire, Powys and Monmouthshire will see a 1% cash cut to their funding.Cardiff will see the greatest cash increase, at 0.4%, while Merthyr Tydfil and Rhondda Cynon Taf will see a 0.3% increase.Newport and Neath Port Talbot will see a 0.2% increase, while Swansea's cash settlement will remain stable.By Felicity Evans, BBC Wales political editorThe thing local government is really tamping about is that the Welsh Government did not pass on more of the extra money it got from the UK Treasury.This came to Wales as a result of the prime minister promising the NHS in England more money. The Welsh Government has the power to spend its share of that money however it wants, but it has directed the bulk of it to health.Welsh councillors think the government is giving the NHS too big slice of the cake, and leaving their social care obligations with the crumbs.One senior local government source said to me earlier: \"They can't say social care is a priority, or prevention [of health problems] is a priority and then come up with a budget like this.\"There will be some extra money coming their way - an extra £30m for social care and £15 million for education - but they are grants and they come with strings attached.Welsh councils want control of how to spend their money. They want it in their core funding, so that they can make local decisions on their big services: social care, housing, transport and schools.Mr Davies said after last year's Welsh Government budget councils were actually facing a 1% reduction, equivalent to £43m.He said: \"We have worked hard, across government, to offer local government the best settlement possible in this ninth year of austerity.\"As a result, the £43m cut has been reduced to less than £13m, including floor funding, which equates to a reduction of 0.3% on a like-for-like basis compared to the current year.\"A total of £60m capital funding over three years is also being provided for a local authority road refurbishment scheme.\"Austerity comes with real world impacts and people are going to find local services diminishing as a consequence of the austerity that we've seen from London and that is going to have consequences in communities up and down Wales,\" he told BBC Wales.Local government sources had hoped for an average of a 1% increase.Anthony Hunt, the WLGA's finance spokesperson and Labour leader of Torfaen council, said he feared \"the wrong decisions have been taken in this budget.\"\"As Labour leaders in Wales, we call on the Welsh Government to enter into immediate dialogue with councils to see how we can work together to avert what will otherwise be a deepening crisis in the funding of our children's schools, social care for vulnerable people and the other vital services that people value and rely on.\"\"This settlement is a kick in the teeth for north, mid and west Wales,\" said Conservative local government spokesman Mark Isherwood.\"It is cronyism of the highest order and it is council tax payers across the region that will be paying the price.\""}