{"author":"","title":"Scotland v Ukraine: Tartan Army sing opponents' anthem","news_category":"general","content":"Scotland fans joined in singing the Ukrainian anthem at Hampden Park in a show of support for their World Cup play-off opponents.Flyers containing a phonetic version of the national song were handed out before the match and members of the Tartan Army sang along in solidarity.It was Ukraine's first competitive game since the Russian invasion in February.Amid remarkable scenes they defeated Scotland 3-1 and will now face Wales in Cardiff on Sunday for a place in Qatar.The Ukraine players walked on to the pitch with the national flag draped round their shoulders before an emotionally charged rendition of the national anthem.It was followed by a rousing chorus of Flower of Scotland before the match kicked off at 19:45.But the Tartan Army were silenced after 33 minutes when Andriy Yarmolenko lobbed Scotland goalkeeper Craig Gordon to give the visitors a 1-0 lead at half-time.Just four minutes into the second half a Roman Yaremchuk header doubled Ukraine's lead, before Callum McGregor scored to give the hosts hope with 11 minutes left to play.But deep into injury time Artem Dovbyk scored a third and ended Scotland's World Cup dream.Ahead of the match Scotland's national pipers learned the Ukrainian national anthem to make the visiting fans feel welcome.\"It actually fits perfectly on the scale, it sits nicely with the drone and is a lovely tune for the pipes,\" Finlay MacDonald, the group's director of piping, told BBC Radio'sGood Morning Scotland programme <https:\/\/www.bbc.co.uk\/sounds\/play\/m0017rx8>\"As musicians sometimes you feel kind of useless when there's obviously such a terrible situation going on, but we thought this is something we can offer, playing this tune in support of the Ukrainian people.\"We're all behind Scotland as a football team, but we're definitely behind the Ukrainian people in their bigger battle. It's just a symbol of our support for them.\"Some Ukrainians travelled from far afield to be at Hampden.Marco Biuss, a first generation Canadian-Ukrainian, flew to Glasgow from Toronto.\"It's more than just a regular football match,\" he told BBC Scotland. \"Emotions are going to be running high.\"Once we hear the Ukrainian national anthem playing in the stadium, I am sure we will all have tears in our eyes. We hope Ukraine will win and Ukraine will prevail in the war.\"John Babiack, a first-generation Ukrainian-American, has been volunteering in Ukraine for two months supporting the Red Cross and other organisations.\"It's a little conflicting for me because I'm here to be a fan and support our national team, but I've just left a war-torn country and it absolutely pulls on the heart strings,\" he said.\"I hope the game will be magnificent and there will be no loser tonight.\"This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Steven Kerr was taking a group of Ukrainian children from the Dnipro Kids <https:\/\/dniprokids.com\/> charity, who were brought to Scotland earlier this year, to the match.\"They'll have the Ukrainian flag on their cheeks, we've got them all Ukrainian flags and I'm sure it will be very emotional for them,\" he said. \"Given what they've been through, they're all very excited to be able to go and support their home country.\"There'll be no split loyalties for me though. I am in the Ukrainian section with the kids so might have to sit on my hands but I want to see Scotland win and go to the World Cup.\"Former Scotland skipper Graeme Souness has sparked debate in recent days after declaringhe wants Ukraine to win <https:\/\/www.thesun.co.uk\/sport\/18725143\/graeme-souness-ukraine-world-cup\/> on Wednesday, to qualify for the World Cup and go on to win it.\"My emotions when I think about it deeply are that it's more important than football to send a message that Russia's behaviour is unacceptable - the world has to unite and tell them that,\" he said.Colin Hendry, who captained the men's team the last time they qualified for a World Cup in 1998, says he \"understands where Graeme is coming from in terms of the bigger picture\" in Ukraine but \"can't agree with it entirely, because sport is sport\".Nevertheless he believes the Ukraine players will receive \"the biggest cheer they've ever heard\" when they walk out at Hampden Park. \"I know The Tartan Army will be fully behind them when they come out for the warm-up,\" he said.Leanne Crichton, part of the Scotland squad at the 2019 Women's World Cup, also agreed the \"entire Hampden roar\" would be felt by both sets of players in the countdown to kick-off.But once the game gets under way, she expected normal service to resume.\"The Scotland players have a job to do and I think the Ukrainian players will also understand and respect the fact that Scotland want to get to a major tournament as much as they do,\" she said.\"For that moment, I think they will be really glad to just focus on football, with everything else that's been going on externally, which has been horrendous.\"They have been in camp for a while now, they have had time to prepare and concentrate on the game, and they will look to drive that emotion into their performance tonight.\"Meanwhile in Aberfeldy, Perth and Kinross, Ukrainian refugees and their host families were expected to watch the game in the bar of a local hotel.\"A lot of the families are integrating already in Aberfeldy really well and it'll be a nice occasion to get everybody together,\" owner Gavin Price told Radio Scotland.Tetiana Lukianenko, a Ukrainian refugee now staying in the town with her new baby, husband and father, said the match would be \"quite symbolic for everyone\".\"Whichever team wins, we'll be happy in any case because we are just very happy to be here,\" she said."}