{"author":"","title":"Energy price: Calls for Wales to copy English council tax rebate","news_category":"general","content":"The Welsh government says it will make an announcement \"in due course\" on what it will do with £175m resulting from a council tax rebate in England.Chancellor Rishi Sunak has announced a rebate for residents in band A-D properties,after the energy price cap was hiked <https:\/\/www.bbc.co.uk\/news\/business-60242432>.Welsh Conservatives say Labour should match the plan.Labour Welsh ministers say they want to target the extra money to \"those who need it most\".They accused the UK government of loading \"even more costs\" onto consumers bills after it announced a Great Britain-wide electricity bill discount of £200 from October that will be paid off in £40 instalments over five years.Citizens Advice Cymru warned 230,000 low-income households would not benefit from an England-style rebate, because they do not have to pay the tax through Welsh government council tax benefits.On Thursday the energy regulator Ofcom announced that the price cap will rise by £693, with average bills climbing to £1,971.In a statement Social Justice Minister Jane Hutt said her colleagues \"are considering how to target this at those who need it most. A further announcement will be made in due course\".\"It is time the UK government acted to support households and to address the turmoil in the domestic energy markets.\"She called for social policy costs on household energy bills to be moved to general taxation, and further and increased support through the warm home discount and other winter fuel payment schemes.The Welsh government said that band D council tax in England is £167 higher on average than in Wales.Earlier this week Cardiff ministers announced they would double a fuel help scheme for people on working age benefits,from £100 to £200 <https:\/\/www.bbc.co.uk\/news\/uk-wales-politics-60202441>.Welsh Conservative Senedd leader, Andrew RT Davies, said: \"As the British economy continues its recovery from the pandemic, we must confront the global inflationary pressures caused by the world economy coming swiftly back to life.\"\"With Labour ministers in Cardiff Bay set to receive £175m as a result of the Chancellor's action plan, it's vital they use this money immediately to fund tax rebates and create a discretionary fund for local authorities to use on households who do not meet the criteria.\"Plaid Cymru Treasury spokesman, MP for Ceredigion Ben Lake, said: \"The [UK]government needs to re-evaluate its decisions - tax hikes and welfare cuts are simply not what households or businesses need right now. I urge the chancellor to increase Universal Credit now and to match Plaid Cymru's funding calls to end fuel poverty this decade in Wales. \"It is now for the Welsh government to get funding out of the door and to households, including those unconnected to the mains gas grid. But we need to do more and implement improved household energy efficiency measures to reduce bills, benefit our climate and give us long-term energy security.\"Rebecca Woolley, Director of Citizens Advice Cymru said: \"The package of measures announced by the UK government will provide some relief for all households in April, but it doesn't go far enough for people on low incomes.\"Energy rebates are a buy now pay later solution which only provide temporary relief later this year.\"She added: \"The Welsh government needs to intervene to make sure those who have been hit hardest by the pandemic, are not left even further behind.\" In the Commons the Chancellor Rishi Sunak said: \"The price cap has meant that the impact of soaring gas prices has so far fallen predominantly on energy companies.\"It is not sustainable to keep holding the price of energy artificially low.\"For me to stand here and pretend we don't have to adjust to paying higher prices would be wrong and dishonest.\"But what we can do is take the sting out of a significant price shock for millions of families by making sure that the increase in prices is smaller initially and spread over a longer period.\""}