{"author":"","title":"Losing Oldham Coliseum a dreadful blow, town's residents say","news_category":"general","content":"The loss of Oldham Coliseum, which cancelled all its upcoming shows after its funding was cut, is a \"dreadful blow\", the town's residents have said.The theatre, which has a 138-year history, announced on Wednesday it had axed its programme beyond March <https:\/\/www.bbc.co.uk\/news\/entertainment-arts-63714056> as it had lost Arts Council England funding.One resident told the Local Democracy Reporting Service <https:\/\/www.bbc.com\/lnp\/ldrs> it was \"a big loss\", while another said it was \"really sad\".Oldham's council leader said it was looking at how it could help the venue.Arts Council England said it was \"maintaining our investment in the town\" and had \"ring-fenced\" £1.845m for Oldham over the next three years, \"working with the council as they pursue their ambition to develop a new performing space for the town\".Council leader Amanda Chadderton said she had been \"devastated to hear the news about the Coliseum\".\"We're working closely with them as they look at their options for the future,\" she said.\"The council has been in almost daily contact with them and continues to offer as much support as we can through this really difficult time.\"Oldham has such a rich cultural heritage, the Coliseum means so much to so many of our residents.\"The Fairbottom Street venue dates back to 1885 and was the only surviving professional theatre in the town.It has an illustrious CV of past performers, from Hollywood greats such as Charlie Chaplin and Stan Laurel, to modern movie stars like Ralph Fiennes and Minnie Driver.It was a training ground for a host of TV soap stars, including Coronation Street's Jean Alexander (Hilda Ogden), Barbara Knox (Rita Sullivan), William Roache (Ken Barlow) and Anne Kirkbride (Deirdre Barlow) and, in recent years, hosted the likes of Millie Gibson, Doctor Who's new companion, and Olivia Cooke, who stars in Game of Thrones spin-off House of the Dragon.It confirmed in November it had been dropped from the Arts Council England funding portfolio after unsuccessfully applying for more than £1.84m for the three years up to 2026 and, on Wednesday, announced it was cancelling all shows from 26 March, including the 2023-24 pantomime Sleeping Beauty.Artistic director and chief executive Chris Lawson said cancelling the performances had been \"horrific\" and was \"something that will sit with me for the rest of my life\".\"It's something that I don't wish to repeat and something that ideally I would have not had to have done,\" he said.\"My priority is looking after the staff and communicating the best I can with audiences and just continuing to work things out and we're at a stage where the conversations are ongoing.\"We are very realistic about our current situation and that's why we have made the decisions that we have had to make, but there are conversations around a new building and we want to remain part of those.\"Outside the venue, Oldham residents and Coliseum regulars Heather and Michael Tomkinson said what had happened was \"dreadful, an absolutely dreadful blow\". \"I think Oldham will have lost part of its heritage because it's been here a long time,\" Mrs Tomkinson said.\"It is quite a big loss to Oldham. \"It has a legacy of people coming and people starting out here. And the panto has always been very, very popular.\"Mr Tomkinson said it was \"an institution\" and had been \"a great apprenticeship for so many famous actors, many who started as children at the workshops\".Fellow resident Melanie Turton said she had signed a petition that called on the council to keep the venue open.\"It's a place to take the grandkids when they get older,\" she said. \"It's making memories as well with the family and the kids and it's what they know. \"It's what's made Oldham basically, the Coliseum. If it goes, it's another thing that's moving, or we're losing, in Oldham.\"Student Dahley Whitehead said she used to go to the theatre's pantomimes \"with my parents as a kid\".\"It's sad, it's one of the only cool things to do in Oldham at Christmas,\" she said.\"From primary school they used to take us out to pantomimes all the time, especially to Oldham Coliseum.\"I would always say I wanted to perform on that stage, be up there, and because of that, I got into musical theatre.\"Both of Oldham's Labour MPs, Jim McMahon and Debbie Abrahams, have called for a way forward to be found to ensure the venue's survival.Mr McMahon said it was \"an important social and economic treasure for Oldham and beyond\".\"Theatre, art and culture has the power to bring us joy, challenge our ideas and reshape how we think about society [and is] something that should be open to everyone, regardless of where they live or how much money they make.\"Ms Abrahams tweeted she was \"devastated\" by the news and would be meeting with Arts Council England to again raise the plight of the Coliseum.Speaking on BBC Radio Manchester, Greater Manchester Mayor Andy Burnham said the combined authority \"do give out culture grants... but our funding would never be the mainstay\".\"The Arts Council would be the national organisation. Ours would be the more supporting fund,\" he said.\"I think what we've got to commit to is to ensure that Oldham has a theatre. The bottom line is that as far as I'm concerned.\"The generation growing up in Oldham needs the chance to put their talent on a stage and to be able to get the experience.\"Arts Council England said it appreciated \"how difficult it has been for the team at Oldham Coliseum to come to a decision to cancel forthcoming events, and how unsettling this must be for the staff and all those who work with the theatre, as well as how disappointing this is for audiences\".\"The Arts Council is committed to supporting performing arts in Oldham, which hugely benefits the local community,\" a representative said.\"We are maintaining our investment in the town and have ring-fenced £1.845m for Oldham over the next three years and are working with the council as they pursue their ambition to develop a new performing space for the town.\"Why not follow BBC North West on Facebook <https:\/\/en-gb.facebook.com\/BBCNW\/>, Twitter <https:\/\/twitter.com\/BBCNWT> and Instagram <https:\/\/www.instagram.com\/bbcnorthwest\/>? You can also send story ideas to northwest.newsonline@bbc.co.uk <mailto:northwest.newsonline@bbc.co.uk>"}