{"author":"","title":"Bangladesh country profile","news_category":"general","content":"Bangladesh is one of the world's most densely-populated countries, with its people living in a delta of rivers that empty into the Bay of Bengal.Poverty is widespread, but Bangladesh has in recent years reduced population growth and improved health and education.Formerly East Pakistan, Bangladesh came into being only in 1971, when the two parts of Pakistan split after a bitter war which drew in neighbouring India.Bangladesh spent 15 years under military rule and, although democracy was restored in 1990, the political scene remains volatile. Islamist extremism has also been rising in the traditionally tolerant country.Bangladesh is low-lying and vulnerable to flooding and cyclones. It stands to be badly affected by any rise in sea levels.President: Mohammad Abdul HamidMohammad Abdul Hamid, formerly speaker of parliament, was elected unopposed to the ceremonial post in 2013. He was elected unopposed for a second term in February 2018.Prime minister: Sheikh HasinaSheikh Hasina started a third term as prime minister in January 2014, after her Awami League won elections boycotted by the opposition amid an ongoing political crisis.Politics has long been dominated by bitter rivalry between two women: Sheikh Hasina, and Khaleda Zia of the Bangladesh Nationalist Party. Both have been prime minister at various times since 1991.Their hostility stems in part from differences over who played a greater role in the country's independence struggle - Hasina's father Sheikh Mujibur Rahman, or Khaleda Zia's husband General Ziaur Rahman.They sank their differences when military ruler Hossain Mohammad Ershad was in power from 1982 to 1990, but they have been uncompromising rivals ever since.TV is the leading medium. State-run BTV has national terrestrial coverage and privately-owned satellite channels are widely watched.Media tend to be polarised, aligning themselves with one or other of the main political factions.Some key dates in the history of Bangladesh: 1947 - British colonial rule over India ends. A largely Muslim state comprising East and West Pakistan is established, either side of India. The two provinces are separated from each other by more than 1,500 km of Indian territory.1971 - Independence after a nine-month war, with India backing the Bengali nationalists against Pakistan.1973 - First parliamentary elections give the Awami League a landslide victory.1975 - A military coup sees founding president Sheikh Mujibur Rahman and most of his family members killed, putting an end to civilian rule.1979 - Second parliamentary elections brings former army chief Ziaur Rahman's Bangladesh Nationalist Party to power.1981 - President Ziaur Rahman assassinated during abortive military coup. 1982 - General Hussain Muhammad Ershad assumes power in coup. He suspends the constitution and political parties.1991 - The country returns to a parliamentary system of government.2006-2008 - Political crisis sees leaders of both major parties briefly detained.2014-17 - Bangladesh faces a campaign of violence by Islamists against bloggers, atheists and secular intellectuals."}