{"author":"","title":"Nicola Sturgeon warned Janey Godley was 'risky' choice for dropped ad","news_category":"general","content":"The first minister signed off on a Covid campaign featuring comedian Janey Godley which was later pulled.The government adverts were dropped after the comedian's offensive historical tweets came to light.A Freedom of Information request to the government showed ministers were warned there was a risk attached to Ms Godley fronting the campaign as she was \"outspoken\" and used profanities.She apologised for the tweets after they were highlighted in the media. And the comedian donated the £12,000 fee she was paid by the Scottish government to charity.The Scottish government has now published documents <https:\/\/www.gov.scot\/publications\/foi-202100237091\/> showing that ministers were warned Ms Godley could be a risky choice.In a briefing for First Minister Nicola Sturgeon, Deputy First Minister John Swinney, and Health Secretary Humza Yousaf, advisers wrote: \"Ministers should... be aware that Ms Godley can be outspoken about a number of subject matters including Donald Trump, other political parties, woman's rights and topical stories.\"Ms Godley's Twitter page carries profanities regularly as does her social media content. So using Ms Godley does not come without some risk.\"But the document suggested Ms Godley because she was \"supportive\" and \"compliant\" with Covid safety measures and had \"a 'no nonsense, straight talking' approach, which appeal[ed] to a wide range of people in Scotland, particularly those of a younger age group\".Her appearance in the advert was then signed off by Nicola Sturgeon, according to the documents.Ms Godley, 60, was selected to front the campaign - to encourage face coverings and lateral flow testing - after she gained a large online following for her viral voice-overs of the first minister's briefings during the lockdowns.Her offensive posts - the most recent of which was from 2017 - were first reported byThe Scottish Sun <https:\/\/www.thescottishsun.co.uk\/news\/scottish-news\/7670687\/janey-godley-apologises-hurtful-tweets-taxpayers-covid-campaign\/> in September.The Daily Beast followed up by publishing several tweets from 2011 and 2012 about black performers.Ms Godley went on to apologise \"without reservation\" for the \"horridly offensive\" tweets, which she conceded had \"terrible, horrific undertones\".She added: \"Comedy is no excuse to use disgusting and hurtful words that affect people and I know many of you expected better of me. I apologise for every single word that upset people.\"A Scottish government spokesperson said at the time that the campaign material in which Ms Godley featured had been withdrawn.Ms Godley, 60, has since revealed she has been diagnosed with ovarian cancer.  <https:\/\/www.bbc.co.uk\/news\/uk-scotland-59344461>"}