{"author":"","title":"Baby boom for North Atlantic right whales off US coast","news_category":"general","content":"One of the world's most endangered whale species is experiencing a mini baby boom off the US state of Massachusetts.Researchers at the Center for Coastal Studies have announced they have seen three North Atlantic right whale mother and calf pairs in Cape Cod bay.The whales give birth off Georgia and Florida in the winter before moving up the US east coast in the spring.Only about 450 of the species are believed to remain.Scientists reportedly did not spot any right whale newborns in 2018 <https:\/\/www.the-scientist.com\/the-nutshell\/endangered-right-whales-have-no-new-babies-this-breeding-season-29899>, so researchers were elated to report the sighting of two pairs of right whales in Cape Cod bay this week.Another pair had been sighted earlier. <http:\/\/coastalstudies.org\/ccs-spots-their-first-2019-right-whale-calf-in-cape-cod-bay\/>This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.The Scientist magazine reports that seven calves have been spotted off Florida <https:\/\/www.the-scientist.com\/news-opinion\/seven-north-atlantic-right-whale-calves-spotted-so-far-this-year-65561> so far this year.North Atlantic right whales were hunted virtually to extinction by the early 1890s <https:\/\/www.fisheries.noaa.gov\/species\/north-atlantic-right-whale>, and have been listed as endangered since 1970.The mammals tend to stay near to coasts and have a high blubber content, making them a valuable target for whalers.It remains illegal to come within 500 yards (457 metres) of a North Atlantic right whale without a Federal Research Permit.There are three species of right whale around the world. The Southern right whale can be found throughout the southern hemisphere, and several thousand are thought to remain.But the North Pacific right whale is even rarer than its North Atlantic relative.The National Oceanic and Atmospheric Administration reports there are likely fewer than 200 left <https:\/\/www.fisheries.noaa.gov\/species\/north-pacific-right-whale>."}