{"author":"","title":"Ukraine conflict: Mother flees to Wales with son, four","news_category":"general","content":"A Ukrainian mother who fled to Wales has pleaded for more action to stop the \"aggression\" of Russia in her homeland.Liliia lived in Kyiv with her husband and four-year-old son Jamil until last week.After two nights of bombing of the Ukrainian capital, <https:\/\/www.bbc.co.uk\/news\/in-pictures-60536824> they decided it would be safer for Liliia and Jamil to stay with her sister in north Wales.At Gulzara's home in Corwen, Denbighshire, Liliia said she now felt safe.With her sister interpreting, Liliia, who withheld her surname to protect her husband in Ukraine, said: \"The situation in Ukraine is escalating every moment and you need to do action. You need to act to stop this aggression.\"The Ukrainian people will do their best, but ordinary people are dying in this war and children as well. It's horrible, just horrific.\"Earlier this week, Gulzara and her husband Dylan travelled to Romania to meet Liliia and her son.After some uncertainty over whether Liliia would be able to enter the UK, they flew into Luton airport on Wednesday.Gulzara said: \"Lilia says that at this moment she feels relaxed, calm and safe because she's with us.\"They were worried about their son and because of him they decided to leave Kyiv.\"For two nights in Kyiv, the husband and wife slept in two-hour shifts in case they missed the air raid siren or failed go down the six floors from their apartment to the safety of an underground car park.Liliia said her son Jamil was \"OK\", but added: \"He thinks we are on holiday, moving from one friend to another friend.\"Every morning he'd say: 'Where are we going next? Who are we going to see today?'\"But unfortunately he already knows words like war, bomb, shelling, siren.\"Liliia said she had been in regular contact with her husband, who was in \"quite a safe place\" in Ukraine.Gulzara added: \"They hope it will finish soon and that Russian people will go on the streets to protest.\""}