{"author":"","title":"Ukrainians resume badminton training in Ipswich","news_category":"general","content":"A group of elite badminton players from Ukraine are receiving regular coaching after being given refuge in Suffolk.Eight youngsters have been found host families in Ipswich, in a scheme organised by coach Helen Thornton and Badminton England.It means they can attend sessions at the town's Badminton Performance Centre at sixth form college Suffolk One.\"It's absolutely everything to all the people who are here - it's a huge sport for them,\" said Ms Thornton.\"There are two things they wanted to be - one, was to be safe and two, to be somewhere they could play badminton.\"That was their second requirement over and above school, and having a nice home.\"Yana, 17, and her elder sister, Yuliia, from the central Ukrainian city Dnipro, initially fled to Poland, and have lived with Alex and Jane Gooch since May.Their family are still in Ukraine, caring for grandparents, and are in daily contact.\"Our parents are really grateful to our sponsors because their daughters are in a safe place, we have a home, food and great people to live with who care about us,\" said Yana.The university student - who is now studying remotely - had been expected to compete in a four-day badminton tournament the day war broke out.\"I'm really happy to be playing badminton again because I can't tell you how much I love the sport,\" she added.\"It helps me to think about something else - not the war, the news - I can concentrate on my training.\"Ms Thornton added the integration over the past few weeks has been \"incredible\".\"The kids are so involved and [playing badminton] gives them some sense of normality,\" she said.\"As soon as they walk in the hall they've got a smile on their face, and they work really hard.\"It also raises the level here, because the kids are really good players.\"Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}