{"author":"By Charlie Jones","title":"Easton Bavents: Farmer's cliff-top cottage demolished","news_category":"general","content":"A farmer is \"devastated\" after being forced to abandon her cliff-top cottage because it was falling into the sea.Anne Jones's family had owned the property in Easton Bavents near Southwold in Suffolk since 1925.A storm destroyed a large chunk of the cliff in December, leaving the building 30ft (9m) from the edge.It has since been demolished over a number of weeks, after being deemed unsafe by engineers, and the cliff has eroded by another 10ft (3m).\"The whole family is incredibly sad, my father won't even go down the lane because he can't bear to look at it. There is so much history there and we have rented it out to so many local people over the years,\" said Mrs Jones.\"It's quite depressing, it makes me angry. It feels so unfair that we have lost hundreds of acres of land and we just have to accept it, whereas more prosperous, populated areas get protected.\"Easton Bavents was once a thriving village and England's most easterly point. Its church disappeared into the sea in the 17th Century and much of the land surrounding it has been eroded.Mrs Jones's great-grandfather Herbert Boggis used his life savings to buy the 400-acre estate in 1925, but it is now less than half that size.Over the past two decades, the house has crept closer to the cliff edge due to erosion.Juliet Blaxland rented part of the property, which is made up of three terraced cottages, from the family for 12 years. She was asked to move out just before Christmas.The author, who wrote a book about her time living there, said she was very sad to watch the house being dismantled and it was \"a great loss\" to the farm.Peter Boggis, who is Mrs Jones's mother's cousin, started building his own sea defences nearly 20 years ago to protect the area butwas ordered to stop <http:\/\/news.bbc.co.uk\/1\/hi\/england\/suffolk\/8316040.stm> after losing a court battle.A government-funded scheme,  <https:\/\/www.bbc.co.uk\/news\/uk-england-suffolk-18899370>which was approved in 2012 to help them relocate, did not work out and the landowners have been left to fend for themselves, Mrs Jones said.A spokesman for East Suffolk Council, which is part of the Coastal Partnership East group that manages the coast in the area, said it had \"worked hard... with property owners in Easton Bavents over the last 10 years to try and find ways to alleviate the challenges of losing your property to the sea\".He added they supported those who lose their property to erosion with a planning right to build elsewhere in the district.Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}