{"author":"","title":"Orthodox Church split fuels Russia-Ukraine tension","news_category":"general","content":"Ukraine's President Petro Poroshenko says top clerics in the Orthodox Church are now ready to grant independence to the Kiev Church, defying Moscow.If the Constantinople Patriarch, Bartholomew, grants Kiev autocephaly (independence) he will be recognising its split with the Moscow Patriarchate.On Friday Russia's Patriarch Kirill met Bartholomew in Istanbul. They did not resolve the Kiev Church's status.Russia sees Kiev as the historic cradle of the Russian Orthodox Church.Russian President Vladimir Putin, a staunch ally of Patriarch Kirill, is bitterly opposed to President Poroshenko. There is a tense standoff in eastern Ukraine between Ukrainian government troops and Russian-backed rebels.In a tweet on Monday Mr Poroshenko said Bartholomew's Ecumenical Patriarchate had \"decided that, without taking account of Moscow's opinion, it can give all states the right to establish a local church.\"And first of all it is the right for Ukraine to set up a Local Congregation of the Ukrainian Orthodox Church.\"On Facebook a spokesman for the Kiev Patriarchate said the move to grant independence was going ahead.\"The Ecumenical Patriarch explained to the Russian delegation that the decision had been taken and that the relevant procedures were under way,\" Archbishop Yevstratiy Zorya wrote.Tensions within the Ukrainian Orthodox Church mounted after the collapse of the Soviet Union in 1991. Ukraine won independence, and with communism discredited there was a huge revival in Christian worship.For centuries, before the Soviet period, the Russian Orthodox Church had been identified with the Russian state, allying its interests with those of the tsar.The Russian nationalist revival under Boris Yeltsin, then under Vladimir Putin, boosted the Church's authority and determination to stay in charge of the Ukrainian churches.In the early Middle Ages Christianity spread to what is now Russia from Kievan Rus, which Moscow claims to have given the origin of the Russian state.Today there are three Orthodox Church branches based in Kiev: The branch loyal to Kirill remains the biggest, but a formal schism could lead many of its followers to join the Kiev Patriarchate.The Moscow Patriarchate's position is that the Ukrainian \"schismatics\" should repent and return to the Russian Orthodox fold.But there is also rivalry between Kirill's powerful Moscow Patriarchate - which has an estimated 150 million followers - and the Ecumenical Patriarchate under Bartholomew, who is seen as first among equals in the Eastern Orthodox Church.The rivalry has been there for centuries, dating back to the Byzantine and Russian empires. Ukraine was part of the Russian empire, but many of its worshippers looked to Constantinople (later Istanbul), rather than Moscow for spiritual guidance.Speaking after his talks in Istanbul, Patriarch Kirill said he and Patriarch Bartholomew had discussed \"all the problems on the agenda\" and it was \"a dialogue between two brothers\".\"There was nothing secret at the meeting, nothing that could sort of explode one's conscience,\" he said, without giving any specifics. Their talks lasted nearly three hours."}