{"author":"By Daniel Davies","title":"Sharp rise in babies facing being taken into care","news_category":"general","content":"The rate of newborn babies involved in care proceedings has more than doubled in three years, the first analysis of data in Wales has revealed.It means newborns in Wales are now more likely to appear in care proceedings than those in England.Courts have the power to put a child into council care if they are being harmed or likely to be harmed at home.The report aims to shine a light on the family justice system, but said more work is needed to explain the trend.For every 10,000 babies born in 2015, 39 became subject to care proceedings because social services raised concerns in the first two weeks of their lives.By 2018, that had risen to 83.Removing a newborn baby is \"perhaps the most difficult, and brutal, decision that professionals can make to intervene in family life\", the report said.But the justice system has \"for too long... been operating in the dark\", it added.In 2015 the data showed 52% of babies aged under one in care proceedings were less than two weeks old.Around half of the mothers had already been involved in court cases with other children.The findings come as the Welsh Government has set targets with local authorities to bring down the number of children in care.But the analysis showed more children are going into local authority care at the end of proceedings - and fewer are being put up for adoption.By contrast, courts in England were much less likely to impose care orders.One of the report authors, Prof Karen Broadhurst of Lancaster University said: \"The changing pattern of legal orders for newborn babies and infants at the close of care proceedings in Wales is particularly striking.\"This is a very distressing issue for mothers who are expected to appear before the courts shortly after giving birth.\"How do these mothers instruct a solicitor or meaningfully participate in proceedings so soon after giving birth and be able to contest the removal of their baby?\"More and more babies in Wales are subject to care orders with fewer family orders and fewer adoptions. So there's a big question about why the family courts are changing their practice around the orders and what happens to the babies as a consequence.\"Some parents know what it's like to have more than one child taken into care.The charity Barnardo's says mothers who repeatedly face care proceedings are often very vulnerable, with many being victims of domestic abuse.Its Reflect scheme in south Wales has helped some escape violence. Others had support for drug or alcohol problems.This report endorses the scheme, which is funded by the Welsh Government, and reveals the scale of the problem.Between 2016 and 2018, around half the newborns (49%) in care proceedings had older brothers or sisters who had already been through the courts.Nuffield Family Justice Observatory director Lisa Harker added: \"The removal of a baby into care is perhaps the most difficult decision that professionals can make to intervene in family life.\"This study provides an important starting point for discussions about how to ensure that more babies are able to be safely cared for by their parents and that any intervention by professionals is designed to avert potential harm.\"Prof Broadhurst said \"all sorts of factors\" could help explain the increase, including the case law of some influential judgements and cuts to services.\"Certainly work that has been done by other researchers suggests that austerity and the cutback in preventative services is impacting overall on the numbers of children coming before the family courts in care proceedings,\" she said."}