{"author":"","title":"Pokemon: Logan Paul buys $2m worth of Pokémon cards","news_category":"general","content":"If you had a spare $2m (£1.5m) lying around, what would you spend it on?A huge mansion, a few cars, a couple of luxury holidays, pay off your student debt or maybe buy... boxes of super-rare Pokémon cards.That's how YouTuber Logan Paul has spent some of his cash. The 25-year-old told his fans he's spent three months looking for unopened 1st edition Pokémon boxes, which were the first to ever be released.He bought six boxes, some of which cost $400,000 (£295,000) each. They each contain 36 packs with around 400 cards in them.It's not known which Pokémon characters are inside but individual cards could be worth hundreds of thousands of pounds each.This article contains content provided by Instagram. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readMeta’s Instagram cookie policy, external <https:\/\/privacycenter.instagram.com\/policies\/cookies\/> and privacy policy, external <https:\/\/privacycenter.instagram.com\/policy> before accepting. To view this content choose‘accept and continue’.Logan Paul says he'll start opening them on Pokémon Day which is 27 February.He says he'll auction off dozens of packs - with the starting price for some at $10,000 (£7,300).\"This is a newfound obsession of mine and I am so excited to share it with other enthusiasts around the world,\" he wrote on social media.He added that he's \"going for the Charizards.\"We wonder if that's anything to do with his mate Logic? In October the rapper reportedly spent £173,000 <https:\/\/www.complex.com\/music\/2020\/10\/logic-spends-226-thousand-dollars-on-rare-pokemon-card> on a 1st edition Charizard Pokémon card at a live auction.During the auction, he tweeted Logan Paul to let him know that he won.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.But that's not the only Pokémon-related purchase Logic made.He also spent $23,000 (£17,600) on a box of unopened Pokémon, containing another Charizard card and a few other rare cards.Logic then spoke on Instagram about his love for Pokémon and how he struggled to afford the cards as a child.\"Being able to enjoy something that I've loved since childhood now as a grown man is like buying back a piece of something I could never have,\" he wrote.This article contains content provided by Instagram. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readMeta’s Instagram cookie policy, external <https:\/\/privacycenter.instagram.com\/policies\/cookies\/> and privacy policy, external <https:\/\/privacycenter.instagram.com\/policy> before accepting. To view this content choose‘accept and continue’.In the late 90's, collecting and trading Pokémon cards was a staple part of childhood. The packs sold for around £3 each at the time.And now, although less people may collect the cards, Pokémon is still just as popular, with games released on mobile and consoles.But while most Pokémon cards won't be worth anything close to the one Logic bought, it's possible that your collection could have increased in price this year.\"The regular Charizard card might be worth around £300,\" Dan, from trading cards and collectibles shop Game HQ, tells Newsbeat.\"Most cards that people have will be the mass-produced ones so they wont be worth as much, but they can still be worth a lot of money as long as the cards are in good condition.\"The price for the vintage Pokémon cards seems to be going up and since lockdown and the demand for the retro cards have gone through the roof.\"It might be time to ask your mum to dig out your old stuff, but if you do, which ones should you look out for?Featuring the fan-favourite, fire-breathing dragon, this card was first seen in 1999.Different editions of the card have sold for different prices, but the holographic 'shadowless' version is said to be worth the most.The $226,000 that Logic spent on this is the largest amount spent on the card, according to Cardhops.This is considered one of the rarest Pokémon cards ever - it's estimated that less than 40 exist.It was issued to the winners of a Japanese illustration contest in 1998.It's sold for $195,000 at an auction <https:\/\/www.polygon.com\/pokemon\/2019\/10\/29\/20938193\/rare-pokemon-pikachu-card-sells-at-auction> in New York.Another extremely rare card - it's said only 34 copies were issued <https:\/\/dotesports.com\/pokemon\/news\/top-five-most-valuable-expensive-pokemon-cards>.It could be worth over $10,000 (£7,700).These were given to the first, second, and third place winners at the first official Pokémon tournament in Japan in 1997.Each of them feature Pikachu holding a gold, silver or bronze trophy.Rumour has it these cards were printed in error <https:\/\/www.redbull.com\/gb-en\/rarest-pokemon-cards-in-the-world>.It's not known how much they may go for, but Logic did receive one in the $23,000 Base set box he bought.Follow Newsbeat on Instagram <https:\/\/www.instagram.com\/bbcnewsbeat\/>, Facebook <https:\/\/www.facebook.com\/bbcnewsbeat\/>, Twitter <https:\/\/twitter.com\/BBCNewsbeat> and YouTube <https:\/\/www.youtube.com\/channel\/UCe1Ef-K5jpnRsmVY5hCBhOw>.Listen to Newsbeat live <https:\/\/www.bbc.co.uk\/sounds\/play\/live:bbc_radio_one> at 12:45 and 17:45 weekdays - or listen backhere <http:\/\/www.bbc.co.uk\/programmes\/b006wkry\/episodes\/player>."}