{"author":"By Jennifer Harby","title":"Leicester exhibition opens on 'forgotten blitz'","news_category":"general","content":"A \"forgotten\" Nazi attack on the city of Leicester in World War Two that left more than 100 people dead is being commemorated in an exhibition.Large parts of the city came under their most sustained attack of the war on 19 November 1940, when Luftwaffe bombers killed 108 people.Newarke Houses museum's display uses images, eyewitness accounts and artefacts.\"So much heroism was forgotten for so long,\" historian Austin J Ruddy said.\"It is right they are now remembered.\"Mr Ruddy, who wrote Tested by Bomb and Flame, a book on Leicester's raids, said the attack was overshadowed raids elsewhere.\"This was an uneven conflict between the military might of Luftwaffe bombers and unarmed civilians,\" he said.\"But, ultimately, the people of Leicester won this battle, blunting the Luftwaffe's bombing through community effort and the dedication of altruistic ARP workers - albeit at a hard cost.\"The exhibition reveals the extraordinary heroism of the ARP and other emergency services, whose remarkable stories had largely been forgotten for over 70 years.\"Many worthy deeds shine through the darkness of the blitz and deserve to be told - and they are in this poignant exhibition.\"Deputy city mayor for culture, leisure and sport Piara Singh Clair said: \"More than 80 years ago, this city faced the bombs of the Luftwaffe, with dozens of people losing their lives and many more losing their homes and their livelihoods.\"The horrors of war have sadly not gone away.\"This exhibition reminds us to learn from history and to think of those who suffered in Leicester in 1940 - but as we remember them, our thoughts will also be with our brothers and sisters in Ukraine.\"The exhibition opens at Newarke Houses Museum on 5 March and runs until 22 May.Follow BBC East Midlands on Facebook <https:\/\/www.facebook.com\/bbceastmids\/>, Twitter <https:\/\/twitter.com\/bbcemt>, or Instagram <https:\/\/www.instagram.com\/bbceastmidlands\/>. Send your story ideas to eastmidsnews@bbc.co.uk."}