{"author":"By Sam Cabral","title":"Alvin Bragg: The Manhattan district attorney investigating Donald Trump","news_category":"general","content":"Alvin Bragg made history in 2021 as the first black man elected New York County district attorney. His spotlight is about to grow a lot brighter.As he left his office last night, Mr Bragg, 49, was saying nothing, knowing he'd guaranteed himself a place in the history books as the first ever prosecutor - at the federal, state or local level - to bring criminal charges against a former American president.His office has been investigating an alleged hush money settlement between Donald Trump and an adult film star.The case stems from a $130,000 (£106,000) payment made by his then-personal attorney Michael Cohen to pornographic actress Stormy Daniels at the height of the 2016 presidential election, allegedly in exchange for her silence over an affair with Mr Trump.The Republican ex-president vehemently denies wrongdoing. He took to his own social media platform to say that he does not expect to have a fair trial in New York.\"They only brought this Fake, Corrupt, and Disgraceful Charge against me because I stand with the American People, and they know that I cannot get a fair trial in New York!\" he wrote on Truth Social.The Manhattan district attorney is a veteran prosecutor who took office at the start of 2022 on a two-part platform: investing in alternatives to incarceration while ramping up white collar and public corruption prosecutions.His campaign for DA focused heavily on his personal biography and the desire for prosecutorial reform it had kindled. Born and raised in New York's Harlem neighbourhood during the 1980s crack cocaine epidemic, he has spoken of having police officers hold him up at gunpoint; of encountering homicide victims at his doorstep; and of having a brother-in-law live with him after a period of incarceration.The Harvard-educated attorney specialised in white collar fraud and civil rights issues, including representing the family of Eric Garner, a black man who died at the hands of New York police in 2014.He has claimed he helped sue the Trump administration more than 100 times in its four-year term. He also led New York's lawsuit against disgraced film producer Harvey Weinstein.Mr Bragg has experience with prosecutions at every level of government. He previously served as an assistant US attorney for the Southern District of New York, a deputy attorney general of New York and a chief litigator for the New York City Council.Days after taking office, DA Bragg detailed new charging, bail, plea and sentencing policies for the Manhattan borough. He said his office would no longer prosecute certain low-level offences such as public transport fare evasion and cannabis-related misdemeanours.An outcry from local law enforcement and business leaders amid rising violence in New York City prompted DA Bragg to apologise and revise the policy.He has since pointed to statistics showing major crimes have fallen under his leadership, but critics - including Mr Trump and his allies - assail him as a \"radical\" liberal who is lenient with criminals.Mr Bragg inherited the Trump probe from his predecessor Cyrus Vance Jr, who opened the case nearly five years ago while Mr Trump was still in the White House.Early in his term, two prosecutors from his office quit, with one claiming that the investigation had been \"suspended indefinitely\" by a \"misguided\" DA who did not want to prosecute Mr Trump.The DA's office responded that the case was ongoing and it was \"exploring evidence not previously explored\".Last December, two of Mr Trump's companies were convicted of tax violations at a criminal trial brought by Mr Bragg. Mr Trump himself was not charged, but The Trump Organization's chief financial officer, Allen Weisselberg, is currently serving a five-month prison sentence.This January, Mr Bragg convened a grand jury to evaluate evidence in the hush money probe.In the wake of these historic charges against Mr Trump, the stakes are enormous. With his third bid for the White House under way, many say the indictment could supercharge his supporters and put him back in the Oval Office once again."}