{"author":"By Anthony Reuben & Tom Edgington","title":"National Insurance: Will tax cut save me money?","news_category":"general","content":"The government's reversal of the 1.25p in the pound rise in National Insurance (NI) has come into effect.It means many people will keep more of their pay.NI went up by 1.25p in the pound in April and went back to its previous level on 6 November.For employees under pension age who earn less than £12,570 a year, the move will make no difference - because they don't pay NI.Above that income level, the amount saved increases as earnings do.So higher earners stand to benefit more than people on lower incomes - although higher earners will still contribute more tax overall.The majority of businesses will also see a reduction in their NI bills. Each business will save an average of £9,600 each in 2023-24,according to the government <https:\/\/www.gov.uk\/government\/publications\/the-growth-plan-factsheet-on-cancellation-of-national-insurance-rise-and-health-and-social-care-levy\/reversal-of-the-health-and-social-care-levy-factsheet>.NI is a tax paid by employees, employers and the self-employed:NI contributes to the cost of benefits and the state pension. However, the government can borrow from the NI fund to help pay for other projects. NI raises a lot of money: £158bn last yearaccording to HMRC <https:\/\/www.gov.uk\/government\/statistics\/hmrc-tax-and-nics-receipts-for-the-uk>.Whether you receive the full state pension depends on your NI record <https:\/\/www.gov.uk\/new-state-pension\/your-national-insurance-record-and-your-state-pension>.Since 6 April, workers and employers have been paying an extra 1.25p in the pound.The increase was part of the government's plan to fund the NHS and social care.It took the rate of NI to 13.25%. That meant the government went back on its 2019 election manifesto promise not to raise the tax.The NI increase was due to be replaced by a new Health and Social Care Levy - at a rate of 1.25% - in April 2023.But the government has now scrapped these plans, putting the NI rate back to 12%.That rate is paid by employees earning between £12,570 a year and just over £50,000 a year. Above that level, the rate has gone back down from 3.25% to 2.0%.The 1.25 percentage point increase in NI was supposed to raise £12bn a year.The government said the extra money would initially go towards easing pressure on the NHS.Some would then be moved into the social care system. This mainly helps older people and people with high care needs, with tasks such as washing, dressing, eating and taking medication.The government has said that funding for health and social care services will be maintained at the same level as if the levy was in place. The funding for health and social care will now come from general taxation.The social care system is under pressure because of an ageing population and the effects of the pandemic. At the same time, it has also been hit by staff shortages and falling government spending.The government wants to ensure that people in England pay no more than £86,000 in care costs from October 2023 (not including accommodation and food).People with assets - such as a home, savings or investments - worth less than £20,000 will not have to pay for care out of those assets, but may still have to contribute from their income.Those with assets worth between £20,000 and £100,000 may have their care costs subsidised.NI is a UK-wide tax. Although the government decided to increase it in order to fund health and social care in England, the tax increase was also expected to raise extra money that Scotland, Wales and Northern Ireland could have chosen to spend on those services."}