{"author":"","title":"South Korea president unveils 'peace gift' puppies","news_category":"general","content":"South Korea's president has revealed the first pictures of puppies mothered by one of North Korea's \"peace gift\" dogs, Gomi.The North's leader, Kim Jong-un, sent the two dogs to his counterpart Moon Jae-in in a bid to promote peace amid thawing ties on the Korean peninsula.Gomi, a Pungsan hunting dog, gave birth to three female and three male puppies.President Moon shared photos of the dogs on the official Blue House twitter feed on Sunday.\"As the pregnancy period of dogs is about two months, Gomi must have come to us pregnant,\" he reportedly tweeted when the pups were born. \"I hope inter-Korean affairs will be like this.\"This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Days after the puppies were born, South Korea flew military planes filled with tangerines to Pyongyang. The North had previously sent pine mushrooms over the border following a summit between the two leaders.Gomi and the other dog, Songgang, came to the South with nearly seven pounds of food, and joined President Moon's other pets - including rescue dog, Tory.Mr Moon has met Mr Kim three times this year and has acted as a mediator between him and US President Donald Trump.This video can not be playedSouth Korea's President Moon Jae-in: \"The dogs are designated as national treasures in North Korea\"In September, he became the first South Korean leader to give a speech to the North Korean public during a trip to Pyongyang. He spoke at the Arirang Games - a major propaganda event - and received a standing ovation from 150,000 people.More recently, President Moon said he was confident the Korean War could soon be ended <https:\/\/www.bbc.co.uk\/news\/world-asia-45832777>. The conflict ended in 1953 with an armistice, but no peace treaty was ever signed."}