{"author":"","title":"Covid care home testing - more complex than it seems","news_category":"general","content":"Claims have been made alleging former health secretary Matt Hancock rejected expert advice to mandate Covid tests for all people going into care homes <https:\/\/www.bbc.co.uk\/news\/uk-politics-64807127> at the start of the pandemic. WhatsApp messages leaked to the Daily Telegraph newspaper suggest Mr Hancock was told in April 2020 that there should be \"testing of all going into care homes\". Government guidance later mandated tests only for those leaving hospital for care homes.When it comes to Covid, in retrospect, there is always the temptation to see things in black and white.If we had followed option A, it would have stopped option B occurring, runs the simple theory.But when considering these issues, it is essential to also ask whether A could have actually been done at that point and, if it could, what trade-offs might there have had to be?And then, a judgement has to be taken on whether option A would actually have stopped option B happening anyway.The current news story is a classic example: a seemingly simple claim that does not, in fact, have a straightforward conclusion.As chief medical officer Prof Sir Chris Whitty made clear in his December review <https:\/\/www.gov.uk\/government\/publications\/technical-report-on-the-covid-19-pandemic-in-the-uk> on the pandemic, the problem the UK faced at that early stage was that there were not enough Covid tests available.By mid-April only around 20,000 tests a day were being undertaken. Testing had to be strictly rationed. It was being used to test only those people with symptoms, and then only those in vulnerable settings, such as hospitals or care homes, or key workers.A member of the public in the general community, even one who had symptoms, could simply not access a test.The decision to test care home residents whether they displayed symptoms or not (and therefore to include asymptomatic testing) marked a break from current thinking at the time.With limited testing available, the decision taken was that, initially, asymptomatic testing would only apply to those people admitted directly from hospital. They were deemed to carry the highest risk of being infected, since they were coming from a place where sick people with Covid were being cared for.Even if the test results showed no Covid, isolation was still recommended given it can take time for symptoms to develop.In the absence of available testing for people admitted to a care home from the community, isolation was also recommended. Eventually they too were tested, with testing capacity expanding rapidly in the weeks that followed.But for that wider testing to be done any earlier, it must be assumed, would have meant tests not being available for another key group.However, this does not mean there are no questions to answer on this issue. Why did the UK have such a small diagnostic testing capacity in the first place?Should the government have used the small labs available so more testing could have been done in those early days? It ruled out this strategy in favour of developing a network of large Lighthouse labs to ensure quality control and integrated end-to-end systems for ordering, sending off and obtaining results.What it does show is that, when it comes to Covid, there are very few issues where the solution is as simple as it might first appear."}