{"author":"","title":"Stormy Daniels: Trump says he did not know about $130,000 payment","news_category":"general","content":"President Trump has said he did not know about a $130,000 (£92,000) payment made by his lawyer to porn star Stormy Daniels before the 2016 election - his first public comment on the issue.Asked on board Air Force One if he knew about the payment or where the money had come from, Mr Trump said \"No\".Asked why his lawyer Michael Cohen made the payment, Mr Trump said: \"You'll have to ask Michael.\"The actress says she had sex with Mr Trump in 2006. He denies it.Ms Daniels, whose real name is Stephanie Clifford, says she signed an agreement to keep quiet about her claims in exchange for $130,000 in October 2016, days before the presidential election.Mr Cohen has admitted to making the payment privately, but has denied that Mr Trump was a party to the transaction.Ms Daniels has also told US media that she was threatened by a stranger in a car park in 2011 to \"leave Trump alone\".This video can not be playedStormy Daniels: 'I was threatened'Last month Ms Daniels filed a lawsuit against the president, alleging that the non-disclosure agreement was invalid because Mr Trump did not sign it.But she lost a court motion for Mr Trump to give sworn testimony <http:\/\/www.bbc.co.uk\/news\/world-us-canada-43588244> about her claim that they had a relationship.However her lawyer Michael Avenatti said on Twitter that Mr Trump's comments on Air Force One had strengthened Ms Daniels's case \"exponentially\".This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Ms Daniels has also sued Mr Cohen, arguing he had defamed her by suggesting she was a liar.While Mr Trump has denied her claims, his lawyers are seeking $20m in damages from Ms Daniels, arguing she broke the non-disclosure deal.This video can not be playedWhite House: The president \"has consistently denied these allegations\""}