{"author":"By Hamish Mureddu-Reid & PA Media","title":"ChatGPT: Motorist uses AI chatbot to challenge Gatwick Airport fine","news_category":"general","content":"A motorist fined after driving through Gatwick Airport's drop-off zone successfully challenged it using an artificial intelligence (AI) chatbot.Shaun Bosley, from Brighton, dropped a work colleague at the airport in November and received a £100 \"final notice\" from NCP several months later.He turned to AI, using ChatGPT to generate a human-like appeal, saying he had had no previous notice of the fine.Mr Bosley said NCP reduced the fine to £15, which was the original amount.ChatGPT users simply type a request into a chat box and the system can generate a response almost instantly.\"In the end, I just typed, 'write an appeal to a penalty charge notice for driving through Gatwick Airport. I have received final notice, but never received first notice of the penalty', and straight away it came back with a great response,\" Mr Bosley said.Motorists dropping passengers at Gatwick must pay £5 for a maximum of 10 minutes. They are charged an additional £1 for every minute they stay after that up to a maximum of 20 minutes.ChatGPT helped him create the appeal which referred to the \"undue stress and hardship\" the final notice had causedIt also asked NCP to provide \"information regarding the circumstances\" as to why Mr Bosley had failed to receive a first notice of the fine.Part of Mr Bosley's letter read: \"I understand that it is my responsibility as a driver to be aware of the rules and regulations regarding driving through an airport.\"However, I never received the first notice of the penalty and therefore, did not have the opportunity to contest the charge or pay the fine in a timely manner.\"I believe that the debt collection process has been premature and I request that you reconsider the penalties imposed.\"Mr Bosley added: \"It's insane how it writes like a human. I didn't have to look at it and think 'that sounds like a robot, I need to change some of it', it was so conversational.\"He said NCP replied the following day, and reduced the fine to £15, which was the original amount.NCP said it \"takes appeals on their own individual merit\".Follow BBC South East on Facebook <https:\/\/www.facebook.com\/BBCSE\/>, on Twitter <https:\/\/twitter.com\/bbcsoutheast>, and on Instagram <https:\/\/www.instagram.com\/bbcsoutheast\/>. Send your story ideas to southeasttoday@bbc.co.uk <mailto:southeasttoday@bbc.co.uk>. "}