{"author":"By Kevin Peachey","title":"UK interest rates: What the rise means for you","news_category":"general","content":"The Bank of England has raised interest rates for an 11th consecutive time following a surprise jump in the rate of rising prices.The Bank rate is up from 4% to 4.25% following a meeting of the Monetary Policy Committee.The change means an immediate impact on some borrowers and savers.The Bank rate is already at its highest level for 14 years, rising consistently in response to the soaring cost of living. There was an unexpected increase in the rate of inflation - which charts rising prices - to 10.4% in the year to February, compared with 10.1% in January.There has been a series of Bank rate increases since December 2021. Although there is uncertainty over the coming months, there remains a widespread belief that any rises may end by the middle of the year. The Bank will be keen not to dampen the economy, which has shown little sign of growth.Analysts expect the rate to peak at 4.5% in the summer.This is lower than initial predictions after the turmoil of last year's mini-budget.The Bank's Monetary Policy Committee meets eight times a year to decide interest rate policy <https:\/\/www.bbc.co.uk\/news\/business-50837114>. The next decision will be announced on 11 May.It is under pressure to put rates up because it has a target to keep inflation at 2%, but prices are currently rising at more than five times that level.MortgagesJust under a third of households have a mortgage, according to the government's English Housing Survey <https:\/\/www.gov.uk\/government\/collections\/english-housing-survey>.After a period of ultra-low rates, many homeowners are now facing the likelihood of much more expensive monthly repayments. The Bank of England says up tofour million households face a higher monthly mortgage bill this year <https:\/\/www.bbc.co.uk\/news\/business-63961179>. An estimated 356,000 mortgage borrowers could face difficulties with repayments by July next year, according to City watchdog the Financial Conduct Authority.When interest rates rise, more than 1.4 million people on tracker and variable rate deals usually see an immediate increase in their monthly payments.The increase in the Bank rate from 4% to 4.25% means those on a typical tracker mortgage will pay about £24 more a month. Those on standard variable rate mortgages face a £15 jump.This comes on top of increases following the previous recent rate rises. Compared with pre-December 2021, average tracker mortgage customers will be paying about £394 more a month, and variable rate mortgage holders about £251 more.Forecasts suggest that they could start to come down again in the summer, but there remains a significant degree of uncertainty about that.Three-quarters of mortgage customers hold a fixed-rate mortgage. Their monthly payments may not change immediately, but house buyers - or anyone seeking to remortgage, estimated to be 1.8 million people this year - will have to pay a lot more now than if they had taken out the same mortgage a year or more ago.There has been considerable upheaval in this market since September's mini-budget, even though most of the policies that were announced have now been ditched.An average two-year fixed deal, which was 2.29% in November 2021, is now 5.32% - potentially a difference of hundreds of pounds each month in repayments for a typical borrower. However, rates are lower than their peak in the autumn, which would have been the most expensive time to take out a fixed deal.You can see how your mortgage may be affected by rising rates with our calculator below.If you can't see the calculator, click here. <https:\/\/www.bbc.co.uk\/news\/business-63474582>Credit cards and loansBank of England interest rates also influence the amount charged on things such as credit cards, bank loans and car loans.Even ahead of this decision, the average annual interest rate in January <https:\/\/www.bankofengland.co.uk\/statistics\/money-and-credit\/2023\/january-2023> was 20.85% on bank overdrafts and 19.9% on credit cards.Lenders could decide to put prices up further, if they expect higher interest rates in the future.SavingsIndividual banks and building societies usually pass on interest rate rises to customers. The deals being offered now arebetter than anything seen for years <https:\/\/www.bbc.co.uk\/news\/business-64399663>.Analysts say that people should shop around for a better savings rate, with many paid little or nothing in interest in many accounts. Major banks have been under pressure from MPs to pass on rate rises.But although this means savers get a higher return on their money, interest rates are not keeping up with rising prices.This means the value of cash savings - its buying power - is falling in real terms.The Bank has been putting rates up to combat rising prices - known as inflation <https:\/\/www.bbc.co.uk\/news\/business-12196322>.Prices have been going up quickly worldwide, as Covid restrictions eased and consumers spent more.Many firms have experienced problems getting enough goods to sell. There have been problems in the UK recently with shortages of fresh food. And with more buyers chasing too few goods, prices have increased.Oil and gas costs were higher than they had been - a problem made worse by Russia's invasion of Ukraine.Raising interest rates helps to control inflation by making it more expensive to borrow money. This encourages people to borrow less and spend less, and to save more.However, it is a tough balancing act as the Bank does not want to slow the economy too much.Since the global financial crisis of 2008, UK interest rates have been at historically low levels. Rates were at 0.1% in 2021.The UK is affected by prices rising across the globe. So there is a limit as to how effective UK interest rate rises will be.However, other countries are taking a similar approach, and have also been raising interest rates.The US central bank has announced big rate rises which have taken its key rate to levels not seen for nearly 15 years, but two banking failures in the US this month have raised fears about the health of the financial system. It hasjust raised rates again <https:\/\/www.bbc.co.uk\/news\/business-65041649>.Other central banks around the world have also raised rates, as inflation continues to cause problems in a host of major economies.How will you be affected by any change to interest rates? Share your experiences by emailinghaveyoursay@bbc.co.uk <mailto:haveyoursay@bbc.co.uk?subject=InterestRates57764601>.Please include a contact number if you are willing to speak to a BBC journalist. You can also get in touch in the following ways:If you are reading this page and can't see the form you will need to visit the mobile version of theBBC website <https:\/\/www.bbc.co.uk\/news\/have_your_say> to submit your question or comment or you can email us atHaveYourSay@bbc.co.uk <mailto:Haveyoursay@bbc.co.uk>. Please include your name, age and location with any submission."}