{"author":"","title":"Covid booster: Who can get another jab this spring?","news_category":"general","content":"Those most at risk from coronavirus will be offered another vaccination this spring.Across the UK, more than 151 million Covid vaccine doses have been given. The government has confirmed an extra booster vaccine dose will be offered to: <https:\/\/www.gov.uk\/government\/publications\/spring-2023-covid-19-vaccination-programme-jcvi-advice-22-february-2023\/jcvi-statement-on-spring-2023-covid-19-vaccinations-22-february-2023>Those eligible will be offered the vaccine about six months after their previous dose.Scotland's booster campaign will begin in the final week of March.Vaccinations in England and Wales will start in early April, with Northern Ireland's rollout from mid-April.People at higher risk from Covid are also expected to be offered a further booster vaccine dose in autumn 2023.This was offered to a wider range of people: Anyone aged 16 or over - or an at-risk child aged 12 to 15 - who had received both primary jabs could have a booster.People with a severely weakened immune system <https:\/\/www.nhs.uk\/conditions\/coronavirus-covid-19\/coronavirus-vaccination\/coronavirus-vaccine-people-with-severely-weakened-immune-system\/> were offered an additional third primary dose before being offered a booster.A free flu jab was also available to more people this winter <https:\/\/www.bbc.co.uk\/news\/health-53847025> - sometimes given at the same time as a Covid booster.Four different vaccines, made by Pfizer-BioNTech, Moderna, Sanofi\/GSK and Novavax are expected to be used in the spring booster programme.Most doses should protect against the Omicron variant as well as previous ones.Under-12s will be offered a children's formulation of the Pfizer-BioNTech vaccine.Health officials advise people to take whichever booster they are offered, as all vaccines provide protection against becoming severely ill or dying from Covid.First and second vaccine doses are either AstraZeneca or (for under-40s) Pfizer or Moderna.According to the official figures, <https:\/\/coronavirus.data.gov.uk\/details\/vaccinations> more than 151 million Covid vaccine doses had been administered in the UK as at 4 September, including:The 2022\/2023 winter's Covid booster vaccination programme reached more than 18.7 million people across the UK:In England, the figure equates to almost two-thirds of over-50s (65%). In July 2022, a report from an influential committee of MPs <https:\/\/committees.parliament.uk\/publications\/23019\/documents\/168825\/default\/> warned that Covid vaccine take-up was too low for several important groups, includingpregnant women <https:\/\/www.bbc.co.uk\/news\/health-61157121>, younger people and those from some ethnic backgrounds.All five to 11-year-olds in the UK can have two doses of a reduced-strength Covid vaccine, <https:\/\/www.bbc.co.uk\/news\/uk-60406155> 12 weeks apart.In addition:The NHS will contact people who are eligible for a spring booster dose.Carers of five to 11-year-olds in Scotland <https:\/\/www.nhsinform.scot\/covid-19-vaccine\/the-vaccines\/vaccinating-children-aged-5-to-11-years\/> andWales <https:\/\/gov.wales\/covid-19-vaccination-5-11-year-olds> should wait to be offered an appointment.Twelve to 15-year-olds in Scotland and Wales should also be contacted directly, but can speak to the relevant helpline or local health board if not.You should leave eight weeks between your first and second dose, and at least 12 weeks before having a booster.The 2023 spring booster should be given six months after your last dose. You should wait four weeks after a positive test, <https:\/\/www.nhs.uk\/conditions\/coronavirus-covid-19\/coronavirus-vaccination\/book-coronavirus-vaccination\/> even if you had no symptoms.Under-18s, who are not at higher risk from Covid, should wait 12 weeks. Those who are more vulnerable should wait four.You should not have a jab if you have a severe illness or high fever. The vaccines do not infect you with Covid and cannot cause positive test results.The most common side effects include a sore arm, headache, chills, fatigue and nausea. <https:\/\/www.bbc.co.uk\/news\/health-56901356>They are part of the body's normal immune response to vaccines and tend to resolve themselves within a day or two.This video can not be playedWhy it is normal for some people to experience short-term side effects from Covid-19 vaccinesThere are extremely rare, but occasionally fatal, <https:\/\/www.gov.uk\/government\/publications\/coronavirus-covid-19-vaccine-adverse-reactions\/coronavirus-vaccine-summary-of-yellow-card-reporting> cases of peopledeveloping blood clots after taking the AstraZeneca vaccine. <https:\/\/www.bbc.co.uk\/news\/health-59418123>A very small number of people have experienced a severe allergic reaction <https:\/\/www.nhs.uk\/conditions\/anaphylaxis\/> after the Pfizer vaccine.You should discuss any existing serious allergies with your healthcare professional before being vaccinated."}