{"author":"By Vitaly Shevchenko","title":"Yevgeny Prigozhin: From Putin's chef to Wagner founder","news_category":"general","content":"Yevgeny Prigozhin has emerged as a key player in Russia's full-scale invasion of Ukraine, in charge of a private army of mercenaries leading the Russian onslaught in key areas of the war.No stranger to Russia's prisons, he recruited thousands of convicted criminals from jail for his Wagner group - no matter how grave their crimes - as long as they agreed to fight for him in Ukraine.Before Russia started what has become Europe's worst armed conflict since World War Two, Prigozhin was accused of meddling in US elections and expanding Russian influence in Africa.How did a man of murky beginnings achieve such influence - and a reputation for fearsome brutality?Yevgeny Prigozhin hails from St Petersburg, Vladimir Putin's home city.He received his first criminal conviction in 1979, aged just 18, and got a suspended two-and-a-half year sentence for theft. Two years later, he was sentenced to 13 years in jail for robbery and theft, nine of which he served behind bars.Upon his release from jail, Prigozhin set up a chain of stalls selling hot dogs in St Petersburg. Business went well and within a few years, in the lawless 1990s, Prigozhin was able to open expensive restaurants in the city.It was there that he began mixing with the high and mighty of St Petersburg and then Russia. One of his restaurants, called New Island, was a boat sailing up and down the Neva River. Vladimir Putin liked it so much that - after becoming president - he started taking his foreign guests there. And that is most likely how the two first met.\"Vladimir Putin… saw that I had no problem serving plates to dignitaries in person,\" Prigozhin said in an interview. \"We met when he came with Japanese Prime Minister Mori.\"Yoshiro Mori visited St Petersburg in April 2000, at the very beginning of Vladimir Putin's rule.Mr Putin trusted Prigozhin enough to celebrate his birthday on New Island in 2003.Years later, Prigozhin's catering company Concord was contracted to supply food to the Kremlin, earning him the nickname \"Putin's chef\". Firms affiliated with Prigozhin also won lucrative catering contracts from the military and state-run schools.But it was after Russia's invasion of Ukraine in 2014 that signs began to emerge that Prigozhin was no ordinary businessman. A shadowy private military company said to be linked to him was first reported to be fighting Ukrainian forces in the eastern Donbas region.It is commonly known as Wagner - after the call sign used by one of its key early commanders. He was reportedly fascinated by Nazi Germany, which appropriated the 19th Century composer's works for propaganda.Ironically, \"de-Nazification\" of Ukraine is a key declared objective of President Putin's full-scale invasion of Ukraine launched in February 2022.Apart from Ukraine, Wagner was active across Africa and beyond, invariably performing tasks that furthered the Kremlin's agenda - from propping up Bashar al-Assad's regime in Syria to combating French influence in Mali.Over time, the mercenary group gained a fearsome reputation for brutality. Wagner members have been accused of torturing a Syrian captive with a sledgehammer, beheading him and then setting his body on fire in 2017.The following year, three Russian journalists were killed while investigating Wagner's presence in the Central African Republic.In 2022, Wagner was again accused of killing a man with a sledgehammer, over suspicions that he had \"betrayed\" the group in Ukraine. Prigozhin described unverified footage of the brutal murder as \"a dog's death for a dog\". After members of the European Parliament called for Wagner to be designated as a terrorist group, he claimed he had sent the politicians a blood-stained sledgehammer.For years, Prigozhin denied having any links to Wagner and even sued people who suggested that he did. But then, in September 2022, he said he had set up the group in 2014.The US, EU and UK have all imposed sanctions on Wagner, but it is allowed to operate in Russia, even though the law bans mercenary activities.Another way in which Yevgeny Prigozhin got involved in world politics relied on people with keyboards, rather than men with guns.For years, he has been accused of being behind so-called \"troll farms\" or \"bot factories\", which used accounts on social media and websites to spread pro-Kremlin views. Such efforts were led by the St Petersburg-based Internet Research Agency (IRA), best known for meddling in the 2016 US presidential election.Former FBI director Robert Mueller, who was appointed to investigate claims of collusion between Donald Trump's campaign and Russia, concluded that the IRA carried out a social media campaign designed to provoke and amplify political and social discord in the US. It then evolved into an operation to support Mr Trump and disparage his election rival, Hillary Clinton, Mueller's report said.The US put sanctions on the IRA and Prigozhin personally over interference in the 2016 presidential election and then attempted meddling in the 2018 midterm elections.Ukraine is another major target of the IRA's disinformation campaigns and, according to the UK, \"cyber soldiers\" with suspected links to Prigozhin have attacked countries including the UK, South Africa and India.Just as with Wagner, after denying any involvement and suing people who suggested that he was behind troll factories and bot farms, Prigozhin claimed in February 2023 that he had \"conceived, created and run\" the IRA.All this time Prigozhin shunned the limelight, usually communicating with the media via statements issued by his catering company, Concord.This changed after Russia launched its full-scale invasion of Ukraine in February 2022. Months into the campaign, it was clearly stalling, and Prigozhin's services were much in demand again.After years of denying that Wagner even existed, on 27 July 2022 Kremlin-controlled media suddenly admitted that it was fighting in eastern Ukraine. Prigozhin also started posting videos on social media - apparently filmed in occupied parts of Ukraine - in which he boasted of Wagner's exploits there. By this time, no other private military company in the world had access to so much kit, including fighter jets, helicopters and tanks.But soon it became obvious that Prigozhin's relations with the Russian military were very strained. He repeatedly criticised Russia's top brass, claimed that the defence ministry starved Wagner of ammunition and at one point even accused Defence Minister Sergei Shoigu and Chief of the General Staff Valery Gerasimov of treason.After tens of thousands of Russian troops were killed in Ukraine, Prigozhin was allowed to recruit in prisons. He personally visited numerous jails to promise convicted criminals that they would be able to go home free, and with their convictions removed, after six months of fighting for Wagner in Ukraine - if they survived.In one video, he is heard telling convicts: \"Do you have anyone else who can get you out of this jail, if you've got 10 years to spend behind bars? God and Allah can, but in a wooden box. I can get you out of here alive. But I don't always bring you back alive.\"UK intelligence estimates that about half of the prisoners Wagner has deployed to Ukraine have either been wounded or killed.As Prigozhin's relations with the defence ministry worsened, he was barred from recruiting more prisoners in early 2023.But why does the Kremlin need someone like Prigozhin to conduct disinformation and military campaigns across the world?One major reason is so-called \"plausible deniability\" - using private operatives allows the Russian government to deny involvement in highly sensitive operations.And why did Prigozhin end up in this role? According to journalist Ilya Zhegulev, who has studied Prigozhin's biography in detail, there are several reasons.\"He never refused to do dirty deeds. He had nothing to lose reputationally,\" Zhegulev argues.Prigozhin's past was another reason, he adds. \"Putin does not like people with an impeccably clean reputation, because they are difficult to control. From this point of view, Prigozhin was an ideal candidate.\"In a rare interview back in 2011, Prigozhin said he had once written a book for children where the main character \"helped the king save his kingdom\" and then went on to do \"something truly heroic\". Prigozhin may now be helping President Putin to save his vision of Russia, but his life story is hardly a children's fairy tale."}