{"author":"","title":"Wales 'sets example' on homelessness, say charities","news_category":"general","content":"Wales is \"setting an example for the rest of the UK\" on homelessness - but new laws on renting could hamper progress, say charities.The report by Crisis and the Joseph Rowntree Foundation <http:\/\/news.bbc.co.uk\/1\/shared\/bsp\/hi\/pdfs\/11_08_2015_homelessness_wales_2015.pdf> praises unique Welsh laws trying to address the issue.However, removing six-month tenancy protection in a new Wales bill could undo some of the good work, they warn.The Welsh government says that measure will help the homeless, by providing a more flexible rental market.According to the report, the number of households in Wales now accepted as being homeless are at a record low.The authors say that is partly down to changes introduced in the Housing (Wales) Act <http:\/\/www.legislation.gov.uk\/anaw\/2014\/7\/contents\/enacted> in 2014 that placed a legal duty on official bodies such as councils to work to prevent people from ending up on the streets.\"By enacting the Housing (Wales) Act 2014, the Welsh government has set an example to the rest of the UK.\"This legislation means that Welsh councils must now offer real support to anyone facing homelessness.\" Homeless Wales:This video can not be playedMel from south Wales tells BBC Radio Wales about the time she spent living on the streetsBut new laws planned for the rented housing market in Wales are a cause for concern, the report authors warned.Currently, it is difficult for a landlord to evict a tenant during the first six-months of any lease.But that \"no fault\" eviction freeze could be scrapped under new plans.\"We're concerned about the growing number of people in Wales who rent their home privately face having even less security,\" said Julia Unwin, head of the Joseph Rowntree Foundation.The Welsh government dismissed the criticism, stating that Crisis supported the same proposals during consultations in 2013 on itsRenting Homes <http:\/\/gov.wales\/topics\/housing-and-regeneration\/legislation\/rentingbill\/?lang=en> legislation.\"Providing greater flexibility to rent for a shorter period of time will encourage private landlords to rent to those they see as high risk, such as people with poor renting histories,\" said an official.\"This will help tenants avoid being driven towards bad-quality housing, rogue landlords and homelessness.\"The report - called The Homelessness Monitor: Wales 2015 - also raises concerns about UK government changes to welfare and housing benefits, including the surplus rooms subsidy, the so-called bedroom tax.It said a fifth of social sector tenants have had housing benefits cut in Wales as a result of that single measure.In response, the UK's Department for Work and Pensions said it had provided substantial funding for the transition to new welfare benefit regimes."}