{"author":"By Kevin Leonard","title":"Children hit by rise in homeless in Wales","news_category":"general","content":"Concerns have been raised about the effects of rising homelessness on children in Wales.Support groups say children particularly suffer when forced to live in temporary accommodation such as bed and breakfasts.Recent figures have shown a steady rise in the number of homeless households with dependent children in Wales.The assembly government said it was concerned, but cuts to its budget meant action in future would be \"curtailed\".There is also concern about an increase in the number of families with children in B&Bs.Joy Kent, director of Cymorth Cymru which is the umbrella body for organisations helping people to find and keep their homes, said children in insecure accommodation faced particular difficulties.\"Generally speaking, we don't want to see children living in temporary or insecure accommodation, but there's also a lot of knock-on effects,\" she said.\"It's hard having to change school for example once or twice. Where there's unstable accommodation, do they have enough space to study?\"It's much more difficult to be a good student if the home environment isn't good.\"She said being homeless or in insecure accommodation placed a mental strain on those involved - both adults and children.\"When people are in dire straits, a lot of things come out of that. Mental health, drug and alcohol issues and domestic abuse increase when times are hard,\" she added.Groups helping those at the sharp end say the rise in homelessness has largely been caused by the recession, a lack of secure employment and a shortage of affordable homes.They also fear that welfare changes being brought in by the UK government will make the situation much worse.The Department for Work and Pensions has said it is working to bring fairness to a system that was \"ineffective, wildly expensive and entirely unsustainable\".It said housing benefit had \"spiralled out of control\", but it had tripled the money available for discretionary payments to support those most vulnerable.Minister for Welfare Reform Lord Freud announced on Wednesday the first allocation of cash to local authorities from a fund to help those affected by the reforms - £1.5m was allocated to Wales.The number of households accepted as homeless had been falling since the end of 2004-05.But in the three months to September last year, there was a 9% increase in Wales on both the previous three months and the same period in 2009.The number of homeless households with dependent children has also steadily increased since the last quarter of December 2009.Shelter Cymru recently raised concerns about the increase in the number of families with children in bed and breakfast accommodation.The charity said it had \"long-held concern\" about the \"cumulative impact\" of the recession, increasing unemployment and a \"drastic shortage of unaffordable homes in Wales\".Ceri Dunstan, of Shelter Cymru, said: \"The increase in households with children being accepted as homeless is a big worry.\"Homelessness causes huge disruption and trauma to anyone involved, but children are especially vulnerable to the effects of living in insecure accommodation, often missing out on schooling or being subjected to bullying and stigma.\"Yvonne Rodgers, Barnardo's Cymru director, said recent homeless statistics made for \"very worrying reading\", with Wales' poorest families \"bearing the brunt of the recession\".\"Tackling child poverty will be impossible without addressing the burden of financial exclusion when the country is struggling through economic crisis,\" she said.The assembly government said it was \"very concerned\" about the impact that homelessness could have on families and children.\"Our 10-year homelessness plan focuses on the prevention of homelessness, including in families, and during the term of this government there has been a fall of 15% in the number of homeless households, many of which are families with children,\" a spokesperson said.\"Our £36.5m mortgage rescue scheme has saved 795 adults and 390 children from becoming homeless since it was launched in June 2008 as an emergency measure during the credit crunch. Under the scheme, grants can be used by housing associations to buy a share of the mortgage or buy properties outright and then rent them back to the former owner.\"The assembly government said it had increased funding \"to support a wide range of front line homelessness services including family mediation services, which help young people to return to their families, homelessness prevention education in schools, and help for families at risk of homelessness due to domestic abuse\".The spokesperson added: \"Cuts to the Welsh Assembly Government's capital budget unfortunately mean that our action on homelessness will have to be curtailed in future years.\""}