{"author":"","title":"Alan Bircher: Swimmers speak in support of suspended coach","news_category":"general","content":"More than 80 swimmers have signed a statement in support of a swimming coach following his suspension after a review into welfare issues.Swim England launched an independent review following concerns raised by parents of swimmers at Shropshire's Ellesmere College Titans Swimming Club.Alan Bircher, a former world silver medallist, was among \"some of the programme coaches currently suspended\".The statement said it was \"shocked and saddened\" to hear of the suspension.They said: \"As past and present swimmers of theirs, all training at Ellesmere College, we are confused as to how these allegations have come to light after we all had such amazing experiences swimming at Titans.\"Alan has given his life to swimming as an athlete, then as a coach.\"As a result of the review Mr Bircher was not nominated to the Tokyo Olympics coaching team for 2021 and will not be part of the team at the Games.\"None of us have ever experienced any hurtful or damaging behaviour from Alan and the coaches at Titans,\" the statement went on.\"We have only ever had the opposite - Alan is a coach who pushes us to be at our best, who makes sure you have a great time while getting there.\"Among the 83 signatories were European and Commonwealth medallist Freya Anderson, who will be making her Olympic debut at Tokyo, Hector Pardoe, also competing in Japan, and former British national champion Chloe Golding.Mr Bircher was an international swimmer from 1997 to 2008, winning silver at the world championship in Dubai in 2004, and formerly a GB world championship lead coach.It is understood the allegations concern bullying and fat-shaming.In a joint statement British Swimming and Swim England said the report identified \"welfare and governance issues\", but would not comment further.\"Swim England will remain working with the club until such time as we are content our robust safeguarding and welfare procedures and policies are embedded within the governance of the club,\" it said.Follow BBC West Midlands on Facebook <https:\/\/www.facebook.com\/MidlandsBBC\/>, Twitter <https:\/\/twitter.com\/bbcmtd> and Instagram <https:\/\/www.instagram.com\/bbc_midlands\/?hl=en>. Send your story ideas to: newsonline.westmidlands@bbc.co.uk <mailto:newsonline.westmidlands@bbc.co.uk>"}