{"author":"","title":"Olivia Pratt-Korbel: Witness denies being scorned woman","news_category":"general","content":"A witness in the Olivia Pratt-Korbel murder trial has denied lying about the accused for money and because she was a scorned woman.The witness, who cannot be identified for legal reasons, said she had a \"fling\" with defendant Thomas Cashman.Mr Cashman, 34, denies murdering the nine-year-old and injuring her mother at their home in Dovecot, Liverpool.The court heard the witness admitted telling \"little white lies\" to police.The witness told a jury at Manchester Crown Court she had now left Liverpool, was still \"terrified\" of giving evidence against Mr Cashman but had done so because a child had been shot dead.\"When there's a little girl involved, there's no form of grassing in my world,\" she told the jury.\"Because of this little girl. I just feel like if he was any sort of man, he would just... own it.\"I can't believe he's making her family go through this. It's a child.\" Mr Cashman is accused of trying to kill another man, Joseph Nee, chasing him into Olivia's home and firing his gun.But the \"execution\" went \"horribly wrong\" the court heard, with Mr Cashman shooting and missing Mr Nee but hitting the mother and daughter, killing Olivia on 22 August last year.Mr Cashman denies being the gunman but the witness has implicated the defendant, telling police after the shooting he turned up at her home agitated and changed his clothing.She also claimed she heard him say he had \"done Joey\", the court heard.But John Cooper KC, defending, suggested she was lying for money and because the defendant had used her for sex.Mr Cooper suggested the woman was angry and wanted to \"ruin\" Mr Cashman's life because the defendant loved his partner and children and she was \"just a bit of fun\".She was initially arrested on suspicion of assisting an offender and admitted telling \"little white lies\" to detectives, she said to protect her family and avoid getting involved in the police investigation.She told the jury: \"I was petrified of speaking in the first couple of interviews.\"I was woken up that night by a guy doing a dreadful thing and putting my life [in] danger.\"I was petrified to speak about Tommy. I've got to come home, he's going to want to see me, what I have been speaking about.\"I was mortified I have been put in this situation.\"I don't know what my life will hold in the next few years.\"Mr Cooper asked if she was so terrified why, the next morning after discovering a little girl had been shot dead, she then went to the gym.She said: \"My gym is my therapy. To be with friends, to release my energy.\"Mr Cooper continued: \"Was having your nails done also part of your therapy?\"The witness replied: \"Am I being shouted at for getting my nails done?\"Trial judge Mrs Justice Yip adjourned proceedings briefly as the exchanges became heated for the second time <https:\/\/www.bbc.co.uk\/news\/uk-england-merseyside-64938751>.Mr Cooper later suggested the witness was lying about the defendant due to money and debts.He suggested a person the witness knew owed Mr Cashman £25,000 for cannabis and one way to avoid paying was to get the defendant, \"off the scene\".The witness said the suggestion was \"absolutely ridiculous\" and that cannabis dealing was \"too poxy\" for Mr Cashman.Mr Cooper asked the witness if she had ever discussed with police the Crimestoppers reward offered for information in this case, which began at £50,000 and rose to £200,000.She said: \"We already came forward first, so there's no money we would be entitled to.\"I've never been or asked or even interested in the money, when I came forward there was no reward up.\"I could not sleep at night.\"Mr Cashman, of Grenadier Drive, Liverpool, denies the murder of Olivia, the attempted murder of Mr Nee, wounding with intent to do grievous bodily harm to Ms Korbel, and two counts of possession of a firearm with intent to endanger life.The trial continues. Why not follow BBC North West on Facebook <https:\/\/en-gb.facebook.com\/BBCNW\/>, Twitter <https:\/\/twitter.com\/BBCNWT> and Instagram <https:\/\/www.instagram.com\/bbcnorthwest\/>? You can also send story ideas to northwest.newsonline@bbc.co.uk <mailto:northwest.newsonline@bbc.co.uk>"}