{"author":"By Charlie Jones","title":"Covid lockdown artist: More than 250 artists help with Essex disabled boy's project","news_category":"general","content":" More than 250 artists from across the world have helped a 12-year-old boy with an art project.Noah, who has hydrocephalus, epilepsy and cerebral palsy, started painting on pieces of cardboard at home in Dedham, Essex in April, during lockdown.His father Nathan Jones posted on Instagram, asking artists to finish the pictures and was \"overwhelmed\" by the response.A book has been created from the art, with all profits going to the NHS.Mr Jones said: \"Noah loves painting. He has a real eye for colour and has created all the backgrounds himself.\"Every time we get a new painting in the post, Noah has the exciting task of opening it up to see what that artist has created. It has certainly kept him busy and very happy.\"Artists from the UK, Colombia, Italy, Spain, France, Sweden, Germany, the US and Australia have all taken part in the project.The family has created the book, called Background Bob, to raise money for the Colchester and Ipswich Hospitals Charity <http:\/\/colchesteripswichcharity.org.uk\/supporters-events\/backgroundbob\/> and also plans to auction off the individual paintings next year for the same cause.Mr Jones said it was their way of saying thank you to the doctors who have played \"a huge part\" in Noah's life.They regularly go to street art exhibitions and were excited to find out recently that the artist Nathan Murdoch has created a mural of Noah holding his paintbrush in an underpass in Peterborough, directly oppositehis famous depiction of Prodigy star Keith Flint <https:\/\/www.bbc.co.uk\/news\/uk-england-cambridgeshire-47654005>.Mr Jones said anyone interested in the project could follow Noah on his Instagram account, \"background_bob <https:\/\/www.instagram.com\/background_bob\/?hl=en>\".Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}