{"author":"","title":"Bloody Sunday: Ex-Official IRA members may be prosecuted","news_category":"general","content":"For the first time, former members of the Official IRA are being considered for prosecution for their role in the events of Bloody Sunday in Londonderry.The PSNI has forwarded a file to the Public Prosecution Service (PPS) on one former IRA member and is understood to be preparing a file on a second.Thirteen people were shot dead when the Army's Parachute Regiment opened fire on civil rights demonstrators in 1972.Fifteen people were injured.The BBC has seen a letter sent by the PPS to relatives of Bloody Sunday victims on 19 September.It outlines why it will take at least another six months to come to a decision on whether or not to bring possible charges, including murder,against former British soldiers. <http:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-foyle-west-39894229>But the possibility of prosecutions against republicans for their activity on the day has also been raised.It states that police have submitted a file on an additional suspect who has been reported to the PPS by the PSNI.The letter says: \"The suspect is not a soldier and is not alleged to have shot any civilian. The file relates to alleged Official IRA activity on Bloody Sunday.\"In 1969, the IRA split into the Official IRA and the Provisional IRA.The Official IRA took a more socialist line, announcing a ceasefire in 1972, while the Provisional IRA became more militant.The Bloody Sunday Inquiry, led by English judge Lord Saville, was the longest and most expensive in UK history.During the inquiry, former members of the Official IRA - giving evidence anonymously - admitted the organisation had played a role on Bloody Sunday but shot at soldiers very early on and only in retaliation for the shooting of two of the protesters.They denied that the organisation had fired first. In his report, Lord Saville concluded that on balance a soldier fired the first shots on the day.The letter from the PPS reveals that the republican suspect under consideration, will be subject to the same test for prosecution as the soldiers.It also states that they understand that the police are preparing another file on a second person over the activities of the Official IRA, and that file will based on statements due to be made by some people who have previously not given statements to the PSNI.The PPS is also examining eight further files on Bloody Sunday but adds that the file on the Official IRA suspect is brief and should not take a great deal of time to consider.But, overall, the introduction of the new material will mean that they will not be able to move towards a decision for another six months.A spokesperson for the PPS told BBC Radio Foyle that they have provided regular updates to all the families over the Bloody Sunday case and the PSNI, in the last year, provided about 35 files of material.The PPS added that its focus is on completing examination of those files and all relevant legal issues.It confirmed that one further suspect has been added and another report is expected. But, they don't believe this will add significantly to the timescale for their decision.The Ministry of Defence said that due to ongoing legal proceedings it was inappropriate to comment. The PSNI confirmed it had sent a number of files to the PPS.Clarification 9 April 2019: This article was amended to remove a reference to the death of John Johnston. This reflects the Bloody Sunday Inquiry's finding about Mr Johnston's death several months after he was wounded in Derry on 30 January 1972. The inquiry report states that his death was \"not the result of any of the wounds he sustained on Bloody Sunday\"."}