{"author":"By Gemma Ryall","title":"Adoption: A father's highs and lows of taking on two children","news_category":"general","content":"\"I can't imagine family life being any different to this.\"Adrian, from Pembrokeshire, has two adopted children, a girl aged 10 and a boy aged seven.As Wales sees an \"unexpected increase\" in children being put up for adoption <http:\/\/www.bbc.co.uk\/news\/uk-wales-41560297>, he said anybody considering giving a child a home should be prepared for challenges but also for love, joy and fulfilment.His children, Katie and Tom (not their real names) were adopted at different times when they were both aged about two-and-a-half.He recalls the moment he had a toddler in his house for the first time as \"incredibly terrifying\".\"First of all you have a person in your life who wasn't there the day before and you have a crushing, dawning realisation you are responsible for her,\" he said.\"I remember walking into her room after her first night and seeing her little face looking at me seriously. And you just wonder what she's thinking. What has she been through? She must be terrified.\"You go through all these scenarios about what she's going through. And that happens a million times a day - and you think like that for a long time. You start to overthink things.This video can not be playedAdrian on the \"powerful\" first moment with his adopted child\"When she has difficulties you think, is it because of something that has happened in her past?\"My first memory of Katie was when she came into the room with a little plastic bag, like a pencil case, and took out all her little stickers and toys.\"She spoke to me then put them all away and walked off. To me, that was like a metaphor for her emotions - she can be very protective and closed with her emotions at times.\"With Tom, my son, he was a bit different. He was adopted at about the same age but he was a stereotypical boy, whereas Katie was a stereotypical girl. He seemed much more resilient and was immediately easy going and full of smiles.\"We are open with them about them being adopted and we have taken them to the towns where they were born. All their friends know and thankfully it's never been a problem. The support systems in place from the adoption services have also been brilliant.\"The biggest challenge is just trying to be the father I think I'm supposed to be with children who are already years ahead of me in experience. They had their world already and I had to come in and put myself in the middle of that.\"But, although they are not biologically related, Katie and Tom get on like any brother and sister and our family has a very close bond.\"Life can be fulfilling without children but they can be a very good bridge for understanding that I'm not here for myself. You see them growing up and doing stuff and that's fantastic and very rewarding.\"I just find it the most complete family I could ever imagine. You expect problems, because that's what you often hear - and yes, there can be challenges emotionally.\"But we can go out on a Sunday and do something and I take a step back and think 'I can't imagine family life being any different to this. It's my family'.\""}