{"author":"By Anthony Zurcher","title":"Fingerprints and a mugshot: This is what will happen when Trump is arrested","news_category":"general","content":"This video can not be playedWatch: What happens when Trump is arrested - in 70 secondsDonald Trump is facing impending arrest on charges stemming from an investigation into a $130,000 (£106,000) payment to porn star Stormy Daniels in 2016.After a grand jury in New York voted on Thursday to indict him, he will be the first former US president to face criminal charges.The exact charges have not yet been disclosed, but here are some key questions on the issues at play in this case.In 2016, adult film star Stormy Daniels contacted media outlets offering to sell her account of what she said was an adulterous affair she had had with Donald Trump in 2006.Mr Trump's team got wind of this, and his lawyer Michael Cohen paid $130,000 to Ms Daniels to keep quiet.This is not illegal. However, when Mr Trump reimbursed Mr Cohen, the record for the payment says it was for legal fees. Prosecutors say this amounts to Mr Trump falsifying business records, which is a misdemeanour - a criminal offence - in New York.Prosecutors could also potentially allege that this breaks election law, because his attempt to hide his payments to Ms Daniels was motivated by not wanting voters to know he had an affair with her. Covering up a crime by falsifying records would be a felony, which is a more serious charge.Even advocates for prosecution acknowledge that either way, this is by no means a clear-cut case. There is little precedent for such a prosecution, and past attempts to charge politicians with crossing the line between campaign finance and personal spending have ended in failure.\"It's going to be tough,\" says Catherine Christian, a former financial prosecutor for the New York City district attorney.The decision on whether to file charges rests with New York City District Attorney Alvin Bragg. He set up the grand jury to investigate whether there was enough evidence to pursue a prosecution, and he was the only one who knew when an indictment would be voted on.On Thursday afternoon, that grand jury reportedly decided to bring charges. But at the moment, we do not know what those charges are.This video can not be playedWas Trump's Stormy Daniels payment legal?Mr Bragg has informed Mr Trump and his lawyers, setting off negotiations over how and when the former president will appear in New York City for his formal arrest and first hearing in court. A spokesperson for the New York City court has said that the former president's arraignment will take place on Tuesday at 14:15 Eastern Time.The document presenting the official charges against Mr Trump will not be made public until a judge reads out the charges against him.Given the historic nature of such a move, and the security concerns involved, the details of Mr Trump's New York appearance are somewhat uncertain. The latest reports, however, are that the president will fly to a New York area airport on Monday and then make the journey to the lower Manhattan courthouse on Tuesday by car.The FBI, New York City law enforcement and the US Secret Service are coordinating security for the proceedings.As part of those negotiations with prosecutors, the court may also agree to grant him a private entrance to the court, instead of the more typical \"perp walk\" in front of the assembled media.Once inside, however, Mr Trump will be fingerprinted and have his mug shot taken like all defendants in criminal cases. He will also be read his \"Miranda\" rights, reminding him of his constitutionally-protected right to a lawyer and to decline to talk to police.Defendants charged with a felony are typically handcuffed temporarily, although Mr Trump's lawyers will try to avoid that for their client. Throughout the booking process, he will be accompanied by Secret Service agents.Mr Trump would then wait in a holding area or cell until his appearance before a judge. The arraignment - the moment where a defendant enters their plea before a judge - is open to the public.Once the case is booked and a judge is selected, other details will fall into place, such as the timing of the trial and possible travel restrictions and bail requirements for the defendant.A conviction on a misdemeanour would result in a fine. If Mr Trump were convicted on the felony charge, he would face a maximum sentence of four years in prison, although some legal experts predict a fine is more probable, and that any time behind bars is highly unlikely.An indictment or even a criminal conviction would not prevent Mr Trump from continuing his presidential campaign if he so chooses - and he has given every indication that he will keep pushing ahead regardless of what happens.In fact, there is nothing in US law that prevents a candidate who is found guilty of a crime from campaigning for, and serving as, president - even from prison.This video can not be playedWatch: Trump supporters gather outside Mar-a-LagoMr Trump's arrest would certainly complicate his presidential campaign, however.While it might cause some Republican voters to rally around their embattled champion, it could be a significant distraction for a candidate on the campaign trail, trying to stump for votes and participate in debates.It would also deepen and enflame already sharp divides within the American political system.Conservatives believe the former president is being held to a different standard of justice, while liberals view this as an issue of holding law-breakers - even those in the highest positions of power - accountable."}