{"author":"","title":"US to evacuate thousands of Afghans before troop withdrawal","news_category":"general","content":"The US plans to evacuate thousands of Afghans who worked for the American military ahead of September's troop withdrawal, senior officials have said.The plan could involve moving as many as 50,000 people - interpreters and their families - to other countries.Afghan interpreters who have worked for the US for years fear reprisals from the Taliban after the withdrawal.As many as 18,000 Afghans have applied for US visas, but the lengthy process has been hindered by delays.The plan is to move them to other countries before September where their applications can be finalised in safety.Speaking at the White House on Thursday, President Joe Biden said: \"Those who helped us are not going to be left behind. They're welcome here just like anyone else who risked their lives to help us.\"Mr Biden is due to hold talks with Afghan President Ashraf Ghani in Washington on Friday. They are expected to discuss the current security situation in Afghanistan, as well as the nature of US support after its military withdrawal.Republican Congressman Mike McCaul, who has advocated for the evacuation programme, told Reuters news agency that about 9,000 interpreters who had applied for Special Immigration Visas (SIVs) would be included in the plan, along with their family members.\"You are probably talking about 50,000 people. There's no way to expedite their visas in-country... on a timely basis that would save their lives,\" he said.Mr McCaul said destinations that \"could be on the table\" include Kuwait, Qatar, the United Arab Emirates and Bahrain. He said the operation would involve \"a lot of planes\".Pentagon spokesman John Kirby said plans for the evacuation were well under way, but that military aircraft might not be needed.\"We are taking this seriously. We know we have an obligation to these men and women and their families,\" he told journalists. \"Planning is ongoing, lots of options are available.\"Other senior US officials involved in the plan said visa processing would continue after the military withdrawal \"including for those who remain in Afghanistan\".\"Should it become necessary, we will consider additional relocation or evacuation options,\" one official quoted by AFP news agency said.President Biden announced in April that US troops would leave by 11 September, after 20 years of military involvement in Afghanistan. \"It is time to end America's longest war,\" Mr Biden said.There are at least 2,500 US troops in the country as part of the 9,600-strong Nato Afghan mission.This video can not be playedAre the Taliban preparing for peace or more war?"}