{"author":"","title":"Paradise Wildlife Park prepares for new habitats after two-year delay","news_category":"general","content":"A family-run zoo opening two habitats for threatened species said a two-year delay was a \"blessing in disguise\".Jaguar Jungle and Sun Bear Heights at Paradise Wildlife Park in Broxbourne, Hertfordshire were due to open in 2021.After delays due to the Covid-19 pandemic and Brexit, the \"UK-first habitats\" will open from 1 April.Aaron Whitnall, one of the brothers who runs the zoo, said they had \"been able to create something amazing\" with the extra time.Three brothers - Aaron, Tyler and Cameron - work at the wildlife park, which has about 800 animals and sits on land near Broxbourne bought by their grandfather in the early 1980s.The habitats in the £1.5m project were due to open in the months after the third Covid lockdown <https:\/\/www.bbc.co.uk\/news\/uk-england-beds-bucks-herts-56428715>, but it took longer to recover from the previous 12 months than anticipated.This was compounded by Brexit regulations.\"Glass that we needed got delayed for ages and there was an increase in the costs of materials pretty much overnight,\" Mr Whitnall said.\"There were also issues with contractors and it all rolled into one giant nightmare project, but it's done now and we're raring to go.\"Resident big cats Kedera and Kumal will return from a sister site, The Big Cat Sanctuary in Kent, to Jaguar Jungle, a refurbishment of their old habitat.The new South American-themed area is about three times bigger with a pool, underwater viewing and a tree top walkway.It is the only habitat in the UK where you can see jaguars swimming, the zoo said.Sun Bear Heights will house three species all new to the park, which are usually found in South East Asia - the threatened bears, Kyra and Indera, together with a pair of binturong and two Asian small-clawed otters.Mr Whitnall said: \"Even though it's a bit behind, the delay has had its benefits. We've been able to take a bit more time and we now think we've got world class habitats.\"It was a blessing in disguise - we've now been able to create something amazing that we think will blow people away.\"The new and returning species are all part of an ongoing plan for the zoo to be at the forefront of wildlife conservation \"creating bespoke habitats\".Each new area also explains what is endangering each species.All the new arrivals are classed as vulnerable on the International Union for Conservation of Nature's Red List <https:\/\/www.iucnredlist.org\/>, which is the class below endangered, and jaguars are \"near threatened\", Mr Whitnall said.It is hoped that they will breed in Hertfordshire in the coming years. The park will be called Hertfordshire Zoo from its 40th anniversary in April 2024 and Mr Whitnall said they had lots of new projects planned for the re-brand.\"2022 was the busiest year in our history and we're now hoping to grow further and invest more into both the park and conservation,\" he said.Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk"}