{"author":"","title":"UK citizens are advised not to travel to Russia","news_category":"general","content":"UK citizens have been advised against travelling to Russia due to a lack of flights available and economic problems in the country.The Foreign Office warned Britons in Russia might not be able to fly directly to the UK or via EU countries.It said the value of the rouble had fallen and there were reports of lots of people \"attempting to withdraw their savings from Russian banks\".The advice comes after Russia banned airlines from 36 countries.In a tit-for-tat retaliation to sanctions, the country said it would stop flights from nations including Germany, Spain, Italy and Canada from using its airspace.On its website <https:\/\/www.gov.uk\/foreign-travel-advice\/russia>, the Foreign Office urged people in Russia to \"amend any travel plans accordingly\".It means UK or EU citizens wanting to leave Russia by air would have to travel to a country which has not issued any flight or travel sanctions to Russia to then get a flight directly home.Russia had already barred UK airlines from flying to and across the region after Britain banned Russian airlines, including national airline Aeroflot and private jets, from landing in the UK.The Foreign Office also warned the sharp fall in the Rouble's value meant any Russian currency people held \"may reduce in value over the coming days\" and that foreign nationals in Russia were reported to be having difficulty using ATM and banking services.It also said since Putin's invasion there had been several reports of anti-war protests with a \"heavy police presence\".\"There are reports of increased police presence and ID checks. You should keep your passport with you at all times,\" the Foreign Office said.On Sunday, Europe shut its skies to Russian owned or controlled planes in one of a number of sanctions imposed by Western nations on Russia following its invasion of Ukraine.The announcement means all planes, including the private jets of oligarchs, will now be unable to land in, take off from or fly over any EU nation.Transport Secretary Grant Shapps also announced he had told all UK ports to not let any Russian \"flagged, registered, owned, controlled, chartered or operated vessels\" to have access.\"I've made clear these vessels are not welcome here,\" he said. This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.The UK Chamber of Shipping said the banning of ships with Russian interests from UK ports would \"put further pressure on the Russian President's military objectives\", but added it would be \"complex\" and would \"require new legislation\".On Monday, the Russian aviation regulator, Rosaviatsia, said: \"A restriction has been imposed on flights for airlines of 36 countries in accordance with international law as a retaliatory measure for the ban imposed by the European states on the flights of commercial airliners operated by Russian airlines and\/or registered in Russia.\"The measures mean airlines will have to make long detours on some routes, potentially raising the cost of fuel and tickets.The countries banned from Russia's airspace are: Albania, Anguilla, Austria, Belgium, British Virgin Islands, Bulgaria, Canada, Croatia, Cyprus, Czech Republic, Denmark (including Greenland, the Faroe Islands), Estonia, Finland, France, Germany, Gibraltar, Greece, Hungary, Iceland, Ireland, Italy, Jersey, Latvia, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, UK.Swiss International Airlines, which is owned by Germany's Lufthansa, said that it had cancelled flights from Zurich to Moscow despite Switzerland not appearing on Russia's list of banned countries.A spokesperson for the Swiss airline also said it was not flying through Russian airspace.It said: \"We continue to closely monitor the development of the situation and are in close exchange with the Swiss and international authorities as well as with the Lufthansa Group for our operational decisions.\"Meanwhile, cruise firm Carnival, which owns P&O Cruises as well as Cunard, said it was changing journeys on Baltic cruises.The company said it would advise guests of the changes \"as soon as possible\".On Monday, Switzerland - traditionally a neutral country and whose banks are believed to hold billions of dollars in Russian funds- said that it would adopt EU financial sanctions against Moscow.The Swiss justice minister, Karin Keller-Sutter, also said it had banned five oligarchs with links to Russia's president Vladimir Putin from entering the country, though declined to name them.The BBC's correspondent in Geneva, Imogen Foulkes, said: \"Make no mistake, this is a huge step for Switzerland, which has often agonised over what being neutral actually means.\"Today, Swiss president Ignazio Cassis made it clear: the attack on Ukraine was an unacceptable attack on freedom and democracy,\" she said.Rob Morris, head of consultancy at aviation data and analytics company Ascend by Cirium, said the restrictions would hinder the aviation industry's emerging recovery ahead of the critical summer booking period.Mr Morris said the restrictions will hit long haul routes from Europe to Asia the most and cargo was likely to be affected more than passenger routes.Are you a UK citizen trying to fly to the UK from Russia? You can get in touch by emailinghaveyoursay@bbc.co.uk <mailto:haveyoursay@bbc.co.uk?subject=BritsInRussia60559513>.Please include a contact number if you are willing to speak to a BBC journalist. You can also get in touch in the following ways:If you are reading this page and can't see the form you will need to visit the mobile version of theBBC website <https:\/\/www.bbc.co.uk\/news\/have_your_say> to submit your question or comment or you can email us atHaveYourSay@bbc.co.uk <mailto:Haveyoursay@bbc.co.uk>. Please include your name, age and location with any submission."}