{"author":"By Tomos Morgan","title":"Bipolar artist's work on display in home town of Cardigan","news_category":"general","content":"This video can not be playedMax Self used art to express what was happening inside his mindAn exhibition featuring the work of an artist who took his life due to his mental health struggles is set to be held in his home town.Max Self from Cardigan, Ceredigion, was diagnosed with bipolar disorder when he was a teenager.Nicky Watts said her son's artwork helped him channel and express his emotions.The proceeds of the exhibition being held at Canfas art gallery will go towards the mental health charity Mind.Max was diagnosed with bipolar in his early teens as he began to show more and more extreme behaviours.But his mother said he was able to channel his emotions and experiences into his love of art, which led to his impressive body of work.\"All the voices, all the torment, all the things he was seeing in his head he was able to put down on paper,\" Nicky said.She added that he told her, \"a pen in my hand is like a doorway through my soul\".Bipolar is where a person experiences super highs, super lows and also manic episodes - which can last anywhere from a few hours, to days and even longer.\"You just have no control when a manic episodes takes you or when the depression hits you,\" Nicky said.\"You have to keep saying to yourself this is somebody that's ill, and they do need the help, and I think you've got to be incredibly patient and keep going with it.\"Max used his artistic outlet to help him illustrate what was going on inside - which helped him produce his psychedelic style of drawings and art.Each piece took him about 50 hours to complete.After winning a competition run by Ubisoft, the international gaming firm told him the maps he had created on his own in just one week would have needed 15 of their own people to do so in the same time.Yet Max turned down a job offer from them so that he could focus on his own work.For some time, the mother and son had been discussing putting his work on exhibition, and exactly one year ago last week they were finalising those plans over lunch.But it was a period of time when Max was struggling considerably with his illness.\"We had a lovely lunch, it was a beautiful sunny day, and we sat outside and I grabbed him by the hand and I said 'how are you doing in there?', and he said 'oh mum, the voices and torment, its just all too much'.\"He said, 'if you're a normal person and you get sick you can recover, but this is my existence for life. I can never ever recover, I can't get better'.\"Just 11 days later, Max took his own life at the age of 29.A year on from his death on 9 April 2022, his works are finally on exhibition in Canfas, an art gallery in Cardigan. The gallery had been following his pictures for a while.\"Every little section, it's all about Max's world, and what he's dealing with,\" says Claire Louise Wrigley, an artist who also works at Canfas.\"You've got this psychedelic art influences with his lovely colours and bold colours.\"We also see bits of MC Escher you know the layers and perspectives.\"It's almost like a modern day Hieronymus Bosch. You've got these strange creatures that don't make sense to us in the real world.\"But for Max, that's what he was dealing with, that was his world.\"Ecstatic that her son's work can finally be on display, Nicky also hopes the exhibition can be an inspiration for others that may be suffering that there are outlets of expression out there.And with so many of Max's other works yet to be displayed another exhibition is already in the pipeline.\"I remember him saying to me, 'mum if something were to happen to me what would ever happen to my art?'\"And I said 'hey, I'm your mum - you know I'll look after it for you'. And that's what I've done.\""}