{"author":"By Richard Morgan","title":"Wrightbus to get £11.2m for hydrogen-fuel technology","news_category":"general","content":"The Ballymena-based bus manufacturer, Wrightbus, is to receive £11.2m from the government to develop hydrogen-fuel technology.It is one of three UK firms to be awarded funding, with the government believing the £54m package will secure 10,000 UK jobs.Wrightbus had increased its workforce in January <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-55737647>, ahead of expected demand for its hydrogen-powered buses.Chairman Jo Bamford said the funding would safeguard and create jobs.This public money will be used to manufacture low-cost hydrogen-fuel cell technology for buses at its Ballymena site.Translink had already ordered <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-55149620> zero and low emission vehicles from the manufacturer.Mr Bamford said a centre of excellence for zero-emission technology would be created in Ballymena.\"It will safeguard more than 1,000 skilled jobs and will allow us to create more than 3,000 additional jobs over the next 10 years, giving a significant boost to the wider economy in Northern Ireland,\" he added.Announcing the funding, which has also been awarded to projects in Cwmbran in Wales and Warwickshire in England, Business Secretary Kwasi Kwarteng said the investment in new technologies will help the UK to meet its climate goals.\"The UK is leading the world by developing cutting edge technology that will help to tackle climate change and lead to a green, competitive future for our automotive supply chain.\"These projects will not only help accelerate the wider application of greener technology in lorries and buses, but will also help generate the high-skilled jobs to level up communities across the UK while ensuring we build back greener from the pandemic.\"The Northern Ireland Secretary of State, Brandon Lewis, said the funding is a boost for the economy.\"Northern Ireland and the local economy thrives on innovation, manufacturing and technological advancements, leading the charge in allowing us to reach our ambitious goal of a net zero future by 2050,\" he added.\"This is outstanding news for the people of Northern Ireland.\"This will continue to level up our local economy, allowing Wrightbus to continue producing the next generation of world-leading hydrogen buses.\"Unite Regional Officer, George Brash welcomed the announcement and said it showed a \"vote of confidence\" in the skills of Northern Ireland's workforce.\"Today's announcement confirms that Northern Ireland's manufacturing sector can succeed despite the failure of Stormont to bring forward a dedicated growth strategy for the sector,\" he said."}