{"author":"","title":"Bus shake-up could see one network across Wales","news_category":"general","content":"A major overhaul could see one bus network and a single ticketing system for the whole country, under proposals from the Welsh government.Private firms would have to bid to run services and ministers would have a bigger say in how the system works.Labour ministers said the aim was to help tackle the climate emergency and \"put people before profit\".The Welsh Conservatives criticised Labour's approach, saying it was neither cost-efficient or effective.Plaid Cymru said reform was long overdue while the Liberal Democrats said Labour's record on buses \"isn't great\".It is not the first time the Welsh government has proposed a system of bus franchising, where companies bid for contracts.But Thursday's announcement <https:\/\/gov.wales\/one-network-one-timetable-one-ticket-planning-buses-public-service-wales> goes further by stipulating that the whole country's network should be run this way.A law was originally proposed <https:\/\/www.bbc.co.uk\/news\/uk-wales-politics-51854045> by the Welsh government two years ago, with powers for councils to franchise, alongside partnerships where councils work with companies, but it was shelved during the first year of the pandemic.BBC Wales was told that climate change and the need to move people out of cars and on to public transport was why the previous, more limited, proposals were abandoned.It comes as the number of people using buses has fallen by about 90% during the pandemic, with services running with increased subsidies.First Minister Mark Drakeford said an \"extraordinary\" level of subsidy was needed to keep bus services running during the pandemic.Mr Drakeford told MSs that last year the Welsh government spent £130m more on bus services than it would normally expect.Ticket sales collapsed during lockdown - and still have not recovered to pre-pandemic levels.At Maesteg bus station on Thursday, Nadia, 17, who uses the bus to get to college, said: \"Bus is a great option, helps solve the pollution problem.\"However, they could be more reliable with the showing-up time because they're often late.\"Shirley Drew, 64, from Maesteg, said: \"It's not very good. Some days you wait for a bus up in Cymmer and they don't turn up and they don't tell you the bus is off.\"But Betty Daniel, 88, from Bryn, said: \"It's a wonderful service, I'm very grateful.\"I rely on them, nearly everyone in our village relies on them.\"Until the 1980s, much of the British bus network was run by publicly-owned companies with local monopolies until services outside London were opened up to competition by former Prime Minister Margaret Thatcher's Conservative government.Since then, many of the less profitable routes have been scrapped.Under proposals, companies would bid for the right to run certain services and could be asked to run buses on less lucrative routes in return.Currently, bus firms are not allowed to cross-subsidise services, with councils providing money for routes which do not generate a profit.Councils would also be given the right - taken away in the 1980s - to set up new local government-owned companies to run buses, or even run buses in-house.Ministers said they would work with councils, the bus industry and passengers on what they called a franchising model with the eventual aim of having one Welsh network with multiple tickets no longer required.Councils, or groups of them, would hand out franchises, but in a major departure from how services are run now, the Welsh government would have a big say.The proposal is for franchising responsibilities to sit with Welsh ministers, with Transport for Wales to act on their behalf and engage with local authorities to ensure that franchise contracts meet local needs and services in line with the network plan.A national plan would be agreed by the Welsh government and a supervisory board, including groups of local councils and the government, would provide a \"guiding mind\" to co-ordinate the network.Contracts could be for individual routes or entire networks in an area.CPT Cymru, the trade association for bus and coach operators in Wales, said the additional costs of a franchise model would be around £61m a year, with no guarantees that bus services would be improved any quicker.It added that working closely with bus operators was crucial to improving services, and that a clear timetable and funding plan was needed.\"Ensuring that operators' expertise in running services, their strong track record for innovation and existing strong relationships with passengers are fully utilised will be vital.\"To avoid a period of uncertainty that delays investment in improvements in services for passengers we now need to see a clear timetable and a solid financial commitment to fund the changes Welsh government propose.\"Deputy minister for climate change Lee Waters said: \"We've seen a gradual decline in the bus industry in Wales over the years and, as a result, we've been left with an industry that is broken and in need of much investment.\"But I am confident that the plans we have announced today will help pave the way to a healthy recovery.\"We're going to be putting people before profit and providing passengers with a well-planned, easy to understand and connected bus network that makes the right thing to do the easy thing to do.\"A 12-week public consultation on the plan will now begin.Welsh Conservative transport spokeswoman Natasha Asghar said her party had been disappointed by the Welsh government's \"lacklustre approach\" to tackling climate change.Action needed to be \"cost-efficient and effective\", she said, but \"so far, Labour's strategy has been neither\".Plaid Cymru's Delyth Jewell said bus services had been \"substandard for too long and a reformation paper - while welcome - is well overdue\".\"For too many people in too many parts of Wales, buses are not currently a viable method of transport and this needs to change,\" she added.Welsh Liberal Democrat leader Jane Dodds said Labour ministers' record on supporting bus services \"isn't great, with the number of journeys by bus in Wales declining by 22% between 2009 and 2019\" and the \"proof will be in action, not words\".\"Nevertheless, we are looking forward to seeing how bus services will be greener and more efficient and we will continue to campaign for under-25s in Wales to be given access to free bus travel,\" she said."}