{"author":"By Theo Leggett","title":"UK new car sales hit 30-year low but electric vehicle demand soars","news_category":"general","content":"New car registrations in the UK fell last year to their lowest level in three decades, new figures show.Despite a recovery in the second half of 2022, a continuing parts shortage hit production lines.Meanwhile, demand for electric vehicles continued to grow and they accounted for almost a fifth of new car sales.But charging infrastructure is not being built quickly enough to cope with growing demand, warned the Society of Motor Manufacturers and Traders (SMMT).Across the whole of 2022, 1.61 million new cars were registered in the UK. That was the lowest level since 1992.The market continued to feel the impact of the Covid pandemic. Sales were slightly lower than in 2021, a period affected by lockdowns and other restrictions - and some 25% down on 2019, the last \"normal\" year before the outbreak.Although demand for new vehicles remained high, manufacturers struggled to get hold of parts.There were particularly serious problems obtaining semiconductors, which are used in a vast array of electronic systems, from in-car entertainment to engine management.\"It's still the long Covid effect,\" said Mike Hawes, chief executive of the SMMT. \"The key issue is global disruption to supply chains,\" he added.\"The demand we know is there… manufacturers have just really struggled to be able to make vehicles in sufficient quantities.\"The situation did improve significantly in the second half of the year, with registrations growing for five months in a row.That trend is expected to continue this year, despite fears of recession. The SMMT is forecasting sales of roughly 1.8 million in 2023.The UK's favourite car of 2022 was the Nissan Qashqai which becomes the first British-built model to top the annual sales charts for 24 years.The model was designed in Paddington, engineered in Cranfield and built in Sunderland.Source: SMMTSales of electric cars, meanwhile, continued to grow. They rose from 190,700 to 267,000 - with their market share climbing from 11.6% to 16.6%.In December, that figure rose to just under 33% - although this reflects the timing of shipments from overseas by Tesla.The lion's share of fully electric vehicles were bought by businesses and fleet customers which made up 66.7% of all registrations of this type of car in 2022.But while electric vehicle sales are still climbing rapidly, the SMMT has concerns about both government policy and the development of charging infrastructure.A Zero Emission Vehicle (ZEV) mandate is due to come into force in 2024. It will compel manufacturers to ensure that a proportion of the cars they sell are fully electric.The sale of new petrol and diesel cars is due to be banned in 2030, although some hybrids will still be allowed on the market until 2035.But the rules about how these targets are to be achieved have yet to be set out in detail - and manufacturers are worried that this could affect important investment decisions.The SMMT is also warning that the number of public charging points is not increasing quickly enough to reach the government's target of having 300,000 by 2030.\"To get to that 300,000, you need about 100 new charging points to be installed every day until 2030,\" said Mr Hawes.\"Current rates, up until the end of quarter three, were about 23 a day. So the danger is the user experience gets worse before it gets better.\"Electric cars will no longer be exempt from vehicle excise duty <https:\/\/www.bbc.co.uk\/news\/business-63660321> from April 2025 as part of a government plan to make the motoring tax system \"fairer\".Erin Baker, editorial director at Auto Trader, said the rise in electric vehicle sales had been a \"clear bright spot\" in a weak market - but she is not confident this will continue.Affordability will be the biggest problem, she said, as the cost of living and high electricity prices take their toll on the market.\"EVs need to be easier to afford, charge and buy to continue the positive sales trajectory and ultimately to meet the government's target,\" she said."}