{"author":"","title":"Border Force staff at airports to strike over Christmas","news_category":"general","content":"Border Force staff are going on strike for eight days over Christmas at Heathrow, Gatwick and several other airports, the PCS union has announced.About 75% of passport control staff are PCS members - and Heathrow has warned checks may take longer on strike days.Thousands of other civil servants - including driving test examiners - will also be taking industrial action.PCS boss Mark Serwotka said the strikes would \"escalate\" unless the government \"put money on the table now\".Strikes at the Department for Work and Pensions and the Highways Agency have already been announced.Mr Serwotka said that PCS members had \"no option\" but to strike, because they were \"currently skipping meals, not being able to put the heating on at home because of the poverty they are living in\".The PCS general secretary has had talks with government ministers, but he said they were refusing to increase a 2% pay rise.\"They keep saying their door is open, but it is a very strange door because there's nothing behind it,\" he told a news conference.About 1,000 Border Force staff are expected to walk out on eight days between 23 December and New Year's Eve at Birmingham, Cardiff, Glasgow, Gatwick, Heathrow (terminals 2, 3, 4 and 5) and Manchester airports, as well as at the port of Newhaven.Christmas is a very busy time at airports and the strikes are likely to lead to longer queues at passport control.In all, 86% of PCS balloted members voted in favour of strike action across 124 government departments and public sector employers.Mr Serwotka warned the government against bringing in the military to cover for the strikes, saying there was not enough time to train them properly.And he said the PCS would escalate industrial action in the New Year unless the deadlock was broken.The strikes were \"part of a targeted and sustained programme of industrial action that is designed to escalate each week unless the government is prepared to put money on the table now to deal with the poverty of its own workforce\", he added.Traffic officers at the National Highways Agency will take part in five weeks of rolling strikes across the country, with five of the strike days co-ordinated to coincide withthe RMT's planned railway strikes <https:\/\/www.bbc.co.uk\/news\/business-63885058>. Staff at the Rural Payments Agency, which deals with farmers, are also joining the industrial action.A Home Office spokesperson said \"passengers should be prepared for potential disruption\".\"We will deploy suitable resource to meet critical demand and support the flow of passengers and goods through our border.\"A Heathrow spokesperson said: \"Our priority is to ensure passengers get through the border safely and as quickly as possible.\"We are working closely with airlines and Border Force on mitigation plans for potential strike action by Border Force officers and these plans will now be implemented for the notified days.\"The Home Office advises that immigration and customs checks may take longer during peak times on strike days, and Heathrow will support Border Force to minimise these impacts with the aim of processing passengers through the border as efficiently as possible.\"Passengers are advised to check their flight status with their airline before travelling. We encourage all parties to resolve this dispute quickly.\"The airport pointed out that the workers involved in the strikes were employed by the Home Office, not Heathrow.A spokesperson for Gatwick said the airport was \"disappointed\" that Border Force staff had decided to take strike action and hoped that a settlement could be found \"as quickly as possible\".\"We expect that flights will operate as normal and remain in regular contact with Border Force about their mitigation plans. Additional airport staff will also be made available to help with passenger welfare on strike days,\" the spokesperson added.Consumer group Which? said the Border Force strikes will be \"a huge worry to travellers, with thousands now anxious as to whether their Christmas plans could be left in ruins if flights are cancelled as a result\".\"Airlines affected should work quickly to inform passengers of any potential changes to their booking because of strike action, and must not fail in their legal responsibility to offer travellers a refund or the option to be rebooked, including with other airlines if necessary,\" said Guy Hobbs, editor of Which? Travel.There is a growing wave of industrial action in December as ambulance and healthcare workers prepare to join rail workers in striking over pay and conditions as the cost of living soars.Prime Minister Rishi Sunak said on Wednesday that he would bring in \"new tough laws\" to curb the impact of strikes as he criticised \"unreasonable\" union chiefs."}