{"author":"By India Pollock","title":"Children in care looked after by grandparents 'on the cheap'","news_category":"general","content":"Would you foster the child of a family member in crisis if the only other option was the child going into care?James and his wife said there was \"no question\" of their granddaughter moving in with them after the five-year-old's mum attempted to take her own life.James is one of up to 300,000 people in the UK who cares for a young relative. But people in Wales who look after a family member feel they are providing \"care on the cheap\" as the majority are paid less than unrelated foster carers.People who care for grandchildren, siblings, nieces or nephews - also known as kinship carers - feel they are \"discriminated\" against in Wales compared with carers who have no family link with the child.In England carers and kinship carers get the same financial help - but in Wales, carers who are family can receive about £100 less a week per child and there are calls to pay all carers \"exactly the same\".The Welsh government has said that \"all foster carers should be treated fairly\" and it, along with the body representing Wales' councils, added allowances for carers were \"under review\".James' wife had to work part time to look after their little granddaughter. While they could manage financially, he realises that many kinship carers can't and often live in poverty.\"Being a grandparent was going to be a joy for us because you get all of the best times and then you can hand them back,\" said James, whose name has been changed to protect the child's identity.\"We felt like that we lost out because we had to instil the structure in her life for her security and safety.James' granddaughter had been on the child protection register three times and had been exposed to \"some disturbing and difficult adult behaviours\".James said he and his wife were told by social services that if his granddaughter could not live with them, she would be taken into care. His granddaughter was living with them in south Wales within two days.\"For the first three months, it was like a weight off my shoulders... she was so happy,\" said James.\"Then you start to see challenging behaviour. There was disturbed nights, nightmares, insecurities and 'do you love me' ... as a person it's difficult to see a child suffer. As a grandparent, it's awful.\"James said she had no routine so they were responsible for getting her into school, teaching her to brush her teeth and have a bath because those normal things were \"alien\" to her.Life had changed dramatically for James as parenting is challenging and tiring at the best of times, never mind doing it all over again in his 50s with a child who had a tough start in life.\"At our stage of our life, our own children are grown up so you start to think about the rest of your life,\" he said.\"It was difficult physically as she's a very active child and always running around. You have to get used to less sleep and all of the other things that go with being a parent. It's hard to parent when you're the grandparent.\"That's doubly difficult with a child who's suffered traumatic experiences and has the residual behavioural problems and sleep problems that are associated with a difficult early life.\"It's a wonderful thing to have a child in the house but it can also be extraordinarily disruptive for the rest of the family.\"There's no recognition of how being a kinship carer can impact the broader family and put a strain on relationships with your own children. They can feel excluded and isolated.\"The number of relatives looking after children that would otherwise be in mainstream care has risen by 88% over the last 10 years.Now it is claimed councils in Wales receive care for the most vulnerable children \"on the cheap\" as most do not pay kinship carers, such as James, as much as unrelated foster carers.A top lawyer is working on a number of claims against Welsh councils for family carers to be paid the same as unrelated foster carers.One local authority has settled out of court and Nigel Priestley of Ridley and Hall Solicitors is ready to bring judicial review proceedings against two other councils.He said all foster carers receive a basic allowance to pay for things such as food and clothing, but kinship carers were not entitled to the extra money that unrelated carers receive.It means that kinship carers could receive about £100 less a week per child compared with unrelated foster carers.\"You cannot discriminate against families who are doing exactly the same job simply because they are related to the children they're caring for,\" Mr Priestley said.\"If anything were to go wrong, the authorities would be down on them like a ton of bricks. They shouldn't be in a position where they are financially worse off while often providing the best care possible.\"Mr Priestley said Welsh councils had \"ignored\" a judgment from the Court of Appeal in 2013 which ruled that family and friend carers must receive the same payments as unrelated foster carers.He described the situation as \"troubling\" and said most Welsh councils were treating kinship carers \"very badly\" and failing to recognise them as an \"unsung group of heroes\".James agrees and he is continuing a legal challenge against his local authority.\"It's completely unfair and unequal,\" he said.Welsh Liberal Democrat leader Jane Dodds saw this in the 20 years she worked as a social worker in child protection and also feels kinship carers can be treated unfairly in Wales.This video can not be playedKinship carers discuss the challenges of raising their grandchildren\"I want the Welsh government to introduce a bill to ensure that kinship carers are treated exactly the same as foster carers and it needs to happen quickly,\" the Welsh Parliament member said.James said he could afford to look after his grandchild but there were many kinship carers who were worse off and any extra money could make a huge difference to carers living in poverty.\"It's not about the money for us, it's the principle,\" he said.\"Kinship carers do an extraordinary job under extraordinarily difficult circumstances but can be valued less than unrelated carers. It completely undermines them.\"The Welsh government said it \"valued\" the role kinship carers played and it would \"review and look at the fees, allowances and support available to foster and kinship carers\".\"We believe all foster carers should be treated fairly and receive the support they need to care for the children and young people they look after,\" added a government spokesman.The body that represents Wales' 22 local authorities said it recognised the \"vital role\" that foster carers, including kinship foster carers, played in \"looking after children who can't live with their birth families helping to make a real difference to a child's life.\"\"Allowances and additional payments for foster carers are currently under review by Welsh local authorities to ensure that all foster carers continue to receive the appropriate level of financial support,\" added the Welsh Local Government Association."}