{"author":"","title":"Bloody Sunday: Victim's sister criticises Orde comments","news_category":"general","content":"The sister of a teenager shot dead on Bloody Sunday has criticised former PSNI chief constable Sir Hugh Orde after he questioned the continued need to investigate the killings.Kate Nash's 19-year-old brother William was one of 13 people killed when members of the Army's Parachute Regiment opened fire on civil rights demonstrators in Londonderry in 1972.A fourteenth person died later.She said she \"feels hurt\" by Sir Hugh's comments. <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-45491271>\"All state killings need to be investigated; the citizens of this country need to be able to trust the rule of law, to trust the government and to know they have equality of justice,\" she told BBC Radio Foyle.Eighteen ex-paratroopers have been reported to the Public Prosecution Service over the killings and the Bloody Sunday victims are currently waiting to hear if any will face charges.Sir Hugh, who was PSNI chief constable from 2002 to 2009, was speaking in the context of whether or not prosecutions for Troubles' murders are still possible as time moves on.He said he feels there is no chance of a conviction in most cases and believes people have to start having honest conversations about legacy issues.Speaking about Bloody Sunday, he said: \"There have been investigations into individual soldiers, none of which have succeeded and we're now investigating it all over again.\"I do question what that delivers and whether we have a continuing obligation as the State to yet again investigate members of a parachute regiment after so much time.\"Ms Nash said she would continue to fight for justice for her brother, and father, who was also shot and injured on Bloody Sunday.\"The families of Bloody Sunday and Ballymurphy and many other innocents have waited a very long time to bring those responsible for these atrocities to accountability,\" she said.\"They need to give us the opportunity to face these soldiers in court.\"She said her brother was just an \"ordinary lovely boy, who loved music and strumming the guitar.\"\"He did not deserve to have his life ended like that, no one does,\" she said.There have been a number of investigations into the deaths, including the Widgery Tribunal - which was later described by some as a whitewash - and theSaville Inquiry, which in 2010 led to then Prime Minister David Cameron apologising to the Bloody Sunday families <https:\/\/www.bbc.com\/news\/10320609>.You can watch the BBC Spotlight programme <https:\/\/www.bbc.co.uk\/iplayer\/episode\/b0bjftvf\/spotlight-11092018> on the iplayer."}