{"author":"","title":"More than 37,000 sewage spills hit the South West in 2022","news_category":"general","content":"There were more than 37,000 monitored sewage spills in the South West Water (SWW) area last year.The Environment Agency figures showed that the number of incidents in 2022 was lower than the approximately 42,500 reported in 2021.However, the agency said this was largely the result of dry weather and a subsequent drought.Campaigners said the figures were \"disgusting\" and showed SWW was failing to sufficiently cut down spill rates.Meanwhile, North Devon MP Selaine Saxby has called for year-round testing of bathing water quality.The Conservative MP said a reduction in storm overflows in her constituency had led to \"good\" or \"excellent\" water quality.But in the Commons, Ms Saxby said testing only took place between 15 May and 30 September and called for an extension.Environment Minister Rebecca Pow said water companies would, by the end of the year, be required to provide \"year-round\" water quality information in the event of a discharge.She added: \"And all water companies will also have to install new flow monitors on more than 2,000 waste water treatment works.\"Louise Ready, from Surfers Against Sewage, said more money should be directed towards improving infrastructure.\"The figures are disgusting,\" she said. \"We're seeing that water companies, and SWW in particular, are continuing to spill at a similar rate as they've been doing for years.\"John Halsall, SWW's chief operating officer, said they were reducing the use of storm overflows and had already installed \"100% monitoring\" of them, ahead of the government target.\"We want everyone to feel confident about the water quality at their favourite beaches and to know that we are serious about reducing the use of storm overflows,\" he said.\"We need to stop the overuse of storm overflows.\"In the Commons, Ms Saxby asked: \"Will [the minister] consider extending the testing season for the increasing number of all-year-round bathers and surfers, or at least look for waters to be tested after a storm overflow has discharged?\"Ms Pow responded: \"We are using powers in the Environment Act, and under those we require companies to make discharge data available in near real time to the public, if there has been a discharge which would affect water quality, and to monitor water quality upstream and downstream of their assets.\"Under the current system, each classification given to bathing waters has a symbol that councils must display. The classifications are: excellent, good, sufficient, and poor.Figures published in November showed just over 97% of England's designated bathing sites met minimum standards in 2022, down slightly on the previous year.South West Water provides water and sewerage services to Cornwall and Devon, plus small parts of Dorset and Somerset.Follow BBC News South West on Twitter <https:\/\/twitter.com\/BBCSpotlight>, Facebook <https:\/\/www.facebook.com\/bbcspotlight> and Instagram <https:\/\/instagram.com\/bbcspotlight>. Send your story ideas to spotlight@bbc.co.uk."}