{"author":"By Vikki Blake","title":"What happened to Anthem? The blockbuster game that failed to find a community","news_category":"general","content":"On paper, Anthem is a game with everything.It's developed by one of the gaming industry's most revered studios, BioWare, and published by one of its biggest companies, Electronic Arts.A co-operative sci-fi shooter, early footage showed off fluid gameplay and a world that is bold and bright, stuffed with exciting environments and plenty of enemy encounters.However - less than two years after its troubled debut <https:\/\/www.bbc.co.uk\/news\/technology-47454530> - BioWare have confirmed that work on the game has now ceased.In a blog post, studio director Christian Dailey wrote that he had \"made the difficult decision to stop our new development work on Anthem.\"\"We will, however, continue to keep the Anthem live service running,\" he added.Listen and subscribe to the gaming podcast Press X To Continue on BBC Sounds <https:\/\/www.bbc.co.uk\/programmes\/p08x7kb5>So how did a studio as beloved as BioWare, the same team behind fan-favourite franchises like Mass Effect and Dragon Age, go so wrong?\"It's sad,\" says Inel Tomlinson, Twitch streamer and reviewer on BBC Sound's Press X to Continue podcast.\"You can tell developers put a lot of hard work into it - whether or not the direction was correct or not, you can tell there was a lot of hard work.\"Because the world is lush - and the graphics beautiful - it just wasn't cohesive enough for people to really enjoy it.\"\"I was surprised by how tactile it felt, but the world was so empty,\" adds reviewer Shay Thompson.\"With all the promises they made about the stuff you could do... none of it was in there. It's a real shame. We know that BioWare is capable of so much more.\"Titles such as Destiny, Fortnite and World of Warcraft have grown huge communities of players that spend hours developing their characters and working to collect rare in-game items - it seems Anthem just hasn't delivered.\"Considering it was meant to be a multiplayer, online role-playing game, it felt so lonely and isolated,\" adds streamer and reviewer Rage Darling.\"I remember walking up to this exosuit thing, and there were so many mechanics, so many features you could add but there was no-one around.\"\"No-one to interact with or talk to, it was empty.\"It just felt like they had the core features of a game - the foundation - but they missed the socialisation.\"So can new games and their unfamiliar in-game worlds still attract - and perhaps more importantly, retain - an audience?\"What makes people want to play new games is the world they create, and making new ones for people to care about is really hard,\" acknowledges Press X to Continue presenter Steffan Powell.Rising to that challenge is about trying original ideas according to Inel Tomlinson who says: \"The issue with Anthem is that it felt like any other third-person shooter, except that you could fly.\"Anthem is trying to be Call of Duty, it's trying to be all these other games in one, in a third-person world and some of it we've already seen before.\"Rage Darling says the game felt too much like a tick-box exercise full of tried and tested features seen in other games: \"It's almost like they said, 'let's throw that at it!' It's a pick-and-mix.\"It's not impossible for the developers of Anthem to turn things around and make the game a success.Games like Final Fantasy XIV and No Man's Sky - both of which also failed to deliver their promises at launch and suffered heavy criticism from the games media and fans alike - have gone on to build passionate communities and win awards.\"I have hope they might be able to turn it around,\" says Shay Thompson. \"I think if they lean in to what makes BioWare games special, in that they tell these really cool stories, I think that will really help them.\"They do have the potential to pull it out of the bag.\"Destiny 2, Final Fantasy - these are games-as-a-service that did not have amazing launches, but they were able to turn it around because they leaned on what made the first games in their franchises really special.\"Follow Newsbeat on Instagram <https:\/\/www.instagram.com\/bbcnewsbeat\/>, Facebook <https:\/\/www.facebook.com\/bbcnewsbeat\/>, Twitter <https:\/\/twitter.com\/BBCNewsbeat> and YouTube <https:\/\/www.youtube.com\/channel\/UCe1Ef-K5jpnRsmVY5hCBhOw>.Listen to Newsbeat live <https:\/\/www.bbc.co.uk\/sounds\/play\/live:bbc_radio_one> at 12:45 and 17:45 weekdays - or listen backhere <http:\/\/www.bbc.co.uk\/programmes\/b006wkry\/episodes\/player>. "}