{"author":"By Chelsea Rocks","title":"We both have ADHD but we are very different","news_category":"general","content":"Laura and Dawn met when they moved into the same street in Aberdeen during the Covid pandemic.The new neighbours got chatting and discovered they were both pursuing an assessment for ADHD but despite being the same age and having similar backgrounds, their experiences were very different.ADHD is a neuro-developmental condition which often causes hyperactivity, impulsiveness and inattention but Laura and Dawn said no two people are the same.While Laura struggled as an anxious teen, Dawn's symptoms mirrored those usually associated with young boys - chatty, disruptive and always getting into trouble.Their experiences have led to a weekly podcast - ADHD As Females (ADHD AF) - which was launched in May and has attracted almost 80,000 downloads to-date.Laura Mears-Reynolds, originally from London, said she was nervous and shy as a child and experienced anxiety, depression and bulimia nervosa as a teen.All of which are now perceived as comorbidities of unmanaged ADHD. \"I was a daydreamer,\" the 39-year-old told BBC Scotland. \"At 14, I was prescribed antidepressants and struggled to come to terms with why I wasn't like everyone else. ADHD wasn't considered,\" she said.\"I was managing my own symptoms and began hating who I was. The symptoms can present as laziness or lack of interest, as opposed to struggling with attention and not managing time and deadlines effectively.\"In contrast, Dawn-Marie Farmer, who grew up in Aberdeenshire, said her symptoms were more aligned with the 'naughty boy' stereotypes of ADHD.\"I was super chatty, disruptive, always getting into trouble and being told off especially into my early teens where my hyperactivity probably heightened,\" she said.\"I was always on the go, impulsive and getting into trouble.\"\"Looking back now it was clear that it was ADHD and it's funny to wonder how it was missed. I look through my report cards from school and think the proof was staring me in the face.\"Both women admit they did not even consider themselves to have ADHD for many years and they thought the condition was something which affected 'naughty schoolboys'.However, Laura began to read more into the symptoms when her depression worsened and affected her ability to work with colleagues and maintain relationships.She said: \"It ruined my life. I felt I couldn't keep up at work and was letting everyone down.\"I didn't know about workplace support or reasonable adjustments, I didn't have a diagnosis and so was struggling without medication or coping strategies.\"When I finally realised ADHD presents in more ways than struggling to keep focused in school, I felt relieved that it might be something I could get help for.\"Laura received her diagnosis in January, having chosen to be diagnosed privately after waiting for an NHS assessment for more than two years.Dawn is set to start her NHS assessment next month.She has already been diagnosed by an educational psychologist when she began studying at Robert Gordon University and asked for reasonable adjustments to be made in order for her to study effectively.NHS Grampian does not recognise the diagnosis from the university, which means Dawn is yet to receive treatment.Dawn said: \"Now, I'm mostly affected by task paralysis and time blindness, meaning I can't manage time well and can't get things started a lot of the time.\"I constantly think about the things I need to do and go through them in my head but I'm unable to just get going. It's like your brain is frozen.\"Dawn said task paralysis affected her self-belief.\"Having since learned about my ADHD, I now understand why I never see through my aspirations and beliefs, because I struggled with reaching for them without fearing I would fail,\" she said.\"I'm at university just now and that's been very challenging, thankfully I am getting the help and support I need.\"I'm still waiting on a medical diagnosis so I can be given the right treatment to manage all aspects of my ADHD.\"Their chance meeting during the pandemic has allowed them to support one another but also learn more about how individual each ADHD experience is. They also want to shine a light on how ADHD manifests as an adult.Laura said: \"Adults with ADHD can constantly come across as tripping themselves up and their actions don't match their intentions.\"People can be quick to judge, oftentimes seeing the person as disorganised, lazy or insincere. I hope our podcast changes that as neurodivergence is recognised more frequently and there is more understanding to support people who are struggling with ADHD.\"The woman said there were many other podcasts discussing neurodivergence and admitted they were not professionals.\"We just have experience of growing up neurodivergent and struggling to make sense of why you don't react the same way as 'normal people',\" Laura said.The pair have received hundreds of messages in the five months since they launched the podcast, many sharing their appreciation for the women recounting their experiences and thanking them for raising awareness of the prevalence of ADHD in adults.Laura said: \"Podcasting allows us to share our experience as we learn about ourselves and people have resonated with that.\"Adult ADHD diagnosis has risen because only now are people learning that it's not a one size fits all diagnosis.\""}