{"author":"","title":"Birmingham Commonwealth Games 'to hit taxpayers for decades'","news_category":"general","content":"Taxpayers will be contributing \"for decades\" to help stage the Birmingham 2022 Commonwealth Games, it is claimed.The total cost of the 11-day sporting event is £778m, with £184m paid by Birmingham City Council and partners.The authority's Tory opposition leader said he was concerned about how a £50m loan to help fund the UK's costliest sporting event since London 2012 would affect residents in years to come.But the Labour-run council insists day-to-day services will not be affected. Robert Alden said the burden of repaying the debt would come out of future revenue funds, money otherwise used for front-line services.\"The council will be paying back £2m a year over 40 years, which will have a huge impact on council tax payers, not just now, but for decades,\" he said.\"They made promises about various funding they will get from partners they have not been able to pin down yet.\"The authority said it did not yet know how much of its share of the cost would be paid by partners including West Midlands Combined Authority, local enterprise partnerships, other local authorities under the banner ofthe Midlands Engine <https:\/\/www.midlandsengine.org\/>, the NEC and others.But its budget report agreed earlier this year <https:\/\/birmingham.cmis.uk.com\/Birmingham\/Document.ashx?czJKcaeAi5tUFL1DTL2UE4zNRBcoShgo=tOc4ZzG1HRXSGXczv0V6bpA%2b6Xjzv3xrvLHK6Q5feISkZ5%2fZlgfgUg%3d%3d&rUzwRPf%2bZ3zd4E7Ikn8Lyw%3d%3d=pwRE6AGJFLDNlh225F5QMaQWCtPHwdhUfCZ%2fLUQzgA2uL5jNRG4jdQ%3d%3d&mCTIbCubSFfXsDGW9IXnlg%3d%3d=jUgQCaU3L68%3d&kCx1AnS9%2fpWZQ40DXFvdEw%3d%3d=h8PtIcaajZA%3d&uJovDxwdjMPoYv%2bAJvYtyA%3d%3d=ctNJFf55vVA%3d&FgPlIEJYlotS%2bYGoBi5olA%3d%3d=NHdURQburHA%3d&d9Qjj0ag1Pd993jsyOJqFvmyB7X0CSQK=ctNJFf55vVA%3d&WGewmoAfeNR9xqBux0r1Q8Za60lavYmz=ctNJFf55vVA%3d&WGewmoAfeNQ16B2MHuCpMRKZMwaG1PaO=ctNJFf55vVA%3d> anticipated partner contributions of £75m. The final breakdown should, it said, be decided by the end of 2019.The council's Labour leader Ian Ward said the event would be a \"catalyst\" for new infrastructure in Birmingham and existing day-to-day services would not be impacted.\"Almost 1,500 new homes, better public transport, improved roads, cycling and walking facilities and other infrastructure - not least a revamped Alexander Stadium and community facilities - will come as a result.\"The event also gives us a golden opportunity to reposition the city and wider West Midlands on a global stage and bring citizens together.\"Birmingham resident Michael Linehan said he is worried about the impact on taxpayers.\"When we heard about the games I was very pleased but as time has gone on I have had this niggling feeling in the back of my mind about what it is going to mean.\"I'm worried that our council tax is going to go through the roof as the council looks to make up for the shortfall.\"I know the games are going to have a really positive impact on business and tourism in the city, but I don't think the average person will be able to afford to go to be honest.\"The 62-year-old raised concerns about how money is spent on services where he lives in Hodgehill.\"Where I live I have seen major cuts to the police presence in the area, we've been inundated with beggars, a couple of weeks ago there was an armed robbery at the local shop.\"Then we've had the bin strikes and everyone has had their rubbish piling up.\"When I take my granddaughter to the park, there's two foot of grass and the council says it doesn't have the money to pay for the equipment to [cut] it and now all we read about is how it's going to spend all this money on the games.\"I love sport, I'm a Birmingham City season ticket holder, but this is a massive amount of money and I am concerned about it.\"Another resident, Peter Leadbetter, is worried about what happens after the games.\"When the flags are down and passed on, what is going to be the games' legacy?\" said the 66-year-old semi-retired management consultant, who lives in Moseley.\"It seems bizarre when we are struggling as a city to finance things like public libraries, community services and youth services to have this level of investment in the games.\"I'm not convinced nor confident that the council has the planning and management capabilities to deal with the future after the games when [it all] calms down.\"Birmingham City Council's financial position was described as \"immensely serious\" by a government-commissioned independent panel earlier this year.Mr Alden said there was \"no doubt\" the games would have huge benefits for Birmingham, but the council needed to \"make the most\" of the opportunity by ensuring basic services were in order, amid claims there arestill problems with waste collections <https:\/\/www.bbc.co.uk\/news\/uk-england-birmingham-48533150> months after strikes by bin workers ended.\"If visitors look around and see mess on streets, it is not going to attract further investment. They need to get basic services right, to maximise the opportunity for Birmingham residents.\"Follow BBC West Midlands on Facebook <https:\/\/www.facebook.com\/MidlandsBBC\/>, onTwitter <https:\/\/twitter.com\/bbcmtd>, and sign up for local news updates direct to your phone <https:\/\/m.me\/MidlandsBBC?ref=website>."}