{"author":"By Erika Benke","title":"Finland election: Sanna Marin fights for survival","news_category":"general","content":"She came to power in December 2019, but Prime Minister Sanna Marin is now facing a tough election battle as head of Finland's centre-left Social Democrats.Two other parties have mounted a strong challenge and opinion polls suggest the 2 April vote is too close to call.Petteri Orpo's centre-right National Coalition Party currently has the edge at just over 20% in the polls. But not far behind, the right-wing, populist Finns Party of Riikka Purra are running neck and neck with Ms Marin's centre-left.This election takes place amid unprecedented international focus over Finland's application to join the Nato military alliance. It shares the EU's longest land border with Russia of 1,300km (810 miles).Ms Marin's Social Democrats may have started the process, but just because there is overwhelming public support for joining Nato, it does not mean she will complete the move.Abandoning military neutrality was a monumental shift after Russia's full-scale invasion of Ukraine, but now 80% of Finns are behind the Nato bid.\"Until February 2022, the vast majority of Finns always said no to Nato. Most people saw it as an unnecessary provocation of Moscow,\" said Sakari Nurmela, managing director of polling company Kantar Public.The war has nevertheless been central to the election campaign and when Ms Marin said she was open to sending Ukraine decommissioned fighter jets, Mr Orpo said her promise was careless and \"cannot be fulfilled\".She became the world's youngest prime minister aged 34, when her Social Democrat predecessor resigned. Her leadership has been defined first by the Covid pandemic and now by Russia's invasion.A modern, feminist, straight-talking leader, Ms Marin has become Finland's best-known figure on the international stage.At home she was widely criticised last year when a video was leaked on social media <https:\/\/www.bbc.co.uk\/news\/world-europe-63517303> showing her dancing with friends, influencers and a Finnish pop star.But that has not dented her approval rating, which remains high despite the popularity of the centre right and the populists.\"It's unusual for support for the prime minister not to decrease by the end of the parliamentary cycle. It's a novelty in Finnish politics,\" says University of Helsinki political history researcher Jenni Karimaki.According to a survey for Helsingin Sanomat newspaper last December, 64% of respondents felt Ms Marin had done a \"very good\" or a \"fairly good\" job as prime minister. Among female respondents, the figure was slightly higher, at 69%.Ms Karimaki attributes Ms Marin's popularity to the exceptional times Finland has been through: \"Some of her statements are not politician-like. That's one thing that attracts a lot of attention.\"Pollster Sakari Nurmela says: \"Her work is recognised even by people who don't like her political views, for example NCP or Finns Party supporters.\"Petteri Orpo, 53, has sought to portray his party as more responsible than the centre left, accusing Ms Marin of taking on too much debt.Although their two parties could form a coalition, they were unable to reach agreement four years ago.Riikka Purra's Finns Party, previously known as the True Finns, could be a surprise winner, argues political commentator Jan Erola.\"If the next prime minister is not Sanna Marin, it's very likely that we'll have a female replacement. It would be a really interesting change: going from a young, left-wing woman to a young, right-wing woman as Finland's prime minister.\"The question is whether any of the big parties would want to go into government with Ms Purra, 45, whose party has been derided as \"openly racist\" by Ms Marin. Her Social Democrats and two other parties have made clear they will not work with the Finns, but Mr Orpo has said he would not rule out talking to any party.Search for Finnish politics on TikTok and many of the top videos will feature messages from the Finns Party, most of which include Ms Purra.One recent poll suggests it is the most popular party among young voters.\"The Finns Party claim they're a new, alternative voice, which appeals to the youth. For many young people they're a hip party, with cool videos on TikTok,\" says Emilia Palonen, senior lecturer at the University of Helsinki.Colleagues view Ms Purra as a great communicator who avoids sounding like a politician. Her style helps generate engagement on social media, says Matti Nelimarkka of Helsinki and Aalto Universities.\"She speaks simply and clearly, using the same words that ordinary people would when they are discussing what's wrong with Finnish schools or the health system.\"I think it's likely that this is going to be the first election in a Nordic country where TikTok plays a significant role.\"The Finns Party oppose immigration from outside the EU, despite worker shortages across several sectors of the Finnish economy.In a recent party leaders' debate, their leader suggested Finland's 2035 carbon neutrality target should be postponed until 2050.\"The Finns Party is pro-meat, pro-cars and anti-wokeism,\" says political commentator Jan Erola. \"Purra uses all the buzz words that attract big discussions on social media.\"Lecturer Emilia Palonen adds: \"They argue that aggressive climate actions are an elitist approach that hurt ordinary people, especially as the economy has taken a downturn. They're tapping into people's concerns about inflation and high electricity prices.\"Finland is well known for its high social spending - 29% of GDP went on public welfare in 2022 - but balancing the books has become a big issue in the run-up to the vote.Public debt rose during the pandemic, and then Finland borrowed more money last year to strengthen its defences after Russia invaded Ukraine. That pushed the state debt up to €144bn (£126bn; $152bn).Mr Orpo took the issue to a confidence vote in February, warning the welfare system was under threat. His party proposes tax cuts and austerity measures.Ms Marin has rejected cuts to benefits, education and healthcare, calling them \"a bitter medicine that doesn't work\". Her SDP would rely on economic growth and \"cutting tax loopholes\" to address issues with the public finances.When Ms Marin became prime minister she was one of five women party leaders making up Finland's coalition government. Her partners included the Centre party, the Greens and the Left.And because of Finland's multi-party system, it is quite possible no party will win more than a fifth of the vote, says Ms Karimaki.So whoever wins will need to persuade other parties to take part, she adds. \"It may take some time but they'll get there in the end.\"But, she says, that might make Ms Purra's task the hardest - if the Finns Party comes out on top."}