{"author":"By Kate Morgan","title":"HIV diagnosis: Marlon Van Der Mark tackles stigma","news_category":"general","content":"This video can not be played\"It was like a whole door unlocked and all these people came flooding in.\"\"You're disgusting, you deserve to have Aids, you're vile.\" These are just some of the comments Marlon Van Der Mark receives after posting online about living with HIV.The 24-year-old said it was \"heart-breaking\" to see the stigma \"so alive\" and wants to see better understanding of living with the virus.The Welsh government said tackling HIV stigma and discrimination will be a major part of its HIV action plan published next year.Diagnosed at 19, Mr Van Der Mark, of Cardiff, described the following few years as a \"blur\" living in fear of telling people.\"It took me nearly four years to even say 'I'm HIV positive' to myself,\" he said.Earlier this year, he said he had had enough and posted a video on TikTok talking openly about living with HIV.\"Within a few minutes it was blowing up... people were saying how proud they were of me... I could breathe for the first time,\" he said.But as the activist posted about not being ashamed, he found the stigma surrounding HIV still existed.\"It's really bad, I never thought it would be after the first video but as videos went on... it was like a whole door unlocked and all these people came flooding in.\"He said comments included people telling him he should be \"put down\" and that he \"didn't deserve to be in this world\".Mr Van Der Mark believes much of the abuse is based on outdated information from the Aids crisis and shows the need for better education about what it means to live with HIV in 2021.\"Once every six months I go for a routine check-up... I take one tablet a day and I live a normal life,\" he said.Mr Van Der Mark also said there was \"such a fear behind getting tested\" for the virus.\"It's just stigmatised, and it shouldn't be,\" he added.HIV stands for Human Immunodeficiency Virus - the immunodeficiency is the weakening of the immune system by the virus.If untreated it can lead to late-stage HIV or Aids, the name for a collection of illnesses caused by the virus.But there are very effective drug treatments that enable most people with the virus to live long and healthy lives.Modern medication reduces the viral load to undetectable levels, meaning someone can't pass on HIV and their health is protected.Sources: Terrence Higgins Trust and NHS Ella Meggitt, from Cardiff, said she had to look at her own stigma when her best friend received a HIV diagnosis that later turned out to be false.\"I was thinking what were people going to think and internalising that myself... because I knew that people didn't know as much as we did,\" she said.The 22-year-old dance teacher said the experience had made her want to support people living with HIV as well as educating herself and others about it.She said she now regularly gets tested for HIV and posts on social media to show the role everyone can play in getting tested and eradicating new transmissions.\"Middle-aged straight people with families don't think it's their issue because they think it's a young gay man's issue and that's what it's been like since the 80s, but that's not the case and in order to erase the stigma and get people tested, we need everyone to talk about it,\" she said.Breaking down HIV stigma is one of the aims of Wales HIV testing week running from 22 to 28 November.It is organised by Fast Track Cardiff and Vale, a volunteer group that was set up partly to tackle Wales' higher-than-average rate of late diagnosis compared to the rest of the UK.Lisa Power, a development worker in the group, said later diagnosis meant \"people are not getting tested and diagnosed until they are actually ill\".\"Also, people who don't know they have HIV are probably passing it on,\" she added.The group is part of a global network of more than 300 cities committed to meeting the UNAIDS targets of 90% of all people living with HIV diagnosed, on treatment and having undetectable and untransmissible viral load.The organisation also wants the Welsh government to set clear goals as part of its HIV Action plan published next year.\"There are more people living in Wales with HIV than ever... we haven't had a public information campaign for 14 years which is why no-one knows these new things about HIV that make it possible to live with it as chronic lifelong condition,\" Ms Power said.A Welsh government spokesperson said it recognised stigma could be \"a major barrier to effective responses to preventing HIV Infection\".\"Tackling HIV stigma and discrimination will be a major element of our HIV Action Plan.\""}