{"author":"By Steffan Powell","title":"Call of Duty London event will be like an 'exciting, rowdy football match'","news_category":"general","content":"\"British Call of Duty crowds are really loud and very rowdy,\" says CoD League presenter Lottie Van-Praag.\"They love a chant and will shout until their lungs can't do it any more, it creates a really exciting atmosphere.\"She's the face of this weekend's Call of Duty esports event in London for viewers at home, guiding them through the frantic on-screen action.\"It'll be like going to a football game,\" she says.It's taking place at The Copper Box Arena in London - which was previously part of the Olympics in 2012 and the Invictus Games.Thousands of fans will pack into the venue to watch eight teams from across Europe and America competing in the game's new esports format - which gives fans a home team to root for, something that doesn't happen in many other esports events.Competitive Call of Duty has grown since the first World Championships were held in 2013.This year, however, the format has changed to have 12 teams of five players in different cities hosting events throughout the season.Lottie says having home teams is an attempt to try and make the league more appealing to fans and viewers: \"Esports viewership is fan driven, so this is for them.\"You can walk out of your back door, travel a few miles and watch your home team play - it brings a whole new dynamic to esports.\"Titles like Counter Strike, League of Legends and DOTA 2 are traditionally perceived by the gaming industry to be the most prestigious esports, with more viewers, bigger prize money and a deeper heritage than their competitors.But Call of Duty developers hope this new format and having home teams will make their league easier to follow and offer a point of difference from those titles to appeal to new fans as well as existing ones.\"Before you'd have esports organisations pick up teams to compete, but they weren't from a specific area or grounded to a specific place,\" Lottie explains.\"Fans were only getting behind teams that were really good, and you weren't getting people supporting Call of Duty teams outside the Top 4 and that was an issue.\"You want teams to be driven to success by the fans and that wasn't really happening before.\"Esports organisations have each reportedly paid around £20 million pounds to run a team in this new-look Call of Duty League.Ten are based in North America with The London Royal Ravens and Paris Legion representing Europe.The London team is made up of Rhys 'Rated' Price, Bradley 'Wuskin' Marshall, Dylan 'Dylan' Henderson, Mathew 'Skrapz' Marshall and Jordan 'Jurd' Crowley and will be hoping to use their home advantage to come out on top at this event.League play will continue throughout the year before a single team is crowned the champions later in the summer.Lottie will be following the teams the whole way: \"I see myself as the glue of the broadcast team, as a storyteller and narrator.\"I can be a bit bossy sometimes but I'm there really to help the viewers get a sense of the excitement of each event.\"We want you to fall in love with what we're showing you, and the teams that are competing, so I'm trying to tell their stories whilst giving the analysts time to share their expert views on the action too.\"Follow Newsbeat on Instagram <https:\/\/www.instagram.com\/bbcnewsbeat\/>, Facebook <https:\/\/www.facebook.com\/bbcnewsbeat\/>, Twitter <https:\/\/twitter.com\/BBCNewsbeat> and YouTube <https:\/\/www.youtube.com\/channel\/UCe1Ef-K5jpnRsmVY5hCBhOw>.Listen to Newsbeat live <https:\/\/www.bbc.co.uk\/sounds\/play\/live:bbc_radio_one> at 12:45 and 17:45 weekdays - or listen backhere <http:\/\/www.bbc.co.uk\/programmes\/b006wkry\/episodes\/player>."}