{"author":"By Navin Singh Khadka","title":"Climate change: Worries over CO2 emissions from intensifying wildfires","news_category":"general","content":"Rising numbers of extreme wildfires could result in a significant increase in CO₂ emissions, scientists warn.That could mean attaining the Paris climate agreement's goal of keeping global temperature rise well below 2C could become harder, they say.Present emission-cut pledges by countries are projected to increase the average global temperature rise by more than 3C by the end of the century.That would lead to dangerous climate change impacts, experts say.These include sea level rise, drought, wildfires, among other extreme events.\"We can't neglect the emissions from wildfires,\" says Ramon Vallejo, a scientist specialising on fire ecology with the University of Barcelona.\"Particularly now that we are seeing intense wildfires all around the world.\"Although estimates vary and still carry uncertainties, some experts say wildfires account for up to 20% of total global greenhouse gas emissions.They are estimated to increase by a few percent to roughly 30% by the end of this century depending on how the climate changes.\"It is a double whammy,\" said William Lau, atmospheric scientist with Nasa's Goddard Space Flight Center in Maryland.\"Big forest fires first lead to significant reduction of forests that suck in CO₂ from the atmosphere and the second loss is they cause significant amount of greenhouse gas emissions.\"A study earlier this year, however, had found that the annual amount of CO₂ emitted as a result of wildfires having fallen over the past 80 years.It said the main reason was that large areas of forest and savannah had been converted to land for crops over the past few decades and therefore wildfires had decreased.The research, however, found that the drop was not huge though.The reason behind that, experts say, is the significantly increased intensity and size of wildfires.That is why, they add, there are now concerns over possible notable rise of CO₂ emissions.The total global CO₂ emissions reached 32.5 billion tons last year, according to the International Energy Agency (IEA).There has, however, not been an exact quantification of emissions from recent wildfires and the one in California now.Some estimates suggest that the wildfire in northern California last year emitted as much CO₂ in a week as what all of the cars and trucks in the state do in a year.That is why some fire experts in that US state fear that its level of CO₂ emissions could endanger its progress toward meeting its greenhouse gas reduction targets.While California and Australia are most of the time in news for their wildfires these days, other regions have also seen intensified wildfires recently.Earlier this year, Greece saw its most deadly wildfire season in Europe since 1900 as it claimed 91 lives.Last year, in Portugal and Spain nearly 70 people were killed by the extreme event.Wildfires in Sweden this year were another extreme case.According to the World Meteorological Organization, the fires burned 30,000 hectares of Swedish forest and triggered EU emergency response mechanisms.In Indonesia, wildfires in September and October of 2015 released about 11.3 teragrams of CO₂ per day, the UN's weather agency said.\"For comparison, the daily release of CO₂ from fossil fuel burning in the European Union is 8.9 teragrams.\"A recent study found that the Earth's boreal forests are now burning at a rate unseen in at least 10,000 years.Another study published in Nature Communications has concluded that if global temperatures rose by three degrees, Mediterranean Europe could see a 100% rise in wildfires.It added that a 1.5C rise could lead to a 40% increase in wildfires.\"We cannot extrapolate our findings to other forested regions of the world,\" said Dr Marco Turco, lead author of the report.\"But the projection is that most places across the globe will see similar intensified wildfires in a warming climate.\"Scientists say warming causes more fires which, in turn, cause more warming.Some experts, however, say greenhouse emissions from wildfires are still tiny compared to emissions from other human activities.\"The California wildfires are enormous,\" said Pieter Tans, from the US National Oceanic and Atmospheric Administration (Noaa).\"But I expect that the amount of CO₂ emitted is at most a few percent of what the US burns annually in making electricity, heating and cooling of buildings, traffic, etc.\"Thomas Smith, assistant professor in environmental geography at the London School of Economics (LSE) has a similar view.\"These (California) fires are likely fairly insignificant in terms of their global contribution to greenhouse gases,\" he said.\"At any one time, there are many fires of a similar size burning across the planet; it's just that this one has been close to populated places.\"Some scientists say the really worry is burning of peatlands.Many of them believe the largest ever wildfire emissions in modern times was the Indonesian peat fire in 1997-98.Estimates vary, but the largest emission figure for it is 3.7 billion metric ton CO₂.\"The real wildcard is permafrost thaw due to climate change that can make a large amount of northern peat susceptible to fire, which was previously unavailable for burning,\" says Bill Degroot, a research scientist with the Canadian Forest Service.\"Peatlands are a very large terrestrial [carbon] pool.\"Scientists also say the issue of wildfires is even more challenging compared to cutting down carbon emissions from burning of fossil fuels.\"If you want to, you can indeed cut down carbon emissions from fossil fuel burning activities - that is something under your control,\" says Professor Vallejo.\"But wildfires are not something controllable like that. They will happen and will intensify in a warming world.\""}