{"author":"","title":"East of England Ambulance Service not fit for purpose says MP","news_category":"general","content":"An MP has told parliament an ambulance service is \"not fit for purpose\" amid claims elderly people had waited hours for ambulances after having falls.Speaking in the Commons, the Conservative MP for Southend West, Anna Firth, criticised the East of England Ambulance Service Trust (EEAST).She claimed the service had not acknowledged her concerns.EEAST said high demand had meant getting to some patients had taken longer than it wanted.Ms Firth asked Mark Spencer, leader of the House of Commons, for a debate on the performance of UK ambulance services.She told MPs: \"Twice in the last month elderly, vulnerable and frail residents in Southend West have been left lying in the street having fallen, cold and frightened, not knowing when an ambulance will arrive.\"She claimed paramedics \"arrived hours after they have fallen\" adding: \"This service is not fit for purpose and must be addressed urgently.\"Conservative Mr Spencer said performance issues should be raised by MPs adding he would be \"happy to support\" Ms Firth in bringing her issues to the attention of Health Secretary Sajid Javid.Tom Abell, chief executive of EEAST, said: \"We have seen some early positive improvement to the service we provide to patients, although we clearly have much more to do and I will look to meet with Ms Firth as soon as possible.\"He apologised for delays and said demand had meant \"it has taken us longer to get to patients than we would like\".\"I will continue to keep our MPs up to date with the progress we are making to improve response times,\" he added.The EEAST covers Bedfordshire, Cambridgeshire, Essex, Hertfordshire, Norfolk and Suffolk.Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}