{"author":"By Helen Bushby","title":"Bafta Game Awards: God of War wins six but Vampire Survivors takes top prize","news_category":"general","content":"God of War: Ragnarok has dominated this year's Bafta Game Awards, winning six out of its 14 nominations, but Vampire Survivors won two including best game.Dark fantasy epic Elden Ring won two, while cat simulator Stray went home empty-handed, despite its eight nominations.Ragnarok, which sees players battle with Norse gods, also won for both of its voice performers, Christopher Judge and Laya Deleon Hayes.Rollerdrome won best British Game.Last year gaming sales accounted for £4.7bn in the UK <https:\/\/www.bbc.co.uk\/news\/technology-64187547>, which is higher than that of the film, television or music industries, according to the digital entertainment and retail association (ERA).Judge, who plays Ragnarok protagonist Kratos, said: \"It Is not lost on me that I'm a black man standing on a British stage accepting an award for playing a Spartan God killer, who in his heart always wants to be a father.\"It is the role of a lifetime. I'm gonna live and breathe every moment of this great gift that I was given. And I will do it humbly.\"He asked gaming fans to \"give each other a break\", adding: \"You have more in common than what separates you. No matter what platform you love.\"EE game of the year, which was voted for by the public, was also won by Ragnarok.Its animator Bruno Velazquez said: \"This award is really special to us, because without all of you out there playing our games, we wouldn't be able to do this.\"Rollerdrome won best British Game, and its lead designer Andreas Yannikaris expressed his surprise as he collected his Bafta - he'd thought survival game Vampire Survivors would win.\"I'll level with you. I don't really have anything prepared,\" he said. \"That 10-year-old kid playing Mega Drive games never thought they'd have a seat at the table, and here we are today.\"Vampire Survivors' development team also looked surprised at their win <https:\/\/twitter.com\/BAFTAGames\/status\/1641550211624361986>, and laughed as they said: \"We did not expect this,\" calling it an \"insane, wild ride\".Technical director Sam McGarry thanked \"the community, our fans and the players all around the world, on every format that they play on\".Vampire Survivors winning best game is a real surprise - there was an audible gasp in the press room when it took the award, and the team themselves were clearly surprised as well.Obviously a jury's loved the fact it's a new take on what has become a very popular genre. It's a procedurally generated survival game, where you try and stay alive as long as you can with swarms of enemies coming at you.This fresh take on it, married with its old-school visual style, has clearly gone down well.But Ragnarok won six awards, and it seemed inevitable that it would win best game. The fact that Elden Ring, which won big at the Game Awards before Christmas, came away with two gold masks, but not the main prize, was also a surprise.But Bafta does do this. I can remember when Zelda Breath of the Wild didn't win in 2018, and wasbeaten by What Remains of Edith Finch. <https:\/\/www.bbc.co.uk\/news\/technology-43744690>So it has got form in throwing up a surprise like this.Action adventure Tunic won best debut game, and its creators said: \"This is nuts, thank you so much.\"Presenters of the awards included actor Troy Baker, who voiced Joel in the game The Last of Us, and went on to play James in the HBO TV show. One of the TV show's stars, Game of Thrones actress Bella Ramsey, who plays Ellie, also appeared via video link.Inbetweeners star and YouTuber James Buckley said as he presented the multiplayer award to Elden Ring's creators: \"One of the amazing things about gaming is the ability to share your experience with others.\"The Bafta Fellowship award went to Shuhei Yoshieida, who called his win \"humbling\", saying: \"Every advancement of technology turns it into a tool for developers to create amazing things.\"So developers dream, because their next game could change the face of the industry forever. And I cannot wait.\"Here are the Bafta Games Awards winners in full:Best game - Vampire SurvivorsBest British game - Rollerdrome Performer in a leading role - Christopher Judge as Kratos in God of War: RagnarokPerformer in a supporting role - Laya Deleon Hayes as Angrboða in God of War: RagnarokEE game of the year - God of War: RagnarokNarrative - ImmortalityEvolving game - Final Fantasy XIVOriginal property - Elden RingMultiplayer - Elden RingDebut game - TunicGame beyond entertainment - Endling - Extinction is Forever Family - Kirby and the Forgotten Land Animation - God of War: RagnarokGame design - Vampire Survivors Artistic achievement - TunicTechnical achievement - Horizon Forbidden WestAudio achievement - God of War: RagnarokMusic - God of War: RagnarokFor more gaming content, go to Press X to Continue ,the BBC Sounds gaming Podcast. <https:\/\/www.bbc.co.uk\/programmes\/p08x7kb5>"}