{"author":"By Reality Check","title":"Ukraine war: What support is China giving Russia?","news_category":"general","content":"Chinese President Xi Jinping is meeting with President Vladimir Putin in Moscow on his first trip to Russia since its invasion of Ukraine.China has become an increasingly important trading partner for Russia as it seeks to soften the impact of economic sanctions imposed by some countries in response to its invasion.The United States has said Beijing is considering supplying weapons and ammunition to Russia, allegations which China strongly denies.China has been expanding its military production capabilities and is now the world's fourth largest arms exporter.\"China's weapons are getting more advanced now,\" says Siemon Wezeman from the Stockholm International Peace Research Institute.\"Its drones, for example, are one area that Russia would be very interested in.\"The US says Chinese firms have already provided \"non-lethal support\" to Russia, and that it has new information suggesting Beijing could soon provide \"lethal support\".Maria Shagina, an expert in economic sanctions at the International Institute of Strategic Studies, says China has not overtly supplied Russia with weapons but may be secretly selling it hi-tech products which could be used for military purposes.\"There is evidence that China is the biggest exporter of semiconductors - often through shell companies in Hong Kong and the UAE - to Russia,\" she says.\"Some Chinese companies are also supplying civilian drones, exploiting the grey space between military and civilian purposes.\"The US-based Center for Advanced Defense Studies <https:\/\/c4ads.org\/reports\/trade-secrets\/> says Chinese companies may be sending Russia electronic parts for anti-aircraft missile radars.The US has also imposed sanctions on a Chinese company which Washington says has provided satellite imagery in support of Russian mercenary forces fighting in Ukraine.After Russia invaded Ukraine a year ago, Western nations imposed strict sanctions on Russia - banning imports of oil and exports of hi-tech products.Many Western firms cut their connections with Russia entirely, and its trade with the US, UK, and EU countries slumped over the course of 2022.However, China's overall trade with Russia hit a record high level of $190bn in 2022 - a 30% increase on the year before.Russian imports from China increased 13% to $76bn and its exports to China increased by 43% to $114bn.As Russia's trade with Western countries plunged in 2022, China became, by far and away, its most important trading partner.Almost half of all the Russian government's annual revenues come from oil and gas, and its sales to EU countries has plummeted over the past year as sanctions bite.A significant amount of this shortfall has been made up with increased sales to Asia.Russia exported twice as much liquid petroleum gas (LPG) to China in 2022 than it did the year before. It also delivered 50% more natural gas via the Power of Siberia pipeline, and 10% more crude oil.The G7 group of economically developed countries, along with the European Union and Australia, has tried to impose a worldwide cap on the price of Russian oil transported by sea, but China has refused to comply and buys Russian crude at market prices.There are also longer term plans to expand energy ties. The two countries have agreed to build a new gas pipeline (the Power of Siberia 2). The existing one began operation in 2019, under a 30-year contract worth more than $400bn.Read more from Reality Check <http:\/\/www.bbc.co.uk\/realitycheck>Send us your questions <http:\/\/www.bbc.co.uk\/news\/uk-41928747>"}