{"author":"","title":"Ed Sheeran announces fourth Ipswich date","news_category":"general","content":"Ed Sheeran has announced he will play a fourth open-air gig in his home county next year.Plans for two dates at Chantry Park in Ipswich on 23-24 August were revealed last month, alongside two dates at Roundhay Park, Leeds.A third Ipswich date, 25 August, was added and now a fourth will take place on Bank Holiday Monday, 26 August.The Ipswich dates have yet to sell out, and some fans have been critical of the £82 ticket price (including fees).The singer grew up in Framlingham, Suffolk and was born in Halifax, West Yorkshire.The Leeds gigs, on 16-17 August, and the ones in Ipswich are the only UK concerts on his European Tour 2019.Some fans have been critical of the price of tickets over the past few weeks.On Ed Sheeran's Facebook page <https:\/\/www.facebook.com\/EdSheeranMusic\/videos\/705278903139364\/>, one mum said: \"I really wanted to take my children but £340 for four of us... have you considered children's prices?\"Another said: \"I'd be grateful if you could let me know if I'll need to sell both kidneys, or just the one in order to come see you? Regards.\"In a different comment, another poster wrote: \"I'm sorry Ed you're damn good and probably have little influence in gig tickets but those prices are ridiculous... have a word fella.\"The BBC has contacted Sheeran's publicity team for comment.The capacity for the Chantry Park concerts will be between 40,000 and 45,000, depending on how many people want seated tickets - the promoters will then configure the concert site accordingly.In a bid to combat touts and the resale of tickets online at inflated prices, the concerts are \"ticketless\" with buyers having to present their credit or debit card at the entry to the venue instead of a ticket or email.It will be the first time Sheeran has performed in Suffolk since since 2014 <https:\/\/www.bbc.co.uk\/news\/uk-england-suffolk-27283603> when he played to an audience of about 100 at a \"secret\" gig at Ipswich's Steamboat Tavern."}