{"author":"","title":"How is the UK stopping Channel crossings and what are the legal routes to the UK?","news_category":"general","content":"New ex-military sites will accommodate thousands of migrants, the government has announced.It is part of plans to tackle small boat crossings after record numbers came to the UK this way in 2022.Under the Illegal Migration Bill, published at the beginning of March:The law will apply retrospectively, with anyone arriving illegally from Tuesday 7 March at risk of deportation.It is already illegal for migrants to knowingly enter the UK without a visa or special permission.People who do so can be jailed for up to four years and removed to a safe country <https:\/\/www.gov.uk\/guidance\/risks-of-illegal-migration-to-the-uk>. However, between June and November 2022,fewer than 100 people <https:\/\/www.bbc.co.uk\/news\/uk-63938698> who crossed in small boats were arrested.The UK also has an international legal duty to not criminally penalise anyone seeking protection as a refugee.The Home Office says there are a number of \"safe and legal\" <https:\/\/www.gov.uk\/government\/publications\/nationality-and-borders-bill-safe-and-legal-routes-factsheet\/nationality-and-borders-bill-factsheet-safe-and-legal-routes> routes to the UK.However, some are only available to people from specific countries such as Afghanistan andUkraine <https:\/\/www.gov.uk\/guidance\/support-for-family-members-of-british-nationals-in-ukraine-and-ukrainian-nationals-in-ukraine-and-the-uk>, or British National status holders in Hong Kong.Other asylum routes only accept a limited number of refugees:Organisations including the Refugee Council and Amnesty International say there are no safe and legal routes for most people to seek asylum in the UK.Critics of the government's asylum proposals, such as the Refugee Council, say they break international law.The 1951 Refugee Convention <https:\/\/www.unhcr.org\/uk\/1951-refugee-convention.html> is an international agreement outlining the rights of refugees around the world.The main principle of the Refugee Convention states that refugees should not be returned to a country where they faced threats to life or freedom.The government argues that its Rwanda plan <https:\/\/www.bbc.co.uk\/news\/explainers-61782866> is in line with international law because it is a safe third country. Critics disagree.The Nationality and Borders Act changed the law so that asylum seekers in the UK could be rejected if it can be shown they passed through a safe third country before reaching the UK. But this has no basis in the Refugee Convention.The European Convention on Human Rights <https:\/\/www.coe.int\/en\/web\/impact-convention-human-rights#\/> (ECHR) is a commitment to protect human rights signed by Council of Europe members. It is part of UK law under the Human Rights Act.The ECHR protects the same rights of refugees as the Refugee Convention. It commits signatories like the UK against sending asylum seekers to countries where their lives may be at risk.In March 2023, the government said that three ex-military sites in Essex, Lincolnshire and East Sussex will be used to house several thousand migrants <https:\/\/www.bbc.co.uk\/news\/uk-65107827>. It hopes the move will deter asylum seekers from coming to the UK, and reduce the amount of money spent on accommodation.However, Immigration Minister Robert Jenrick conceded that \"these sites on their own will not end the use of hotels overnight\".He also confirmed reports that the government was \"exploring the possibility\" of using ferries to house migrants, but said no final decision had been taken.The UK has agreed to give France £500m over three years <https:\/\/www.bbc.co.uk\/news\/uk-politics-64916446> which will go towards more patrol officers and a new detention centre.Prime Minister Rishi Sunak previously announced a new Small Boats Command Centre bringing together the military and National Crime Agency (NCA).Most people arriving by boat claim asylum on arrival in the UK <https:\/\/www.gov.uk\/claim-asylum>. Asylum seekers have an initial interview and - if their case is accepted - they can apply to remain in the UK.However, asylum claims can be rejected if the applicant has a connection to a safe third country <https:\/\/assets.publishing.service.gov.uk\/government\/uploads\/system\/uploads\/attachment_data\/file\/1084315\/Inadmissibility.pdf>. This includes passing through France.The Home Office says applicants should receive a decision within six months, butin the year to June 2022 <https:\/\/www.gov.uk\/government\/statistics\/immigration-statistics-year-ending-june-2022> 70% had not heard back within that time.Asylum seekers usually cannot work while their case is considered.If their application for asylum is accepted, they can stay in the UK. If rejected, they face being returned to the country they came from, but can appeal.Clarification 2 December: This article has been amended to make clear that the government's \"safe and legal\" routes are only available to certain groups of people who have already been recognised as refugees, or family members of refugees already in the UK."}