{"author":"","title":"Birmingham Commonwealth Games a 'catalyst' for post-pandemic recovery","news_category":"general","content":"The 2022 Commonwealth Games in Birmingham will be a \"catalyst\" for the post-pandemic recovery in the West Midlands, its chief executive said.The Games have been affected by Covid-19, but Ian Reid said they are still a \"real opportunity for the region\".Although coronavirus scuppered the Perry Barr athletes' village, Mr Reid said he was \"really encouraged\" by how the region responded to challenges.He said the Games would provide up to 30,000 jobs as well as volunteer roles.The West Midlands has been hard hit when it comes to unemployment, with an estimated 100,000 jobs being lost since the start of the pandemic <https:\/\/www.bbc.co.uk\/news\/uk-england-birmingham-56238445>.Plans for a £500m athletes' village in Perry Barr were abandoned last year due to delays in construction <https:\/\/www.bbc.co.uk\/sport\/athletics\/53744076> caused by Covid-19. Instead, athletes will be housed in student accommodation and at the National Exhibition Centre.\"We've had a few challenges,\" Mr Reid said. \"But we're really encouraged by how the whole region's moved away from those.\"He said the Games were on time and on budget, adding that the business was \"in a really good place\".\"Of course we're aware it's a significant public investment,\" he said of the Games, estimated to cost £800m. \"However, I think it's a real opportunity for the region.\"\"If you talk to other politicians or other leaders across the country, they're quite jealous of some of the really big projects that are in the West Midlands right now,\" he said, citing HS2 and Coventry City of Culture alongside the Games.\"So we very much see the Games as being a catalyst for that post-pandemic recovery,\" he said.As well as the thousands of job opportunities, Mr Reid said \"a huge amount of money\" was being invested in the cultural sector <https:\/\/www.bbc.co.uk\/news\/uk-england-birmingham-55824819>.Raidene Carter, executive producer of the Commonwealth Games' cultural programme, said the six months of activity around the Games will be a \"celebration\".\"It's been a painful year obviously for the cultural sector, so what we're hoping is that the cultural festival will be more than just something for audiences - [it] will also be a real celebration for the cultural sector to also get back on its feet,\" she said.Follow BBC West Midlands on Facebook <https:\/\/www.facebook.com\/MidlandsBBC\/>, Twitter <https:\/\/twitter.com\/bbcmtd> and Instagram <https:\/\/www.instagram.com\/bbc_midlands\/?hl=en>. Send your story ideas to: newsonline.westmidlands@bbc.co.uk <mailto:newsonline.westmidlands@bbc.co.uk>"}