{"author":"","title":"Prodigy's Keith Flint mural in Peterborough 'iconic'","news_category":"general","content":"A mural painted in tribute to The Prodigy singer Keith Flint is \"iconic\" says an ex- guitarist with the band.Flint, a founding member of the band who sang lead vocals on number one singles Breathe and Firestarter, died at his Essex home earlier this month.The mural was created on a legal graffiti wall in Peterborough by street artist Nathan Murdock.Guitarist Gizz Butt, who played with The Prodigy in the late 90s, wrote: \"Amazing street art of Keith.\" <https:\/\/www.facebook.com\/photo.php?fbid=10157231234812853&set=a.31402772852&type=3&theater>Butt, who is also from Peterborough, visited the mural after it was completed on Tuesday night.It shows Flint in his characteristic pose with his pierced tongue sticking out.An inquest into the singer's death at his Dunmow home opened last week and heard the provisional cause of death was from hanging <https:\/\/www.bbc.co.uk\/news\/uk-england-essex-47523338>.Mr Murdock said his 12ft-tall (3.6m) tribute to the artist took two days to create as \"I had to get it right\".\"It's my personal tribute - I've seen the band loads of times but I last saw them in December,\" he said.\"You hear a lot of tragic stories about the deaths of famous people, but this was the first time it meant anything to me.\"Mr Murdock runs Street Arts Hire Ltd, which creates artwork and graffiti for commissions, but he painted this one for himself and other fans.Posting a photo of his mural on his company's Facebook page, Mr Murdock said: \"Keith Flint, you've given us years of great times and memories! We hope we've done you proud in return.\"His post has been liked more than 5,000 times, shared by more than 7,000 people, and hundreds of comments have been added from as far away as Hawaii and Australia.Butt described the work as \"iconic\" and said it was \"our own shrine to Keith Flint\".Flint was born in Redbridge, north-east London, and later moved to Braintree, where he co-founded The Prodigy in 1990 with Liam Howlett and Leeroy Thornhill.If you are struggling to cope, contact the Samaritans on the free helpline 116 123, orplease click on this link <https:\/\/www.bbc.co.uk\/programmes\/articles\/4WLs5NlwrySXJR2n8Snszdg\/emotional-distress-information-and-support> to access support services."}