{"author":"By Matt Lloyd","title":"Wales: 2022 in pictures","news_category":"general","content":"It has been a colourful, controversial and contrasting 12 months in Wales.The year began with Covid lockdown measures in place <https:\/\/www.bbc.co.uk\/news\/uk-wales-55333756>, then we had extreme weather <https:\/\/www.bbc.co.uk\/news\/av\/uk-wales-63670457>, political drama, sporting agony and ecstasy and moments of history.Throughout 2022, photographers captured those moments - the extraordinary and the everyday.Here are 26 memorable photographs from Wales - with the stories behind them.A quiet night out. Coronavirus restrictions reintroduced in Wales on Boxing Day <https:\/\/www.bbc.co.uk\/news\/uk-wales-59779931> meant nightclubs were closed for New Year's Eve and the \"rule of six\" applied to pubs, restaurants and cinemas.This shot of January's \"wolf moon\" <https:\/\/www.bbc.co.uk\/weather\/feeds\/60002675> above Tonypandy, Rhondda Cynon Taf, was reminiscent of Hollywood blockbuster ET.A vigil was held outside Cardiff Museum in February for Dr Gary Jenkins who was killed in a homophobic attack in the city's Bute Park. Two men and a girl, then aged 17,were later found guilty of his murder <https:\/\/www.bbc.co.uk\/news\/uk-wales-60229689>.Welcome to Wrexham. It was quite a year for the town that became Wales' seventh city <https:\/\/www.bbc.co.uk\/news\/uk-wales-61520080> as part of the Queen's Platinum Jubilee. Itmissed out on becoming the UK's next city of culture <https:\/\/www.bbc.co.uk\/news\/uk-wales-61651946> but Wrexham was projected around the world thanks toa documentary <https:\/\/www.bbc.co.uk\/sport\/football\/62663215> by its football club's Hollywood owners, Ryan Reynolds and Rob McElhenney.Bye-bye Banksy. Season's Greetings first appeared on the side of a Port Talbot garage <https:\/\/www.bbc.co.uk\/news\/uk-wales-46617742> belonging to former steel worker Ian Lewis in 2018. It shows a child enjoying what they think is snow, but the other half of the image reveals it is actually ash from a bin fire.It was later put on public display in the town centre before being moved in February to an undisclosed location <https:\/\/www.bbc.co.uk\/news\/uk-wales-59340034> by its owner, Essex art-dealer John Brandler.Surf's up. Storm Eunice <https:\/\/www.bbc.co.uk\/news\/uk-wales-60419268> was one of the worst storms to hit Wales in a generation triggering a rare red weather warning. Gusts exceeded 90mph (145km\/h), causing power cuts, closing schools, toppling large trees and lorries as well as battering the coastline - including here at Porthcawl.Benjamin Mwangi, father of of Logan Mwangi, read a statement outside Cardiff Crown Court after Logan's mother, Angharad Williamson, step-father John Cole and a 14-year-old boywere found guilty of murdering the five-year-old boy <https:\/\/www.bbc.co.uk\/news\/uk-wales-60953867> in July 2021.Labour smiles. Labour councillors celebrate victory <https:\/\/www.bbc.co.uk\/news\/uk-wales-61306723> during the local elections in Wales that were a disaster for the Conservatives, who lost control of their only council.Hey Hay. Festivals were back on this year  <https:\/\/www.bbc.co.uk\/news\/uk-wales-60982752>following a two-year hiatus due to the coronavirus pandemic.In May, five schoolchildren were injured when they were hit by a school bus <https:\/\/www.bbc.co.uk\/news\/uk-wales-61557775> in Llanfair Caereinion, Powys. Three of the children were airlifted to hospital. A fourth child and the bus driver were also taken to hospital but all were later discharged.Oar-some. This super-relaxed seal did not seem to have a care in the world as it relaxed on a dinghy for a leisurely cruise.Karis Hedges was returning from Skomer Island, Pembrokeshire, when she saw the seal \"chilling out\" <https:\/\/www.bbc.co.uk\/news\/uk-wales-61747423>.The Principality Stadium hosted a number of the biggest acts in music during 2022,including the Stereophonics <https:\/\/www.bbc.co.uk\/iplayer\/episode\/m0018lg7\/stereophonics-live-in-cardiff-well-keep-a-welcome>.Wales joined four days of celebrations for the Queen's Platinum Jubilee in June <https:\/\/www.bbc.co.uk\/news\/uk-wales-61665905>, marking the 70th anniversary of her accession to the throne.More than football. Ukraine and Wales supporters embraced after the FIFA World Cup qualifying match in Cardiff. Gareth Bale's goal clinched a 1-0 victory that sawWales qualify for the first time in 64 years <https:\/\/www.bbc.co.uk\/news\/uk-wales-61697975>, though it was a bitter-sweet success against the backdrop ofwar in Ukraine <https:\/\/www.bbc.co.uk\/news\/world-us-canada-63987113>.Among the lesser-known festivals to return after Covid restrictions were lifted was FerryFest in Briton Ferry, where the pram and drag parade always proves a popular and colourful attraction.The impact of climate change was felt in Wales  <https:\/\/www.bbc.co.uk\/news\/uk-wales-62125565>this year as we baked during the country's two hottest days ever recorded.The cracked tidal river bed at Carew Castle in Pembrokeshire provided some dramatic images during the summer.A drought was officially declared in two areas and a first hosepipe ban for 30 years <https:\/\/www.bbc.co.uk\/news\/uk-wales-62592174> was put in place as water across the country dropped to worrying levels.Brinn Bevan soars in the Men's Parallel Bars Final at the Birmingham 2022 Commonwealth Games. Walesended the games with 28 medals <https:\/\/www.bbc.co.uk\/sport\/commonwealth-games\/62472472>, including eight golds.GCSE and A-level students, including Hugo Lewis of Swansea, picked up their results after being the first tofirst to sit exams since 2019 <https:\/\/www.bbc.co.uk\/news\/uk-wales-62660790> due to the Covid-19 pandemic.In their first official visit as Prince and Princess of Wales <https:\/\/www.bbc.co.uk\/news\/uk-wales-63035829> following the death of Queen Elizabeth II, the royal couple visited the RNLI Holyhead Lifeboat Station on Anglesey, where they also met some very excited members of the public.King Charles II also visited Wales following his accession to the throne <https:\/\/www.bbc.co.uk\/news\/uk-wales-62864054>, though a handful of protesters demonstrated ahead of the Welsh Proclamation at Cardiff Castle.Wales women celebrated a dramatic win over Scotland <https:\/\/www.bbc.co.uk\/newsround\/63190659> at the Rugby World Cup after Keira Bevan kicked a penalty in the final seconds. Siwan Lillicrap's team were eventuallyknocked out in the quarter-finals by hosts <https:\/\/www.bbc.co.uk\/sport\/rugby-union\/63409317> - and eventual champions - New Zealand.We all felt the pinch of the cost of living crisis <https:\/\/www.bbc.co.uk\/news\/topics\/cljev4jz3pjt>, some more than others. Councils and charities across Wales openedwarm spaces <https:\/\/www.bbc.co.uk\/news\/uk-wales-63200609>, such as this foodbank in Cardiff, as a short-term fix to those struggling to pay soaring energy bills.Cold shoulder. Wayne Pivac paid the price for a miserable year for Wales, including first home defeats toItaly <https:\/\/www.bbc.co.uk\/sport\/av\/rugby-union\/60808652> and Georgia <https:\/\/www.bbc.co.uk\/sport\/rugby-union\/63687627>. He was sacked after winning just three of 12 games <https:\/\/www.bbc.co.uk\/sport\/rugby-union\/63770196> in 2022.A room with a view. The new kitchen and canteen at the Urdd's Llangrannog outdoor education centre in Ceredigion was part ofa £9.5m scheme <https:\/\/www.bbc.co.uk\/news\/uk-wales-63740429> to modernise three of Urdd Gobaith Cymru's residential centres across Wales.Sing when you're... losing. Most Wales fans were unable to travel to Qatar to watch Robert Page's side in action at the Fifa World Cup, but they packed pubs, bars and evenschool halls in their thousands <https:\/\/www.bbc.co.uk\/news\/uk-wales-63597853> to cheer their heroes.Brrrrrrave soul. After a mild autumn, December in Wales was gripped by an icy blast <https:\/\/www.bbc.co.uk\/news\/uk-wales-63996952>."}