{"author":"","title":"A quick guide to Gavin Williamson and why he's resigned","news_category":"general","content":"Gavin Williamson is a sometimes controversial figure, but if you're not an avid politics-watcher, you might not know why. Here's a very quick guide to the three-time minister.As a cabinet minister, he was one of the top 30 people running the country. He returned to the cabinet when Rishi Sunak took over as prime minister in October.An investigation has been launched after he allegedly sent sweary messages to the chief whip - the person who ensures party loyalty and that MPs do as they're told. It's a job he once did himself. There is also an allegation of bullying dating back a few years. He says he hasn't bullied anyone but he's now resigned as a minister saying the claims were a distraction from the government's work.Instead, he was Minister of State (Minister without Portfolio). That means that instead of being in charge of something like defence or health, he was more of a general contributor to the running of government.Sir Gavin has been in the top ranks of government twice before. But he was fired as defence secretary in May 2019 over allegations of leaking info from National Security Council meetings, and lost his job as education secretary after two years when Boris Johnson decided to shuffle the top jobs around.We called him Sir Gavin above. That's because he got a knighthood for Political Service from Boris Johnson in 2022, despite much criticism. So officially he's Sir Gavin Williamson CBE (Commander of the Most Excellent Order of the British Empire).He was born in Yorkshire and studied Social Sciences at the University of Bradford. Before politics, he worked as a manager in a fireplace maker, and then moved to be a top manager of a British pottery and china maker in Staffordshire. He is married and has two daughters.While chief whip, Sir Gavin kept a large tarantula named Cronus on his desk. When that hit the headlines, he told The Telegraph he'd raised the hairy spider from hatching, and that Cronus was \"an incredibly clean, ruthless killer\"."}