{"author":"By Katy Lewis","title":"Milton Keynes panto 'nerve-wracking' for Diversity's Banjo","news_category":"general","content":"Diversity dancer\/founder Ashley Banjo said it was \"slightly nerve-wracking\" doing pantomime this year due to uncertainty about Covid restrictions.The dance troupe, which won Britain's Got Talent in 2009, is in Jack and the Beanstalk at the Milton Keynes Theatre.In 2020, the group only did a few performances at the London Palladium panto before it had to close.\"Last year we had to stop after six days, so I'll never take it for granted again,\" said Banjo.Banjo, who is playing Jack while the rest of the group plays his siblings, said: \"It's great to be back but it's slightly nerve-wracking not knowing what is happening with the rules.\"But I feel like, theatres are open, audiences are back with bums on seats and we are back to where we should be.\"Since reopening, Milton Keynes Theatre had been asking customers to prove their negative Covid-19 test status and had also strongly advised ticket-holders to wear face coverings.Last week, the government made the wearing of face masks mandatory again in public venues, and proof of a negative Covid test could be a legal requirement, if MPsapprove it on Wednesday <https:\/\/www.bbc.co.uk\/news\/uk-politics-59640792>.\"We are still putting everything in place to make your evening is fun and enjoyable, whilst being safe for everyone,\" the venue said.All being well though, what audiences will see are fresh dances from Diversity, created from scratch from day one of rehearsals.\"All the routines are completely new and the first time we will have done them on stage will be in Milton Keynes,\" said Banjo.And while Jack having a number of siblings may not be the traditional interpretation of the story, Banjo said the group \"fits in like any other character\".\"We were keen not just to slot things in as a Diversity dance, but to be part of the plot,\" he said.\"We do sketches and signature pieces created around the story, with two big numbers and other bits and pieces throughout.\"As the group's founder, Banjo, who grew up in east London and Essex, has seen his career rocket since those early days when theybeat Susan Boyle to the BGT title <http:\/\/news.bbc.co.uk\/1\/hi\/entertainment\/8075510.stm>.Well known for his television roles, he has presented, judged and produced award-winning programmes including a return to Britain's Got Talent, Dancing On Ice and the Emmy and BAFTA award-winning The Real Full Monty.The group is known for consistently pushing the boundaries of dance and creativity and as choreographer, Banjo creates all of the group's performances including all nine of their sell-out UK tours.While the group has planned a big routine around defeating the giant and the celebration of that, many people will not forget Diversity's performance on Britain's Got Talent last year which dealt with events of 2020.As well as featuring themes about the pandemic, they depicted George Floyd's death in police custody in the US and the significance of the Black Lives Matter movement.It attracted thousands of complaints but the broadcasting watchdog Ofcom said it hadnot raised issues that warranted an investigation <https:\/\/www.bbc.co.uk\/news\/entertainment-arts-54188788> and added that \"its central message was a call for social cohesion and unity\".It subsequently won a TV BAFTA for the Must-See Moment of the year.Banjo said that despite the complaints, with hindsight, he would not have done anything differently.\"That topic is always up for debate,\" he said.\"Social media never lets it lie but it was a subject very close to all our hearts in Diversity so it was something we couldn't not create.\"The goal is always to authentically be yourself as far as possible, so it just confirmed that it's important to stand up for what you believe in, especially if you've got a platform.\"It was just one moment in what he describes as a \"tough and unnerving\" year for their sector of entertainment which \"took a big hit\" but they were lucky because they could still meet, put together work and teach online.For now, he said he was looking forward to the \"relentlessness of the hard work of two shows a day\" that pantomime brings.\"As much as it is hard work, it's a privilege to see the looks on the audiences' faces again, and see people enjoying themselves,\" he said.Jack and the Beanstalk runs at the Milton Keynes Theatre <https:\/\/www.atgtickets.com\/venues\/milton-keynes-theatre\/> until 8 January.Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk"}