{"author":"","title":"Ukraine: Welsh minister planning to take in Ukrainian relatives","news_category":"general","content":"A senior Welsh government minister is waiting to find out if two of his Ukrainian relatives will receive visas so they can live with him.Pontypridd Labour Senedd member Mick Antoniw, who is the son of a refugee, said he feels a sense of obligation to help.Mr Antoniw is willing to allow his relatives to stay with him until it is safe to return.The counsel general also called for hubs to be set up to help new arrivals.The two relatives are the wife of one of his cousins and his teenage son.They live in western Ukraine, which has so far been spared some of the worst fighting.They applied on Tuesday morning after the UK government's family visa scheme was extended to allow online applications.Mr Antoniw, who was born in Reading and speaks Ukrainian, visited the country days before the invasion began.\"We've been trying to get them visas since the start of the invasion,\" he said. \"But the government schemes have been incredibly restrictive and bureaucratic.\"\"We'll be waiting to see how long it takes to process. \"If that happens, then obviously they can go across the border. And I'll be in a position to arrange flights for them to come to the UK.\"This video can not be playedFirefighters attend an apartment block in Obolon district after an air strikeMr Antoniw told BBC Wales: \"I was brought up in a community of people who were in that similar situation - displaced persons after the war,\" he said.\"You obviously have an obligation to do for them what a lot of people did for our parents - to provide homes and jobs and to help them settle.\"Others in his family are in the east of the country, in areas coming under increasing attacks.Some have moved west, and Mr Antoniw said three generations of his family involved in civil defence.While his family face fewer hurdles coming to live with him, he believes other refugees could face difficulties such as language.\"If they go into someone's home or into some accommodation, it can be a very lonely experience for refugees,\" he said.\"What will be important is that there are sort of hubs created where people can engage and have support and can meet and mix and basically begin to acclimatise to the trauma of what has happened to their lives.\"On Monday the UK government launched its Homes for Ukraine scheme <https:\/\/www.bbc.co.uk\/news\/uk-60741942>, where individuals and, at a later date, organisations can sponsor Ukrainians to come to the UK.The Welsh government, which hopes to become a \"super sponsor\" in the scheme, saidUkrainian nationals will need more public sector support <https:\/\/www.bbc.co.uk\/news\/uk-wales-politics-60755800>."}