{"author":"","title":"Christopher Alder death: Body mix-up claim probed","news_category":"general","content":"Authorities in Hull are probing claims that the body of a man who died in police custody has turned up - more than 10 years after he was thought to have been buried.Police were accused of \"unwitting racism\" over the death of black ex-paratrooper Christopher Alder, 37.His sister told the BBC the family were \"shocked and appalled\" at the news.Hull City Council would not confirm the body was Mr Alder's, but said it was \"appalled and distraught\" by the error.Mr Alder's sister Janet told the BBC: \"I'm just in total shock, I really can not believe that after all we've been through, after all the family's been through ... there can be so much incompetence.\"It just feels like contempt. It feels like adding insult to injury when you're trying to move on with your life.\"The council said the body of a man had been found in the city mortuary where it was thought a woman's body was being kept.Mr Alder's family said they had been told they \"buried the wrong body\" at his funeral.Mr Alder died in a police detention area in 1998.A council statement said: \"On Friday 4 November 2011, Hull City Council was made aware of a situation relating to the body of a man, who was in his late 30s, located in the city mortuary.\"The body lay in the place where Grace Kamara had been recorded as rested. At the moment, we cannot explain this.This video can not be playedChristopher Alder's sister Janet: \"I'm just in total shock\"\"Whilst Grace Kamara had died of natural causes in 1999, her council-funded burial was, for family-related reasons, only able to take place on Friday. It was immediately postponed.\"Hull City Council is both appalled and distraught at what it has learnt and, in conjunction with Hull and East Yorkshire Hospitals NHS Trust, is undertaking a full and thorough investigation.\"At the present time our main priority is to inform and support the families of those affected. We expect further information to be available later.\"In 2006, a report by the Healthcare Commission watchdog said lessons must be learned from the \"tragic death\" of Mr Alder.The commission found a failure to share information between hospital staff and police, and called for better co-operation.It was published alongside an Independent Police Complaints Commission (IPCC) report that said four police officers were guilty of the \"most serious neglect of duty\" over the death. The IPCC said the officers had been guilty of \"unwitting racism\".Mr Alder choked to death in a police station after he was arrested at Hull Royal Infirmary for an alleged breach of the peace.He had been injured in a scuffle outside a hotel in Hull city centre before being taken to the hospital for treatment.In 2002, five Humberside Police officers went on trial accused of manslaughter and misconduct in public office. They were cleared of all charges at Teesside Crown Court."}