{"author":"","title":"Plans for Smethwick Commonwealth aquatic centre unveiled","news_category":"general","content":"The location of a new £60m venue to host aquatic events at the Commonwealth Games in 2022 has been revealed.Birmingham won the bid to host the games <http:\/\/www.bbc.co.uk\/sport\/commonwealth-games\/42437441> in December and already has 95% of its venues in place.Londonderry Playing Fields in Smethwick, Sandwell, will host the \"state-of-the-art\" aquatic centre.Two swimming pools in the area, Smethwick Baths in Thimblemill Road and a pool in Langley, will close to make way for the new centre.Sandwell Council will now put the proposal to the Commonwealth Games Federation.The multimillion-pound venue will feature a 50m-long (164ft) swimming pool, a 25m (82ft) diving pool and 5,000 spectator seats.The council said the centre would be run by Sandwell Leisure Trust and will include two activity studios, a 12-court sports hall, a 125-station gym, a 25-station ladies-only gym, an indoor cycling studio, a sauna\/steam room and a café.Smethwick Baths is a listed building and will be used for other purposes, the council said, while the pool in Langley \"could\" be demolished.Steve Eling, leader of the council, said the games are a \"once-in-a-lifetime opportunity\" and he is \"very proud\" Sandwell can play a part.\"The eyes of the world will be on Sandwell and the benefits to the local economy will be huge with significant investment into the area and athletes and visitors from around the globe,\" he added.Mr Eling added the playing fields are \"well-placed to meet the needs of local people\".The proposals will be considered by the council's cabinet at the end of the month and if approved will be subject to planning permission and a full consultation with residents and businesses.The cost will be met by \"various organisations involved in delivering the Commonwealth Games 2022\", including Commonwealth Games Organising Committee, Sandwell Council and the Black Country Local Enterprise Partnership.The decision to choose the playing fields was made the council's committee for leisure and Sport England.\"Adequate alternative spaces\" would be provided for the lost playing fields, the council promised.However, the news two pools are to close to make way for the centre was met with amixed reaction on the BBC Midlands Facebook page. <https:\/\/www.facebook.com\/MidlandsBBC\/photos\/a.71945339760.64825.21263239760\/10155980851954761\/?type=3&theater>Barbara Humphreys wrote: \"There is an obesity explosion but you are closing the easiest and most accessible exercise centres. Ridiculous!\"Charli Preston said: \"I think it will make the area look much better....can't get much worse and there are dog walk paths and fields in around the whole of Sandwell that can be used alternatively.\""}