{"author":"","title":"Mencap NI jobs and services 'at risk' over EU funding cuts","news_category":"general","content":"A charity which provides support to people with learning disabilities has warned it may have to make more than 50 people redundant as EU funding will come to an end in March.Mencap NI said the ending of EU funding will have a \"devastating\" impact. The charity said there is not enough money in the replacement fund set up by the UK post-Brexit.The UK government has said it will \"match previous EU funding in Northern Ireland\".Mencap NI director Grainne Close said the charity has applied to the UK Shared Prosperity Fund (UKSPF) - set up to replace EU funding streams - but argued that there is no guarantee that they will receive funding.The UKSPF fund falls short by 50% of what it previously received from the EU's European Social Fund (ESF), the charity said.That could lead to a loss of employment opportunities for those supported by the charity, it warned.Ms Close said: \"For people with a learning disability it's not just about getting to work, it's about feeling included in society.\"People want to work, they want to have those opportunities and they have the right to have those opportunities\".A mother of a 21-year-old woman with severe learning disabilities has said that without Mencap their family \"would be lost\".Jamie Leigh Hughes from Limavady has attended Mencap for more than two years.Her mother Catherine said that the charity \"provides a lifeline\" for her daughter and allows her to \"come out her shell\".\"I want something better for Jamie Leigh and Mencap gives that to her.\"Eoin Kenny lives in Eglinton, County Londonderry. He is 32 and has learning disabilities.He said his life changed after his father took him to Mencap when aged 16. Now he has a 2:1 degree in Cinematic Arts from Ulster University.That success, he told BBC Radio Foyle's Breakfast <https:\/\/www.bbc.co.uk\/sounds\/play\/live:bbc_radio_foyle> Show, happened because of hard work and the support given to him by Mencap.\"I barely talked as a teenager. My whole story could have been very different,\" he said.Grainne Close told BBC News NI's Evening Extra programme: \"Many of the employers that we provide support to and provide placements for us would not be able to provide those employment opportunities without the support of Mencap.\"\"It will have devastating consequences if we can't find the funding,\" she added.Ms Close has appealed to local government officials to provide support to the charity in order to ensure services can continue.\"Our colleagues in Mencap NI, who work in communities across Northern Ireland are highly skilled and dedicated, having built up many years of expertise in supporting people with a learning disability to access training opportunities and jobs.\"They are doing all they can to ensure continuity of services,\" she added.The European Social Fund Peer Group which provides employment support programmes in Northern Ireland saidup to 1,700 jobs are at risk if EU funding lost after Brexit is not replaced. <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-63219860>The ESF had previously provided about £40m a year, which was 35% match-funded from Stormont, giving £54m in total.Next year, sector experts are anticipating about £30m from the UK Shared Prosperity Fund, but no match funding has been confirmed from Stormont yet.The European Union Social funding is due to end on 31 March. A UK government spokesman told BBC News NI the UKSPF will match previous EU funding and increase in the coming years.\"As EU projects come to an end, funding from UKSPF will increase, reaching over £50m for Northern Ireland in 2023-24 and £74m in 2024-25, to spread opportunity, help local businesses and improve pride in place.\""}