{"author":"By Dominic Casciani","title":"Channel migrants: Why can't crossings be stopped?","news_category":"general","content":"\"The government is determined to continue to crack down on the evil trade in such trafficking, whose perpetrators have no regard for human life,\" said the home secretary.No, not Priti Patel - but Jack Straw in June 2000 when 58 migrants suffocated in the back of a lorry as they were smuggled across the English Channel.Wednesday's 27 deaths appear to be the worst single loss of life <https:\/\/www.bbc.co.uk\/news\/uk-59406355> by drowning in the English Channel in a day.But the brutal fact is that over two decades of attempts to control the flow of seemingly desperate people - nobody in power in the UK or France has found a way to stop the crossings.That's a long and complex question - but the fall of Communism and the later opening of the Channel Tunnel prompted the French and British governments to begin talking seriously about improving security at the English Channel.People were on the move globally from the poorer south and east to the richer north and west.And ultimately, the numbers began to mass along the French Pas-de-Calais coast.In 1999, the French Red Cross opened the Sangatte refugee facility near the Port of Calais. The UK soon protested it had become a magnet.The then-Labour government persuaded the French to shut it down and, in 2003, to introduce British border controls in the port itself.That in turn led to what is now the extraordinary sight of 4km of security steel that encloses L'Autoroute des Anglais, the motorway that leads to the sea. In short, it became harder to get into the port - or into lorries.Soon a massive and dangerous refugee camp to the east of Calais grew up.Dubbed \"The Jungle\", the French closed it in 2009 - but it sprang up again. Eventually it was destroyed in a massive security operation in 2016.But it did not end the problem - because at exactly this moment organised smuggling by small boats was becoming a thing.The previous year, hundreds of thousands of Syrians fleeing the collapse of their country made it to the European Union by crossing the Aegean Sea in dinghies.International criminal people smugglers saw an opportunity to expand their business at the English Channel.In 2018, less than 500 people were detected by the UK Border Force arriving by small boat. This year there have been 25,776 so far. Twice that number have been stopped by the French.Today there are makeshift camps up and down 130km of French coast that forms the closest crossing points to the UK. The locations are often linked to where the gangs think they have an opportunity get people across without being noticed.And the fact that crossings have not reduced as the weather has turned towards winter, shows the smuggling operations are now major embedded enterprises with a steady supply of customers.Official figures show <https:\/\/committees.parliament.uk\/oralevidence\/3008\/html\/> the largest groups of migrants by nationality are from countries that are either unstable, very poor or known to have serious human rights abuses:In 2018, the UK and France signed another treaty in which the UK committed £42m to help the French security operation.A \"joint action plan\" in January 2019 included dedicated funding to target small boats - including CCTV schemes for beaches.In October that year, the Home Office was sufficiently concerned to announce an \"enhanced action plan\".The measures included funding more French patrols, detection equipment and intelligence-sharing.That aimed to halve attempted crossings - then running at up to 300 a month - and turn them into\"an infrequent phenomenon\" <https:\/\/www.gov.uk\/government\/publications\/uk-france-joint-action-plan-on-illegal-migration-across-the-channel\/addendum-to-the-joint-action-plan-by-the-united-kingdom-and-france-on-combatting-illegal-migration-involving-small-boats-in-the-english-channel-acces> by 2020.It didn't work and so in August 2020 a former Royal Marine, Dan O'Mahoney, was appointed commander <https:\/\/www.gov.uk\/government\/news\/home-secretary-appoints-small-boat-commander> of a new Border Force operation to stop the crossings.He says he is working closely with the French - and they are now deploying a panoply of military kit to the coast - from night vision goggles and beach-going quad bikes, to fast and stealthy inflatables to intercept migrants at sea.That brings us to talk of \"push back\" operations - broadly inspired by Australia's controversial use of such tactics in international waters.A tactic had been developed to intercept boats <https:\/\/www.bbc.co.uk\/news\/uk-58495948> and literally push them back into French waters - but it seems it has not been used.The Home Office has concluded \"marine fencing\" will not work - and rumours of a giant wave machine are seemingly a fantasy.This is a critical question. Smugglers tell migrants if they reach the UK, they will get to stay. Many want to come because of ties to the UK through family, language or culture.As late as August 2020, the Home Office was saying it would send them back under EU arrangements to return migrants, called the Dublin III agreement.But months later the UK left the EU - and there has been no successor deal.As a consequence, according to figures provided to MPs last week, <https:\/\/www.bbc.co.uk\/news\/uk-england-kent-59320160> only five people who have arrived by small boat have been returned to Europe this year.The new plan is the Home Office's Nationality and Borders Bill. It controversially plans to treat anyone arriving via unauthorised means differently to refugees who come by approved routes - something many legal experts think would be unlawful - but a policy that the government thinks will discourage arrivals.It also creates a power to process migrants in another offshore location. We don't know where yet. And we don't know whether that would influence any migrants' decisions about the journeys they take.In her appearance before MPs following the drownings, Home Secretary Priti Patel said some options depended on co-operation with the French - but also resolving complications between the two country's laws.For instance, while Ms Patel insisted there had been a \"constant offer\" of British personnel to help the French patrol, British police can only operate over there without their usual powers to investigate or arrest.A proposal to deploy drones was initially complicated by France's privacy laws - and it's not clear at the moment whether another British plan, to use number plate recognition cameras to identify vehicles linked to smugglers, could go ahead.But many charities and refugee experts champion another solution. In the House of Commons today, the Conservative MP and former International Development Secretary Andrew Mitchell asked Ms Patel why not allow people to seek asylum at British embassies around the world, \"rather than risking their lives, just for the chance to file paperwork\"."}