{"author":"By Liz Clements","title":"Social care: Demand pushes unpaid carers 'to the brink'","news_category":"general","content":"Emily Bleakley says the pressure of caring for her brother has been made worse by the pandemic.\"Being an unpaid carer doesn't stop. And the lack of respite opportunities during Covid has only worsened that,\" the 18-year-old from Powys said.Despite that, more families are being urged to carry out caring duties as the system struggles to meet \"the surge in demand for care\".Cardiff and Vale is the latest of four health boards to make similar calls. The health board said it had seen a 30% increase in people needing care at home, compared to pre-pandemic levels.A huge increase in demand, alongside a UK-wide shortage of care workers and health care staff, is leading to delays in care provision and preventing the timely discharge of patients from hospital, it said.Its warning follows others from Swansea Bay, Hywel Dda and Betsi Cadwaladr health boards and calls on relatives to consider providing care themselves to \"free up much-needed care for other vulnerable people who do not have any support\".Blaenau Gwent council described its situation as \"concerning\" and has also asked for families to consider arranging their own care, rather than using an agency, and for people to think about becoming a care worker or volunteer.Emily said her role could often be relentless and has been further exacerbated by the pandemic: \"I'm feeling quite worn out to be honest.\"We need to keep getting further support to adjust the challenges of caring during Covid because this has been much more than mental health - it's financial, it's social, it's been very hard for a lot of unpaid carers, and this does need to be recognised,\" she said.Emily said she felt frustrated by health boards asking more of already-struggling families.\"It does make me quite angry. Unpaid carers are being stretched to the point where that their mental health is suffering and they're being asked to do more.\"Christine Jenkins, from Coelbren, Powys, cares for her husband, who has dementia.\"I've got to think of him all the time which I don't mind, obviously, but I go to bed at night, I can't sleep properly because I'm waiting for him to wake up - it's constant, all the time,\" she said.\"I consider myself a strong woman and I don't say it's depression, it's more the anxiety of, if you failed, what happens?\"But I am strong, I am, I will fight on to get things done if I can.\"Carers have been \"pushed to the brink\" during the pandemic, according Beth Evans, a policy manager at Carers Wales.The charity's research in June showed 72% of carers had reported exhaustion from the additional care responsibilities they had taken on.\"It's really demoralising - services haven't fully reopened after the pandemic for carers with quite intense caring responsibilities,\" she said.\"To add additional responsibilities on to them, when they really are at breaking point, without adequate support, is really unfair.\"Cardiff and Vale's plea for family support comes as no surprise to the charity.\"It's a desperate situation, I completely understand why they're asking. But they need to make sure that those families and those carers get the adequate support and equipment that they need to care safely and look after their own health.\"Otherwise, what will happen, is that the health and social care services will end up with two patients instead of one. Nobody wants that.\"Health Minister Eluned Morgan said people in social care had done an \"incredible job\", but there was a shortage of social care workers, prompting health boards to ask relatives to fill in.\"We have put extra packages in place for unpaid carers and additional significant funding in place as we go into the winter months,\" she added."}