{"author":"By Gwyneth Rees & Hollie Smith","title":"The young Welsh Muslim women gaining confidence","news_category":"general","content":"Hate crimes and Islamophobia are on the rise across England and Wales. Here two Muslim women from Cardiff describe the discrimination they have faced and how iLead - a leadership training programme run by the Muslim Council of Wales - has helped them to rebuild their confidence.Sadia Begum, 20, is a second year university student. She said:As a younger woman, I had confidence but I also had fear. Every time I was out walking I was worried. Was someone going to rip off my headscarf? Was someone going to attack me? My parents started fearing when I left the house.One of my cousins, only 16, was walking to school with a friend and a bunch of boys started following them in a car shouting: \"Take that towel off your head.\"I've been asked many times - what's that on your head? Do you have hair underneath it?When I was working in retail, people used to ask if I was allowed to work. Of course I can work.As a woman, it does knock your confidence, but people are fed the wrong information and don't get educated.They don't have the knowledge and there is a stereotype coming from the media and social media.That's why I like it when non-Muslims ask me questions, like during Ramadan. I explain to people why we don't eat and drink, and that fasting teaches you self-discipline.I recently did the leadership programme, iLead, to gain more confidence in public speaking and learn how to incorporate Islam into my everyday lifestyle.It taught me I don't need to hide who I am. Everyone seems so focussed on fitting in and being accepted, they can forget their identity.But sometimes it's better to be different and show the way. I now have confidence and know the way to act.Muslim women are not oppressed. We have so many rights and so much empowerment.We just need to build on what we truly are. Haifa Shamsan, 29, is a clothing designer, blogger and mum of two. She said: Personally, I had a lot of confidence when I was young because my parents instilled it.But I was very quiet in school, so people just assumed they could get away with things.Once a boy said: \"Take that towel off your head\". So I chased him around the playground, grabbed hold of him and told him to apologise. This is not a towel, it's a hijab.People have asked me if I sleep in it, shower in it, and if my parents see my hair.I have never minded being asked questions but in school I found a lot of bullying.I would tell my dad and he told me to stand up for myself. He said that if someone hit me, I should hit them back, but not to hit them first.People need to update their view of Muslim women. There are a lot of great leaders out there - bloggers, social media influencers and athletes.They show that it's okay to weight lift and do boxing. We're not oppressed and if a Muslim woman doesn't talk, it's not because of her religion, it's because she is shy or quiet or scared of being called a terrorist.I just want to educate people because often all they see is something negative.So many people say to me: \"You're alright actually. You're cool, you're funny.\"And I say: \"What did you think we were?\""}