{"author":"","title":"Manchester Gay Village murals defaced with homophobic graffiti","news_category":"general","content":"The defacement of two murals of LGBT personalities in Manchester's Gay Village with homophobic graffiti is \"disappointing\", a drag queen depicted in one of the works has said.The artworks on Richmond Street, which feature computing pioneer Alan Turing, Drag Race UK star Divina De Campo and others, were attacked on Saturday.The number 666 and a misspelt expletive were spray painted on to the murals.It showed the LGBT movement Pride was \"needed more than ever\", De Campo said.Both works - an individual portrait of De Campo and a large work featuring Turing, writer Quentin Crisp and political activist Emmeline Pankhurst on the side of The Molly House pub - were daubed with the same words.Greater Manchester Police said the graffiti had been reported, but no arrests had been made.Carl Austin-Behan, LGBT advisor to Greater Manchester's mayor, said in a tweet <https:\/\/twitter.com\/CarlAustinBehan\/status\/1409122538064646149> that the works had been \"disgracefully\" defaced, while Manchester councillor Jon-Connor Lyons said those who had painted the words were \"cowards\".Manchester artists Nomad Clan, made up of Hayley Garner and Jay Gilleard, created the mural on The Molly House eight years ago.They said the work \"means a lot to people\", before adding that \"as members of the LGBT community, it has hit us on a personal note too\".They said the graffiti was particularly upsetting to see during Pride month, which is currently taking place across the world.They added that they had already repainted the mural to remove the offensive words.De Campo said it was \"sad\" and \"really disappointing\" that the mural of her, which was created by artist Akse P19, was attacked, but she was not taking it personally.\"The person who has done this probably has no idea who I am,\" she said.\"They certainly don't know who Alan Turing was, because they wouldn't be spray painting against his mural on his birthday if they did.\"Following the repairs to The Molly House mural, Mr Austin-Behan tweeted <https:\/\/twitter.com\/CarlAustinBehan\/status\/1409502431671640067> that the painting of De Campo would also be \"restored to its former glory tomorrow\".The drag queen said the graffiti and the recent spate of homophobic and transphobic attacks in Liverpool <https:\/\/www.bbc.co.uk\/news\/uk-england-merseyside-57568691> highlighted the continuing importance of Pride.\"Pride is a protest,\" she said.\"With what has happened in Manchester recently and Liverpool, [it] is needed more than ever.\"Why not follow BBC North West on Facebook <https:\/\/en-gb.facebook.com\/BBCNW\/>, Twitter <https:\/\/twitter.com\/BBCNWT> and Instagram <https:\/\/www.instagram.com\/bbcnorthwest\/>? You can also send story ideas to northwest.newsonline@bbc.co.uk"}