{"author":"By Cherylann Mollan","title":"The sinister draw of Indian true crime shows","news_category":"general","content":"Rakhi*, 22, says she gets panicky when walking along a deserted street at night and looks over her shoulder obsessively to make sure no one's following her.The psychology student who lives in India's financial capital, Mumbai, says she's a fan of true crime shows because she enjoys \"watching how a criminal's mind works\", but confesses to feeling anxious about her own safety after bingeing on them.She is among thousands of Indians who are swiftly taking to popular and at times, sensationalist Indian true crime shows and podcasts on streaming platforms.These slickly-produced shows focus on Indian-born criminals and their evil deeds, shining a spotlight on the country's history of crime.Docuseries like The Indian Predator traces the crimes of serial killers. House of Secrets: The Burari Deaths examines the controversial theories surrounding thedeaths of 11 members of a family  <https:\/\/www.bbc.com\/news\/world-asia-india-44678679>in capital Delhi. The Emmy award-winning drama series, Delhi Crime, is based on thehorrific gang-rape  <https:\/\/www.bbc.com\/news\/world-asia-india-63968198>of a woman in Delhi in 2012.Fans say these shows are creating a lexicon of Indian criminals and crimes that was largely absent before. Rakhi, who grew up watching and reading about American serial killers like Jeffrey Dahmer or Ted Bundy, says she \"now talks aboutCharles Sobhraj  <https:\/\/www.bbc.com\/news\/world-asia-64073271>and Jolly Joseph <https:\/\/www.hindustantimes.com\/kerala\/kerala-s-serial-killer-jolly-joseph-planned-more-murders-cops\/story-5XjfvQ1wj7SjipTqgGL8VM.html>\".The true crime genre is not new to India; pulpy detective magazines from the 2000s often drew inspiration from real-life crimes for their plots as did TV shows like Crime Patrol and CID. But these shows had cheesy graphics and dialogues that inspired humour rather than fear.Fans say that today's web series are more gripping and informative: they explore the criminal's background, mindset and present multiple perspectives on the case.Seema Hingorrany, a therapist, says true crime shows are addictive because they give the viewer a \"high\" by triggering the release of certain feel-good chemicals in the brain.\"They also allow you to vicariously experience extremely thrilling situations without actually putting yourself in harm's way,\" she says.These shows often use visceral visuals to grab attention. In the docuseries The Butcher of Delhi, a scene of the killer butchering a body - though it's out of the frame - is repeated multiple times. There are partially-blurred photos of decapitated bodies, tied-up victims and blood spatters.The show tells the story of Chandrakant Jha, a migrant worker who killed and dismembered several victims - all of them poor migrants - in the 1990s and early 2000s and dumped their bodies in front of a jail, along with notes taunting the police.Director Ayesha Sood says that depicting the violence in such a jarring fashion was a conscious decision, but the caveat was that the violence would be suggested rather than actually shown.\"The fact is that the crimes were brutal and the case was ignored by the media, police and public for years,\" says Ms Sood. \"We sometimes only want to hear about people who are like us - and the news cycle reflects this - but it's important to understand that brutality happens across class, and that we need to pay attention to it wherever it happens.\"Ms Sood says that Indian crime shows - by virtue of their subjects - create room for important conversations around criminality and its genesis in the country, how criminal behaviour is dealt with and what can be done to create safer spaces for everyone.Sukoon Tyagi, who's an avid fan of The Desi Crime Podcast - which highlights crimes from India and other South Asian countries - says that the podcast has made her more vigilant about her safety and that she pays attention to how a victim has escaped a dangerous situation.For Ms Tyagi, the podcast reflects a reality she has always known. She lives in Delhi, which is known for its high crime rate. As per the National Crime Records Bureau's (NCRB) latest report,two minor girls were raped in  <https:\/\/www.livemint.com\/news\/india\/delhi-most-unsafe-metropolitan-city-for-women-in-india-ncrb-data-11661786494155.html>Delhi every day in 2021.\"The crimes that are talked about have been committed in places you know or frequent, so you cannot distance yourself from the fear,\" she says.Some studies say that women are more likely <https:\/\/universe.byu.edu\/2022\/09\/24\/why-women-are-more-likely-to-listen-to-true-crime-podcasts\/> to consume true crime media because they can relate to the victim - who very often is female - and because it helps them gain insight into why and how a crime was perpetrated and what they could do to save themselves if they are confronted with the same situation as the victim.However, critics say such shows and podcasts can sometimes be factually inaccurate and poorly researched. \"These shows are also fraught with ethical issues,\" says Srinath Rao, a Mumbai-based crime reporter. \"There's little to no thought about how the show could impact the victim's or criminal's family\".After the documentary on the Burari deaths released in 2021, several memes <https:\/\/lifestyle.livemint.com\/health\/wellness\/what-burari-death-memes-tell-us-about-the-state-of-mental-health-awareness-in-india-111637020682602.html> about the tragic incident surfaced online. The key message of the documentary, which was to highlight the poor state of mental health in the country, was lost on many as it became a punch line of jokes.The same year, a Netflix series on serial killer Jeffrey Dahmer sparked controversy <https:\/\/variety.com\/2022\/tv\/news\/dahmer-controversy-ryan-murphy-victims-families-research-1235416997\/?sub_action=logged_in> after family members of a victim claimed that they found the show \"traumatising\". A 2019 biopic on serial killer and rapist Ted Bundy, and starring actor Zac Efron,drew the ire of critics <https:\/\/www.insider.com\/zac-efron-ted-bundy-movie-extremely-wicked-shockingly-evil-vile-controversy-2019-1> for \"glamourising Bundy's charisma\" and \"making him look a bit like a rockstar\".Ms Hingorrany says that true crime shows can also trigger anxiety or desensitise a person.\"The criminals depicted often have poor conflict-resolution skills and resort to violence and criminal activity. A person watching these shows could internalise such behaviours unknowingly,\" she says.Ms Sood, however, says that these shows, when made well, can \"push us to look inside and what's happening around us\".\"Fear is a powerful emotion,\" she says. \"It can keep you safe.\"BBC News India is now on YouTube. Click here <https:\/\/www.youtube.com\/@bbcnewsindia> to subscribe and watch our documentaries, explainers and features."}