{"author":"","title":"Richard Bacon and Victoria Derbyshire to leave 5 live","news_category":"general","content":"Richard Bacon and Victoria Derbyshire, two of the biggest names on 5 live, are to leave the station later this year.Shelagh Fogarty will also move on in the autumn as part of a daytime shake-up for the BBC talk radio station.Derbyshire said it would be \"a huge wrench to leave\", while Bacon said he would \"always be grateful\" to 5 live.The new schedule will see Adrian Chiles and Peter Allen host a new mid-morning programme, 5 live Daily, and a new afternoon show on every day but Friday.Chiles will host 5 live Daily in the 10:00 to 13:00 slot on Mondays and Tuesdays, with Allen hosting for the rest of the week.BBC Sport presenter Dan Walker and BBC Northern Ireland's Sarah Brett will co-host the other new show, Afternoon Edition, from 13:00 to 16:00 on Monday to Thursday.Simon Mayo and Mark Kermode's Film Review show will retain the afternoon slot on Fridays after a new Friday Sports Panel between 13:00 and 14:00.Tony Livesey will take on Allen's current role as co-presenter of Drive, with Chris Warburton taking over Livesey's slot on Weekend Breakfast.Punditry show Fighting Talk will also have two new hosts in Georgie Thompson and stand-up comedian Josh Widdicombe.\"Victoria, Shelagh and Richard have all played such key roles delivering fantastic live radio and I wish them every success with their future projects,\" said 5 live controller Jonathan Wall.\"This Autumn feels the right time to refresh parts of our schedule as we follow on from what's already proving to be a wonderful sporting summer.\"\"5 live has been a spectacular place to work, I've got nothing but good things to say about it,\" said Bacon, whose new projects include a BBC One talent search for \"Britain's best amateur painter\".\"It's been a hugely important part of my career and life, and I'll always be grateful, and a listener.\"In her own statement, Fogarty said 5 live had given her \"some of the happiest times and richest experiences\" of her working life.\"I'm very sad to be leaving but it's definitely time to do so,\" she went on. \"I'm spending the summer exploring a number of opportunities, before deciding what's next.\"Derbyshire, meanwhile, spoke about her departure at the end of her show on Tuesday.She said she would be launching a new show \"elsewhere on the BBC\" while revealing she would still be doing \"collaborations\" with 5 live.\"You and I have shared so many experiences so I want to thank you so much for trusting me,\" she told her listeners.\"I will definitely miss all of you.\""}