{"author":"","title":"Inquiry into Christopher Alder body mix-up in Hull continues","news_category":"general","content":"An inquiry into how the body of a man was found in a Hull mortuary 11 years after his family thought they had buried him is to continue, police say.South Yorkshire Police, who are investigating, said they were still waiting to question people over the Christopher Alder case.Mr Alder, 37, died in police custody in Hull, in 1998.Last year, his body was found in a Hull mortuary, indicating that his family had unwittingly buried someone else.Grace Kamara, 77, had been mistakenly buried in his grave and her body was exhumed earlier this year.Both bodies have since been reburied.Det Supt Richard Fewkes, of South Yorkshire Police, said: \"From the outset, it was believed that this would be a complex and lengthy investigation and this has very much proved to be the case.\"Whilst the enquiry is nearing its end, officers are waiting for approval from international authorities to interview a number of people that they believe may be able to assist the investigation, which is causing a slight, but not unexpected delay.\"Once these enquiries have been completed the investigation will enter its final stage and detectives will be in a position to formally approach the Crown Prosecution Service for advice which is required in cases of this nature\"Mr Alder, a former paratrooper, choked to death at Hull's Queen's Gardens police station after being arrested in 1998.He was believed to have been buried in 2000 at Hull's Northern Cemetery but his body was found in a city mortuary last November.His sister, Janet Alder, said she was hopeful there would be \"some kind of positive outcome\" from the inquiry but did not have \"any confidence from past experience\".\"It's totally unbelievable. How can they mix up a 77-year-old woman with a 37-year-old man? There's just so many questions that need answering.\"I really feel sorry for the way my brother's been treated,\" added Ms Alder.Grace Kamara's friend, Christine Omoregie, said she wanted assurances that this would not happen again to anyone else."}