{"author":"By Charlie Haynes","title":"Pre-sex HIV drug should be made available on NHS, MPs say","news_category":"general","content":"A drug that cuts the chances of contracting HIV during sex should be made available on the NHS in England to anyone at risk, three MPs have told the BBC's Victoria Derbyshire programme.Tory MPs Crispin Blunt and Nigel Evans, and Labour's Stephen Doughty said the Prep drug had been proven to be cost-effective during continuing trials.A much cheaper version of Prep could soon be available to the NHS.NHS England said it would \"look at evidence from the trial\".Prep (pre-exposure prophylaxis) is available on the NHS in Scotland and Wales.Mr Blunt told the programme the drug \"should be rolled out fully\".\"[Making it available] for all the people that might benefit will save the NHS money and assist the long-term elimination of HIV,\" he said.Mr Blunt, who is himself gay, added that he believed the stigma around some gay men's lifestyles had influenced the decision not to roll out the drug.Prep is suggested for people who might not have safe sex.\"The issue has not been one of public health, but public attitudes,\" he said.\"The drug is associated with sexual behaviour. That doesn't sit well with those who think there should only be sex within marriage.\"Labour MP Stephen Doughty, who chairs the All Party Parliamentary Group on HIV and Aids, said the drug was a \"life-saver for individuals, and a cost-saver for the NHS\".\"The long-term costs to the NHS of people acquiring HIV and other co-morbidities is going to cost lots, lots more,\" he said.\"It's not just gay men who get infected and live with the consequences. It's many other people\".Mr Doughty said that in Wales, where the drug has been made available to all who can benefit from it, \"not a single person has acquired HIV who is on Prep\".The High Court ruled this week that the patent for the current Prep drug used by the NHS should end, meaning much cheaper versions could soon be available - reducing the potential overall cost to the NHS.Conservative MP Nigel Evans, who is himself gay, told the BBC the \"only blockage\" to the drug was the \"judgemental\" attitudes of those who \"would rather see young gay guys be HIV positive and on expensive drugs for the rest of their lives rather than allow them this protection\".NHS England said that \"while it would be wrong to prejudge the Prep impact trial, it is already expanding, with the number of places available increasing this year by 3,000 to 13,000\".\"The NHS will look at evidence from the trial to expand prevention services in the most effective way.\"Watch the BBC's Victoria Derbyshire programme on weekdays between 09:00 and 11:00 BST on BBC Two and the BBC News channel in the UKand on iPlayer afterwards. <https:\/\/www.bbc.co.uk\/programmes\/b05qqk5c>"}