{"author":"","title":"Bronze handle suggests 'lions used' in Roman Britain executions","news_category":"general","content":"An unearthed bronze key handle suggests lions were used in executions in Roman Britain, archaeologists have said.The handle, which shows a \"Barbarian\" grappling with a lion, was excavated from under a Roman town house, off Great Central Street in Leicester.It also shows figures of four boys cowering in terror.Excavation leader Dr Gavin Speed, from the University of Leicester said nothing quite like it had been found \"anywhere in the Roman Empire before\".\"When first found, it appeared as an indistinguishable bronze object, but after we carefully cleaned off the soil remarkably we revealed several small faces looking back at us, it was absolutely astounding,\" Dr Speed said.The object was found by the University of Leicester Archaeological Services (ULAS) in 2017, then studied at King's College London and the findings have now been published in the journal Britannia.Co-author Dr John Pearce, from King's College, said: \"This unique object gives us our most detailed representation of this form of execution found in Roman Britain.\"As the first discovery of this kind it illuminates the brutal character of Roman authority in this province.\"Roman law sanctioned the execution of criminals and prisoners of war through the public spectacle of throwing them to the beasts, defined by the Latin termdamnatio ad bestias.This form of execution was often used to symbolise the destruction of Rome's enemies - members of tribes who lived outside the Roman Empire and were collectively known as \"Barbarians\".This new evidence of Leicester's Roman past was found along with Roman streets, mosaics floors and a Roman theatre.Nick Cooper from the ULAS said the handle would have been purpose-made in Leicester for a very important house.The town house where it was found stands next to the newly-discovered Roman theatre.\"It's one of the most exciting finds we've had in Roman Leicester and it's got a great story to tell about life in Roman Leicester and the potential evidence it gives for activities that might have taken place in the theatre, or possibly an amphitheatre that we haven't discovered yet,\" Mr Cooper added.\"Within a small handle, about 10cm long, you have a story evolving there of the practice in Roman law where criminals and prisoners of war are condemned to be killed by beasts.\"That was slightly worse than being condemned to the mines, which is the other way that prisoners often met their end.\"The bronze handle will go on public display at Leicester's Jewry Wall Museum which is currently being redeveloped and will reopen in 2023.Follow BBC East Midlands on Facebook <https:\/\/www.facebook.com\/bbceastmids\/>, Twitter <https:\/\/twitter.com\/bbcemt>, or Instagram <https:\/\/www.instagram.com\/bbceastmidlands\/>. Send your story ideas to eastmidsnews@bbc.co.uk <mailto:eastmidsnews@bbc.co.uk>."}