{"author":"","title":"Olivia Pratt-Korbel: Gunman's weapon 'may have malfunctioned'","news_category":"general","content":"A weapon used by the gunman who killed Olivia Pratt-Korbel may have malfunctioned during the shooting, a firearms expert has told a court.Thomas Cashman denies murdering the nine-year-old and injuring her mother at their home in Dovecot, Liverpool.He is accused of chasing and attempting to murder Joseph Nee before Olivia was struck by a bullet to her chest.The jury at Manchester Crown Court has heard two weapons may have been used throughout the incident on 22 August.The court was shown CCTV of a man chasing Mr Nee and firing three shots in the street on Kingsheath Avenue just before 22:00 BST that night.Firearms expert Andre de Villiers Horne said two shots were fired in \"quick succession\" before a third shot was fired five seconds later.He said it was likely one of the first two shots perforated Mr Nee's lower abdomen.Mr Cashman, 34, claims he was not the gunman.Mr de Villiers Horne said of the third shot, it impacted with the wall below the bay window of a property and shattered into fragments.He said: \"The bullet had probably missed Joseph Nee but I cannot exclude the possibility it may have caused a graze wound.\"He said the cartridge case of the bullet, thought to be from a self-loading pistol, was never recovered.The jury were told the bullet that caused the fatal injury to Olivia was thought to be from a different gun, a revolver.Mr de Villiers Horne told the jury: \"It is possible that the 9mm pistol used by the gunman may have malfunctioned during an apparent struggle preceding or during the third discharge.\"For that reason the cartridge case was not ejected as you would normally expect.\"What we now have is the gun malfunctioned, the cartridge case had been discharged, hadn't been ejected, was still located within the gun.\"That would have to be manually fixed before any more shots could be discharged.\"He said a bullet was also recovered from the inside of the front door of Olivia's home.\"It was evident from gunshot residue marks on door that the gun had been discharged in very close proximity, if not touching the internal surface of door,\" he said.Pathologist Dr Jonathan Medcalf said a single bullet had caused three wounds to Olivia, hitting her in the chest before exiting through the left side of her body and then shattering the bone of her upper arm.Forensic scientist Kalwant Chana said two particles of gunshot residue were found on a pair of tracksuit bottoms discovered by police in a box at the home of Mr Cashman's sister Coleen.She said the residue was the same type found on the inside of the front door of Olivia's home after the shooting.She said: \"The findings, in my opinion, provide slightly more support for the proposition that the jogging bottoms had been put on by the firer after the incident, rather than not.\"The court also heard DNA analysis was as would be expected if Mr Cashman had worn the jogging bottoms at some stage.At the start of proceedings on Wednesday, judge Mrs Justice Yip reminded the jury not to go looking for anything relating to the case on the internet.She said: \"Overnight there has apparently been inappropriate, inaccurate content relating to the case being put online.\"That's something I regard seriously. It will be investigated. It shouldn't happen.\"Mr Cashman, of Grenadier Drive, Liverpool, denies the murder of Olivia, the attempted murder of Mr Nee, wounding with intent to do grievous bodily harm to Ms Korbel, and two counts of possession of a firearm with intent to endanger life.The trial continues. Why not follow BBC North West on Facebook <https:\/\/en-gb.facebook.com\/BBCNW\/>, Twitter <https:\/\/twitter.com\/BBCNWT> and Instagram <https:\/\/www.instagram.com\/bbcnorthwest\/>? You can also send story ideas to northwest.newsonline@bbc.co.uk <mailto:northwest.newsonline@bbc.co.uk>"}