{"author":"By Ben King","title":"Big landlords are trying to solve Britain’s renting mess","news_category":"general","content":"Most people in the UK rent from small private landlords, often amateurs, with mixed results. Big investors are now building thousands of properties especially for rent, but will they be a better option?Moving into his new sparkling white flat in a high-rise block in east London, Michael McDonald is looking forward to one thing more than anything else - high speed broadband that actually works.In his last home the internet was broken and the landlord didn't fix it for a whole year. So he can soon finally watch a high-definition film in his own living room.His new flat also comes with a gym, a roof terrace, a 24-hour concierge and special lockers for receiving parcels. There's a table-tennis table, a reading snug and a rentable bedroom and dining room - in case guests come or he wants to hold a dinner party.It costs around £1,600 a month - which he says is not too expensive for a flat 20 minutes from his office in London's Canary Wharf. \"It's quite good for the space we have got. And when you tally up the benefits, it's just as affordable,\" he says.This video can not be playedMichael McDonald likes the idea of renting his flat from a big firmThe developer, Grainger, has built all these extras to lure new tenants and encourage them to stay. But the really unusual thing about the block is that it has been built specifically for renting.So that means Mr McDonald can get a three-year tenancy, not the usual six months. And because the landlord is a large public company, they're unlikely to turf him out because they want to sell up, or move back in themselves.And if the internet breaks, they promise to fix it - and anything else - a bit more quickly.Over the past few years, the number of these \"build to rent\" (BTR) developments has been growing rapidly in Britain, and this month the government gave its official blessing to the rise of the sector in its new national planning policy.Supporters of BTR hope it will increase the supply of housing, improve the quality and choice available to renters, and even transform the growth of cities.The British Property Federation calculates that over 105,000 such homes are either complete or planned across the UK - of which just over half are in London. Next to Wembley Stadium, Quintain is developing what will be the largest BTR project in the UK, with over 5,000 homes.The rest are spread around the country, with big clusters in Birmingham, Liverpool and Manchester. They're not all flats - Grainger is also developing family homes on the site of a former military barracks in Aldershot.Owning rental homes is a good way for pension funds to get steady, reliable income to pay their pensioners, so a growing number are keen to invest. Legal and General, for example, the giant pensions and insurance company, has earmarked over £1bn to invest in BTR.In the US, as well as many European countries this way of renting is much more widespread. In the Netherlands and Switzerland, institutions have nearly half their property investments in residential, whereas it's just 1% in the UK, according to a 2010 survey by data provider IPD.\"We have in the UK a housing shortage,\" says Grainger's chief executive Helen Gordon. \"We know that more people will be renting for longer periods of their lives, and unlike shops and offices we will have a constant demand for occupation.\"Plus rents usually rise with inflation and wages, so for an investor, it's quite a good hedge against inflation.\"But if it makes such good sense, why haven't big institutions invested in rental property before?As any buy-to-let landlord will tell you, looking after tenants is not an easy thing to do. \"There is a lot of detailed work in making somebody's home work for them and in keeping your tenant happy,\" says Ms Gordon. \"Offices or shopping centres have been a much easier prospect.\"Also, until recently property prices were rising so fast that building homes for sale just made more financial sense for developers. Many big developments were sold \"off plan\" before they were even finished.But if you look back far enough, it turns out that institutions used to invest a lot in rental property. Not far from the Wembley Park development in North London is a BTR development from an earlier era.Developed in the 1960s by the Norwich Union Life Insurance Society (now part of Aviva), the Queensmead estate in Maida Vale comprised six blocks of flats. \"Nothing has been spared in making these homes epitomise the high standards of contemporary comfort,\" the promotional literature of the time gushed.The society had investments around the country. It rebuilt the centre of Solihull in the West Midlands, with shops, offices and flats. But by the 1970s, all the homes had been sold off. Only the offices and shops remained.\"Very reluctantly, we came to the conclusion that there was little future for the private landlord in this country,\" Norwich Union's chief estates manager, John Darby, told the society's newspaper in 1976. \"The institutions have been practically forced out of residential ownership by the policies of successive governments since the war. I think this is a great shame.\"Part of the problem was limits to the pace at which they could put up rents. Landlords and investors argue that if they can't put rents up as fast as their costs increase, the investments become unviable.The new generation of build to rent investors fear that history may repeat itself. The 2017 Labour manifesto promised to limit rent rises to inflation - which would limit the investment returns, and the viability of new projects.Michael Allen, director of build to rent at Quintain, the Wembley Park developers says: \"There is clear evidence that where rent control has been imposed, this has led to a decline in institutional investment in the private rented sector.\"Meanwhile, in places like Boston and New York where rent controls are on the decline there has been a strong resurgence in institutional investment.\"In any case, BTR doesn't offer a solution to all the UK's housing market's woes. 100,000 properties is a small contribution to the extra 250,000-300,000 homes needed every year just in England, according to some estimates.And for those who dream of owning their own home, renting from any kind of landlord will always feel like second best.But advocates hope that a better choice of rental homes - with more secure tenancies - will help more people see renting as a viable long-term alternative.Michael McDonald is happy to be a renter. \"I can see myself renting for the next 10-20 years, no problem. It reduces risk.\"At the moment the housing market is all over the place, house prices are higher than ever and nobody wants that risk of a mortgage that you can't afford to pay, especially if the price of the property crashes.\"At least he now has an internet connection. "}