{"author":"","title":"Heat pumps: How do they work and how do I get one?","news_category":"general","content":"The government's flagship green heating scheme has been extended by three years until 2028.The Boiler Upgrade Scheme offers households £5,000 to replace their gas boilers with heat pumps.The scheme was heavily criticised in a recent House of Lords report. The Lords Net Zero Committee has warned take-up is so low the national target for green heating is \"very unlikely to be met\" <https:\/\/www.bbc.co.uk\/news\/science-environment-64710225>.The boiler upgrade scheme was launched in April 2022 to help reduce the cost of more environmentally-friendly heating systems.Grants are available to existing homes and non-domestic buildings in England and Wales, and can be used for:The property must have an eligible Energy Performance Certificate (EPC) <https:\/\/www.gov.uk\/find-energy-certificate> issued in the last 10 years, with no outstanding recommendations to install loft or cavity wall insulation.If that has been recommended, you'll need to insulate your home first, or do it as part of the application process.The scheme is not available if you live in social housing or a new-build property. Private rented accommodation is also eligible but the landlord has to apply.A heat pump is an electrically-powered device which absorbs heat from the air, ground or water around a building.For example, air-source pumps suck in outdoor air and pass it over tubes containing refrigerant fluids to produce heat.This video can not be playedHeat pumps explained in 60 secondsThe Lords Environment and Climate Change Committee heard detailed evidence from industry, the public, and government.Committee chair Baroness Parminter heavily criticised ministers for the lack of progress made and low levels of awareness of the \"seriously failing\" scheme <https:\/\/www.bbc.co.uk\/news\/science-environment-64710225>. The government's own research from Autumn 2022 showed 80% of people in the UK did not know what a heat pump was, let alone had heard of the grant <https:\/\/www.gov.uk\/government\/statistics\/beis-public-attitudes-tracker-autumn-2022>.The scheme has a budget of £150m each year for three years and aims to issue 30,000 vouchers annually. But in the first eight months of operation, only 9,888 grants were awarded.The committee also found there was a lack of training for engineers leading to a shortage of heat pump installers, and said more needed to be done to bring down the cost of heat pumps.A government spokesperson told the BBC: \"We've recently launched a marketing campaign to further increase public awareness, and will consider further options to ensure our targets are met\".The government is providing £5,000 for households to install air source heat pumps (ASHPs) - which would cover between 75% and 50% of the cost.It will provide £6,000 for the less commonly used ground source heat pump (GSHP) or water-source heat pump (WSHP). This would cover between 50% and 30% of the cost of the unit, although the cost of installation (digging a hole, for instance) could be significantly higher.Then-Chancellor Rishi Sunak also announced in the 2022 Spring Statement <https:\/\/www.gov.uk\/government\/news\/chancellor-announces-tax-cuts-to-support-families-with-cost-of-living> that there would beno VAT on heat pumps for five years <https:\/\/www.bbc.co.uk\/news\/business-60849054> in England, Scotland and Wales.The first step is to contact an MCS-certified installer. Find one local to you using this tool. <https:\/\/mcscertified.com\/find-an-installer\/>Once they have provided a quote, the installer will then apply for a voucher from the energy regulator Ofgem, which manages the scheme.If Ofgem approves the voucher, it will send a direct payment to the installer after the work is completed. The householder then pays the remaining balance.Installation must be completed within three months of the voucher being approved for an ASHP, or six months for a GSHP.Originally meant to run until 2025, the scheme has now been extended until 2028. It is operating on a first-come, first-served basis.Heat pumps are normally three times more efficient than gas boilers, but they use electricity to run, and electricity prices can be more expensive than gas.However, given the current high price of gas, heat pumps could still be cheaper.The government says it will look at measures to ensure heat pumps are no more expensive to run than a gas boiler in the long run.A box of about 1m x 1m x 0.4m needs to stand outside - close to, or attached to the property - to draw in air.It should be at least 1m from your neighbour's property so they will not be able to hear it, although it won't be much louder than a fridge.You will also need space inside for a heat pump unit and hot water cylinder. The unit will be about the size of a gas boiler - while the cylinder depends on the size of the home.A ground source heat pump needs much more space outside - either a bore hole as deep as 100m, or a horizontal system dug into the ground over a large area."}