{"author":"","title":"Cardiff Airport: Wizz Air ends flights in and out of Wales","news_category":"general","content":"A budget airline is ending all flights in and out of Cardiff Airport. Wizz Air suspended its winter flights in August <https:\/\/www.bbc.co.uk\/news\/articles\/cv28xyee315o>, over running costs and has now cited the economic climate as the reason for this decision.The Welsh government, which owns the airport, described the move as \"surprising\".Wizz Air said affected customers could have either a 120% refund in airline credit, a 100% cash refund or another flight from one of its other bases.The airline's two remaining winter routes to Milan and Bucharest will cease to operate from 25 January.Customers who have booked with the airline have been encouraged by Cardiff Airport to rebook with an alternative operator at the airport - TUI, Vueling, Ryanair or KLM.All Cardiff-based employees will be offered redeployment opportunities at Wizz Air's two other UK bases, London Gatwick and London Luton.Wizz Air managing director Marion Geoffroy said: \"The challenging macro-economic environment and high operational costs including fuel mean that unfortunately we are unable to continue operating from Cardiff Airport.\"We sincerely apologise to our customers in Wales and the south-west of England for the disruption and inconvenience that this will cause.\"Our priority now is to ensure that all affected customers are contacted directly with clear advice on their options, and to look after our Cardiff based colleagues and crew.\"The company announced its new base at Cardiff Airport in December 2020 - a move that created 40 jobs.At the time, it said it had plans to increase the annual capacity of the airport by more than 350,000 seats.However, it reported growing losses of £381m in the first quarter of 2022 financial year, which it said was down to the effect of fuel costs and recent airport disruption.Cardiff Airport said: \"Our thoughts are with our customers who are impacted by this news and now face disruption to their travel plans for this year, along with our friends and colleagues that are employed by Wizz Air based at Cardiff.\"The Welsh government said its Covid recovery plan remained in place, but the aviation sector was suffering in the current economic climate.Welsh Conservative Leader Andrew RT Davies said this was \"yet another blow to the taxpayer-owned Cardiff Airport\".He added the money spent on the airport since the Welsh government bought it \"could have gone towards sorting out the A&E crisis in the Welsh NHS\".Welsh Liberal Democrat leader Jane Dodds said serious questions now needed to be answered about Labour's strategy for the future of the airport.\"With a bill of £210m since the Welsh government purchased the airport and no sign of things improving, taxpayers will rightly be asking what value for money they are getting.\""}