{"author":"By Daniel Mumby","title":"Glastonbury Festival's Pyramid Stage could become permanent","news_category":"general","content":"The world-famous Pyramid Stage at the Glastonbury Festival could become a permanent fixture, if plans are backed.Festival organisers currently have rolling temporary planning permission but want it to become permanent.It would mean that as well as the festival, it would allow use of the land, on the Somerset site, throughout the year for parties and camping.But local residents are concerned it would change the land from a working farm to a festival and camping site.Anthony and Hilary Austin said: \"If the site becomes a permanent site, we are concerned that additional events could be held on the site without seeking any additional planning.\"The festival creates its own problems due to the lack of accessibility from main roads, having only one entrance off the A361, and we would be concerned should the number of events be increased.\"The permission would also allow the \"permanent regularisation\" of the Pyramid Stage, along with a building currently used for storage and recycling, and the allocation of land to accommodate the temporary festival workforce.According to the Local Democracy Reporting Service (LDRS) <https:\/\/www.bbc.com\/lnp\/ldrs>, the festival would still be subject to its official licence.So even if planning permission were granted, it would still need to comply with the likes of an agreed capacity and a limit on noise.A spokesman for Planning Sphere, representing Glastonbury Festival Events Ltd (GFEL), said: \"The grant of planning permission will provide certainty and secure the future of the largest music festival in Europe.\"There are significant cultural and economic benefits.\"GFEL's temporary planning permission expires in 2024.In 2021, Mendip District Council advised GFEL that a further extension to the temporary permission would not be allowed, since it was \"contrary to best planning practice\" as laid out by central government.Follow BBC West on Facebook <https:\/\/www.facebook.com\/pointswest>, Twitter <https:\/\/twitter.com\/bbcbristol> and Instagram <https:\/\/www.instagram.com\/bbcwest>. Send your story ideas to: bristol@bbc.co.uk <mailto:bristol@bbc.co.uk>"}