{"author":"By Kevin Peachey","title":"Renting: Tenants seek 'bills included’ homes as energy costs rise","news_category":"general","content":"All-inclusive rents are rising up the list of priorities among people searching for somewhere to live, according to property portal Rightmove.The phrase \"bills included\" is second on the list of search terms, having been fourth a year earlier, reflecting the pressure of surging prices.But one student told the BBC that rising rents mean the costs can still \"consume your thoughts\".Property buyers are also widening searches to find an affordable home.Pets have consistently topped the list of search terms for rental properties, according to the Rightmove data provided to the BBC, as people consider landlords' policies on allowing dogs and cats in their properties.Early last year, this was followed on the priority list by searches about whether the property had a garage - as people sought extra space while working from home - and whether the premises were furnished.But, a year on, the term \"bills included\" has jumped to second place. \"Any landlord able to offer this to a tenant is likely to be met with a long queue of applicants,\" said Tim Bannister, property data expert at Rightmove.The growing Build to Rent sector <https:\/\/www.bbc.co.uk\/news\/business-43324486> has been trying to tap into this demand - offering flats that include the cost of bills, and at the higher-end may also provide membership at on-site gyms.Jermaine Browne, co-founder of one such operator - ARK - said it was a \"simple and effective solution\" to financial uncertainty.However, rents can be linked to inflation - so these may have risen sharply as prices have soared.These represent only a fraction of the rental market, and private landlords are far less likely to include bills in the rent.Students are among those who might have access to all-inclusive deals, but Sofia Gauntlett-Palou - who studies at the University of York - said it did not remove the stress of bills.The 20-year-old shares a house with three others, and their bills are included up to a cap set by the landlord.\"We've managed to stay in it by limiting our use - turning off the heating, and using the most appropriate cooker ring,\" she said.\"But I've been stressing that if we go over the cap, I can't guarantee I can afford the excess. It can consume your thoughts.\"The second-year social and political sciences student, who has found another house-share for next year, said she had seen a massive increase in the cost of renting. A shortage of properties meant tenants had little bargaining power.She took a gap year, working in a shop, before university to build up savings to help with living costs, and is planning to work throughout the summer to help pay for next year.\"Finances can take quite a toll on students' wellbeing when also juggling academic work,\" she said.A survey of university students by the website Save The Student <https:\/\/www.savethestudent.org\/accommodation\/national-student-accommodation-survey-2023.html> suggested that 63% of those asked had struggled to pay their rent, up from 53% a year earlier. Many said this had an impact on their mental health.Dan Wilson Craw is the deputy director of Generation Rent, which lobbies for renters. This is his view on the pros and cons of inclusive rents:Some tenants want to buy a first home. House prices may be starting to fall, but not necessarily fast enough to make much of a difference to affordability. Potential first-time buyers are also facing the prospect of higher mortgage rates than they might have expected.The Rightmove data suggests that potential buyers are less certain about what they can afford. Based on search on the portal, this has led to:During Covid, many people searched for inside and outdoor space, creating more interest in rural and coastal areas. The latest data suggests buyers are now increasingly looking to more affordable outskirts of towns and cities, as the cost of living dominates considerations.\"First and foremost, finding a suitable home within budget will be the top priority for most buyers, and our data suggests people are continuing to look further afield and consider more areas in order to do this,\" Mr Bannister said.On Radio 4 and 5 Live we're looking in depth at rented housing in the UK and we want to hear your stories for our Rental Health project at the end of March.What impact is the cost of rent having on you? If you are looking for somewhere to rent are you having to queue to view? What conditions are you living in? If you are a landlord, what pressures are you under?If you are reading this page and can't see the form you will need to visit the mobile version of theBBC website <https:\/\/www.bbc.co.uk\/news> to submit your question or comment or you can email us atHaveYourSay@bbc.co.uk <mailto:Haveyoursay@bbc.co.uk>. Please include your name, age and location with any submission."}