{"author":"","title":"Ukraine invasion: Cardiff, Swansea rallies show support","news_category":"general","content":"More rallies are being held in Wales to show support for Ukraine following Russia's invasion.About 250 people were at one in Swansea and there were others in Aberystwyth and Cardiff amid fighting in Ukraine.First Minister Mark Drakeford has reiterated his intention for Wales to offer a sanctuary for Ukrainians.People are being encouraged to light a candle in solidarity later by Welsh government minister Mick Antoniw, who has family in Ukraine.Sunday's event in the Mumbles was called Standing with Ukraine <https:\/\/www.facebook.com\/events\/3020980918124878\/> and organisers Voice of Ukraine Wales said: \"Together we are strong.\"On Saturday, with rallies around the UK, people gathered in Caernarfon, Gwynedd, to show their support for Ukraine. <https:\/\/www.bbc.co.uk\/news\/uk-wales-60536195>Mr Drakeford told the BBC News Channel that Welsh ministers would meet their UK counterparts to \"plan together for the actions that we can take to help those people who will be looking to rebuild\" their lives due to the invasion.This video can not be playedWatch: A woman can be heard screaming as crowds try to force themselves onto a train bound for Poland\"Wales has an ambition to be a nation of sanctuary,\" he said.\"We've tried to live that out in relation to Syrian refugees and refugees from Afghanistan.\"And we will want to play our part again, as the picture unfolds and as we work with other governments across the United Kingdom.\"Mick Antoniw, the Welsh government counsel general and MS for Pontypridd, has asked people across Wales to light a candle on Sunday evening for Ukraine.\"Lighting a candle is a simple way of showing solidarity; to let the people of Ukraine know that they are in our thoughts and that we are on their side,\" said Mr Antoniw.He returned to Wales on Wednesday after taking part in a delegation to Ukraine <https:\/\/www.bbc.co.uk\/news\/uk-wales-politics-60508111>, which included Plaid Cymru leader Adam Price.Mr Price told BBC Radio Wales' Sunday Supplement that Ukrainian capital Kyiv was a \"city under siege \"in scenes \"beyond any of our imagination\".He said Ukrainians had an \"incredible sense of determination\" and those whom he met had told him \"no matter how long it takes, we will win\".Welsh Liberal Democrat leader Jane Dodds said: \"British and Welsh people are welcoming; they want to do their bit to help Ukrainian's fleeing the conflict.\"UK Foreign Secretary Liz Truss has told the BBC \"we are urgently looking at what more we can do\" tohelp Ukrainian refugees <https:\/\/www.bbc.co.uk\/news\/live\/world-europe-60542877?ns_mchannel=social&ns_source=twitter&ns_campaign=bbc_live&ns_linkname=621b4a1f0ce87e491a0ed4ef%26UK%20government%20wants%20to%20do%20more%20for%20Ukrainian%20refugees%262022-02-27T10%3A06%3A13.871Z&ns_fee=0&pinned_post_locator=urn:asset:f0a08c3c-2338-49c6-bcd7-a147cf06e92a&pinned_post_asset_id=621b4a1f0ce87e491a0ed4ef&pinned_post_type=share>."}