{"author":"","title":"Coronavirus: Ilkley residents 'afraid to go out'","news_category":"general","content":"People living near a Yorkshire beauty spot say they are afraid to go out amid claims visitors are breaking social distancing rules.Large crowds gathered by the river in Ilkley, West Yorkshire, at the weekend, leaving litter including empty bottles and barbecues behind.Councillor Anne Hawksworth said she had been contacted by many people concerned about the spread of coronavirus.She said Ilkley was a \"cautious town\" and people feared infections may rise.The independent councillor said: \"I have been contacted by many residents saying they have no intention of changing their habits of the last 10 weeks.\"One contacted me to say she was terrified of leaving her house when the huge numbers were converging on Ilkley from high density areas, fearing what she called the 'inevitable' second wave.\"Bradford Council has been approached for comment. The spa town is popular with visitors and at the weekend crowds gathered at a section of river known locally as the swing bridge.With no public toilet facilities open, the area was left strewn with dirty nappies and toilet paper <https:\/\/www.bbc.co.uk\/news\/uk-england-52867696>.Ed Duguid, Chair of Friends Of Ilkley Riverside Parks, said: \"Covid has exacerbated what is already a bad situation when we have very warm weather.\"I walked through the park on Saturday and there were large groups of mainly younger people messing around together and there was one group of guys trying to play a game of rugby.\"Then there is the bridge, where people were jumping off into water which is not very deep and others were egging them on. It's crazy behaviour.\"Of course, particularly older people are fearful of what's going on and the R number will start to rise again, the risks will become greater and probably some of them won't want to leave the house at all.\"Mr Duguid has called on the council and police to work together to enforce bylaws put in place to protect the town's environment.Follow BBC Yorkshire on Facebook <https:\/\/www.facebook.com\/BBCYorkshire\/>, Twitter <https:\/\/twitter.com\/bbclooknorth> and Instagram <https:\/\/www.instagram.com\/bbcyorkshire\/>. Send your story ideas to yorkslincs.news@bbc.co.uk <mailto:yorkslincs.news@bbc.co.uk>."}