{"author":"","title":"Covid: Cardiff Airport saw biggest drop in passengers in UK","news_category":"general","content":"Cardiff's airport was hardest hit by the Covid pandemic in the UK last year, seeing an 87% decline in passengers, figures show.Traveller numbers there dropped from 1,656,085 in 2019 to 219,984 in 2020.In Britain and Northern Ireland as a whole, 223 million passengers were lost in 2020 because of coronavirus.Some 74 million people travelled through UK airports in 2020, analysis of Civil Aviation Authority data revealed.This is less than a quarter of the 297 million recorded in the previous 12 months.The Airport Operators Association (AOA) said the statistics showed the \"devastating impact\" of the virus on aviation.Cardiff Airport received a further blow after Aer Lingus' operators Stobart Air went into liquidation <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-57451845> on Friday after failing to find a buyer.Stobart Air had been expected to start services between Cardiff and Belfast at the end of June.The company also planned to fly a service between Cardiff and Dublin from August.After Cardiff, the worst affected airports were Glasgow Prestwick - experiencing a 85.8% decline in passengers - and Exeter (85.5%).Other airports with the biggest drops in passengers included Southampton (83.4%), London City (82.3%) and Leeds Bradford (81.2%).The UK's largest airport, Heathrow, recorded a 72.7% reduction, from 80.9 million passengers in 2019 to 22.1 million last year.The figures include all passengers who travelled through British airports, except the Channel Islands or Isle of Man.AOA chief executive Karen Dee said: \"These figures lay bare the devastating impact Covid-19 has had on UK airports.\"With passengers down nearly 90% between April and December 2020, airports' economic output was decimated and significant numbers of jobs were lost.\"With travellers from every major viable tourist destination currently required to go into quarantine when they return to the UK, Ms Dee warned the UK government's \"overly cautious\" approach to reopening travel meant this summer would be \"as bad, if not worse, than 2020\".In March the Welsh government said a £42.6m grant had been given to Cardiff Airport <https:\/\/www.bbc.co.uk\/news\/uk-wales-politics-56350712> and \"a similar level of debt written off\".The then deputy minister for the economy, Lee Waters, said had they not done this it would have \"gone bust\".\"It would have closed,\" he said. \"We know there are roughly 2,400 aviation-related jobs that would have been directly impacted by that and in total over 5,000 indirect jobs, supported by the airport.\"That would have been a loss to the taxpayer of £115m.\"Cardiff Airport has been approached for comment."}