{"author":"By Chirag Trivedi","title":"What will the Olympic legacy for Londoners be?","news_category":"general","content":"It was a great London Olympics and it could be an even better Games for Londoners.From Team GB's brilliant medal haul, the much-derided transport system coping admirably and the feel-good atmosphere replacing the shameful images of last year's riots, the capital has benefited hugely from hosting the world's greatest sporting event.But can 16 days of euphoria translate into real, long-term improvements for the people of the capital?BBC News looks at some areas where Londoners could see their lives improve thanks to the 2012 Olympic and Paralympic Games.If medals were given out for areas of London which performed best during the Games, the city's maligned transport network would surely win gold.Commuters used to delays on the crowded Tube and congestion on the roads must have wondered how they could cope with the huge numbers of sport fans flooding into the capital.But cope it did. Long-term improvements commuters can look forward to exploiting thanks to the Games include Stratford - with 10 lines in and out it could well be the best connected sporting venue on the planet.There is now wi-fi on the Underground, which was free during the Olympics but will now be paid for. The Thames Cable Car is proving popular - but will it still be a success after the tourists leave? And a number of stations, such as King's Cross, were upgraded or improved in time for the Olympics.There was good co-ordination between train companies and TfL, so when events finished late trains were held, and Londoners would want that to continue.It would also seem to make sense to continue the relaxing of the rules restricting night-time deliveries as long as there are strict noise controls. That would reduce traffic on the roads.But the greatest impact on transport from the Olympics could be on reducing the rush hour, when millions of commuters use the network between 08:00 and 09:00.Part of the transport success story has been the way Londoners changed their work travel patterns.But can this continue?Telecoms company O2 said a survey carried out on 3 August showed there had been a 50% increase in the number of people working flexibly, and an increase of 30% in those working from home.Liz Bingham, from Ernst & Young, which expanded it flexible working for the Games, said: \"Post the Games, more of our people are likely to have greater confidence to choose how, when and where they work, but it's unlikely to be applied on such a grand scale.\"Transport for London said: \"A small change in customer behaviour... can have a disproportionately big impact on how commuting feels.\"It is fair to say the economic impact of the Games has not met expectations.To begin with organisers warned people to stay out of central London as it was thought the huge number of visitors would overwhelm the West End.But retailers and tourist venues complained about a lack of customers. One T-shirt seller in Covent Garden said turnover was down by 30%.According to Experian, only three days during the first 13 of the Games saw higher numbers of shoppers in the West End and East End of London than the previous year.The New West End Company said: \"It was quieter than we forecast in the first week but it recovered with some retailers reporting very strong sales in the last week, particularly with the sale of merchandise.\"A survey of 100 London companies by Deloitte showed 42% reported an increase in demand from customers, compared with 27% reporting a decrease. When surveyed in January, 80% expected an increase and just 4% a decrease.But it is how London has been perceived across the world which could eventually lead to a boost in the economy.Images of a confident, cosmopolitan city coping extremely well with the Olympics and enjoying the event have been beamed across the globe, replacing the shameful scenes of rioting last summer.Mayor Boris Johnson said promoting London to industry leaders during the Games had resulted in \"25 serious business leads\".An Oxford Economics study indicates tourism gain motivated by the Games between 2012-17 is expected at 1.1 million additional visitors worth £650m to London. Mr Johnson claimed London 2012 could generate about £13bn in total.Colin Stanbridge, chief executive of the London Chamber of Commerce and Industry, said: \"Long-term London has just experienced the biggest and most impressive marketing campaign we could've wished for.\"We should reap the benefits in terms of increased tourism and business for years to come as long as we take advantage now.\"Boris Johnson has said the Athletes' Village will be converted into 2,818 new homes and renamed East Village. Half of them will be affordable with families moving in next year.Eventually the Olympic Park will house five new neighbourhoods, with up to 8,000 new homes completed by 2015.East London's Newham Council says it will place 300 families in the park. Its mayor Sir Robin Wales admits it is just a start, saying it is just a \"small number compared to the demand\".Carpenters Against Regeneration Plans, a local group which claims Newham Council plans to remove residents and demolish the Carpenter's Estate adjacent to the park, said: \"I think the housing legacy will be to get on a bus and get out of Newham.\"I think that is what the mayor is hoping to do with a lot of people here - the kind of people he does not want.\"Those that are lower income, those that are poorer.\"Newham Council said residents will not lose out in the major redevelopment of the estate.A spokesman for housing charity Shelter said: \"It's great that after the Olympic Games come to a close, almost half of the homes in the Athletes' Village will be affordable housing.\"With so many families in the capital facing a daily struggle to keep a roof over their heads due to the high cost of housing, these homes will be very welcome.\"IOC president Jacques Rogge described them as \"heroes\" and they got the biggest cheer at the closing ceremony.The 70,000 Games Makers, decked out in pink and purple, were pivotal to the smooth running the Olympics.Prime Minister David Cameron highlighted the fact that half a million people applied to become Olympic volunteers.He said: \"Bottling this volunteering spirit, I  think, is really vital.\"Volunteering England said there was not a shortage of volunteers, but a lack of resources.The government's most recent Citizenship Survey shows Londoners are slightly below the England average in terms of volunteering.About 40% of Games Makers said they had never volunteered before.Sir Stuart Etherington, chief executive of the National Council for Voluntary Organisations, said: \"The spirit of voluntarism is alive and well.\"The challenge now is to harness the energy of this new generation of volunteers.\""}