{"author":"","title":"'First of its kind' tiger habitat opens at Paradise Wildlife Park","news_category":"general","content":"A new habitat, said to be the first in the UK where Amur tigers can be viewed under the water and co-exist with another species, has been created.Land of the Tigers at Paradise Wildlife Park <https:\/\/www.pwpark.com\/> in Hertfordshire features in the new CBBC showOne, Zoo, Three <https:\/\/www.bbc.co.uk\/programmes\/m000n1cw> and opens to the public on Saturday.It features a pool with fish that deep enough for both tigers to be fully submerged.The tigers are \"more relaxed than ever\" in their new home, the park said.The zoo, near Broxbourne, has 800 animals and its two 200kg (441 lbs) tigers, Aleena and Siberia, have been moved to a new 600 sq m (6,458 sq ft) habitat, which the park said was themed to raise awareness of practices such as illegal logging which threaten the species in the wild.Source: Paradise Wildlife ParkThe park said no other Amur tiger enclosure features a pool deep enough for two tigers to be submerged in and it is also the country's first mixed habitat, with the introduction of 41 koi and grass carp.Aaron Whitnall, one of three brothers who run the family zoo, said: \"We are trying with each new habitat to build a story around it, to educate the public as to what is endangering the animals.\"The decision to introduce fish went through an ethics committee - a group of world-renowned vets, keepers and other wildlife experts - who said it was \"fantastic enrichment\" for the animals, Mr Whitnall added.\"You can never eliminate stress completely but the tigers were showing less than 1% of stressful behaviours in their old environment so they were as happy as they could be there,\" he said.\"Since their move they've showed a total behaviour change - they are more relaxed than ever and enjoying their new space.\"Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}