{"author":"","title":"George Floyd death: Ice-T and Chuck D share artist's anti-racism mural","news_category":"general","content":"A street artist who painted a mural to promote unity said he has been \"amazed\" by the attention his work has attracted in light of George Floyd's death.Nathan Murdoch's design in Peterborough depicts two hands joined together to create a heart shape.An image of the work has been shared globally, including by those affected by events in the US, rappers Ice-T and Chuck D and an American footballer.Mr Murdoch, 34, said he was \"happy it's got people talking\". The mural was painted in an underpass in the Millfield area of the city, where he said there was \"racial tension\", in November.Mr Murdoch, from Peterborough, was commissioned to create the work by local charity Diaspora to help use art to highlight anti-racism.He said the hands were partly in colour and partly in greyscale to show \"if we take colour away from who we are, what makes us different? We are all equal\".Mr Murdoch, whose work also includes a tribute to The Progidy's Keith Flint <https:\/\/www.bbc.co.uk\/news\/uk-england-cambridgeshire-47654005>, said he was contacted by a woman in Minneapolis, Minnesota, who was looking for a piece of artwork that expressed how she felt and to encourage a \"different conversation\".He said he was \"amazed that someone from so far away found this picture in Peterborough\".Interest in it has since grown in momentum, with Ice-T's tweet alone being liked almost 16,000 times and retweeted almost 3,000 times.Among those who retweeted Ice-T's post were Public Enemy's Chuck D and American Football player and Super Bowl winner Jahri Evans.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Mr Murdoch said when he heard of Mr Floyd's death it made him think about the artwork \"a lot\".\"I thought about how relevant it is but I never saw it becoming internationally recognised,\" he said.Mr Floyd, 46, died after he was arrested <https:\/\/www.bbc.co.uk\/news\/world-us-canada-52861726> on 25 May in Minneapolis. Video footage showed a white police officer continuing to kneel on his neck even after he pleaded that he could not breathe.The officer, Derek Chauvin, has been charged with murder and will appear in court next week.Protests have been held in Minneapolis, across the US and around the world."}