{"author":"By Morven Mckinnon","title":"Litter-picking eco dog Trinny cleans up park","news_category":"general","content":"This video can not be playedTrinny is helping clear litter while out on walks in her local parksA Border Collie called Trinny is helping clear litter while out on walks in her local park.The five-year-old pet picks up rubbish she finds on the ground and deposits it in the nearest bin.Her owner Alanna Jackson, from Clydebank, said she only needed a little bit of training and it's now a game for the clever canine.She is hoping Trinny's example will encourage more people to keep their local area free from the litter.Alanna said: \"It started because there is a lot of litter in the parks that we walk in on a regular basis.\"When she's not got a toy, she'll sometimes pick up a bottle instead of a toy, trying to encourage me to throw it for her.\"Just from her naturally picking things up when she was out on walks, I've then shaped the behaviour into her putting it into the bin.\"Trinny first gained the attention of locals when Alanna posted a video of her new trick on social media.It was intended to highlight how much litter there was in the community. Over lockdown, local people took part in clean-ups in the area, but Alanna feels the impact of them has been lost.\"It's kind of sad to see that being lost like that, things falling to pieces and litter amounts and fly tipping picking back up again.\"So if a wee something like this can have a positive influence and get people to get a bit more involved and look after the local areas again, then great.\"She also hopes it will encourage children to think twice about littering. \"It is very sweet, it's unusual, it's novel,\" she said \"Obviously from the point of view of children seeing it and being inspired to do something, pick up after themselves, it's great and they all love it, they get really excited seeing her.\"Trinny has also achieved a certificate from the global dog training organisation Do More With Your Dog, where she was awarded expert level for performing numerous tricks.Alanna believes more people can teach their pets to adopt eco-friendly habits with the right training and guidance.\"There's no reason why you can't have a wee bit of fun with it and shape it into some different behaviours,\" she said.\"You can get them cleaning up their own toy box, putting their toys away at home. Who knows, maybe we'll have our own pack of litter picking dogs!\""}