{"author":"","title":"In pictures: 2022 Sony World Photography Awards","news_category":"general","content":"The winners of the Professional category of the 2022 Sony World Photography Awards have been announced, with Adam Ferguson named as Photographer of the Year for a series of self-portraits of migrants in Mexico as they wait to cross the border into the United States.Migrantes is a series of black and white portraits made in collaboration with the subjects. Ferguson set up the equipment and scene, and then allowed the individuals to choose the moment to capture their own image.\"By giving his subjects the shutter release, Adam hands a certain power to the sitter to make that decision on how to be perceived. These photographs are beautiful, meaningful and kind,\" said Mike Trow, chairman of the Professional competition.The series triumphed in the Portraiture category.Here are the other category winners, along with comments from the photographers themselves.Dorf by Domagoj Burilović\"Dorf is the German word for village. In the 19th Century, the Croatian region of Slavonia was inhabited by people from all nations of the Austro-Hungarian empire.\"German colonists made the largest cultural impact through language, crafts and architecture.\"With the extinction of the village, the historic houses that became part of its cultural identity are the first to decay.\"Mellow Apocalypse by Alnis Stakle\"I am interested in the fate of canonised artistic, scientific and journalistic images and their potential to embody contemporary meanings.\"For my collages, I have used images from the open source collections at art museums, scientific institutions and image banks, whose archives may be considered iconic testimonies of the present and the past.\"The Children of the Financial Collapse in Venezuela by Jan Grarup\"More than 8.5 million people in Colombia urgently need help. \"The financial collapse in Venezuela has left many with no access to emergency aid, shelter, clean drinking water or food. Children pay the highest price.\"Living in the Transition by Shunta Kimura\"Gabura Union is located on the south-western coast of Bangladesh. It is one of the most vulnerable areas to the impacts of climate change, and many residents often suffer from its effects.\"The purpose of this photo essay is to capture and communicate the situation for people living quietly in this transition, impacted by climate change.\"Life On Earth by Lorenzo Poli\"Science and religions may all fall short in explaining the incredible miracle of life which, through millennials of evolution, has transformed barren land into a living planet.\"There is an untamed world between sacred and magic, where the essence of life is safeguarded by silence, where the outer and the inner world coincide. This is what I am seeking to photograph.\"Hugh Fox\"A selection of images taken over the last couple of years. \"For me, this series evokes the quiet, isolated, reflective moments I felt during the pandemic.\"The Fox's Tale by Milan Radisics\"Over eight months, I spent almost every night sitting at the window of my cottage in the middle of the forest - where wild animals live almost as neighbours of the villagers.\"The young vixen appears in the village after dusk, circles an hour-and-a-half, and appears in a courtyard several times.\"I set the lights in advance, like in a studio, and waited for the protagonist to walk into the scenes.\"Constellation by Haruna Ogata & Jean-Etienne Portail\"These images were taken in a studio in Paris, in September 2020 - for the pure creation of a still life photo.\"Kuarup by Ricardo Teles\"The Kuarup is a ritual of the Xingu Indigenous Brazilian to honour the illustrious dead - it is the farewell and closing of a mourning period.\"The celebration takes place once a year in different villages, and lasts for three days.The highlight of this celebration is a competition of a martial art called Huka-huka, similar to the Greco-Roman wrestling fight, which has competitive symbolism that shows the strength and virility of the young men.\"The Open competition celebrates the power of single images.Scott Wilson is Open Photographer of the Year 2022 for his photograph titled Anger Management, entered in the Natural World & Wildlife category.The image shows a dirt-caked wild mustang kicking up dust in north-western Colorado, USA.Ezra Bohm, of the Nederlandse Acedemie voor Beeldcreatie, has been awarded Student Photographer of the Year 2022 for his series titled The Identity of Holland.Bohm photographed the residents of close-knit communities in the Netherlands, who maintain a traditional way of life.Tri Nguyen has won Youth Photographer of the Year 2022 for his image Under The Moonlight.The photograph depicts a young man basking in artificial moonlight standing against a derelict background.All photographs courtesy of 2022 Sony World Photography Awards. <https:\/\/www.worldphoto.org\/sony-world-photography-awards-exhibition> An exhibition of the winners and shortlisted work takes place at Somerset House, London from 13 April to 2 May 2022."}