{"author":"By Steffan Powell","title":"Dungeons & Dragons: Why Hollywood is keen on a 50-year-old game","news_category":"general","content":"Nearly 50 years after the first copies of Dungeons & Dragons were sold, the role-playing game is still played in kitchens, living rooms and gaming clubs around the world.Its continued popularity is partly responsible for Hollywood's latest blockbuster adaptation.An estimated 50 million people have rolled dice and used their imaginations to go on a Dungeons & Dragons - or D & D - adventure since its inception.In recent years the game has found new audiences, with pop culture references, social media and the pandemic encouraging people to give it a go.This latest silver screen adaptation of the game (the first one was all the way back in 2000) is another example of the film industry leaning on established intellectual property to encourage people into the cinema.Whether it be Sonic the Hedgehog, Transformers or Middle Earth, famous characters and settings from other mediums have become a mainstay on the movie release schedule.The team behind Dungeons & Dragons: Honor Among Thieves claim they're not exploiting the game's heritage to cash in on fans, but instead want to pay respect to the game's ongoing legacy.This video can not be playedDungeons and Dragons fans explain the game's enduring appealSome might be surprised that a game that hasn't really changed in nearly 50 years, and relies on players imaginations to work, is still relevant in an age of Fortnite and Tik Tok. However, D & D might be more popular now that it has ever been.If you've never sat down for a session, it's basically a game where you role-play a scenario, usually full of unexpected twists and turns, planned and orchestrated by a Dungeon Master.You'll use your mind to take on roles like that of a wizard, thief or barbarian in a fantasy setting. Dressing up in character or using table-top models is optional. Rolling lots of dice to figure out what happens in your story is not.Youtube channel Oxventure, subscribed to by thousands, is an example of how the game has maintained its relevance in the digital age.Channels like this have become increasingly popular, generating millions of views worldwide. According to Jane Douglas, one of Oxventure's founders, the benefits of play for adults is one reason for this success.\"One of the most important things about tabletop role-playing games is that they're make-believe. Playing pretend for grown-ups is not something you get to do an awful lot as an adult.\"It is something that you have to leave behind as a kid and then, with Dungeons & Dragons, I realised actually I can keep doing this. I can play make-believe and tell stories with friends in an entirely new way.\"It's a theme that was echoed by Mike Channel, another of Oxventure's founders, saying it's a \"social experience all about working together and collaborating. I think it's important to as an adult to try and flex your imagination a little bit\".The cast also work as video game content creators and originally played Dungeons & Dragons on YouTube as a one-off, until it became obvious that there was a market of people who wanted to see more.Douglas says: \"We love to tell stories and we're also nerds! I can say that in a loving way. We love rules. We love video games also and they owe a great debt to Dungeons & Dragons, which is the foundation for so much of what we play on our consoles.\"Another of Oxventure's founders, Andy Farrant, says the traditional stereotypes of the game have been challenged recently, leading to new people giving it a try.For some, role-playing games like this are seen as non-inclusive boys' clubs where people are confined to play in dark rooms surrounded by complex rule books.Farrant says: \"One of the barriers to entry for Dungeons & Dragons is that not a lot of people actually know what it is, unless they've played it. I think the TV show Stranger Things has been a big influence.\"It showed lots of people what Dungeons & Dragons was, and I think that changed a lot of people's perceptions of it.\"Ellen Rose, who also works for the channel, says familiarity is a reason it has found such a big audience all these years after it was first created, \"because it's dwarves, elves and rangers and all that sort of stuff. People are familiar with it, which makes it an easier entry point to role-playing games\".They're not the only ones taking advantage of the continued popularity of the game. For example, the YouTube channel Critical Role, of which Dungeons & Dragons is a key part, has nearly two million subscribers.Michelle Rodriguez, who plays Holga in the movie, is adamant this adaptation is not simply trying to cash in on a well-established brand.She told us that the first questions she asked when she was approached about the film were: \"Are you going to mess this up? Do you care? Are you just after money? Are you trying to make a genre movie based on 50 years of free advertising?\"So my first emotion is fear. Then when I read the scripts, it all went away, the writers are actual fans and they care.\"Chris Pine plays the thief Edgin in the film and says that he got into the role-playing game by watching his nephew play.\"The idea that we have to please all the fans is ridiculous and impossible. I think it comes down to the story and if you don't go into a film and feel something, you've screwed up whether or not you've paid attention to all the rules or not - is it a good story? Do you laugh do you cry?\"This intellectual property is so vast and everyone who's ever played the game has a sense of ownership over it, because they've all got their unique stories. It's impossible to keep them all happy but the film captures the spirit of what it is like to play, and that's the best compliment we could have.\"Rege-Jean Page, best known for his role in the first series of Netflix hit Bridgerton, plays a deadpan Paladin.He adds: \"This gives you permission to walk into a room and let your imagination go, remind yourself what the light is inside that you fight through the rest of the world for. That sounds cheesy but it is exactly what this movie is peddling!\"Despite the developments and enhancements of gaming technology, Dungeons & Dragons plays largely the same today as it did when it was invented by American Gary Gygax back in 1975.It came to the UK in the same year after Sir Ian Livingstone and his colleagues Steve Jackson and John Peake played it for the first time. They would end up importing it and founding retail shop Games Workshop.Sir Ian says: \"We became immediately obsessed with the game and ordered six copies because that's all the money we had in the world. Off the back of that order Gary Gygax gave us a three-year exclusive distribution agreement for the whole of Europe.\"He, like us, was operating out of a flat at the time, so it was kind of us all role-playing as businessmen, while also role-playing in the game!\"Dungeons & Dragons was a milestone in gaming history, it opened up your imagination like no game had ever done before, and I don't think any game ever will.\"Despite his instant love of the game back in 1975, Sir Ian says he is still a little surprised that it has gone on to have the lasting impact that it has, laughing: \"Geeks have become chic.\"But we all enjoy stories, we all enjoy worlds of wonder, so why can't we as adults enjoy them? If we can enact part of it as if we were actually there, what's not to like?\"For more gaming content, go to Press X to Continue, the BBC Sounds gaming Podcast. <https:\/\/www.bbc.co.uk\/programmes\/p08x7kb5>"}