{"author":"By Michael Race","title":"Veg shortages drive surprise jump in UK inflation","news_category":"general","content":"The cost of living rose more than expected last month as salad and vegetable shortages helped push up food prices at the fastest rate in 45 years.Alcohol prices in restaurants and pubs also drove up costs for households, as inflation jumped to 10.4% in the year to February from 10.1% in January.Clothing costs, particularly for children and women, rose last month but fuel prices continued to fall.The surprise figures come ahead of a decision on interest rates on Thursday.The UK's central bank, the Bank of England, will decide whether to increase, lower or hold rates as it continues its battle to curb inflation.It has put up interest rates 10 times since December 2021, as it seeks to make borrowing money more expensive and encourage people to spend less, with the aim of stopping prices rising so quickly.To calculate inflation, which measures how prices change over time, the Office for National Statistics (ONS) <https:\/\/www.ons.gov.uk\/economy\/inflationandpriceindices\/bulletins\/consumerpriceinflation\/february2023#main-points> tracks the prices of hundreds of everyday items.It said the continued rise in food costs had been a big factor in February's inflation figure, coming at a time when supermarkets were experiencing shortages of some salad items and vegetables.Tomatoes, peppers and cucumbers were among the goods affected as extreme weather in Spain and North Africa impacted harvests <https:\/\/www.bbc.co.uk\/news\/business-64718826>, and high energy prices hit growers in the UK. Problems with supply chains also contributed to the problem.Along with higher prices for milk, olive oil and eggs, the ONS said the shortages helped push food inflation to 18.2% - the highest since 1978.Read more tips here <https:\/\/www.bbc.co.uk\/news\/uk-61798003>How have you been affected by increased prices? Get in touch.So called \"core inflation\" - which strips out items such as food, energy, alcohol and tobacco which can fluctuate in price - also unexpectedly rose jumping from 5.8% to 6.2%.Until February inflation had fallen for three months in a row and the shock rise was \"depressing\", said ONS chief economist Grant Fitzner. However, he told the BBC the longer term outlook was \"not quite as bleak\".He said inflation was set to fall this summer as energy prices come down. The question here is whether the British economy is now more inflation prone than before, and compared to similar major economies.Last year, a top policymaker told me that there were signs that since Brexit, UK companies were feeling less competitive pressure on profit margins from European competition. This, I was told, was happening all the way up the supply chain, and may be as much to do with EU exporters exiting markets as any specific new trade barrier.Add in the fact that key sectoral labour shortages are especially concentrated in parts of the economy that used to be reliant on EU workers, and the falls in the trade intensity of the UK economy and there is a theoretical explanation for higher inflationary pressures.This month's figure does not prove that case, and nor does a pattern over the past year of the UK having the highest or close to the highest inflation across the G7. For example Italy's fall back in inflation is to do with falls in regulated energy prices. The UK economy remains more dependent on gas prices, directly, and as a factor for electricity prices too.But this \"stickier\" inflation is exactly in line with what would have been predicted. UK inflation will fall over the coming months, as last year's rise in energy bills drop out of the annual comparison. But in the coming months it will matter whether that drop is slower, and inflation remains higher for longer, here than across the world.Does the UK have an inflation problem? Read more here. <https:\/\/www.bbc.co.uk\/news\/business-65037292>Lucianne Allen is sales and marketing director at Aubrey Allen, a wholesale butchers in Coventry which also has a retail shop in Leamington Spa.She told the BBC that packaging and transport were two areas where costs had risen considerably.\"We've had to pass on some of that cost in the last 12 months, but we've absorbed some of it.\"I hope we've seen a peak [in price rises] but inflation continues to be very real and very present.\"Inflation in the UK is higher than in most major developed economies. Chancellor Jeremy Hunt said slower price rises were \"not inevitable\".\"We recognise just how tough things are for families across the country, so as we work towards getting inflation under control, we will help families with cost-of-living support worth £3,300 on average per household this year,\" he added.Labour Shadow Chancellor Rachel Reeves said the latest figures showed that \"nothing\" in the UK economy was working better than it did before the Conservatives took office 13 years ago.Many economists had been expecting the Bank of England to hold rates on Thursday in light of recent fears over the stability of the banking sector, but following the inflation figures most expect a rise to 4.25% from 4%."}