{"author":"","title":"The music photographer trusted by the stars","news_category":"general","content":"When photographer Jim Marshall died, in 2010, he left behind more than a million pictures that captured the true face of music in the 1960s and 70s.From Hendrix burning his guitar at Monterey to Johnny Cash playing Folsom Prison to The Beatles' last concert, Marshall was on hand to not only record the moment but to capture it in such a way as to help define its place in history.A new film, Show Me the Picture: The Story of Jim Marshall, captures the stories behind the images and the man himself, a complex character who fully immersed himself into the culture of the time.His pictures can be found on more than 500 album covers.\"I like to shoot something that is emotionally exciting and people that are visually exciting,\" Marshall told radio journalist David Gans in 1978.\"When the music is right, when the access is right and the light is good, I really get off on it. I'll only photograph people I like. You couldn't pay me enough to photograph someone I didn't like or an event I didn't want to go to.\"Marshall's archive is now managed by Amelia Davis, who worked with him for many years curating his huge body of work.Here are just a few pictures from his archive. Before rock and roll, Marshall snapped the streets around him in San Francisco, recording everyday scenes in bars and coffee shops, but by the early 60s, he was photographing in jazz clubs, capturing John Coltrane and others.Marshall called this 1963 shot of Bob Dylan in Greenwich Village \"Dylan with Tire\".It was taken on Sunday morning as Dylan, his girlfriend Suze, fellow folk singer Dave van Ronk, and his wife, Terri, were heading to breakfast.In 1997, Marshall said: \"Contrary to popular belief, this shot did not inspire the song Like a Rolling Stone.\"No-one really knows where he was coming from but he's one of the most brilliant songwriters of our time.\"In 1967, Marshall shot the three-day Monterey International Pop Music Festival, in California, having been given a free hand by the organisers.\"Jim was really curious, he was inquisitive, and more than wanting to just shoot it, you could tell he wanted to be in it,\" says fellow rock photographer Michael Zagaris.\"He wanted to jump in it and experience it. And he'd capture it too but he wanted to have the whole feel. And I think you get that in his pictures.\"It was in Monterey that Marshall came face to face with Jimi Hendrix. His colour picture of him setting fire to his guitar became a symbol for the changes sweeping music and society but he also shot Hendrix during the sound check.\"All by himself, Marshall wandered around the stage that morning, taking pictures of Hendrix face-to-face, catching him sitting behind the drum kit or soaring into some sustained note on his Stratocaster, wearing that Sergeant Pepper military coat,\" writes music critic and author Joel Selvin.\"These photos snapped in the foggy morning before the gates were even open would be among the most enduring photos ever taken of Hendrix.\"By now, Marshall was shooting for Life magazine, with commissions to photograph bands such as the Grateful Dead and Jefferson Airplane.He photographed Janis Joplin on many occasions, both on and off stage. His pictures of her with Grace Slick, of Jefferson Airplane, were taken for Teen Set magazine in 1967.\"Janis wasn't in the mood to do any pictures that day but I begged her and she came along,\" Marshall wrote in his book Not Fade Away.\"Everyone always thought there was a huge rivalry between Janis and Grace but they were dear friends.\"This is the only time they were photographed together and by the end of the session, we were all getting pretty silly and clowning around.\"Marshall met Johnny Cash in 1962 and, having stayed in touch, was asked to shoot a concert Cash was giving in Folsom Prison and subsequently another to the inmates of San Quentin, CaliforniaTaken during the sound check, this shot captures Cash's reaction when Marshall suggested they shoot a picture for the warden.This picture of Miles Davis in the ring came about after he saw Marshall had taken some beautiful pictures of John Coltrane.Davis asked Marshall why he didn't take pictures of him like the ones of Coltrane, to which Marshall replied: \"Why don't you let me?\"Marshall also recalled Davis telling his sparring partners not to hit him in the mouth as he was playing that night.Life magazine contracted Marshall to photograph the Rolling Stones US tour of 1972.Once again, his pictures were on the cover. His ability to get close with a wide-angle lens gave the work an intimacy rarely seen.By the mid-1970s Marshall, who had been taking drugs for some years, began to fade from the music scene, though he still shot stills on the set of the TV show Streets of San Francisco in 1975.Amelia Davis worked with Marshall on his archive for the last 13 years of his life.\"I think I got Jim when he was much mellower, for sure, because I've heard all the stories from when he was younger,\" she wrote.\"He'd had a lot of time to reflect on his life and regret some of his choices. \"I don't think he regretted his life, because he'd lived it the way he wanted to live it.\"But there were things along the way that he wished he hadn't done.\"Graham Nash, of Crosby, Stills and Nash, noted Marshall's ability to get the shots.\"He was pushy but in a really human way,\" he said.\"Every artist that he shot knew that Jim wanted the best shot of them, he always wanted that.\"Artists trusted him. They knew he wasn't going to ask questions like, you know, who you slept with last night, and what colour socks have you got.\"People trusted Jim Marshall and I think it shows in his work.\"Show Me the Picture: The Story of Jim Marshall directed by Alfred George Bailey is released across the UK from 31 January and an exhibition of his work can be seen at the Royal Albert Hall in February.Jim Marshall: Show Me the Picture is published by Chronicle Books.All photographs courtesy © Jim Marshall Photography LLC"}