{"author":"By Miriam Barker","title":"Ukraine crisis: Woman speaks of 'horror' as Russia attacks","news_category":"general","content":"This video can not be playedOlena Escott has been given a six month settlement visaOlena and Joseph Escott have been married for 20 years, splitting their time between Wales and Ukraine.Mrs Escott was in Odesa in the south of Ukraine, whilst Joseph was in Tredegar when the war began.She made the decision to get to Moldova to escape the invasion.But in escaping, she had to leave behind her son, who has congenital heart disease, but is not allowed to leave Ukraine because men under 60 have to stay to help with the war effort.\"People are afraid and people are in shock, it's like they don't believe it's real, that it's reality, because nobody was thinking it would happen.\"It's a bit like a horror - you don't know where to run, you don't know what will happen next, you live like [that] every day and go to sleep and you don't know if you will wake up or not,\" Mrs Escott said.She said the noise caused by the fighting is so loud you can go deaf for an hour afterwards.Mrs Escott said she finds it hard to comprehend what is happening to her country and spoke of the upset of having to leave her son behind.\"They have prepared the cellar and have put their blankets, pillows, some food and water, in case they hear anything, then they go there.\"I don't know if it's safe or not there, but at least they have a little space to hide when there will be bombing,\" she said.When Joseph Escott heard about the war, he flew to Budapest and then drove to find his wife at the Moldovan border.He is frustrated at how long it took his wife to get a visa and disappointed that it was only for six months, despite the couple being married for 20 years.\"We go to the visa centre, only to discover that it had moved three months earlier and they hadn't updated the visa centre site online.\"So we had to travel another 45 minutes to get to the visa centre and when I got there I said I need to make an application for my wife to go to the UK.\"The officer said have you got the link, and I replied saying 'what link?', and he said 'they should have sent a link to you if you've already spoken with them.'\"I said I've received no such link and no such information - and it was at that point that I was totally exhausted and I broke down.This video can not be playedUkraine: First Minister call for checks on refugees after travel\"I was on my knees, I was literally on my knees to discover that nobody had taken the time out to help me, a British citizen, to get through this,\" he said.In response, the Home Office said they stand shoulder to shoulder with Ukrainians and have made it easier for people with Ukrainian passports to come here and for Ukrainians in the UK to stay here.A spokesperson said: \"We have expanded our Visa Application Capacity to 13,000 a week, deployed additional staff across the EU, with a 24\/7 helpline in place to ensure those who need appointments can get them to come here. This allows us to balance security risks while welcoming those in need.\"A new sponsorship route, which will allow Ukrainians with no family ties to the UK to be sponsored to come here is also being brought forward and all the measures we've put in place follow extensive engagement with Ukrainian partners. We will keep our support under constant review.\""}