{"author":"By Gareth Evans","title":"Raymond Dearie: Who is the special master reviewing seized Trump files?","news_category":"general","content":"The removal of top secret documents from former President Donald Trump's Florida home last month marked a new and dramatic phase in the investigation into his handling of classified material.In the weeks since, lawyers for Mr Trump have been wrangling with the Department of Justice over - among other things - whether to appoint a third-party lawyer to review the files and who that person could be.Both sides found rare common ground when Mr Trump's team proposed Judge Raymond Dearie as a candidate to be the so-called special master. The justice department did not object, and he has now been formally appointed to the role.The 78-year-old is a veteran New York judge who was first nominated by Republican President Ronald Reagan in 1986.He covers the Eastern District of New York, which includes Brooklyn, Queens, Staten Island and Long Island and is one of the busiest legal districts in the country.Judge Dearie served as chief judge in the district from 2007 to 2011, and is now a senior judge there. Senior status is a form of semi-retirement for long-serving judges.During his decades-long career in the city he has presided over numerous high-profile cases involving organised crime, heroin smuggling, murder, extortion, and terrorism.As the New York Times reported after he changed roles in 2011 <https:\/\/archive.nytimes.com\/cityroom.blogs.nytimes.com\/2011\/04\/08\/federal-judge-to-take-on-new-role\/>, Judge Dearie's extensive case history includes that of an an Afghan immigrant who conspired to detonate a bomb in the subway as well as a former baggage handler who was accused of stealing the Duchess of York's jewels.\"I do not think he will be daunted by the [Trump documents] case,\" Steve Gold, a law professor who previously worked as a clerk for Judge Dearie, told the BBC. \"He has handled major cases and intense media interest.\"Judge Dearie has also shown a willingness to protect government secrets - something that appears relevant in the Mar-a-Lago case.In one trial of an al-Qaeda suspect, he allowed British MI5 officers to protect their identities by wearing wigs, glasses and makeup. Judge Dearie then instructed the courtroom artists to only draw them with \"blank faces\" and \"generic hair\".\"[He was] always mindful of the fact that his decisions had real consequences for real people,\" Prof Gold said.In 2012, Judge Dearie was appointed by Supreme Court Justice John Roberts to a seven-year term on the United States Foreign Intelligence Surveillance Court. This secretive court in Washington handles requests by investigators for surveillance warrants against suspected spies and foreign agents in the US.During his time on that court, he was one of the judges who signed off on a request from the FBI and Department of Justice to monitor Mr Trump's former campaign adviser, Carter Page, as part of the investigation into Russian interference in the 2016 election.As the justice department wrote in a recent filing <https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.flsd.618763\/gov.uscourts.flsd.618763.86.0.pdf>, Judge Dearie (along with its two original nominees to be special master) has \"substantial judicial experience... including federal cases involving national security\".One of his most high-profile moments came in 2015 when he presided over the corruption cases of officials at the governing body of world football, Fifa.At the time, when Judge Dearie faced a sudden flurry of international media attention, lawyers who had appeared in his courtroom spoke of his character and reputation. They told Reuters that he was widely respected, fair and calm.\"He rarely loses his temper,\" one New York lawyer said.\"Judge Dearie is scrupulously fair,\" Prof Gold told the BBC. \"As a judge, he applied the law. It speaks volumes that Trump proposed him and the justice department did not object.\"Judge Dearie will sift through the seized material and decide whether any of the hundreds of classified documents are covered by attorney-client privilege - a part of US law that allows people to keep conversations with their lawyers private.Mr Trump's legal team have also claimed executive privilege over the documents, which allows presidents to keep certain communications under wraps.But the justice department has argued that the former president cannot assert this privilege as he is no longer in office.Judge Dearie will review the documents and then submit his recommendations or findings to the judge in the case. He has been given a November deadline for this work.If any of the seized documents are deemed to be protected by privilege, they could not be used in any potential legal proceedings.It's worth noting that, in theory, the special master can help with anything the judge needs. But legal analysts expect Judge Dearie to be primarily tasked with determining what - if anything - is covered by privilege."}