{"author":"By Shazia Ali","title":"Islam: Winning photo celebrates Muslims' Wales connection","news_category":"general","content":"A photograph of a woman gazing over Snowdonia has won a competition celebrating Islam in Wales.The image, taken by Muhammad Muhsin Abd Rahman from Wrexham, was set above Llanberis in Gwynedd.Judges said it captured the spirit of reflection and connection with nature at the heart of Islam with echoes of the Prophet Muhammad seeking solitude.The competition also aimed to mark Muslims' everyday relationship with landscapes, people and places in Wales.The contest was a collaboration between Cardiff University's The Centre for the Study of Islam in the UK, the Muslim Council of Wales and Muslim creatives platform Now In A Minute Media.Second place went to Abyd Quinn Aziz from Cardiff for his lively shot of laughing Muslim girls waving in the centre of the city.Judges said the candid shot captured the \"energy, vitality and spontaneity\" of life encapsulated the \"everyday\".Sajad Ahmad won third place for his sunset shot of Bracelet Bay and Mumbles Head on the Gower Peninsula.He said: \"Just like in Islam, much of photography rotates around the sun.\"It's the sunset shot, the sunrise event and the changing weather that most often produce good images.\"In Islam, we look towards the sun to work out our five daily prayer times. I find it interesting that often, after every one of the sunset images that I have taken, there has been a prayer linked directly after it.\"The competition aims to mark Muslims' everyday relationship with landscapes, people and places in Wales.Abdul-Azim Ahmed, deputy director for The Centre for the Study of Islam in the UK, said: \"Islam has long been a Welsh religion, and the entries showed that from the everyday to the landscapes.\"The photos have been exhibited by Now In A Minute Media, to showcase the Muslim creative scene in Wales.Co-founder Mariyah Zaman said: \"There has never been a space to fully express myself as being proud in my Welsh identity, my Muslim identity and my passion for creativity - and now there is.\"Islam is a way of life, and the response around the importance of having an open and honest discussion around our relationship with creativity as Muslims was hugely well received.\"There's a hunger for this, and it was really pleasant to see the conversations around Muslim life in Wales cultivate.\"There's always a huge pressure to move out of Wales to 'make it', which is such a shame.\"It was really important to have an exhibition that said 'Look at all the Muslim talent, right here on our doorstep here in Wales'.\""}