{"author":"","title":"Humza Yousaf to announce cabinet after being sworn in","news_category":"general","content":"Humza Yousaf is beginning the job of shaping his new government after being officially sworn in as Scotland's first minister.Mr Yousaf took the oath of office during a short ceremony at the Court of Session on Tuesday morning.He will soon begin to announce his ministerial appointments.Kate Forbes, the finance secretary he narrowly defeated in the SNP leadership contest, is leaving government after turning down a move to rural affairs.BBC Scotland political editor Glenn Campbell <https:\/\/twitter.com\/GlennBBC\/status\/1641007115417387008> said he understands that Ms Forbes felt the SNP's partnership agreement with the Scottish Greens would have \"tied her hands and cost her dearly in her constituency\".Ivan McKee, who had been the business minister under Nicola Sturgeon, will also leave the government.Mr McKee had initially been campaign manager for Ms Forbes in the leadership contest but stepped back from that role after early controversies in her campaign.He was offered a job by Mr Yousaf that he viewed as being a demotion and will now not be a part of the new first minister's team.Potential members of Mr Yousaf's new ministerial team, including his leadership campaign manager Neil Gray, have been arriving at his Bute House residence throughout the morning.He has already confirmed that Shona Robison - a close friend of Nicola Sturgeon - will serve as his deputy first minister.Ms Robison, who as social justice secretary played a key role in introducing the controversial gender recognition legislation, was one of the MSPs who nominated Mr Yousaf for SNP leader.The first minister has also re-appointed Ms Sturgeon's chief of staff, Colin McAllister, to the same role.During the SNP leadership campaign Mr Yousaf said he favoured a \"big tent\" rather than \"inner circle\" approach to making key decisions and has pledged to bring the party back together again after deep divisions were exposed by the contest.He faced withering criticism of his own ministerial record from Ms Forbes in a live STV debate, while her views on issues such as gender recognition reform and gay marriage led the Scottish Greens to question whether they could work with her.Given the narrow margin of his victory over Ms Forbes, by 52.1% to 47.9%, some of her supporters had urged Mr Yousaf to keep her in government.The BBC understands she was offered the job of rural affairs secretary - which would generally be regarded as a demotion from finance secretary - but turned it down and will return to the backbenches.She later tweeted that Mr Yousaf had her full support and she had \"full confidence that he will appoint a talented cabinet and ministerial team\".Scottish Conservative chairman Craig Hoy said Mr Yousaf had \"poured petrol on the SNP civil war\" by effectively trying to demote Ms Forbes despite her being backed by almost half of the party members who voted in the leadership contest.Ms Robison told BBC Radio's Good Morning Scotland <https:\/\/www.bbc.co.uk\/programmes\/b0074hf7> that the new cabinet's number one priority would be the cost of living crisis.She also denied Ms Forbes had been snubbed by the new first minister.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Ms Robison said the first meeting Mr Yousaf had after being confirmed as the SNP's new leader on Monday was with Ms Forbes at Murrayfield.\"He made clear that he wanted Kate to be in government and they spoke on a number of occasions over the last two days about a role in government,\" Ms Robison said.\"I understand the discussion was very cordial and was very much centred on what Kate's thoughts were.\"I really hope Kate makes a return to government at some point in the future.\"Asked if Ms Forbes had been offered a demotion, Ms Robison told the BBC all government roles were important.She added: \"I know that the first minister was prepared to look at other roles, but after consideration it was Kate who made it clear that she wanted out of the spotlight.\"Ms Robison also confirmed she would not be taking up the post of health secretary for a second time.Another key supporter of Mr Yousaf's leadership campaign, Neil Gray, is also tipped for an important role in his government.Humza Yousaf is the first member of an ethnic minority to lead the Scottish government and, at 37, he will be the country's youngest first minister.He was nominated as first minister at Holyrood on Tuesday, securing 71 votes from SNP and Green MSPs with whom he plans to continue a power-sharing agreement.He formally becomes first minster once he has taken the official oath in front of the Lord President of the Court of Session and other senior judges on Wednesday morning.Mr Yousaf has confirmed that he intends to appoint a \"minister for independence\", something he had promised during the hustings.Prime Minister Rishi Sunak called him on Tuesday afternoon to congratulate him on his new role.Mr Sunak is said to have \"reiterated his desire to continue working constructively with the Scottish government\" to deliver on what he argued were the \"peoples priorities across Scotland, including the need to half inflation, delivering growth, and cut waiting times.\"Mr Yousaf raised the issue of an independence referendum, but Mr Sunak suggested this would \"distract\" from \"delivering on the things that are top of the priority list for people across Scotland\".The first minister designate tweeted that they had a \"constructive discussion\" on a range of issues, including helping people through the cost of living crisis.\"I also made clear that I expect the democratic wishes of Scotland's people and Parliament to be respected by the UK government,\" he added."}