{"author":"By Chris Dearden","title":"Water pollution from metal mines will cost Wales £282m, NRW says","news_category":"general","content":"Ending pollution from old lead, zinc and copper mines in Wales will cost as much as £282m, Natural Resources Wales has said.The organisation has identified 129 disused sites causing problems to nearby rivers and streams.Metal pollution can devastate insects and snails, and leave some rivers with no fish.The Welsh Conservatives said many problem areas were identified almost 20 years ago.They said work to stop the pollution must happen quicker. Natural Resources Wales (NRW) said it has had £5m from Welsh government this year alone, and is developing ways to deal with the problem - including a treatment plant which is the first of its kind in the UK.Wales has more than 1,300 abandoned metal mines, affecting more than 67 bodies of water and more than 370 miles (600km) of river.Many mines on NRW's \"red list\" have been out of action for more than a century.However, they are still leaking masses of metal pollution every year - rainwater can get into mine shafts or soak through old spoil heaps, and streams sometimes overflow into mines.At Parys Mountain, on Anglesey, NRW said 231 tonnes of metal pollution was leaking into the Irish Sea from an old copper mine every year.And Abbey Consols, near Pontrhydfendigaid, in Ceredigion, has created a 15km (nine miles) long \"plume of pollution\" in the River Teifi.The Welsh Conservative shadow climate change minister, Janet Finch Saunders MS, said: \"It's nearly 20 years since the Welsh Labour government identified these troublesome mines and the devastating impact they have on Welsh rivers, yet very little remedial action has been undertaken.\"If ministers are serious about their climate change obligations, then we need to see far more action from the regulatory body, Natural Resources Wales, in tackling serious issues such as metal mines.\"Earlier this week, we had a grave warning about the environmental challenges in front of us. It's now time Labour ministers led from the front and ensured NRW does its job properly and effectively and protects Wales' environment.\"At Abbey Consols mine, lead was last mined in about 1910. Work begins next month on the next phase of a £1.2m scheme to stop metal pollution from the mine getting into the River Teifi below the old workings.Peter Stanley, NRW's abandoned mines senior specialist advisor, said: \"We have both problems here. Water is getting into the old mine shaft and also running off old spoil heaps.\"The impact on the Teifi is a polluting plume that extends 15km down river. \"What we do is to try and stop water entering the mines. Sometimes we divert a stream to stop it getting into a mine shaft, but we can also treat water that comes out of a mine or we can cap spoil heaps.\"It is costly work. As well as stopping the water getting in, we've been investing heavily in research to develop new ways to treat it and remove the metal pollution.\"He added that Abbey Consols will be the first metal mine water treatment system in the UK \"and possibly the world\", using sodium carbonate to treat the water and remove metal pollution.\"Wales has been investing heavily in this area and we're now developing a level of expertise which will allow us to move forward in tackling the problem in new and innovative ways in the coming years.\"The Welsh Government said it had put £9.5m into improving the water in streams, rivers and lakes this financial year.It said Wales faced \"significant\" water management issues and some could be addressed, but problems like legacy chemicals would affect the nation's waters \"for decades to come\"."}