{"author":"By Darren Waters","title":"Homelessness figures on the rise in Wales","news_category":"general","content":"The number of households classed as homeless in Wales rose 10% in the year to June 2010, latest figures show.Shelter Cymru said it was seriously concerned about the impact of mortgage and rent arrears on homelessness.It has called for a Welsh Assembly Government scheme, which helped families meet mortgage payments, to be widened.The assembly government said the scheme was an emergency measure applied only during the recession.It said it had to narrow eligibility for the scheme after funds were exhausted.Eligibility was limited after it became a \"victim of its own success\", Shelter Cymru said.There were 1,467 households accepted as homeless in Wales by local authorities, according to the Office for National Statistics [ONS].The rise in number was largely driven by an increase in those people who lost accommodation that was tied to a job, or occupants who were required by a landlord to leave a rented property.Housing charity Shelter Cymru said it had seen a big increase in the number of queries it received relating to mortgage arrears.\"The proportion of mortgage repossession cases handled by Shelter Cymru advisers has trebled over the last three to four years,\" said Ceri Dunstan, from the charity.Shelter said it was concerned that welfare and public sector cuts would lead to a reversal in a recent decline of homelessness due to mortgage repossessions.Ms Dunstan said: \"In our view, the cuts proposed by the Westminster government to housing benefit and local housing allowance [the housing benefit paid to tenants in the private rented sector] will only make this situation worse.\"The figures from the ONS show that the number of people in Wales who have been made homeless due to rent arrears has risen over the last 12 months.The main reason for homelessness was a parent, friend or relative no longer providing accommodation, the ONS figures said.There is also concern that while homelessness due to mortgage arrears has fallen in recent months, it could rise again now that the successful Mortgage Rescue Scheme (MRS) operated by the Welsh Assembly Government has narrowed its eligibility criteria.\"It's very unfortunate, but the MRS just seemed to be a victim of its own success and all the funding it had was allocated in the first few months of the year,\" said Ms Dunstan.She added: \"It's a great shame, as the scheme was very effective - more than 600 adults and 300 children who would otherwise have gone through repossession were able to stay in their homes.\"Shelter Cymru said it was lobbying hard for additional funding to be found to continue the scheme more fully in the next financial year.A Welsh Assembly Government spokesperson said the growing number of repossessions was \"a matter of concern\".The spokesperson said: \"We have invested £138,000 over the last two years in a housing debt helpline which offers telephone-based counselling to anyone at risk of losing their home.\"We have also worked with the court system to ensure that mortgage lenders have to provide evidence that they have taken all other steps available to them before resorting to repossession.\"The Welsh Assembly Government calls on lenders to act responsibly and not to take repossession actions unless it is an absolute last resort. Home owners who are getting into difficulties should be given early advice to prevent problems escalating.\""}