{"author":"By Jonathan Amos","title":"Wildlife Photographer of the Year: How many crocodiles can you see?","news_category":"general","content":"How many crocodiles can you count in this picture? One hundred, maybe?You're forgiven for doing a double-take because you don't immediately register that this male gharial croc's back is entirely covered by its young.The image was captured by expert photographer Dhritiman Mukherjee <http:\/\/www.dhritimanimages.com\/>. His shot, snapped in India's National Chambal Sanctuary, is highly commended in this year'sWildlife Photographer of the Year (WPY) <https:\/\/www.nhm.ac.uk\/wpy\/> competition. Every one of these youngsters needs to survive into adulthood and to breed. The freshwater gharial (Gavialis gangeticus) is critically endangered <https:\/\/www.iucnredlist.org\/species\/8966\/3148543>. Where once it could have numbered more than 20,000 animals across South Asia, the species is now down to perhaps less than 1,000 mature individuals - and three-quarters of these are concentrated in the Uttar Pradesh sanctuary.\"This male had mated with seven or eight females, and you can see that it was very much involved,\" explained Dhritiman. \"Normally the gharial is quite a shy crocodile compared with the saltwater and marsh crocs. But this one was very protective and if I got too close, it would charge me. It could be very aggressive,\" he told BBC News.The male gharial sports a fabulous bulge on the end of its snout that is reminiscent of a round earthenware pot, or \"ghara\" in the Hindi language.\"It's a structure that enables vocal sounds to be amplified,\" said Patrick Campbell, the senior curator of reptiles atLondon's Natural History Museum <https:\/\/www.nhm.ac.uk\/>, which runs the prestigious WPY competition. \"Other crocs carry their young about in their mouths. Very carefully, of course! But for the gharial, the unusual morphology of the snout means this is not possible. So the young have to cling to the head and back for that close connection and protection.\"The gharial's decline is a familiar story of habitat loss. This has been driven principally by dams and barrages that have disrupted river flows. Sand extraction and boulder removal have restricted nesting opportunities. And then there's the perennial problem of animals getting caught up in fishing gear.\"Rear and release\" programmes appear to have at least stopped this species going over the edge. But a big effort is now needed if this extraordinary animal is to have a long-term future.Dhritiman hopes he can help spur that endeavour by linking the emotion displayed in his images to the science that's required for successful conservation.Otherwise, the only place you'll be able to see the gharial will be in museums - as the taxidermy specimens, like those held by the NHM.Dhritiman's picture at the top of this page is highly commended in the Behaviour: Amphibians and Reptiles category of WPY. The winners of the 2020 Wildlife Photographer of the Year competition - its grand prizes and category winners - will be announced on 13 October.However, because of the global impact of Covid-19, the awards ceremony will be held online. This will be hosted by the well known TV presenters Chris Packham with Megan McCubbin.The Natural History Museum's popular WPY exhibition, showcasing the best images, is to go ahead as normal from 16 October.Tickets are on sale <https:\/\/www.nhm.ac.uk\/visit\/exhibitions\/wildlife-photographer-of-the-year.html> this week.Twenty-twenty is year 56 for WPY. The competition was initiated by BBC Wildlife Magazine, then called Animals, in 1965. It is now wholly organised by the NHM.Also highly commended (Behaviour: Birds) this year is this picture of yellow-billed choughs battling the winds high up on the Alpstein Massif in the Swiss Alps. The perfectly framed silhouettes of the birds were captured by Alessandra Meniconzi. Anyone who has been skiing in the Alps will probably have seen these animals because they will often scavenge discarded human food around holiday resorts. Alessandra said their shrieking was \"so loud and insistent in the dramatic landscape, it was like being in a thriller movie\".If you can dare to look... this rather gruesome picture is of a large wandering spider making a meal out of an egg from a giant glass frog. The image was taken by Spanish photographer Jaime Culebras in a stream in Manduriacu Reserve in northwestern Ecuador. To consume the egg, the spider injects digestive juices and then sucks back the liquefied products. This female spider, which has a leg span of 8cm, spent more than an hour in front of Jamie's camera lens devouring the frog's eggs. This particular picture was highly commended in theBehaviour: Invertebrates category. Jonathan.Amos-INTERNET@bbc.co.uk <mailto:Jonathan.Amos-INTERNET@bbc.co.uk> and follow me on Twitter:@BBCAmos <https:\/\/twitter.com\/#!\/BBCAmos>"}