{"author":"","title":"British doctor 'punches shark' in Australia surfing scare","news_category":"general","content":"A UK doctor says he escaped a shark by punching it in the face after the animal injured him in Australia.Charlie Fry, 25, was at a beach north of Sydney on Monday when the shark \"jumped out of the water and hit him in the right shoulder\", police said.Dr Fry said he punched the shark while in the water before climbing back on his board and surfing to shore.He said he had been inspired by surfer Mick Fanning, who famously fended off a shark <http:\/\/www.bbc.co.uk\/news\/world-africa-33585853> during a competition in 2015.The shark left scratches and a small puncture wound on Dr Fry's arm. Police said the animal was about 2m (6.5ft) long.\"I saw this shark come out of the water and breach its head and I punched it in the face with my left hand,\"Dr Fry told local Nine Network's Today programme <https:\/\/www.9news.com.au\/national\/2017\/11\/13\/20\/54\/shark-attack-avoca-beach-central-coast-charlie-fry> on Tuesday.\"When it happened, I was like, 'just do what Mick did, just punch it in the nose,'\" he said.He described the contact as \"a massive thud on my right-hand side, which completely blindsided me\". He said he feared for his life during the incident, which happened near shore at Avoca Beach.Dr Fry received treatment in hospital and has since been discharged.A helicopter rescue service photographed what is said was most likely a bronze whaler shark nearby shortly afterwards.Dr Fry arrived in Australia two months ago and works in a hospital on the New South Wales coast, local media reported.The beach was closed on Tuesday, council authorities said.This video can not be playedSurfer Mick Fanning: \"I punched the shark in the back\"There have been 18 shark attacks - including one fatal incident - in Australia this year, according to theAustralian Shark Attack File <https:\/\/taronga.org.au\/conservation\/conservation-science-research\/australian-shark-attack-file\/2017>."}