{"author":"By Laurence Peter","title":"Ukraine war: Russian strike on eastern city Kostyantynivka 'kills six'","news_category":"general","content":"Ukraine says heavy Russian shelling has killed at least six civilians in Kostyantynivka, an industrial city near embattled Bakhmut in eastern Ukraine.Missiles and rockets damaged 16 apartment blocks and other buildings including a nursery school, head of the presidential staff Andriy Yermak said on social media.The toll was not verified by the BBC.The city is just 27km (17 miles) west of Bakhmut, where many have died on both sides in months of heavy fighting.Mr Yermak said the Russians hit Kostyantynivka with S-300 surface-to-air missiles and Uragan rockets, and at least eight people were injured.The city is near Kramatorsk and Slovyansk, two key cities which Russia is striving to capture in order to complete its occupation of Donetsk region. Kostyantynivka's population before Russia's February 2022 invasion was about 70,000.Explosions also rocked Russian-occupied Melitopol on Sunday, the southern city's Ukrainian mayor Ivan Fedorov said. He said the blasts targeted the rail depot there.Melitopol has been hit repeatedly by Ukrainian missiles because it is a transport hub for the Russian military, lying just north of Russian-occupied Crimea.On Saturday Russian Defence Minister Sergei Shoigu told fellow Russian commanders that steps were being taken to ramp up ammunition production. \"The volume of supplies of the most needed ammunition has been determined. Necessary measures are being taken to increase them,\" he said.Independent military analysts have said repeatedly that Russia is running short of precision weapons, after firing so many in the Ukraine war.Mr Shoigu and the defence ministry have been sharply criticised by Yevgeny Prigozhin, head of Russia's Wagner mercenary group, who accuses them of depriving his troops of key ammunition. Wagner - officially called a private military company - has suffered heavy losses in the Bakhmut fighting, with convicts released from Russian prisons drafted in to swell the group's numbers.Ukraine's President Volodymyr Zelensky insists that, despite heavy casualties, his forces entrenched in ruined Bakhmut will not surrender the city. The Russians are reported to have made small gains there in recent days.Bakhmut has little strategic value, but Ukraine has seen it as an important drain on Russia's military equipment and manpower.In a Telegram post on Sunday Mr Zelensky praised his compatriots in a message marking a year since Russian forces were expelled from the Kyiv region.\"Ukrainian people! You have stopped the greatest anti-human force of our time. You have stopped a force that despises and wants to destroy everything that gives meaning to people. And we will free all our lands,\" he said."}