{"author":"By Nicholas Yong","title":"Afghanistan: Girls' education activist arrested by Taliban","news_category":"general","content":"A prominent Afghan campaigner for female education has been arrested by the Taliban, even as teenage girls and women remain barred from classrooms.Matiullah Wesa, 30, had often received threats - he has spent years travelling across Afghanistan trying to improve access to education for all children.The Taliban did not say why Mr Wesa is in custody. His house was also raided. His arrest follows the detention of a number of other activists who have been campaigning for women's education.In February Prof Ismail Mashal, an outspoken critic of the Taliban government's ban on education for women, wasarrested in Kabul <https:\/\/www.bbc.com\/news\/world-asia-64623868> while handing out free books. He was freed on 5 March but has not spoken out since then.Mr Wesa is one of the most prominent education activists in Afghanistan and, via his charity PenPath, has been campaigning for girls' right to study since the Taliban barred female education in 2021.His last tweet - on Monday, the day of his arrest - was a photo of women volunteers for PenPath \"asking for the Islamic rights to education for their daughters\".This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.The UN's mission in Afghanistan has also highlighted Mr Wesa's case and called on the Taliban to clarify his whereabouts and the reasons for his detention.Mr Wesa was arrested after he came out of a mosque in the capital Kabul on Monday.\"The Taliban came in two vehicles,\" a person close to the family told the BBC. \"He was handcuffed and put in the car.\"Today at 10am, the Taliban went to his house and raided it. They turned it upside down, threatened his family against speaking out, seized phones, documents and computers. Matiullah's brothers were briefly detained and then released with a warning.\"Mr Wesa has travelled to hundreds of districts in Afghanistan over the past decade to promote the cause of education.The PenPath network he founded has more than 2,400 volunteers across the country. They help set up local classrooms, find teachers and distribute books and stationery.The ban on girls attending secondary schools has not stopped Mr Wesa. \"The damage that closure of schools causes is irreversible and undeniable,\" he tweeted last week.Women's rights have been gradually eroded since the Taliban returned to power in August 2021 following the withdrawal of US-led forces.Only boys and male teachers were allowed into secondary schools when they reopened in September 2021.There was a brief spell of hope following an announcement in March 2022 that girls would be allowed to attend secondary schools. But tearful schoolgirls were turned away after what appeared to bean abrupt U-turn by the Taliban leadership <https:\/\/www.bbc.com\/news\/world-asia-60848649>. They said girls would be allowed to return to school after \"a comprehensive plan has been prepared according to Sharia and Afghan culture\". But in December 2022, female students were also barred from universities.The Taliban say schools and universities are only temporarily closed to women and girls until a \"suitable environment\" can be created.But women are severely curtailed in other ways too. The Taliban have decreed that women should be dressed in a way that only reveals their eyes, and must be accompanied by a male relative if they are travelling more than 72km (48 miles).And last November, women were banned from parks, gyms and swimming pools, stripping away the simplest of freedoms. The enforcement of the rules is different in different areas, but the rules create an environment of fear and anxiety.The restrictions have continued despite international condemnation and protests by ordinary women as well as activists speaking up on their behalf.They have also hindered the work of foreign aid groups after the Taliban said women could not work in domestic and international NGOs except in the health sector.Some organisations were forced to suspend services at a time when the country is reeling from a severe economic and humanitarian crisis."}