{"author":"By Reality Check team","title":"Climate change: Is the UK on track to meet its targets?","news_category":"general","content":"The UK has pledged to reduce its greenhouse-gas emissions to net zero by 2050. Net zero means a country takes as much of these climate-changing gases - such as carbon dioxide - out of the atmosphere as it puts in.The UK's target is important to meet its commitments under the 2015 Paris climate agreement <https:\/\/www.bbc.co.uk\/news\/science-environment-35073297> in which governments agreed to try to limit global temperature rises to 1.5C above pre-industrial levels.However, in July 2022, the High Court ruled <https:\/\/www.bbc.co.uk\/news\/science-environment-62223551> that the government's net zero strategy failed to outline policies that would enable it to meet the target. As a result the governmentpublished a new plan <https:\/\/www.gov.uk\/government\/publications\/powering-up-britain>. Currently, less than 40% of the UK's required emissions reductions are supported by proven policies and sufficient funding, according to theClimate Action Tracker website <https:\/\/climateactiontracker.org\/countries\/uk\/>.So, what progress is the government making?The government says all of the UK's electricity will come from clean sources by 2035 <https:\/\/www.bbc.co.uk\/news\/uk-politics-58792261>.The government is expecting a 40-60% rise in demand for electricity by 2035, for example due to the electrification of transport. This means taking the carbon emissions out of electricity generation is important.UK governments have been relatively successful in cutting emissions from electricity generation. Thesefell by 73.4% between 1990 and 2021 <https:\/\/assets.publishing.service.gov.uk\/government\/uploads\/system\/uploads\/attachment_data\/file\/1094628\/DUKES_2022_Chapter_5.pdf>.This is largely due to a substantial reduction in electricity generated from coal - the dirtiest fossil fuel - from 40% in 2012 to less than 2% last year.The proportion of electricity generated by renewables has grown to around 40% in the last few years, up from just over 10% a decade ago. Fossil fuels - mainly natural gas - still generate about 40% of UK electricity. The remainder comes from nuclear power and imports.The government has set ambitious targets to accelerate the expansion of low carbon energy to reduce reliance on natural gas. These include increasing offshore wind capacity five-fold <https:\/\/www.gov.uk\/government\/news\/uk-signs-agreement-on-offshore-renewable-energy-cooperation> by 2030 andapproving up to eight new nuclear reactors <https:\/\/committees.parliament.uk\/committee\/135\/science-and-technology-committee\/news\/172212\/new-parliamentary-probe-into-uks-nuclear-power-strategy\/>.A report <https:\/\/www.nao.org.uk\/wp-content\/uploads\/2023\/03\/decarbonising-the-power-sector.pdf> by the National Audit Office warned that the lack of a clear delivery plan risked the UK not meeting its 2035 carbon-free electricity target. But the UK Climate Change Committee (CCC)recently emphasised <https:\/\/www.theccc.org.uk\/publication\/delivering-a-reliable-decarbonised-power-system\/> that it is still possible if delivery is significantly ramped up.However, the government has opened a new licensing round <https:\/\/www.bbc.co.uk\/news\/science-environment-63163824> for companies to explore for oil and gas in the North Sea for wider energy production, not limited to electricity. The International Energy Agencywarns <https:\/\/www.iea.org\/reports\/net-zero-by-2050> this would go against climate agreements.Direct emissions from buildings account for <https:\/\/www.theccc.org.uk\/wp-content\/uploads\/2020\/12\/Sector-summary-Buildings.pdf> about 17% of the UK's greenhouse gas emissions, mainly due to burning fossil fuels for heating.The government committed to installing 600,000 heat pumps a year by 2028 to replace gas boilers. Heat pumps use electricity rather than gas, and are three times more efficient than a boiler. The government isoffering grants <https:\/\/www.bbc.co.uk\/news\/business-58959045> of £5,000 to help homeowners install a heat pump.However, in February 2023, the Lords Climate Change Committee described this scheme <https:\/\/www.bbc.co.uk\/news\/science-environment-64710225> as \"seriously failing\". Currently, only 50,000 heat pumps are installed annually, meaning the government's 600,000 target is \"very unlikely to be met\".Insulation is one of the most effective ways to reduce greenhouse gas emissions from housing. It prevents the loss of heat, meaning less energy is wasted trying to maintain the house's temperature.However, the UK has some of the least energy-efficient homes <https:\/\/spiral.imperial.ac.uk\/bitstream\/10044\/1\/100954\/11\/Full-text.pdf> in Europe. In June,the CCC said <https:\/\/www.theccc.org.uk\/2022\/06\/29\/current-programmes-will-not-deliver-net-zero\/> there was a \"shocking gap in policy for better insulated homes\".In response, in November 2022 the government announced <https:\/\/www.gov.uk\/government\/news\/government-joins-with-households-to-help-millions-reduce-their-energy-bills> a new £1bn scheme, called ECO+, to improve insulation in UK homes. This is due to come into effect in April 2023. But critics say it doesn't go far enough.In March 2023 the government rebranded it as the Great British Insulation Scheme, to help insulate 300,000 of the poorest performing homes.Transport accounted for <https:\/\/assets.publishing.service.gov.uk\/government\/uploads\/system\/uploads\/attachment_data\/file\/1134664\/greenhouse-gas-emissions-statistical-release-2021.pdf> just over a quarter of UK emissions in 2021, making it the largest emitting sector.The government says no new petrol and diesel cars will be sold from 2030.By 2028, it wants 52% of car sales to be electric. In 2021 <https:\/\/www.smmt.co.uk\/vehicle-data\/evs-and-afvs-registrations\/>, 11.6% of car sales were electric. TheCCC says <https:\/\/www.theccc.org.uk\/wp-content\/uploads\/2022\/06\/Progress-in-reducing-emissions-2022-Report-to-Parliament.pdf> that this is ahead of schedule and that the market is \"currently growing well\".To meet higher demand, the government wants <https:\/\/www.gov.uk\/government\/publications\/uk-electric-vehicle-infrastructure-strategy> 300,000 publicly-accessible charging points by 2030.This represents <https:\/\/www.theccc.org.uk\/wp-content\/uploads\/2022\/06\/Progress-in-reducing-emissions-2022-Report-to-Parliament.pdf> more than a ten-fold increase from present levels. It has pledged over £350m to fund charging infrastructure.In June 2022, the government announced <https:\/\/www.gov.uk\/government\/news\/plug-in-grant-for-cars-to-end-as-focus-moves-to-improving-electric-vehicle-charging> it was ending grants for electric cars, saying the payment was having \"little effect on rapidly accelerating sales\".In March 2022, it pledged <https:\/\/www.gov.uk\/government\/news\/uk-on-track-to-reach-4000-zero-emission-bus-pledge-with-200-million-boost> £200m for nearly 1000 new electric and hydrogen buses, and is consulting on an earlier phase-out date of non-zero-emissions buses between 2025 and 2032.And it aims to remove all diesel-only trains by 2040, but the CCC says <https:\/\/www.theccc.org.uk\/wp-content\/uploads\/2022\/06\/Progress-in-reducing-emissions-2022-Report-to-Parliament.pdf> it needs a clearer plan to achieve this.It has promised <https:\/\/www.gov.uk\/government\/publications\/the-second-cycling-and-walking-investment-strategy> to double cycling rates from 2013 levels by 2025, and build a \"world-class\" cycling network by 2040. It has spent £338m on walking and cycling infrastructure in EnglandFlying makes up <https:\/\/www.theccc.org.uk\/wp-content\/uploads\/2020\/12\/Sector-summary-Aviation.pdf> about 7% of overall UK emissions, andshipping about <https:\/\/www.theccc.org.uk\/wp-content\/uploads\/2020\/12\/Sector-summary-Shipping.pdf> 3%.The UK published its strategy <https:\/\/assets.publishing.service.gov.uk\/government\/uploads\/system\/uploads\/attachment_data\/file\/1095952\/jet-zero-strategy.pdf> for delivering net zero aviation by 2050 in July 2022.It was criticised for relying too much <https:\/\/www.bbc.co.uk\/news\/science-environment-64788106> on technologies such as sustainable fuels and zero emissions aircraft that do not yet exist. It alsorelies on <https:\/\/www.iea.org\/reports\/carbon-capture-utilisation-and-storage-2> the development of ways to remove CO2 from the atmosphere to make up for remaining emissions in 2050.As a result, the CCC said <https:\/\/www.theccc.org.uk\/wp-content\/uploads\/2020\/12\/Sector-summary-Aviation.pdf> that the government should be looking at how to manage demand and not allow it to grow.The government has announced <https:\/\/www.gov.uk\/government\/news\/major-milestone-in-uks-race-to-net-zero-maritime-with-77-million-boost> £77m of funding to help decarbonise shipping.Agriculture is the source of <https:\/\/www.gov.uk\/government\/statistics\/agri-climate-report-2022\/agri-climate-report-2022> 11% of the UK's greenhouse gas emissions.The CCC said <https:\/\/www.theccc.org.uk\/2022\/06\/13\/governments-food-strategy-a-missed-opportunity-for-the-climate\/> emissions from agriculture needed to be cut by 30% between 2019 and 2035.This would require eating 20% less meat and dairy <https:\/\/www.theccc.org.uk\/2022\/06\/13\/governments-food-strategy-a-missed-opportunity-for-the-climate\/> by 2030 and shifting land from agriculture to supporting trees and restoring peatlands.The CCC criticised <https:\/\/www.theccc.org.uk\/2022\/06\/13\/governments-food-strategy-a-missed-opportunity-for-the-climate\/> the government's food strategy for failing to deliver action to drive down emissions from agriculture at the required scale or pace.The National Food Strategy independent review shows <https:\/\/www.bbc.co.uk\/news\/science-environment-58831636> daily meat consumption in the UK has fallen by 17% in the last decade. The government has been criticised fornot pushing <https:\/\/www.bbc.co.uk\/news\/business-58981505> for further behavioural change in meat consumption.In February 2023, the government released details <https:\/\/www.gov.uk\/government\/publications\/environmental-land-management-update-how-government-will-pay-for-land-based-environment-and-climate-goods-and-services\/environmental-land-management-elm-update-how-government-will-pay-for-land-based-environment-and-climate-goods-and-services> of its long-awaited environmental land management schemes, replacing the EU common agricultural policy.Trees and peatlands play important roles <https:\/\/www.iucn-uk-peatlandprogramme.org\/sites\/default\/files\/2020-04\/IUCN%20UK%20PP%20Peatlands%20and%20trees%20position%20statement%202020.pdf> in removing carbon dioxide from the atmosphere.UK forest cover <https:\/\/www.forestresearch.gov.uk\/tools-and-resources\/statistics\/statistics-by-topic\/woodland-statistics\/> is 13%,among the lowest <https:\/\/www.forestresearch.gov.uk\/tools-and-resources\/statistics\/forestry-statistics\/forestry-statistics-2018\/international-forestry-3\/forest-cover-international-comparisons\/> in Europe.The government has pledged <https:\/\/www.gov.uk\/government\/news\/over-100-leaders-make-landmark-pledge-to-end-deforestation-at-cop26> to end deforestation in the UK by 2030. It has an ambitioustarget to plant <https:\/\/www.nao.org.uk\/wp-content\/uploads\/2022\/03\/Tree-planting-in-England-Summary.pdf> 30,000 hectares of trees a year by 2025.However, annual tree planting has not risen above <https:\/\/www.forestresearch.gov.uk\/tools-and-resources\/statistics\/data-downloads\/> 15,000 hectares UK-wide since 2001. In June 2022, theUK forestry body warned <https:\/\/www.bbc.co.uk\/news\/science-environment-61908988> that there was \"zero chance\" of the UK meeting its target.It is estimated <https:\/\/www.iucn-uk-peatlandprogramme.org\/about-peatlands\/peatland-damage> that only around 20% of UK peatlands are in a near-natural state, including only 1.3% in England. These damaged peatlandsare responsible for <https:\/\/www.bbc.co.uk\/news\/science-environment-53684047> 5% of the UK's greenhouse gas emissions, whereas healthy peatlands would take up carbon dioxide.The government aims to <https:\/\/www.gov.uk\/government\/news\/sale-of-horticultural-peat-to-be-banned-in-move-to-protect-englands-precious-peatlands> restore 35,000 hectares of peatland by 2025, andwill completely ban <https:\/\/deframedia.blog.gov.uk\/2023\/03\/24\/media-reporting-on-peat-ban-for-the-professional-horticulture-sector\/> the sale of horticultural peat by 2030. However,the CCC warns <https:\/\/www.theccc.org.uk\/wp-content\/uploads\/2020\/12\/Sector-summary-Agriculture-land-use-land-use-change-forestry.pdf> this does not go far enough.Hydrogen is a low-carbon fuel that could be used for transport, heating, power generation or energy storage.The government says <https:\/\/assets.publishing.service.gov.uk\/government\/uploads\/system\/uploads\/attachment_data\/file\/1123751\/hydrogen-strategy-update-to-the-market-december-2022.pdf> it is committed to developing the UK's low carbon hydrogen capabilities and considers it a critical part of energy security and decarbonisation. Itwants to have <https:\/\/assets.publishing.service.gov.uk\/government\/uploads\/system\/uploads\/attachment_data\/file\/1123751\/hydrogen-strategy-update-to-the-market-december-2022.pdf> a 10GW hydrogen production capacity by 2030.The industry is in its infancy, and the government admits <https:\/\/assets.publishing.service.gov.uk\/government\/uploads\/system\/uploads\/attachment_data\/file\/1011283\/UK-Hydrogen-Strategy_web.pdf> it will need \"rapid and significant scale-up\" in the coming years.A recent study <https:\/\/www.bbc.co.uk\/news\/science-environment-63050910> warned that hydrogen was less efficient and more expensive for heating homes than alternatives such as heat pumps.The government has promised <https:\/\/www.gov.uk\/government\/publications\/energy-security-bill-factsheets\/energy-security-bill-factsheet-enabling-the-hydrogen-village-trial> a decision on the role of hydrogen in heating by 2026. In March 2023it announced <https:\/\/assets.publishing.service.gov.uk\/government\/uploads\/system\/uploads\/attachment_data\/file\/1147340\/powering-up-britain-joint-overview.pdf> the first winning projects from the £240m Net Zero Hydrogen Fund.In December 2022, it launched <https:\/\/assets.publishing.service.gov.uk\/government\/uploads\/system\/uploads\/attachment_data\/file\/1123751\/hydrogen-strategy-update-to-the-market-december-2022.pdf> a consultation on the potential for hydrogen transport.The ability to capture carbon before it is released - or take it out of the atmosphere and store it - will be important if the UK is to reach net zero,to balance emissions <https:\/\/www.theccc.org.uk\/publication\/delivering-a-reliable-decarbonised-power-system\/> from the continued limited use of natural gas.The government is aiming <https:\/\/www.great.gov.uk\/international\/content\/investment\/sectors\/carbon-capture-usage-and-storage\/> to capture and store between 20 and 30 million tonnes of CO2 a year by 2030.In March 2023 it announced <https:\/\/www.bbc.co.uk\/news\/science-environment-65107072> the first sites for storing captured carbon, which will be on Teesside.The Chancellor recently announced £20bn in investment in carbon capture over the next 20 years. But the technology is still emerging and is expensive.Emissions from manufacturing and construction represent <https:\/\/www.theccc.org.uk\/wp-content\/uploads\/2020\/12\/Sector-summary-Manufacturing-and-construction.pdf> about 12% of total UK emissions.The government aims to cut emissions from manufacturing by about two-thirds by 2035.It has awarded <https:\/\/www.gov.uk\/government\/news\/energy-intensive-industries-given-12-million-boost-to-cut-emissions-and-costs> £34.8m of funding through the Industrial Energy Transformation Fund to help energy-intensive industries decarbonise, but critics say this is insufficient.The government also plans <https:\/\/www.gov.uk\/government\/publications\/participating-in-the-uk-ets\/participating-in-the-uk-ets> to cap the amount of emissions allowed by individual sectors each year, reducing that amount over time.But the scheme risks companies shifting production to other countries and therefore not reducing their emissions."}