{"author":"By Kevin Peachey","title":"Cost of living: New average mortgage rates fall below 6%","news_category":"general","content":"New average two and five-year fixed-rate mortgages now have an interest rate of less than 6% for the first time for two months, data shows.Financial information service Moneyfacts said the typical two-year deal on the market now had a rate of 5.99%, and was likely to fall further.Mortgage costs had surged after the mini-budget, peaking at 6.65% <https:\/\/www.bbc.co.uk\/news\/business-63327553>.The average five-year fixed-rate deal dropped below 6% nearly two weeks ago, and is now at 5.78%.\"It appears lenders are slowly making reductions to their fixed pricing to adjust their positions, and in doing so, the overall average two and five-year fixed mortgage rates now sit below 6%,\" said Rachel Springall, from Moneyfacts.\"In the weeks to come rates could fall further, particularly if mortgage lenders have targets to meet as we edge closer to the end of 2022.\"As the mortgage market remains volatile, it is vital borrowers seek independent advice to consider the deals on offer to them, or whether they need to be a little patient in hopes rates will fall further.\"Fixed-rate mortgage deals have a set interest rate during the term of the deal. Most run for two or five years, but longer deals are available. Variable or tracker rate mortgages can change at any time, usually in response to decisions made by the Bank of England's Monetary Policy Committee on the benchmark Bank rate.Anyone coming to the end of their fixed-rate mortgage deal and looking for a new one, or first-time buyers taking out their first mortgage saw these loans become much more expensive than they had probably expected or planned for. The rates are much higher than the norm of the last decade or so.Rates on new fixed-rate deals have climbed throughout this year, as the Bank put up interest rates to fight inflation, but they shot up following the mini-budget.However, they stabilised in the run-up to, and after, Chancellor Jeremy Hunt's Autumn Statement which calmed the markets and, in turn, eased uncertainty for lenders and borrowers.Anyone taking out a new mortgage is likely to still pay a much higher rate than on their previous deal. The average two-year deal stood at 2.34% at the start of December last year, ahead of a series of base rate increases by the Bank.The number of deals available also dropped sharply after the mini-budget. It has mainly recovered but it is still much lower than it was last year, with 3,705 deals on the market."}