{"author":"","title":"Powys: Schoolchildren stranded after buses scrapped","news_category":"general","content":"Schoolchildren were stranded and expected to walk three miles (5km) on busy roads after the council scrapped several bus routes, parents say.Powys council has been criticised for poor communication about the cancellations.Children were left on the side of the road after parents say they were not notified of the changes.The council apologised for the issues but said the changes were necessary for its climate goals.Parents have taken to social media to express their frustration, according to the Local Democracy Reporting Service (LDRS) <https:\/\/www.bbc.com\/lnp\/ldrs>.James Morris said his son was told the bus no longer went to Bwlch, but claimed the council had not told him.\"We had no idea that there had been a change to his route,\" he said.\"I'm not sure what Powys expect him to do, walk three miles home along a busy 60mph road.\"And Debbie Brown said: \"The change of times now means my daughter and others have to wait in Sennybridge for nearly an hour for the main bus, surely this is a safeguarding issue?\"Councillor Iain McIntosh told the LDRS: \"Clearly, the authority is in utter chaos, which has resulted in children being left by the side of the road as their parents weren't informed about different bus times.\"I am very concerned that some children are expected to spend over three hours travelling to school and back every day, and that some will have to wait between buses in uncovered exposed areas.\"Cabinet member councillor Jackie Charlton said the free home-to-school transport service would continue on its designated route.\"Whilst the majority of these changes were implemented without any issues, there have been a number of problems in certain areas, for which we can only apologise,\" she said.\"Not only does this make financial sense but it is vitally important from a climate emergency perspective that we only operate the routes that we absolutely need to.She added \"for context\" that Powys was the largest and most rural authority in Wales and transports 4,500 children to school on 230 school buses using 2,500 pick-up and drop-off points."}