{"author":"","title":"Britain's Got Talent: Complaints rise to 15,000 for Diversity performance","news_category":"general","content":"The number of complaints about an episode of Britain's Got Talent, which featured a Black Lives Matters-inspired routine by dance troupe Diversity, has risen to 15,500, Ofcom has said.The number of complaints about the episode has shot up from 1,121 on Tuesday <https:\/\/www.bbc.co.uk\/news\/entertainment-arts-54056501> and 10,267 on Thursday <https:\/\/www.bbc.co.uk\/news\/entertainment-arts-54099894>. The dance saw Ashley Banjo being knelt on by a police officer, a reference to George Floyd's death in police custody <https:\/\/www.bbc.co.uk\/news\/world-us-canada-52861726>.Media watchdog Ofcom said \"almost all\" relate to Diversity.Ashley's brother Jordan said on Wednesday that the response was \"sad, genuinely\".ITV said the performance opened up \"important topics of conversation\" and \"was complied for a family audience\".Ashley Banjo has explained that the group had wanted to use the routine to \"express how the events of this year have made us feel\".Jordan and Perri Kiely, two other key members, spoke about the performance and complaints on their Kiss breakfast show on Wednesday.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.\"It was really important, it was special to us, and we're all about positivity and love, and we got so much positivity and love back from this one,\" Jordan said.\"But we also got bombarded with messages and articles and horrible stuff about all of us, about our families, about how even now Diversity isn't diverse enough because there's only five white people in it.\"I can't speak for anyone else, but it's sad. It's sad, genuinely. I feel anxious and worried saying something like black lives matter when that's all we want, man. It's just love and positivity. No-one's saying only black lives matter.\"Earlier this week, an Ofcom spokesperson told the BBC: \"We are assessing the complaints against our broadcasting rules, but are yet to decide whether or not to investigate.\"The performance attracted both praise and scorn on social media for its political stance, with Ashley Banjo referring to both in a tweet after the show.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Part of the performance saw Banjo lying on the floor while a dancer dressed as a police officer handcuffed him. Other performers crowded around with smartphones as if to film and take photos of the incident.The dance was also narrated, and included the line: \"What we thought we knew, some clearly didn't. Black Lives Matter.\"The group, who won the talent show in 2009, then all took a knee before the song Black Lives Matter by Dax began, which features the lyrics \"I can't breathe\",the words Mr Floyd repeatedly said as he was restrained. <https:\/\/www.bbc.co.uk\/news\/world-us-canada-52861726>A BGT spokesperson said earlier this week: \"Diversity's performance offered their take on the extraordinary events of 2020 opening up important topics of conversation. The show was complied for a family audience.\"Ashley Banjo has taken Simon Cowell's place on the judging panel for this series afterCowell injured his back. <https:\/\/www.bbc.co.uk\/news\/entertainment-arts-53713971>Follow us on Facebook <https:\/\/www.facebook.com\/BBCEntsNews\/>, or on Twitter @BBCNewsEnts <https:\/\/twitter.com\/BBCNewsEnts>. If you have a story suggestion emailentertainment.news@bbc.co.uk <mailto:entertainment.news@bbc.co.uk>"}