{"author":"","title":"The Last of Us: What to expect from series two","news_category":"general","content":"After nearly nine weeks of tense, traumatic and tearful drama, the opening series of The Last of Us is about to reach its climax.Joel and Ellie's arduous journey across America has gripped viewers and critics alike, as they dodge ruthless militia and terrifying monsters, while seeking a cure for a fungal brain infection that devastated the population.HBO, which adapted the series from the original video game, quickly announced after the first few episodes that there would be a second series.In this article we'll examine what that could look like. Spoilers will be avoided, in much the same way that Joel and Ellie dodge those grotesque fungal spores.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.The biggest clues come from the video game's own sequel.The Last of Us: Part 2 was released on the PlayStation 4 in the summer of 2020, and picks up the story five years after the events of the first instalment. It goes on to expand the world, introducing new characters, factions and locations.The game was a big success for Sony, despite its makers having to defend its use of violence <https:\/\/www.gamespot.com\/articles\/sony-exec-defends-that-very-violent-the-last-of-us\/1100-6454616\/>. Three years on, it's considered one of the best games ever made,successfully living up to the legacy created by the original. <https:\/\/www.bbc.co.uk\/news\/newsbeat-55272359>Given that the first series of the TV show has largely been faithful to the game - it's reasonable to assume the show will continue along that path.Neil Druckman, its director, has also suggested that will be the case, telling theHollywood Reporter <https:\/\/www.hollywoodreporter.com\/tv\/tv-features\/the-last-of-us-hbo-pedro-pascal-bella-ramsey-interview-1235290103\/>, \"We have no plans to tell any stories beyond adapting the games.\"However, given the wider scope of the sequel, maybe one series won't be enough to do it justice - so it could focus on just one element portion of the story (come back here in future to read a \"what to expect in series three\" article…)The opening series of the adaptation has been traumatic. Not since Game of Thrones have more central characters said hello and goodbye to viewers with such regularity.That trend will continue in series two. There will be difficult and heart-breaking decisions made from the first to the last episode. Characters will lose loved ones as they explore more of this changed America.Viewers will shed a tear, or several, and the constant threat of imminent and sudden death will haunt the show as it has done in series one.Thematically the opening series has touched upon authoritarianism. What does it feel like to be governed by a dictatorship? If we have little or no voice in how society is run, what do we do next?The next series will thrust religious fundamentalism under the spotlight. As is often the case in post-apocalyptic zombie dramas (I appreciate they're called 'infected' in this show, but you know what I mean), the humans are often the scariest enemies.That will certainly be the case as the Seraphites (also known as Scars), a group of violent cultists who communicate via menacing whistling sounds, arrive on screen.How much the show decides to explore the inflexibility of their fundamentalist beliefs, and what that means to the other characters, we'll have to wait to find out.Listening to the creators of the show, Neil Druckman and Craig Mazlin, discuss their work, it is clear that love is the central theme of the first series. Every episode is laced with people trying their best to save a loved one.For series two there will be a shift. Instead it will ask how people deal with grief? Should we get angry? Go numb? Try to forget? Or get revenge?Characters will answer this question differently and viewers will be challenged to decide which approach they instinctively support.So far we've met three types of infected in the Last of Us. The common-or-garden 'runners', who flock together when a spore is interfered with; The mushroom faced 'clickers', blind but with deadly rapid reactions; And the 'bloater', a big lad who appeared out of the ground in episode five.In series two, expect that roster to expand. In the game, players come across a character named 'The Rat King' - a massive and even more grotesque version of what's been shown on screen so far. This infected is a combination of many individuals meshed together in a hospital setting.The game features a memorable set-piece, where the characters are ambushed by a rat king in a dark basement. It's a difficult and unsettling encounter that will be tricky to translate to television.Neil Druckman told the BBC when the Last of Us: Part 2 was first released that video games needed to do a better job of representing society <https:\/\/www.bbc.co.uk\/news\/newsbeat-53080982>. Diversity of gender, sexuality and ethnicity was important to him and the team making the game.Series two will introduce us to the transgender character Lev - who was one of the first trans characters featured in a major high-profile gaming release. Their story arc is an emotional one, so expect the show to explore societal attitudes to transgender rights.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.We've already met one of the major characters of the next series. Dina, a resident of Jackson, makes a fleeting appearance in episode six, staring at Ellie and Joel as they arrive in town. She will be the heartbeat of series two: Intelligent, loving and loyal.This casting decision will be key to the series' success. The rumour mill is in full force <https:\/\/www.gamespot.com\/articles\/the-last-of-us-fans-convinced-hbo-has-cast-abby-for-season-2\/1100-6510767\/> as to who will play the role of Abby. Portrayed by Laura Bailey in the game, she is a strong woman who's suffered significant heartbreak. Her divisive actions are central to the storyline of the second series and linger in the memory long after you set down your controller.There is a moment three quarters of the way The Last of Us: Part 2 that plays with character perspective in a way that will be difficult to do in television. This section is a significant element of the game's overall emotional impact. Can the on-screen equivalent live up to it?We don't know when series two will be ready, Pedro Pascal has hinted that filming could start as soon as 2023 <https:\/\/collider.com\/last-of-us-season-2-pedro-pascal-comments\/>. If everything goes to plan, then we're likely to re-join the story in 2025.Watch this space.For more gaming content, go to Press X to Continue, the BBC Sounds gaming Podcast. <https:\/\/www.bbc.co.uk\/programmes\/p08x7kb5>"}