{"author":"By Ian Youngs","title":"Fears over Christmas panto bookings as theatre ticket sales play catch-up","news_category":"general","content":"Beanstalks, horse costumes and dazzling dame dresses are being dusted off at theatres across Britain for the return of pantomime season. Oh yes they are!But with the pandemic still not behind us, new research suggests many people are reluctant to return to live shows.As the festive season approached in late October, theatre ticket sales were down by a third on pre-pandemic levels, according to the Audience Agency.Christmas shows are crucial to theatres for income and reaching new audiences.Most productions were cancelled or curtailed last year, but this Christmas venues can stage performances without restrictions on capacity.Audience members bought 473,807 tickets in the week beginning 25 October, the most recent available week.In the equivalent week in 2019 - before the pandemic - 715,210 tickets were sold, meaning there has been a drop of 34%.The Audience Agency monitors sales in more than 340 English venues.Ticket-buying did pick up during October and some producers have reported a further upturn this month, suggesting sales may be catching up.Meanwhile, some major West End theatres, which are not part of the survey, have reported full houses.Audience Agency chief executive Anne Torreggiani said the drop was \"more of a problem for venues and organisations in smaller towns, outside the big metropolitan centres\".She said: \"The festive season - panto and other traditional festive offerings - may be down by 30% or 40% in the worst case. That obviously has a very serious effect on lots of organisations who spend lots of money on those Christmas productions, expecting big sales.\"The effects could be quite dramatic. Lots of venues are in a fairly healthy situation with the recovery money that they've had from the government, but this could be a terrible blow.\"In further research carried out in October, 23% of people said they would normally go to a panto in a typical year but only 17% rated their chances this year as eight out of 10 or higher.This video can not be playedStars of Peter Pan explain what a panto isOlder people are less likely to attend, with 6% of over-65s rating their chances as at least eight out of 10, compared with 26% of those aged between 16-34.Meanwhile, some schools in Scotland have scrapped their panto trips this year, according to The Stage newspaper <https:\/\/www.thestage.co.uk\/news\/a-quarter-of-scottish-councils-ban-school-panto-trips-costing-venues-thousands>.Trevor MacFarlane, director of Culture Commons, said: \"This could spell trouble for venues in every village, town, and city up and down the country who rely on a packed-out panto production to bring in up to a quarter of total box office takings for the year.\"This income subsidises the rest of the year's programme and important community outreach and educational activities too.\"There are several factors at play here. School and group bookings are still down on 2019, and grandparents and significant older others may also, understandably, be hesitant about joining younger families and friends into theatres.\"In places outside London - especially non-metropolitan areas - concerns around returning to in-person cultural activities appear to be even more pronounced.\"The Centre for Cultural Value, which led research with the Audience Agency and the Creative Industries Policy and Evidence Centre, will \"continue to monitor the situation and share emerging findings with the government\", he added.Emily Wood, co-director of Evolution Productions, which is staging 11 pantomimes around the UK this year, said box offices had a \"a slow start\" but are now experiencing a \"strong surge\".\"We've seen a totally different sales pattern to normal,\" she said. \"But actually, things are catching up really nicely.\"Certainly, the last couple of weeks have been a lot stronger than those equivalent weeks two years ago, because I suppose we've had more availability to sell. So we are catching up nicely and things are looking really positive.\"Separate research <https:\/\/s3-eu-west-1.amazonaws.com\/supercool-indigo\/Insights-Alliance-webinar-Missing-Audiences-slides-c-Insights-Alliance.pdf> published earlier this month found that 32% of past theatre audience members were still not planning to return to venues.Most said they were avoiding interacting with crowds or were worried that other people would not comply with Covid safety measures.Andrew Lloyd Webber told BBC Radio 4's Front Row <https:\/\/www.bbc.co.uk\/sounds\/play\/p0b61t0l> on Tuesday that the low numbers of people wearing face masks in theatres was \"an issue\" and that he would like to introduce compulsory face masks at his six venues.But he said it would be better for the whole West End to do so together. \"At the moment, I don't think we will across my theatres,\" he said. \"Of course, it's up to the individual producers.\"I think it's probably best at the moment that the West End does it as a body. I myself would introduce it, yes, but at the moment I don't think it's necessary.\"Lord Lloyd-Webber added that many West End shows are performing well, especially with younger audiences. \"I think what we're going to find is the New Year is going to be the testing point,\" he said.The Society of London Theatre, which represents the West End, said many of its members are seeing audience numbers at pre-pandemic levels.Lord Lloyd-Webber's venues do ask audience members to show either proof of vaccination, negative test or natural immunity, despite it not being a legal requirement in England.Other theatre operators also ask for Covid passports, such as the Ambassadors Theatre Group, which runs 37 UK venues, and the Storyhouse in Chester.Covid passes are mandatory to enter theatres in Wales and will be compulsory in Northern Ireland from next week. The Scottish government has stopped short of requiring them."}