{"author":"","title":"Britishvolt: Disgust and dismay in Blyth as company collapses","news_category":"general","content":"The collapse of electric car battery start-up Britishvolt has been met with dismay and disgust in the town where the factory was set to be built.The so-called gigafactory was touted as creating 3,000 jobs in Blyth, Northumberland, but the company entered administration earlier.The majority of the firm's 300 staff have been made redundant.Linda Rumsby, 63, of Blyth, said her \"forgotten\" town desperately needed the highly skilled jobs that the project would have brought to the area.Lifelong Blyth resident Mrs Rumsby said: \"It's terrible because we need more employment round here.\"People are fed up with what's going on and something needs to be done for jobs.\"This part of the North East gets forgotten. You hear about Middlesbrough and Stockton, but what about this end?\"People want to work, they are fed up with struggling. They need the purpose of going out to work and getting their own money.\"Billy Richardson, 78, has also lived in Blyth all his life. \"I think it's disgusting,\" he said. \"Employment is being taken away from a bad area where there is plenty of unemployment to start with.\"Blyth needs more shops to open and a new market place. It has nothing like that.\"David Ray, 68, of nearby Newsham, said: \"It's terrible for the area. \"The factory would have created so many jobs not just for Blyth but Ashington as well. It's absolutely terrible.\"I really thought the government would rescue it, not pull the plug.\"By Luke Walton, BBC North East & Cumbria political correspondentBritishvolt's plans were hailed by former prime minister Boris Johnson as a key part of a \"green industrial revolution\".Kwasi Kwarteng, his business secretary, said the promise of a huge factory in an ex-mining community in Northumberland proved Conservatives were \"reindustrialising\" the north.Now, in the view of the government's critics, the project's collapse represents a devastating blow to the \"levelling up\" agenda.The gigafactory would have been close to the Blyth Valley constituency, a Conservative \"red wall\" gain from Labour in 2019.Its MP Ian Levy says he will work \"tirelessly with the government and the council to attract potential investors to the site\", but Wansbeck Labour MP Ian Lavery, whose seat includes the factory site, accuses ministers of failing to support Britishvolt with the investment needed.The wider picture is not all doom and gloom. Blyth's flourishing wind turbine industry and some other hi-tech engineering employers had already created some optimism.But the area includes pockets of severe deprivation, and local people have been left disappointed and bitter about today's developments.What happens next could have political as well as economic consequences in an electorally volatile corner of the North East.The Unite union described Britishvolt's collapse as \"a grim day for the North East\".Its national officer for the automotive sector, Steve Bush, said: \"It is extraordinary that despite the UK automotive sector being required to move to the production of electric vehicles, there are still no UK stand-alone factories making the batteries that are required.\"The demise of Britishvolt means there are not even any in the pipeline. The government's strategy seems to be to cross their fingers and hope that everything will be OK.\"The workers are frankly enraged at this dreadful and total abdication of leadership\"However, the Conservative MP for Blyth Valley, Ian Levy, believes the fight for a gigaplant at the site in Blyth should go on.\"It has all the necessary infrastructure, and a workforce who are ready to go. We need this to happen,\" he said.When asked whether he wished the government had been more forthcoming with support, Mr Levy replied: \"It's taxpayers' money. We have got to make sure any project hits all the right markers [to receive funding].\"The government has to do its due diligence.\"When asked what markers Britishvolt had missed he said \"That is between Britishvolt and the government.\"The £3.8bn gigafactory project had been delayed several times and had struggled to cope with rising costs.Last year, Britishvolt narrowly avoided going into administration after running out of money, before existing investors stepped in with extra support.Experts have said gigafactories will be vital for the future of the British car industry, as petrol and diesel-powered vehicles are phased out.Only one other such factory is under construction in the UK. It is being build by Chinese firm Envision adjacent to Nissan's car plant in Sunderland.Follow BBC North East & Cumbria on Twitter <https:\/\/twitter.com\/BBCNEandCumbria>, Facebook <https:\/\/www.facebook.com\/bbcneandcumbria> and Instagram <https:\/\/www.instagram.com\/bbcneandcumbria\/>. Send your story ideas to northeastandcumbria@bbc.co.uk <mailto:northeastandcumbria@bbc.co.uk>."}