{"author":"By Charley Adams","title":"Paul O'Grady alter ego Lily Savage 'a voice for a queer generation'","news_category":"general","content":"Paul O'Grady's death has prompted a flood of tributes from celebrities across the entertainment industry and even the Royal Family.And the legacy of his witty blonde alter ego Lily Savage has been described by the drag community as trailblazing and life-changing.The character, inspired by tough but colourful women in his family, had fans spanning generations - with many saying her rise to fame led the way for thousands of future drag artists.Copper Topp, a contestant on the latest series of RuPaul's Drag Race UK, says waking up to the news they \"had such a heavy heart\".\"It was through Paul O'Grady and Lily Savage that British drag culture was born,\" she said. \"They've paved the way for legions of drag artists and I wouldn't be here without them.\"The 39-year-old said of watching Lily on TV in the 90s: \"I was in awe of her… at the time I had no idea who I was and what I wanted to be... but she made me feel comfortable for the first time.\"Referencing O'Grady's work in the fight against Aids and HIV, Copper Topp said: \"It must have been such a hard time to live with that going on.\"From the police raids in the Royal Vauxhall Tavern, to then becoming a prime time TV household name - she was a face for a whole generation of queer people and she still is.\"The performer, who uses she\/her pronouns when in drag, said O'Grady's \"quick wit and dry sense of humour\" as Lily on mainstream television \"changed the game\" for drag artists.\"Paul and Lily have been a voice for a queer generation,\" they said, adding: \"She walked so we could run.\"Danny Beard, who won RuPaul's Drag Race UK Series 4, says they remember watching O'Grady as a child.\"It was hilarious and as a young gay boy to sit there and see something of yourself on television, it meant things were OK and it meant I could dream to do that as well.\"Describing O'Grady as a \"trailblazer\", they told BBC News: \"He took drag to the mainstream and really set the way for people like me to be able to do our jobs.\"Beard said O'Grady was an \"icon\" for queens, people from Merseyside and many working-class people.\"For Paul to make it mainstream on television just after the Aids crisis and working through it as an entertainer really was a testament to who he was as a person,\" they said.Beard said drag was changing around the world, and looking at the legacy of O'Grady \"it's nice to be reminded that drag isn't new\".\"Drag isn't scary and it's been around for a long time and we ain't going anywhere, baby!,\" they said, adding: \"He's an icon and he's an inspiration to so many queer people that want to make it in the entertainment industry.\"Gareth Joyner, who works as Myra DuBois, says having Lily Savage on mainstream media \"demystified drag for a lot of people\".She [Lily] \"created visibility for drag artists\", he said, adding: \"It gave queer people and drag performers the confidence that it might be possible.\"Talking of their inspiration, Joyner said Lily Savage was \"certainly on the mood board\" and taught him that drag does not have to be nice.Her character with ripped fish-nets and a scowl \"appealed to me more as a creative\", said Joyner.The drag performer said: \"I owe him [O'Grady] a tremendous debt of gratitude that he was on television when I was a little kid because I could see those glimmers of representation.\"I don't know who I'd be if that didn't exist.\" There have been even more tributes on social media.Comedian Jayde Adams, who started her career as an Adele drag act, posted a picture of O'Grady as Lily onTwitter <https:\/\/twitter.com\/jaydeadams\/status\/1641039115767382018?s=20> and said: \"She's the reason drag even exists in the UK.\"Cheddar Gorgeous, who was the runner-up on Drag Race UK's fourth series, said: \"We love you Lily, you will forever walk the alleyways of our hearts.\"\"A British institution, beamed into households every week for decades, celebrated for her sharp wit, filthy tongue and innuendo and equally for his heart of gold and warmth in panto and family entertainment\", the drag artist posted onInstagram <https:\/\/www.instagram.com\/p\/CqW7wWcPo_Q\/?utm_source=ig_web_copy_link>. This video can not be playedWatch: Paul O'Grady speaks to Michael Parkinson about his alter ego Lily Savage (2002)"}