{"author":"","title":"Syria conflict: Trump slows down troop withdrawal","news_category":"general","content":"US President Donald Trump has now said the abrupt withdrawal of US troops from Syria he announced earlier this month will be carried out \"slowly\".\"We're slowly sending our troops back home to be with their families, while at the same time fighting Isis [Islamic State] remnants,\" he tweeted on Monday.His clarification confirmed remarks by Republican Senator Lindsey Graham.When Mr Trump first announced the move, he had said: \"They're all coming back and they're coming back now.\"The development had shocked US allies and American defence officials alike, with Defence Secretary Jim Mattis and a top US official in the fight against the Islamic State (IS) group, Brett McGurk, resigning soon after.America's Kurdish allies on the ground in north-east Syria have been left feeling exposed as Turkey, which regards them as terrorists, appears poised to move against them.The Kurds appealed to Syrian government forces for help to secure a key northern city, Manbij, to guard against any Turkish offensive.Syrian government forces could be seen taking up position near the city on Sunday but, according to the UK-based Syrian Observatory for Human Rights, they later pulled out \"in order to avoid any frictions\" with US forces in the area.Some 2,000 US military personnel are believed to be in Syria although the real numbers could be higher.After the president made his announcement on 19 December, US officials said American forces had been given 30 days to leave Syria.In his announcement, Mr Trump had also declared that IS had been \"defeated\". <https:\/\/twitter.com\/realDonaldTrump\/status\/1075528854402256896>However, on Monday, he said troops were being pulled out \"slowly\" and that they would be fighting remaining IS militants at the same time.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.IS remains in pockets of north-eastern Syria and the group says it has launched a series of small-scale but deadly attacks on the Kurdish-led Syrian Democratic Forces in recent days, in claims that could not be independently verified.Without giving names, he referred to complaints about his tactics from \"failed generals who were unable to do the job\" before he had taken over in the White House.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.And he boasted about achieving \"far better results\" in stopping America's foreign wars than even he had promised himself.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Sen Graham, who had sharply criticised Mr Trump's withdrawal plans, held talks with the president on Sunday and later spoke of a \"pause situation\" regarding operations in Syria.\"We're re-evaluating what's the best way to achieve the president's objective,\" the senator said.The New York Times reported  <https:\/\/www.nytimes.com\/2018\/12\/30\/us\/politics\/lindsey-graham-syria-trump.html>that he might be referring to assurances given to military officials that they could have longer than 30 days to ensure an orderly withdrawal of troops.US ground troops first became involved in Syria in autumn 2015 when then-President Barack Obama sent in a small number of special forces to train and advise local Kurdish fighters who were fighting IS.This video can not be playedIs this the end for Islamic State?The US did this reluctantly after several attempts at arming anti-IS groups had descended into chaos.Over the intervening years the numbers of US troops in Syria has increased, and a network of bases and airstrips has been established in an arc across the north-eastern part of the country.The US has also been part of an international coalition conducting air strikes against IS, while also targeting Syrian government bases in retaliation for suspected war crimes involving chemical weapons.BBC defence correspondent Jonathan Marcus says Mr Trump appears to be washing his hands of Syria <https:\/\/www.bbc.com\/news\/world-us-canada-46645718> and handing the job over to Russia, Turkey and Iran.All three countries have forces deployed on the ground to support their respective allies, with Russia and Iran key backers of President Bashar al-Assad's government.This video can not be playedJeremy Bowen visits the wreckage of Eastern Ghouta after the rebel collapse thereWhile 2018 saw new fighting across Syria, notably in the Eastern Ghouta area near Damascus where Assad forces finally drove out rebel fighters, it was reportedly the least bloody year of the conflict.According to the Observatory, a total of 19,666 people were killed, which it says is the lowest annual death toll since fighting started in 2011.\"Most of those killed during the first part of the year were killed in regime and Russian bombardment of opposition areas, including Eastern Ghouta,\" Observatory chief Rami Abdel Rahman told AFP news agency.\"The majority of those killed in the second half of the year were killed in coalition air strikes,\" he added."}