{"author":"","title":"Northern Ireland 'losing out on tens of millions of EU funding'","news_category":"general","content":"Northern Ireland is losing out on tens of millions of pounds with the end of funding which had previously come from the EU, the finance minister has said.Conor Murphy said £70m had been lost to the Stormont executive, with a further £34m deducted from agricultural subsidies.The EU's structural funds have been replaced by the Shared Prosperity Fund.It will be administered from Whitehall rather than the UK's devolved administrations.During Question Time at the assembly, Mr Murphy said the post-Brexit funding landscape \"had not been a positive one\".He said there was now no access to the European Social Fund, the European Regional Development Fund and other EU programmes.While these had been replaced by the UK's Shared Prosperity Fund, neither Wales, Northern Ireland or Scotland had been given any say in its design, policy direction or delivery, he added.\"The result is a £70m annual loss to the executive's spending power,\" he said.\"£315.6m has been agreed in agricultural support in 2021-22 but Treasury will deduct the receipts we get from the current programme - the deductions estimated at £34m over the next three years, which I consider lost.\"However, Mr Murphy said on a more positive note, Brexit had not impacted on the Peace Plus funding programme, which would see a pot of €1.1bn (£930m) over the next seven years.UK farmers used to receive subsidies from the European Union via the Common Agricultural Policy but that financial support was replaced by funding from Westminster after the UK left the EU on 31 January 2020.On Monday, farmers in Northern Ireland received their share of just over £300m <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-58952035>, as the first of this year's direct payments hit applicants' bank accounts.Direct payments are annual government subsidies paid to farmers to support the agricultural industry and to help protect food supplies.Payments rose by 6% this year, meaning farmers get, on average, an extra £800.Agriculture Minister Edwin Poots said it was the largest amount paid out on the first day of the payment window."}