{"author":"By Nelli Bird","title":"Ukraine refugees: Family needs visas to come to Wales","news_category":"general","content":"The home secretary has been urged to intervene in the case of a Ukrainian family of seven who cannot come to Wales because only five of their visas have been approved.Lilya and her six boys, aged between four and 14, are waiting to come to Monmouthshire.But visa delays mean they could soon lose their temporary home in Romania. The Home Office said it had streamlined the system and was working as fast as it can.Lilya and her sons lived in a village in central Ukraine.Before the invasion, Lilya lost her four-year-old daughter Liza, her son Dmytro's twin, in a house fire.Her severely disabled daughter, Vladochka, died when she was 13.So when the latest Russian invasion began, she said she knew she had to get her family out.\"I know what it's like to lose a child,\" she said. \"When the war started, we were still at home for a while, hoping that these hostilities would end quickly, as we had been told we will win in a week or two.\"When the situation worsened, I simply had no choice but to try to put my children in a safe place, because I didn't want to lose more children.\"As the invasion continued into March, Lilya read a BBC Wales story about plans to house up to eight Ukrainian refugees in a refurbished bungalow on the site of a primary school in Wales.She got in contact with Phil Cotterell, chairman of the school's governors, who then sponsored the family to come to Wales.Lilya said she was \"thankful to God\" for his help and the work of volunteers in Wales.Her next struggle was to get herself and her boys out of Ukraine.Her initial plan was to travel to Odesa on the Black Sea, but heavy shelling made the route unsafe.Eventually, she found someone to take them to Romania, arriving at the border in the middle of the night.They found help and a place to stay in the Romanian capital, Bucharest.But the family's goal was to reach the bungalow in Wales. \"When I saw the photo and learned that people are raising money and making renovations, I was amazed... especially the photo where they already bought toothbrushes and toothpaste,\" she said. \"Every day they ask how my day went... I know that there are very wonderful people living there.\"Lilya said she looked up the town on the internet and was looking forward to going there.\"We saw the castle, but only in the photo. I want to visit it and get acquainted with the people of this city,\" she said. \"We hope that we will not only be guests but will be able to become part of society and benefit people.\"She said she associated the UK with castles and knights and described Mr Cotterell as a \"noble knight\".As she waited in Romania, Lilya said she felt the visa process was \"taking too long\".The bungalow, meanwhile, has been transformed from being a storage space to a welcoming home, with a cosy lounge, new carpets and three bedrooms.People have done painting, gardening and fundraising, while local businesses have helped to cover the cost of the family's travel and accommodation in Bucharest.Mr Cotterell has asked the home secretary to step in, as the family's current accommodation in Romania is only available until 1 May.\"I would like to say to Priti Patel, to the home secretary, as a mum, can you intervene in this family's plight and get her on a flight to the UK before May 1st,\" Mr Cotterell asked. \"This family has gone through horrendous horror in escaping the war.\"He said there was \"anticipation\" but also the \"frustration\" over the weeks the family has had to wait.\"We have done everything possible through the system to the letter, I've had an enhanced DBS check, and the family has completed all the process,\" he said. \"What I found mind-blowing is, how do seven people present their applications at the same time but they can't be processed at the same time?\"Other families having problems with visas, including applications being \"lost,\" have been raised in the House of Commons by the Cardiff North MP, Anna McMorrin.The latest Home Office figures show 2,314 visas had been issued to people wanting to come to Wales as part of the UK government's Homes for Ukraine sponsorship scheme.The figures, which are broken down by local authority area, indicated that Cardiff had the most visas issued, at 162.Blaenau Gwent had the least with five.A total of 669 visas have been approved after being sponsored by the Welsh Government.There are no figures on arrivals to Wales but of the 86,100 visas issued by the UK government, 27,100 people have arrived.A UK government said the UK was at the \"forefront of supporting those fleeing Ukraine\" with staff deployed to visa application centres across the EU, where they are \"providing advice and supporting people through the process as fast as [they] can\".A spokesperson added: \"In just six weeks, almost 72,000 visas have been issued so Ukrainians can live and work in the UK.\"The changes the Home Office has made to streamline the visa system, including simplifying the forms and boosting staff numbers, are working and we are now processing visas as quickly as they come in, enabling thousands more Ukrainians to come through our uncapped routes.\""}