{"author":"","title":"Shelter Cymru funding is cut in Wrexham","news_category":"general","content":"Wrexham councillors have voted to withdraw £44,000 of funding to a charity which supports homeless people.The authority claims it can manage the cases itself, while Shelter Cymru has said a vital service will be lost.The money helped to pay for three jobs in the charity's Wrexham office. Staff hours will now be reduced.A report to the council said the local authority was trying to ensure resources were used in the \"most cost effective way\".In the last 12 months Shelter Cymru dealt with more than 1,000 cases in Wrexham, including 541 new cases.Janet Loudon, Shelter Cymru's national operations manager, described the move as a false economy.\"Any immediate savings made by cutting our funding will be far outweighed by the additional demands made on the council and other services by people in crisis situations with complex housing and debt problems,\" she said.\"The current economic climate is likely to mean an increase in redundancies, repossessions and housing problems.\"Shelter's senior debt advisor, Dave Sheridan, explained the help group was busy every week attending Wrexham county court, giving independent advice to judges whilst helping its own clients.A total of 25% of its new cases over the last year involved representing people in court.Mr Sheridan said if the help group wasn't on hand to provide advice, cases would have to be adjourned, adding to costs, time and heartache to people who face having homes repossessed.Shelter Cymru also receives funding of £38,000 from Legal Services Commission and Welsh Assembly Government to pay towards their current service.The report said: \"There is no obligation on local authorities to ensure any housing advice it provides is 'independent' and there is no obligation on homelessness functions to fund advocacy services.\"Councillors sitting on Wrexham council's executive board on Tuesday were advised to recommend the non renewal of the contract.Officials want the savings retained by the authority's own Housing Options (Homelessness) service, funding two homelessness prevention posts.In 1987, Wrexham became one of the first local authorities to provide funding for Shelter Cymru's housing advice service."}