{"author":"","title":"Essex hospitals: Waits in A&E for ward beds hit record high","news_category":"general","content":"The number of people waiting more than 12 hours in Essex hospital A&Es for a bed on a ward hit a record high last month, according to latest figures.Across Essex, 68,518 people visited an emergency ward in the area in October, the highest monthly total since monthly records began in June 2015.Matthew Taylor, chief executive of the NHS Confederation, said: \"The NHS is now facing unsustainable pressures.\"Hospital bosses said services should be used \"appropriately\".NHS hospitals have a target of at least 95% of patients attending accident and emergency departments to be admitted, transferred or discharged within four hours.In October, it was 77.4% at Mid and South Essex NHS Trust, 61.1% at The Princess Alexandra Hospital NHS Trust and 78.7% at East Suffolk and North Essex NHS Trust.There were also 227 people having to spend more than 12 hours before getting a bed, the highest number on record, according tothe Local Democracy Reporting Service <https:\/\/www.bbc.co.uk\/lnp\/ldrs>.The East of England Ambulance Service answered 101,377 calls to 999 in October, a record high number, with paramedics responding to 8,487 life threatening call-outs last month.Mr Taylor said the NHS was \"running so hot it has reached a tipping point\".\"These numbers highlight the extraordinary and unprecedented demand the health service is now facing with a waiting list that now tops 5.8 million,\" he said.Neill Moloney, interim chief executive of East Suffolk and North Essex NHS Foundation Trust, said: \"If anyone is seriously unwell and needs urgent or emergency care, they must of course come to hospital, but the best way our communities can support the NHS this winter is to use services appropriately.\"Stephanie Lawton, chief operating officer at The Princess Alexandra Hospital NHS Trust, said: \"We encourage patients to contact NHS 111 first to find the right place for their healthcare needs. Often, most minor injuries and illnesses can be treated safely and quickly outside of a hospital environment by a GP, local pharmacy or with the right self-care.\"Mid and South NHS Hospital Trust has been contacted for comment.Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}