{"author":"By Tom Airey","title":"Neuroblastoma: The cancer-hit families facing a funding mountain","news_category":"general","content":"Neuroblastoma is a rare, aggressive and complex cancer most common in children under five. It is treatable on the NHS, but survival rates when relapses occur are poor. Some families turn to fundraising to pay for experimental US care in a bid to stop the cancer returning - facing medical bills that dwarf the average UK house price. Three families at different stages of the process have spoken to the BBC about their experiences.On the eve of her son's third birthday last July, Lucy Mellon-Jameson texted her boss.\"I just want to let you know that I won't be in work for a while. Jude's been found to have cancer,\" she wrote.An hour earlier, she and her husband Arron had received the earth-shattering news that their little boy had high-risk neuroblastoma.Jude, from Sheffield, is one of about 100 UK children diagnosed with the rare condition each year, accounting for just 6% of all childhood cancer cases.A diagnosis kicks off a chain of NHS treatments - but families face challenging odds even if the cancer goes into remission. According to charity Solving Kids' Cancer, it returns in almost 50% of cases. If it does come back, they say, fewer than one in 10 will survive.Lucy says the family thought the first signs of Jude's illness were caused by a tick bite he suffered during a summer camping trip to the North Yorkshire coast.\"We ended up seeing some very unusual things going wrong with him,\" she says. \"After various trips to A&E I was convinced they were to do with the bite.\"\"He was struggling with walking, going off his food, sweats in the night, a high temperature. But none of it was constant and very few of the symptoms happened at the same time.\"After various hospital departments carried out tests, Jude had an MRI scan which revealed the cause of his symptoms - a tumour which had spread to his skeleton.\"You hear of breast cancer, prostate, bowel, leukaemia, but having the word neuroblastoma put to you - that you have absolutely no knowledge of - made it more frightening.\"You don't know what you're dealing with.\"Jude has responded well to a gruelling set of treatments and begins immunotherapy in March. His family is now aiming to finance treatment options in the US.Because neuroblastoma is so rare, progress of treatments is slow and clinical trials must often run for many years and across international borders to obtain statistically valid results.But without the luxury of time, Lucy and Arron wanted to give Jude the best possible chance of avoiding relapse.\"We haven't come this far to go through this journey again when there are options out there - it just seems so cruel,\" she says.\"They are only trials, there are pros and cons. I can understand why some families do not choose it and no child's cancer journey is the same, but we feel we have to do everything we can.\"After deciding fundraising was the right decision, Jude's parents realised the circle of people who were aware of their situation had to expand.\"Each place that wants to help needs the backstory, they need photos. That's really difficult because you've got a child at the centre of it all that has gone through so much and you're trying to protect them, but you also have to expose them at the same time,\" she says.Arron, a former Sheffield Wednesday FC goalkeeper, helped to arrange for Jude to present the match ball at the start of the Owls' home game at Hillsborough last Sunday. Their fundraising total quickly doubled from £16,000 to £32,000 as a result.\"You want to give them normal experiences, I just want him to be able to go to nursery and enjoy being around other children, so for him to be stood in front of 26,000 people is not a normal thing for a three-year-old,\" Lucy says.\"He felt safe, secure and really enjoyed it, it's about getting the exposure right and being selective about what we do.\"Six-year-old Eden, from Holmfirth, West Yorkshire, was diagnosed with high-risk neuroblastoma in April 2021 after complaining of pains in her legs which her parents had initially put down to growing pains.After multiple rounds of chemotherapy and a nine-hour operation to remove the tumour, her family wants to be ready to take her to the US by the time her NHS front-line treatment comes to an end in the summer.They hope she can access the Bivalent Vaccine clinical study in New York, with the vaccine aiming to trigger a response of the immune system against neuroblastoma.\"For us as a family it was a no-brainer really,\" says her dad, Lee Smith.Lee contacted the Memorial Sloan Kettering Cancer Center in the US, and says he was \"absolutely shocked\" when it sent back a $700,000 (£514,412) quote.\"We were looking at our options, money in the house, savings. We'd have done anything we could have done but we certainly wouldn't have been able to reach it,\" he says.\"We'd have sold the house if we had to, we would have done whatever it took.\"After Solving Kids' Cancer stepped in to help, the family's target became £360,000, with £230,000 raised to date.The campaign got a £160,000 boost from the Gardens of Eden event - a 22-mile sponsored walk joined by hundreds.\"It was a long line of 440 people wearing pink trailing around Huddersfield during torrential rain,\" says Lee. \"The whole community has raised a massive amount with one event, it's unbelievable really.\"\"I can sleep a lot easier now and you can tell this community isn't going to stop until we hit this target. You can tell they're fully behind us and I'm almost 100% confident we'll get there.\"The family says Eden is excited about visiting New York for the trial.\"She's taken each treatment head-on, she's polite even when she's been sick and the Leeds General Infirmary nurses adore her,\" says Lee.But there's also frustration that the option involves several years of transatlantic trips.\"It's mind-boggling how much UK cancer treatment has progressed here in the last 20 years and there's no reason why neuroblastoma should be so far behind,\" adds Lee.A lump was found on Oliver Stephenson's kidney in January 2020, with the cancer spreading to his bone marrow, skull and eye sockets.Chemotherapy started the next day, with his family initially hopeful about hitting their fundraising total of £230,000 until the world changed two months later due to Covid-19.\"Our biggest concern was we had to cancel everything, nothing can happen, how on earth are we going to raise this money with everything closed and we can't go out?\" recalls his mother Laura Stephenson, from Ackworth in Wakefield.Ten close friends formed an \"admin team\" to share out the fundraising effort and the family hearing about the Bivalent Vaccine trial due to an odd coincidence.\"There was another little girl in our village who'd had the same diagnosis and treatment the previous year, so as a village we'd already raised money for her and heard about this US treatment,\" says Laura.\"To have two children who went to the same school was just unheard of.\"As the UK was getting to grips with family calls over Zoom, the \"admin team\" used the app to hold online raffles and weekly quizzes to keep building up their total and eventually hit the target.\"People who were ordinarily at work were now at home, so it ended up working in our favour in the end,\" says Laura.Oliver, now four years old, has made five trips to New York, with one more course of US treatment due in April. The family soon hopes to be in the position where Oliver's regular check-ups in Leeds get further and further apart.The bigger hope is that, one day, families plunged into turmoil by learning their child has developed a potentially fatal disease will not have to make Herculean efforts to find money while processing the devastating news of their diagnosis.\"Your world is upside-down when your child is diagnosed, everything you ever knew about life is gone and you then have to currently raise more than £300,000 on top of the most traumatic thing in your life,\" says Laura.\"To take that worry away for families would be incredible.\"Solving Kids' Cancer, the charity which is supporting all three families practically, financially and emotionally, says the paradox is that these huge funding pots are being channelled away from broader research goals that could benefit all children facing the disease.Chief executive Gail Jackson says: \"The Bivalent Vaccine trial shows promise in a Phase 2 relapse study, but the data is still as yet unproven in children who are in first complete remission.\"Our ultimate goal is to facilitate and support more research that improves the effectiveness of standard of care treatment in the UK so families don't feel compelled to raise these funds.\"The family of Liam Scott, a five-year-old boy from Kent who took part in the New York trial, recently met with Health Secretary Sajid Javid to call for the experimental vaccine to be brought to the UK, with Batley and Spen MP Kim Leadbeater aiming to raise the issue in Parliament after supporting asimilar fundraising drive. <https:\/\/www.bbc.co.uk\/news\/uk-england-leeds-60317714>A Department of Health and Social Care spokesperson said: \"Our experts are taking part in an international discussion on the best way to trial the Bivalent Vaccine so that we understand its efficacy in this group of patients.\"We currently have over 800 cancer trials in progress, including those on children - this is double that of any other country including the US.\"Follow BBC Yorkshire on Facebook <https:\/\/www.facebook.com\/BBCYorkshire\/>, Twitter <https:\/\/twitter.com\/bbclooknorth> and Instagram <https:\/\/www.instagram.com\/bbcyorkshire\/>. Send your story ideas to yorkslincs.news@bbc.co.uk <mailto:yorkslincs.news@bbc.co.uk>."}