{"author":"","title":"Ukrainian refugee arrives at friend's flag-painted house in Cambridge","news_category":"general","content":"A woman who painted her house in the colours of the Ukrainian flag said she was \"really relieved\" that her friend from the country had arrived in the UK.Rend Platings secured a visa for Kristina Korniiuk, 34, from Kyiv, under the Ukraine Sponsorship Scheme.The pair were reunited at Mrs Platings's home in Cambridge on Sunday.\"It feels really, really wonderful,\" Mrs Platings said. \"It's a little bit surreal. And it's kind of quite hard to believe.\"Mrs Platings, who said she painted her house blue and yellow <https:\/\/www.bbc.co.uk\/news\/uk-england-cambridgeshire-60576687> to \"to make a statement\" about the Russian invasion, has been friends with Ms Korniiuk for three years and they last saw each other at the beginning of February.Mrs Platings told the Press Association that her reunion with her friend, following a journey which took more than 24 hours, was \"amazing\" and coming to the UK was \"just the right thing to do\".\"I think the first thing I felt was just really relieved, and the second thing was that I just couldn't believe that she's actually here,\" she said.\"I've always wanted her to come, and to show her Cambridge.\"It's just a shame it was in this situation, but on balance we're happier that she's safe.\"I hope that she'll be able to make the most out of it and find that she makes friends over here and that she, instead of losing her country, she kind of gains another community that she can become close to.\"Then hopefully we'll all be able to visit her back in Ukraine when this is all over.\"Ms Korniiuk, who stayed in Kyiv for the first three weeks of the invasion before moving to the west of the country, said while she was happy to be in England she would prefer if it was under better circumstances.She said she was worried about her family in the Ukrainian capital, but realised it was her parents' choice to stay there.\"I tried really hard to convince them,\" she said.\"Well, I mean we are all adults and we have responsibilities for our lives, so they decided to stay and I couldn't convince them.\"Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}