{"author":"","title":"Oldham Coliseum theatre closure confirmed after funding cut","news_category":"general","content":"Oldham Coliseum is to close despite a long campaign to save the 135-year-old venue, it has been confirmed.The much-loved Victorian theatre will shut on 31 March after losing all its funding from Arts Council England.Head of marketing Shelly Ramsdale confirmed the closure \"with deep sadness\" after consultation with staff.The playhouse had been unable to come up with a rescue plan despite a campaign <https:\/\/www.bbc.co.uk\/news\/uk-england-manchester-64722734> supported by the likes of actress Maxine Peake.Oldham Council said the building was not fit for purpose and has unveiled plans for a new £24m theatre in the town.Ms Ramsdale said: \"The Coliseum is not the historic building so many have come to adore, it is the company that runs it and the people who fill its halls with memories.\"The outpouring of love for the theatre over the past weeks has been overwhelming, demonstrating the Coliseum's impact on the communities of Oldham and further afield.\"To our audiences, industry colleagues, partners, sponsors, funders, patrons and friends - we cannot thank you enough for your support over more than a century of theatre.\"Arts Council England said it recognised the closure was \"upsetting news for many and devastating for its staff\".A statement read: \"We are providing funding to ensure the company can pay full redundancies to its employed and freelance staff and that it can honour any outstanding contracts and agreements.\"Whilst recognising the current difficulties, we are supportive of Oldham Council's plans for a new performing space which will carry forward Oldham Coliseum's cultural legacy.\"We will be investing £1.85m in the borough so that the people of Oldham will still have the opportunity to enjoy and take part in arts and culture.\"Oldham Council said plans for the new theatre on Union Street would be submitted in the summer.Why not follow BBC North West on Facebook <https:\/\/en-gb.facebook.com\/BBCNW\/>, Twitter <https:\/\/twitter.com\/BBCNWT> and Instagram <https:\/\/www.instagram.com\/bbcnorthwest\/>? You can also send story ideas to northwest.newsonline@bbc.co.uk"}