{"author":"","title":"Energy bills: What can I do if I can't afford to pay?","news_category":"general","content":"Energy prices have soared, leaving many people worried about how to pay their bills.Some of those struggling have been forced onto more expensive prepayment meters.If you don't agree a payment plan with your supplier, they might try to force you to have prepayment meter installed, or they mayswitch your existing smart meter to prepayment mode <https:\/\/www.bbc.co.uk\/news\/business-64469358>.This has proved controversial. The energy regulator, Ofgem, is reviewing the way prepayment meters operate.In very rare cases, if you haven't paid a bill after 28 days, you might be threatened with disconnection, but you'll normally be offered a meter first.Your supplier must give you a chance to clear your debt through a payment plan before activating a prepayment meter.If you've reached state pension age, your supplier can't disconnect you between 1 October and 31 March if you either:Suppliers can pass your details to a debt collection agency - and you might be charged more to cover the cost of this.Many suppliers also charge extra fees for late payments.Paying by direct debit is normally the cheapest way to pay for electricity and gas. Cancelling a direct debit means your future bills are likely to be higher.Finally, not paying bills could damage your credit rating, and make it harder to borrow money in the future.There are more than four million UK households on prepayment meters. Under the rules <https:\/\/www.ofgem.gov.uk\/information-consumers\/energy-advice-households\/check-prepayment-meter-rules>:However, an investigation by the Times newspaper <https:\/\/www.thetimes.co.uk\/article\/british-gas-prepayment-meter-debt-energy-bills-investigation-wrgnzt6xs> found debt agents acting for British Gashad wrongly broken into vulnerable people's homes to fit meters <https:\/\/www.bbc.co.uk\/news\/business-64491243>. Ofgem has asked all suppliers to review the use of court warrants <https:\/\/www.bbc.co.uk\/news\/business-64504609> to enter the homes of customers in arrears.Check your direct debitYour monthly payment is based on your estimated energy use for the year, and your supplier may reduce your bill if its estimate is higher than the amount you actually use <https:\/\/www.nea.org.uk\/get-help\/key-things-to-do-if-you-are-struggling-with-your-energy-bills\/>, so check.You can also request a flexible monthly direct debit where you pay for what you actually use each month. This requires a smart meter or regular readings.But two-thirds of gas usage is during the winter months, and prices have risen sharply, so in the short term this could mean your bill is higher.This video can not be playedWorried about energy bills? The BBC's Colletta Smith tells you - in a minute - about four discounts and payments that could helpPay what you canIf the direct debit is fair, but you can't meet it, ask your supplier for an \"able to pay plan\" based on what you can afford.By paying something every month - even if it's less than the amount due - your arrears will grow more slowly, meaning your supplier may be less worried about your debt.You may also wish to get your name added to the Priority Services Register (PSR) <https:\/\/www.ofgem.gov.uk\/information-consumers\/energy-advice-households\/getting-extra-help-priority-services-register>, a list of households which should get extra support.Those eligible include pensioners, those who are pregnant or who have young children, or people who are disabled.Your supplier can also get your name added to the network operator register if necessary. Ofgem recommends doing this if you rely on your energy supply for medical reasons.If you have a different supplier for your gas and electricity, you need to contact them both.Being on the PSR doesn't cancel your arrears. But it does show that you are vulnerable, which your supplier should take into account.Claim what you are entitled toCheck you are claiming all the benefits you can.The independent MoneyHelper website <https:\/\/www.moneyhelper.org.uk\/en\/benefits> has a useful guide, while Policy in Practice <https:\/\/www.betteroffcalculator.co.uk\/login> and the charities Entitledto <https:\/\/www.entitledto.co.uk\/?e2dwp=y> and Turn2us <https:\/\/benefits-calculator.turn2us.org.uk\/> run benefits calculators.You may also be able to repay your debt directly from your benefits through the government'sFuel Direct scheme <https:\/\/www.gov.uk\/bills-benefits>.A number of suppliers and charities also offer grants to help with bills <https:\/\/www.citizensadvice.org.uk\/consumer\/energy\/energy-supply\/get-help-paying-your-bills\/grants-and-benefits-to-help-you-pay-your-energy-bills\/#Grants_To_Help_Pay_Energy_Debts>.Check you're getting extra government helpThe government has announced a range of support to help people with energy bills <https:\/\/www.bbc.co.uk\/news\/business-61592496>, including a £400 grant for all UK households, paid in instalments between October 2022 and March 2023.Norther Ireland households are getting a single payment of £600 <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-64024396> from January. It is more because so many homes use heating oil.Adjust your boilerIf you have a combi boiler at home - you don't have a hot water cylinder and there is a (usually white) plastic pipe under the boiler - you may wish to consider turning down the heating flow temperature.On the front - sometimes behind a flap - look for a dial or set of buttons with a radiator icon. Turn the dial to the number three, or the 12 o'clock position. If it has a digital display, select 60C.You may also want to turn off the hot water pre-heat. Many boilers come on every few hours - night and day - to ensure there's always some hot water available.Most homes don't need this, and turning it off saves money. How have you been affected by rising energy prices? Share your experiences by emailinghaveyoursay@bbc.co.uk <mailto:haveyoursay@bbc.co.uk?subject=Energy62435432>.Please include a contact number if you are willing to speak to a BBC journalist. You can also get in touch in the following ways:If you are reading this page and can't see the form you will need to visit the mobile version of theBBC website <https:\/\/www.bbc.co.uk\/news\/have_your_say> to submit your question or comment or you can email us atHaveYourSay@bbc.co.uk <mailto:Haveyoursay@bbc.co.uk>. Please include your name, age and location with any submission."}