{"author":"By Phil Mackie","title":"Birmingham Commonwealth Games: Excitement for aquatics centre","news_category":"general","content":"One of the most deprived towns in the UK will soon have one of its best swimming and diving complexes.The aquatics centre for the Birmingham Commonwealth Games is being built in Smethwick in neighbouring Sandwell.But as well as full-time athletes, the venue has also been designed for the local community's long-term use.The area has traditionally had low participation in swimming and other water activities.In recent weeks, the pool has been gradually filled with water <https:\/\/www.bbc.co.uk\/news\/uk-england-birmingham-60071255> in preparation for the Games this summer, and Liz Wilkins, a water polo coach with local club Warley Wasps, was allowed a sneak preview.Wearing a hard hat, goggles and a high visibility jacket, she couldn't hide her excitement, saying: \"Oh wow, it's amazing. In Smethwick!\"This video can not be playedCommonwealth 2022: Smethwick swimming and diving complexIt is 60 years since Ms Wilkins became involved in swimming, and cannot wait until hers, and two other clubs, get to use the venue next year.\"If you want to go on an aquatic journey that's going to take you as far as you possibly can, potentially even to the Olympics, you can do most of your training in Smethwick,\" she said.When Birmingham was awarded the 2022 Games, many asked what would be its legacy.In the city itself, the Alexander Stadium is being given a major revamp, and there will be new housing in Perry Barr, but arguably the landmark building project is the aquatics centre.Smethwick is an old industrial town in the Black Country and is diverse, with large Muslim, Hindu, Sikh and African-Caribbean communities.It has lower than average wages and life expectancy, with higher than average unemployment and fuel poverty. People living in Smethwick are more likely to be obese and unhealthy.It is why the new aquatics centre could be a game-changer. Labour councillor Bob Piper has lived in the town for 40 years and believes the diving facilities will be as important as the swimming pool.\"Who knows?\" he said. \"In ten years' time we could have our very own Tom Daley from Smethwick. It'd be wonderful.\"After the Games, the venue will become a building site once again as contractors return to remove 5,000 seats and a warm-up pool to replace them with several gyms and football pitches. It will be opened to the public in 2023.Under-18s aren't allowed on site at the moment, but the borough council is taking a roadshow around local schools to show children what their new sports complex and pool will look like.At Bristnall Hall Academy, which is half a mile (0.8km), or ten minutes' walk from the new site, questions were about job opportunities as well as facilities.Kim, in year 10, who is already a member of a swimming club in Birmingham, says it will be inspirational to be able to compete in the same pool as the professionals.Aurona, in year 11, plays basketball, so is looking forward to the non-aquatic facilities, while another year 11 pupil, Sabaa, believes that plans to have private, women-only sessions in gyms and pools will persuade more participation from some of the local communities.\"It's kind of like 'wow this is actually happening' - it's part of my childhood, it's where I grew up, so it's kind of amazing to see that,\" Sabaa said.Follow BBC West Midlands on Facebook <https:\/\/www.facebook.com\/MidlandsBBC\/>, Twitter <https:\/\/twitter.com\/bbcmtd> and Instagram <https:\/\/www.instagram.com\/bbc_midlands\/?hl=en>. Send your story ideas to: newsonline.westmidlands@bbc.co.uk <mailto:newsonline.westmidlands@bbc.co.uk>"}