{"author":"","title":"EU funds: UK government urged to fully replace money lost post-Brexit","news_category":"general","content":"Northern Ireland's five main political parties have sent a joint letter to the UK government urging it to fully replace EU funds which were lost after Brexit.The letter concerns the European Social Fund (ESF) which has helped projects in the community and voluntary sector.On Tuesday, a consortium of community groups warned they were facing a funding \"cliff edge\" <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-63219860>.They warned up to 1,700 jobs were at risk if the ESF was not fully replaced.The letter says: \"The Conservative Party made a manifesto commitment to replace the European Social Fund in its entirety.\"As leaders of the main parties at Stormont, we would urge the UK government to honour that commitment and provide certainty and security for the many people who depend on these programmes by fully replacing the European Social Fund.\"The letter has been sent to Simon Clarke, secretary of state for Levelling Up, Housing and Communities.The ESF had previously provided about £40m a year, which was 35% match-funded from Stormont, giving £54m in total.Next year experts are anticipating about £30m from the UK Shared Prosperity Fund, but no match funding has been confirmed from Stormont yet.The ESF Peer Group, which provides employment support programmes in Northern Ireland, has been seeking a solution from Stormont and Westminster departments for more than a year.The consortium is due to meet with representatives from the Department for Levelling Up on Friday.The Reverend Andrew Irvine, the chairman of the ESF Peer Group and chief executive of East Belfast Mission, said the EU funding had been used to help vulnerable and disadvantaged people find work.\"Much good work has already taken place to secure funding but a final agreement is still outstanding,\" he said.\"There is a small window of opportunity to address these issues this week. If no solution can be reached, jobs and our support programmes will be lost.\"A government spokesperson said: \"Northern Ireland is benefiting from £49m through our Levelling Up Fund, which is empowering communities to drive change.\"This is on top of £127m allocation from the UK Shared Prosperity Fund to help those most vulnerable and furthest away from the labour market to secure sustainable employment, alongside other priorities.\"The Department for Levelling Up said they were also engaging with Stormont departments.Earlier this year, a senior official at the Department for the Economy said that over the next three years more than £100m in core funding which would have come from the EU will no longer be available.The UK government has previously said that funding will \"ramp up\" over time so that total domestic UK-wide funding will at least match receipts from EU structural funds."}