{"author":"","title":"Coastal erosion group in Norfolk wants neighbourhood plan changed","news_category":"general","content":"A woman who started a campaign to defend a village from the sea is calling for the neighbourhood plan to be changed.An application to build a rock defence at Hemsby in Norfolk has been submitted to Great Yarmouth Borough Council.But Lorna Bevan, from Save Hemsby Coastline <https:\/\/www.facebook.com\/SaveHemsbyCoastlineNOW>, said unless the rock berm was prioritised in the neighbourhood plan, the village was at risk.The parish council said residents must decide what is best for the village.The coastline at Hemsby has been severely affected by erosion. Seven bungalows along The Marrams had to be demolished when sandy cliffs washed away <https:\/\/www.bbc.co.uk\/news\/uk-england-norfolk-43442176> in March 2018 and, in December 2013,\"the worst storm surge in 60 years\" <https:\/\/www.bbc.co.uk\/news\/uk-england-norfolk-25254808>, destroyed seven homes.An application for a 1.3km (0.8m) rock berm - a line of rocks at the base of the cliff - has been submitted, but alongside this process is a consultation for theHemsby Neighbourhood Plan <http:\/\/www.hemsbyparishcouncil.org.uk\/community\/hemsby-parish-council-18539\/neighbourhood-plan\/>, which prioritises rollback.This is a scheme where people who lose property as a result of erosion are given the chance to relocate inland.Ms Bevan, who runs The Lacon Arms on the coast, said they need to save the cliff and beach and has called for residents to write to Hemsby Parish Council, asking them to support the prioritisation of rock berm in the plan instead.\"Why would I want a piece of land somewhere else that might not be in the village?\" she asked.\"It could be somewhere else; it's not my community and it's just a piece of land; it's not a property.\"Once [the neighbourhood plan] gets set in stone it's there for donkeys years to come... this is just making sure going forward, that rollback is not the option.\"She added that without the beach being maintained there would be no tourism and the village, which has just over 3,000 residents, would \"become a very insignificant place\".Parish council chairman, Keith Kyriacou, said many of the draft polices in the neighbourhood plan mirrored those already in the borough council's local plan, including the district's policy on rollback.\"During consultations with residents, they requested that we identify sites within the parish for rollback,\" he said.\"If this is no longer the case and the residents wish to change their original comments, please contact the parish council directly.\"Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk"}