{"author":"By Mark Savage","title":"Paul McCartney shares 'magical' Glastonbury memories and exclusive photos","news_category":"general","content":"This video can not be playedBackstage at Paul McCartney's Glastonbury setFrom the explosive opening of Can't Buy Me Love to the closing chords of The End, Sir Paul McCartney played one of Glastonbury's greatest ever sets this summer.Over the course of three hours, he brought new life to the classics that established him as the planet's most successful and influential living songwriter.Along the way, he duetted with Bruce Springsteen and Dave Grohl; played Something on George Harrison's own ukulele; and blew the fireworks budget for a thrilling Live And Let Die.It was an emotional night from the outset, when fans stopped Sir Paul in his tracks by singing Happy Birthday.\"For me?\" asked the star, who'd turned 80 a week earlier.It was equally moving when Sir Paul played I Got A Feeling as a duet with John Lennon, whose vocals had been isolated for Peter Jackson's Get Back documentary.For a moment, the two friends were reconnected and trading melodies again; Lennon frozen in time, as Sir Paul surveyed an audience they could, in a different universe, have shared.\"That is so special for me,\" said the star. \"I know it's virtual, but there I am singing with John again. We're back together.\"Then he strapped on a guitar and played Helter Skelter, cutting the tension with a blast of pure hedonistic energy.Sir Paul's command of the stage is so casual that he makes it look easy. But it isn't. It's pure magic.\"It was the comeback that matched every bit of anticipation after two years of lockdown, and it brought the whole festival to tears of joy,\" says Glastonbury organiser Emily Eavis.\"Sometimes there is a performance where everything aligns and for us, this was it. The incredible band and guests, the untouchable set list, a packed field singing along to every word, the clear sky and the magic of the night… truly unforgettable.\"Now, Sir Paul shares his personal reflections on Glastonbury with BBC News, along with a selection of backstage photos and videos - many of which have never been seen before.\"Festivals are special, but Glastonbury is particularly so and it's a big event in lots of people's year. Because it had been cancelled in 2020 and 2021 due to Covid, it became more important to pull it off.\"I'd asked Bruce Springsteen in 2020 if he'd be happy to come onboard and he said yes, and he kept his promise two years later. So that was very exciting, having him and Dave Grohl up on the stage.\"It's a pretty impressive scene for people in the audience, but we get the whole view up on the stage with the flags and the hills going back forever, so it was quite a big deal that they said yes to joining me in that experience.\"Of course, up on stage I can't really see people's reactions but I love to hear them because I've found myself doing that at concerts. I went to see James Taylor once and started blubbing because it was just so lovely! I was thinking, 'Oh, I love this guy' - I'm getting emotional even now!\"It's a magical thing, knowing music can do that to people. We're the only animal on the planet that does that.\"Then you've got the spirituality of the place, knowing about the ley lines and everything else. When you have an event like Glastonbury and everyone comes together with good vibes and energy, I'm very happy to be part of that.\"Follow us on Facebook <https:\/\/www.facebook.com\/BBCEntsNews\/> or on Twitter @BBCNewsEnts <https:\/\/twitter.com\/BBCNewsEnts>. If you have a story suggestion emailentertainment.news@bbc.co.uk <mailto:entertainment.news@bbc.co.uk>."}