{"author":"By James Williams","title":"Emergency Covid funding for Wales' buses to be withdrawn","news_category":"general","content":"Emergency funding to help keep Wales' bus industry afloat during the pandemic is set to come to an end in late July.The Welsh government has announced the cash will run for a further three weeks until 24 July, as the Bus Emergency Scheme (BES) had previously been extended from March to June.Ministers have warned services could be reduced to a \"skeleton\" service <https:\/\/www.bbc.co.uk\/news\/uk-wales-politics-64650058> following the end of the grants.Plaid Cymru said it was an \"incredibly short-sighted decision\".The Welsh government stepped in to provide more than £150m in support to bus companies when passenger numbers collapsed at the start of the pandemic.On Friday, it announced a further three-week extension to the end of the school year, meaning \"school transport will continue as normal\".In a written statement <https:\/\/www.gov.wales\/written-statement-bus-emergency-scheme-and-franchising-expert-panel>, Deputy Climate Change Minister Lee Waters MS said the government would work with partners \"on the transition away from emergency-style funding to plan bus networks which better suit the new travel patterns we have seen since the end of the pandemic\".He has asked Transport for Wales, council leaders and bus representatives to work together \"to understand the impact of the ending of BES and to resolve the network issues that are likely to arise from the change in funding regime\".Industry body Coach and Bus Operators Cymru which represents small firms, has previously raised fears of 65% to 100% of services being cut.Two Welsh Labour council leaders warned that cuts to bus services could be \"devastating\" <https:\/\/www.bbc.co.uk\/news\/uk-wales-politics-65054549> for those relying on public transport.Speaking on the BBC Politics Wales <https:\/\/www.bbc.co.uk\/iplayer\/episode\/m001kv39\/politics-wales-02042023> programme, Education Minister Jeremy Miles said: \"Authorities across Wales are mapping out what this means - both for their public services but also for schools.\"Plaid Cymru leader Adam Price said: \"I think extending by a matter of weeks beyond the three months that was already promised is not going to work at all because it's going to lead to absolutely cataclysmic collapse of not just bus services but bus companies.\"It's an incredibly short-sighted decision by a Welsh government that is saying, quite rightly, they want to encourage the shift out of the car to public transport.\"What we need, really, is 12 months of stability while we can actually build a bridge towards that new public transport provision rather than completely pulling the rug from underneath the bus companies.\""}