{"author":"By Emily Unia","title":"Kinship: Third of family carers get no financial support, says charity","news_category":"general","content":"A grandmother says she feels \"pushed into poverty\" after taking on parental responsibility to stop her two grandchildren going into care.The woman from Merseyside has been speaking out about the difficulties of getting support, following a national survey by the charity Kinship.It asked 1,948 carers what help they received from their local authority and found more than a third got nothing.The government said councils were receiving an extra £3.2bn.Children in kinship - or family and friends care - are usually vulnerable and if they were not living with relatives or family friends, they would probably be in local authority care.There were believed to be 180,040 children living with relatives in the UK, according to the 2011 census.Jo - not her real name - has a grandson and a granddaughter who both live with her.She took them in because their birth parents could not look after them and there was a risk they would go into foster care or be adopted.Jo went to court to get Special Guardianship Orders, giving her all the same rights as a parent, but she said it meant she could not be a \"normal\" grandmother.\"I should be sneaking them ice creams and hiding them when they're naughty, I can't do that,\" she said.\"We all have to sing when the ice cream van comes round so they can't hear the bell. It takes up all your time.\"You want to be a nan but you have to be a parent.\"Like thousands of other grandparents in a similar situation, Jo gave up work to care for the children and as a result money is a constant worry.She gets financial support for her grandson because he was briefly in foster care before coming to live with her.But his sister is not entitled to the same support because she was never in the care system.Jo said: \"It's terrible. My granddaughter eats the same as my grandson, she wears the same clothes as him.\"She's struggling with life the same as him, I feel like we've been pushed into poverty.\"The survey by Kinship, which spoke to 1,948 carers looking after 2,800 children in England and Wales, identified significant disparity in the financial support given to families.More than a third (36%) of kinship carers said they received no financial support from their local authority at all. Among those who did get financial support, the average weekly allowance for informal carers is just £18.46.By comparison, the lowest rate of allowance for foster carers - who are caring for children with similar backgrounds who are unable to live with their parents - is £132.Lucy Peake, the chief executive of Kinship, said: \"It's really time that we supported kinship carers who've stepped in to raise someone else's child, and that means a fair financial allowance, whatever the child's legal order and wherever they live.\"Kinship care and poverty fit hand in glove. It's more common in areas of deprivation and kinship carers are plunged into poverty because they've done the right thing.\"A spokesman for the Department for Education said: \"Kinship carers support some of the most vulnerable children in society by opening their hearts and homes.\"Councils are receiving an extra £3.2 billion to deal with pressures arising due to the pandemic, including to help kinship carers, as we recognise the challenges they are facing.\"Kinship carers can also access emergency counselling from the Adoption Support Fund.\"Why not follow BBC North West on Facebook <https:\/\/en-gb.facebook.com\/BBCNW\/>, Twitter <https:\/\/twitter.com\/BBCNWT> and Instagram <https:\/\/www.instagram.com\/bbcnorthwest\/>? You can also send story ideas to northwest.newsonline@bbc.co.uk"}