{"author":"By Tomos Morgan & Beth Edwards","title":"Covid: Social workers 'braced for tsunami of needs' after lockdown","news_category":"general","content":"Social workers say they are braced for a \"tsunami of needs\" as the UK recovers from the pandemic.The British Association of Social Workers (BASW) expects workloads to increase as restrictions are lifted.One worker described a \"big surge\" in referrals after the first lockdown and the fears of missing something wrong.Officials in all four nations praised the efforts of social workers and highlighted schemes to help vulnerable children set up in the pandemic.A survey conducted by the BASW <https:\/\/www.basw.co.uk\/media\/news\/2021\/jan\/survey-unveils-heavy-toll-social-workers-%E2%80%93-%E2%80%9Cforgotten-frontline%E2%80%9D-%E2%80%93-restrictions> at the end of last year, seen by the BBC, suggests the majority of members had seen an increase in referrals since schools returned in the autumn.Minny Jackson, not her real name, works as a social worker with children in Greater London. \"When lockdown started it was quiet for a little bit, but definitely when the schools came back there was a big surge in referrals coming through.\"In March my case load was 18, now it's 26. Our biggest challenge is that every week we're getting new referrals on duty.\"Ms Jackson said that trend was repeated after the short lockdown in England in November and the BASW believes there may be another surge after the current restrictions across the UK are eased.\"It feels like we're kind of just cementing over the cracks but not actually getting to the foundation of what's going on. Every team meeting everyone is talking about the concerns they feel, the pressures of the workload,\" Ms Jackson said.\"I think there's that constant worry that, 'Am I missing something, is there something here that I'm not seeing, that something untoward is happening?' and, 'How can I actually do the meaningful work through a computer screen?' When I think about it, it just makes me feel stressed.\"Between November and December last year the BASW conducted a survey to investigate the impact of the pandemic on the industry.More than two thirds of the 1,119 BASW members from across the four nations who responded said they had seen an increase in referrals or in their case load since the return of schools in the autumn.And more than three quarters were concerned about their capacity to safeguard and protect adults and children as a result of lockdown restrictions.Another social worker who works with children described a case where contact with a family was done via Zoom, always against the backdrop of their blank living room wall.On one occasion the computer was accidentally knocked into a different position and the case worker saw a child sleeping on a mattress on the floor.Upon seeing this the social worker made an emergency house call and the home was revealed to have extensive damp, broken windows, barely any furniture and the floor that the child was sleeping on was covered in animal excrement.\"How many young children have we missed, awful cases that might come to light when this pandemic is over? Are these children just collateral damage?\" the social worker said.\"How do we even begin to repair the damage that is being done to these children while the rest of the country's head is turned? We were in absolute crisis in children's care before the pandemic, now it's complete meltdown.\"Another said: \"I just feel like we need to think about those who have worked outside the NHS, but on the frontline during this pandemic. It's almost like social work is the forgotten profession of key workers.\"The situation is the same across the devolved nations, according to Allison Hulmes, the national director of BASW Cymru, but there is a fear that things will continue to get worse before they improve.\"It's the tip of the iceberg at the moment, we're really fearful about what's lying underneath... there are so many children who wouldn't have been vulnerable prior to the pandemic but have become vulnerable as the pandemic has unfolded,\" she said.\"Our fear is that there will be an absolute tsunami of need which will translate into increased referral and increased demand on the profession.\"Short term we'd like to see a clear roadmap for return of schools across the devolved nations, we need to increase the number of social workers that we have, so that would mean an investment in professionals and some acknowledgment from Westminster and devolved governments that social workers are essential workers, that they've been doing an incredibly difficult job, and we want the blame game to stop.\"The UK government and the devolved administrations of Northern Ireland, Scotland and Wales praised the \"fantastic job\" social workers had done in \"very challenging circumstances\" adding that they had provided extra funds for social care and taken steps to ease workloads.The Scottish Government also said it was giving frontline workers - including social workers - a one-off pro-rata payment of £500 in recognition of their work in the pandemic.The UK government said it had started a review of children's social care in England, while Northern Ireland's Department of Health said it was carrying out a social service workforce review to help meet \"current and anticipated demand\".The Welsh Government also said it was working with local authorities to tackle any future impact from the pandemic."}