{"author":"","title":"Doncaster Sheffield Airport: MP calls for public inquiry into closure","news_category":"general","content":"A South Yorkshire MP has called for a public inquiry into the decision to close Doncaster Sheffield Airport.Don Valley Conservative MP Nick Fletcher said he had contacted Number 10 and the Department for Transport over the \"ridiculous decision\" to shut the site.Airport owner Peel Group said the closure was due to a \"fundamental lack of financial viability\".Mr Fletcher also called for the council to compulsorily purchase the land.In an announcement on Monday <https:\/\/www.bbc.co.uk\/news\/uk-england-south-yorkshire-63033676>, Peel said services at the airport, which employs 800 people, would wind down from 31 October.They said said \"no tangible proposals\" had been received regarding its future ownership.Mr Fletcher said the business had refused an offer of public money to keep the airport open <https:\/\/www.bbc.co.uk\/news\/uk-england-south-yorkshire-63014655> until a new owner could be found.\"Which business would turn down an offer of public money to cover its losses for the next 13 months while a buyer was sought to actually take the airport off their hands, give them the money that they wanted for the airport and keep their reputation intact?\"They've got nothing to lose so I cannot understand why this decision has been made,\" he said.The MP said a public inquiry was needed to \"find out what's happened\".\"The public inquiry will let us know how it's failed, why it's failed and if it does close it will help us not to make those same mistakes again.\"It will help us in the process of reopening the airport.\"However, the Labour mayor of South Yorkshire Oliver Coppard said there was \"no mechanism I'm aware of about a public inquiry\".\"Quite frankly my priority right now is for those people whose jobs whose livelihoods are so uncertain at a time when our whole economy is uncertain,\" he said.Mr Coppard said that planning documents meant that the \"airport site can only be used for aviation activity.\"He added that the authority and partners had been \"working tirelessly on trying to find a solution\".Speaking on Radio Sheffield, Sarah Barnes from the GMB union said employees were \"devastated\" by the closure and called on the prime minister to intervene.\"A public inquiry would be welcome , but that's not going to save our members' jobs at the end of next month,\" she said.\"We need intervention from central government now and we need to put pressure on Peel.\"In response to the offer of a grant to keep the airport operating, Peel Group said any future proposals did not address the \"lack of viability\" of the site,.It added: \"Peel's Board has concluded that it cannot responsibly accept public money for this highly uncertain process against the backdrop of an unviable, loss-making operating business.\"Follow BBC Yorkshire on Facebook <https:\/\/www.facebook.com\/BBCYorkshire\/>, Twitter <https:\/\/twitter.com\/bbclooknorth> and Instagram <https:\/\/www.instagram.com\/bbcyorkshire\/>. Send your story ideas to yorkslincs.news@bbc.co.uk <mailto:yorkslincs.news@bbc.co.uk>."}