{"author":"","title":"Energy price guarantee: What help is there for gas and electricity bills?","news_category":"general","content":"Energy bills for a typical household in Britain will remain at £2,500 until the end of June. They had been due to rise to £3,000 a year from April.However, the £400 discount on bills which most households received this winter has come to an end.When prices soared after Russia's invasion of Ukraine, the government announced alimit on the amount households could be charged for each unit of energy they use <https:\/\/www.gov.uk\/government\/publications\/energy-bills-support\/energy-bills-support-factsheet-8-september-2022>.This energy price guarantee means bills for a typical household for gas and electricity are about £2,500 per year.That maximum limit had been scheduled to rise to £3,000 a year from April, but the government announced that it would continue at the same level <https:\/\/www.bbc.co.uk\/news\/business-64961667> for the next three months. The chancellor says this will save the average family £160.The guarantee is scheduled to be in place until April 2024.Prices will then be controlled by the return of the energy price cap, which is set every three months by Ofgem <https:\/\/www.ofgem.gov.uk\/information-consumers\/energy-advice-households\/check-if-energy-price-cap-affects-you>, the energy industry regulator.It confirms the maximum price suppliers can charge households per unit of energy on a standard - or default - tariff in normal circumstances.As well as an extension to the energy price guarantee, the government has also promisedto bring prepayment energy charges in line with those for direct debit customers <https:\/\/www.bbc.co.uk\/news\/business-64930953>. This should save households about £45 a year on their energy bills from July.The calculations for a typical household are based on a direct debit customer using 12,000 kWh (kilowatt hours) of gas and 2,900 kWh of electricity a year.A kilowatt hour is a unit of energy used to calculate your bill. However, most households aren't typical. Bills are based on how much energy you actually use, which depends on the number of people, the type of property and its energy efficiency.The government has already announced that some groups across the UK will receive further help from April:What help is the government providing with energy bills? <https:\/\/www.bbc.co.uk\/news\/business-61592496>In recent months global energy prices have been falling, and experts predict cheaper prices for households later this year.Analysts at Cornwall Insight think Ofgem's energy price cap will fall to £2,153 in July, and remain close to that level for the rest of the year.That would make the government's energy price guarantee redundant by July.Cornwall Insight says at this point households might once again be able to shop around for more competitive energy deals.Up until the end of March, businesses had their costs limited under the government'senergy bill relief scheme <https:\/\/www.bbc.co.uk\/news\/business-62969427>:Under a new scheme, firms will now get a discount on wholesale prices, rather than costs being capped <https:\/\/www.bbc.co.uk\/news\/business-64211744>. Heavy energy-using sectors, like glass, ceramics and steelmakers, will get a larger discount than others.Those in Northern Ireland are receiving a single payment of £600 <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-64024396>, more than in the rest of the UK, because of the widespread use of heating oil.Eight million low-income households who get certain benefits or tax credits have received £650 in two payments.Pensioner households got £300 and some disabled people were paid £150. This help was being partly funded by a temporary windfall tax on oil and gas companies <https:\/\/www.bbc.co.uk\/news\/business-60295177>. Vulnerable families can also claim help through the Household Support Fund <https:\/\/www.gov.uk\/government\/publications\/household-support-fund-guidance-for-local-councils>, and theWarm Home Discount <https:\/\/www.gov.uk\/the-warm-home-discount-scheme> scheme."}