{"author":"","title":"North Korea's Kim Jong-un agrees to shut missile site","news_category":"general","content":"This video can not be playedNorth Korea's agreed to shut one of the country's main missile launch sites. Laura Bicker considers what might happen next.North Korean leader Kim Jong-un has agreed to shut one of the country's main missile testing and launch sites.He signed a pledge to permanently close the Tongchang-ri facility, after talks in Pyongyang with his South Korean counterpart Moon Jae-in.Both leaders also \"agreed on a way to achieve denuclearisation\" on the Korean peninsula, Mr Moon said.Mr Kim said he hoped to \"visit Seoul in the near future\" - he would be the first North Korean leader to do so.China has welcomed the outcome of the inter-Korean summit, saying both sides had found \"new and important common ground\".The main focus of the summit was the issue of denuclearisation. While the US and North Korea agreed in broad terms earlier this year to work towards that goal, negotiations have stalled.Pyongyang has now sought to reconfirm its commitment. Mr Kim expressed a readiness to shut down the Yongbyon nuclear facility - where North Korea is believed to have produced the material used in its nuclear tests - if the US took some reciprocal action. The details of that were not specified.But he went further on Tongchang-ri, saying the engine missile testing and launch facility would be permanently closed \"in the presence of experts from relevant nations\".The BBC's Seoul correspondent Laura Bicker said the announcement is a major step forward.Satellite images suggest Tongchang-ri is in the process of being destroyed, she added, but the declaration will allow inspectors to verify the process.This video can not be playedThe war that never officially endedNorth Korea blew up its main nuclear testing site <https:\/\/www.bbc.co.uk\/news\/av\/world-asia-44251928\/north-korea-s-nuclear-site-destruction-what-does-it-mean> at Punggye-ri shortly before Mr Kim's meeting with US President Donald Trump in June.\"The outcome is a big win for Moon Jae-in, who has managed to extract a series of positive headlines from Kim Jong-un related to denuclearisation,\" Ankit Panda, editor of The Diplomat, told the BBC.\"None of the concessions are truly costly to Kim and won't help move North Korea toward short-term disarmament, but provide a further basis for confidence building on which US-North Korea talks can move forward.\"The two countries also made advances on inter-Korean ties, announcing plans to link up their railways, allow more reunions for families separated by war and co-operate on health care.Mr Moon invited the North Korean leader to Seoul, suggesting the visit should take place before the end of this year.They will also seek to co-host the 2032 Summer Olympics. This video can not be playedHow North Korea welcomed the South Korean leaderThe South's defence minister and the head of the North Korean army also signed an agreement to reduce military tensions, with a buffer zone to be established along the border to prevent accidental clashes.The signing came mid-way through a three-day visit to Pyongyang by Mr Moon. While it is the first trip to the North Korean capital in a decade by a leader from the South, it is Mr Moon's third meeting with Kim Jong-un since their historic summit in April.Efforts towards denuclearisation between the North and the US had recently hit a deadlock and this week's Pyongyang summit will bolster the South's role as a mediator.Mr Trump was quick to tweet his applause for the Moon-Kim summit. This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.The US and North Korea held their own historic meeting in June when Mr Trump and Mr Kim agreed in broad terms to work towards denuclearisation.Since then, however, there has been little progress, with no clear process nor timeline laid out.Most observers warn that so far the North has taken no meaningful steps to end its controversial nuclear weapons programme and that this week's summit might not be enough to convince them otherwise.\"For instance, the commitment to shutting down the Yongbyon complex is premised on reciprocal US measures, which raises difficulties,\" warns Mr Panda.\"Washington will have to help move the needle here and it's unclear if the Trump administration can do that.\"Mr Trump recently said that he and Mr Kim would \"prove everyone wrong\", after he received an invitation from the North Korean leader for a second summit. Both sides say they are working on making that meeting happen."}