{"author":"","title":"West Midlands autism charity grants boosting wellbeing","news_category":"general","content":"Groups supporting autistic people in the West Midlands say charity grants are making a \"massive\" difference.Awards of up to £20,000 are available to help those with the condition lead \"happier, healthier and independent lives\", said the charity, Landau.It distributes awards funded by NHS England to organisations in Birmingham and Solihull.Birmingham student Abigail Murray-Lowings said such funding had helped her \"experiment and grow as a person\".The pupil, who hopes to become an art teacher, attends a special school where sessions are run by Birmingham Open Media.Chloe Lawson, from the arts organisation, said: \"Getting the funding for the project is really important because it allows us to provide this service for free for schools where budgets are very tight.\"Emma Clark, from Heart of England Vocational College, said the funding was a lifeline for students.\"They're out in the community. They visit museums. We have companies come in and do cooking with them. They just have a great time,\" she said.\"And just for them to be with their peers and people of their own age, it just makes all the difference. So its huge, the funding is massive for us.\"The National Autistic Society estimates autism affects about 700,000 adults and children in the UK, with some three million people providing care for them.Sharon Brown, who works with Landau, said the charity's support had improved her own son's wellbeing, and there was \"plenty more funding available\".\"We do still have the funds for any organisation that is interested in applying and without these services people like my son would be just sat at home not really doing anything,\" she said.Follow BBC West Midlands on Facebook <https:\/\/www.facebook.com\/MidlandsBBC\/>, Twitter <https:\/\/twitter.com\/bbcmtd> and Instagram <https:\/\/www.instagram.com\/bbc_midlands\/?hl=en>. Send your story ideas to: newsonline.westmidlands@bbc.co.uk <mailto:newsonline.westmidlands@bbc.co.uk>"}