{"author":"","title":"Covid-19: Essex boy's lockdown art project raises £100k for NHS charity","news_category":"general","content":"A 12-year-old boy's lockdown art project has raised about £100,000 for charity, after 250 artists came forward to help him.Noah, who has hydrocephalus <https:\/\/www.nhs.uk\/conditions\/hydrocephalus\/>, epilepsy and cerebral palsy, began painting on cardboard at home in Dedham, Essex, a year ago.His father posted on Instagram, asking artists to finish the pictures.They were displayed in a gallery <https:\/\/www.bbc.co.uk\/news\/uk-england-essex-54673977> before being auctioned for theColchester and Ipswich Hospitals Charity <http:\/\/colchesteripswichcharity.org.uk\/supporters-events\/backgroundbob\/>.Mr Jones sent the backgrounds that his son created to the artists, who finished them and posted them back.More than 200 pieces were then auctioned on eBay and raised more than £80,000, with the rest made up from book sales featuring the art and donations.Noah's father Nathan Jones said they had originally hoped to raise £500 and were \"absolutely stunned\" by the total.He said it was the perfect way to thank the doctors who had \"played a huge part\" in Noah's life.\"It smashed our expectations out of the park. We would like to say a massive thank you once again to all the artists involved,\" he said.\"We would also like to thank everyone for their generous bids.\"The money raised will make a huge difference to many families like ours.\"Artists from the UK, Colombia, Italy, Spain, France, Sweden, Germany, the US and Australia all collaborated with Noah onthe project <https:\/\/www.instagram.com\/background_bob\/?hl=en>.The family decided to make the art into a book, called Background Bob, and the work was exhibited atFirstsite gallery in Colchester <https:\/\/firstsite.uk\/event\/background_bob-and-his-amazing-friends\/>.\"We just started this as a way to pass time, but it turned into something very special,\" said Mr Jones.\"I feel like we have created a little piece of history over lockdown and hopefully the art is a reflection of a moment in time, that will become a bit collectable.\"Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}