{"author":"","title":"Veterans NHS Wales mental health support extended","news_category":"general","content":"An NHS Wales service helping veterans suffering with mental health issues has been extended.A total of £900,000 in extra funding is financing more therapy support for former armed forces personnel.Veterans NHS Wales <http:\/\/www.veteranswales.co.uk\/health-boards.html> saw 633 people last year, up from 191 in 2010.Veteran Tom Adamson, 59, from Anglesey, who developed post-traumatic stress disorder (PTSD) after serving in Northern Ireland, said \"therapy has done me the world of good\".But Veterans NHS Wales psychological therapist, Karen Hawkings, based at Anglesey, believes some veterans do not seek the support they need.\"There is a stigma around seeking mental health support and people can be struggling for quite a few years before they do come forward and seek support,\" she said.\"We want to ensure that every veteran in Wales knows that they are not alone, and we can provide the support they need to help them deal with their problems and get on with their lives.\"Mr Adamson said he had spent four decades suffering from flashbacks, sleep problems and anger issues before receiving psychological therapy.\"The hard thing for a veteran is accepting that you have a problem, and there is a culture in the armed forces that looking for support is a weakness\" he said.\"I can honestly say that therapy has done me the world of good and the people around me tell me how much I've changed.\"It's important people realise that it's not a short term fix, and to make the therapy work you've got to open up and let everything out.\"After joining the Army at the age of 16 in 1974, Mr Adamson served with the King's Regiment in Northern Ireland as an infantry soldier and corporal before leaving in 1981.He now runs a brewing company and works voluntary as a director with veterans support group, UK Veterans - One Voice.Veterans' NHS Wales has appointed three full time equivalent therapists to provide extra support to veterans who are referred to the service, thanks to £500,000 from Help for Heroes over the next three years.The aim is to reduce the time it takes for veterans to be seen.Focus is currently being placed on the Swansea area where the waiting list is longer.Veterans NHS Wales is also now providing six psychiatry sessions a month in each of Wales' seven health board areas, with £400,000 Welsh Government funding, which increased half day support to a full day.Veterans can self-refer to the service via the Veterans NHS Wales website or their GP."}