{"author":"By Manish Pandey","title":"Twitch announces new tools to fight hate raids","news_category":"general","content":"Twitch has announced it's adding new verification tools to fight harassment on the platform.It comes after the flood of abuse that streamers, mainly from minority or marginalised communities have received.Hashtags such as #DoBetterTwitch or #ADayOffTwitch were trending over the past few weeks and months with creators demanding action.The streaming platform said <https:\/\/blog.twitch.tv\/en\/2021\/09\/29\/securing-your-chat-with-phone-and-email-verification\/>it hoped the new measures would \"reduce the number of channels\" impacted by abuse.Radio 1 Newsbeat has spoken to streamers who've been targeted, such as 19-year-old Max, a bisexual transgender man.\"Being so open about my identity is met with a lot of hate from people I don't know most of the time,\" he says.The trolling that users like Max experience is through something called hate raids - a type of coordinated harassment targeting mainly those from minority or marginalised communities.A \"raid\" is a feature on Twitch that lets streamers send their viewers to someone else's channel when they go offline, normally used to boost a smaller or new channel.But in a hate raid, a user abuses this with bots - fake users that can be programmed to watch a channel or type in a chat - to overwhelm a streamer's chat section with hateful messages.Some streamers have reported that can sometimes lead to accounts who've been victim to hate raids being banned - if they're also offline and unable to deal with slurs in chats and are then reported to the platform.Twitch channels can have a chat function, and the platform's rules say streamers are responsible for moderating the content on their channel.The platform says it will be adding phone verification chat controls - which means streamers will be able to require a viewer to have a verified phone number to chat, with Twitch hoping this will reduce hate raid incidents involving bots.There is further action on banning accounts - if one account associated with a phone number or email address is banned, all other accounts linked with those will be suspended.Twitch has also recently filed lawsuits <https:\/\/www.wired.com\/story\/twitch-sues-users-over-alleged-hate-raids\/> against people involved in \"chat-based attacks against marginalised streamers\".Max, from South East England, has been streaming for a year because he wanted \"to create more positive and realistic representation for trans people\" on Twitch - but the abuse has become worse in recent months.\"I've been told to kill myself, called the T-slur for trans people, the F-slur for gay people and misgendered numerous times.\"\"What really upsets me is my community and viewers, seeing horrific messages spammed in my chat and not knowing what's going on.\"\"It's not nice when people come in and spam slurs in the chat when you're just trying to play a game and create a positive impact.\"And that's something 23-year-old Sami, who was hate raided a few weeks ago, can relate to.\"The targeted attacks I've been getting feel like they're based on me being a girl,\" the streamer, from Belgium, tells Newsbeat.\"My chat was spammed with hateful comments, sexualising comments, about me killing myself, tonnes of slurs like the N-word and the R-word.\"\"I was stunned, I didn't know what to do at the time,\" she adds.Sami says she tried to keep streaming but stopped streaming for a week because she \"didn't feel safe\".For 22-year-old Ty, he's suffered hate raids which have targeted his skin colour.\"It will be really vile comments about my appearance and racial slurs, it just shocks me,\" the 22-year-old from Gloucestershire tells Newsbeat.\"It's frustrating and upsetting to see words like the N-word being spammed through different characters while I'm live.\"At its worst, he was hate raided every day for about a week, an hour into every stream.Ty says he's sent emails to Twitch and wishes they were better at communicating with streamers.Max feels the use of channel tags, such as the LGBTQ one, is used to single out minority streamers.\"It can also put a target on your back because hate raiders can just search the tag.\"The fact Twitch added that before any real protection for streamers, makes you feel left in the dark and uncared about.\"Max and Ty have both experienced trolls who've used symbols to replace English words to bypass any moderation - and they both want to see that fixed.\"These things shouldn't be too difficult for a multi-billion dollar company,\" Max says.Sami believe moderation is an issue, with many streamers left to do it themselves which can be overwhelming in a hate raid.\"I don't have a lot of moderators, just friends who sometimes do it for me. And now I have to look for real ones to be able to protect me and my community so I can feel safe.\"Max, Ty and Sami all took part in a one day boycott of Twitch on 1 September - and feel the platform could learn from streamers who have created their own software to keep themselves safe from bots and hate raiding harassment.\"It should have been done by Twitch in the first place,\" Sami adds.\"I'm quite fed up of having to find my own solution to a problem they should be handling. It's not my platform, I just stream on it and provide content,\" Ty says.After announcing its new measures, Twitch said \"no single tech solution will ever block bad actors' behaviour entirely\" but that more tools will be arriving in the future.\"Our work to make Twitch safer will never be over, just as there'll never be a single fix for harassment and hate online.\"A version of this article was published earlier.Follow Newsbeat on Instagram <https:\/\/www.instagram.com\/bbcnewsbeat\/>, Facebook <https:\/\/www.facebook.com\/bbcnewsbeat\/>, Twitter <https:\/\/twitter.com\/BBCNewsbeat> and YouTube <https:\/\/www.youtube.com\/channel\/UCe1Ef-K5jpnRsmVY5hCBhOw>.Listen to Newsbeat live <https:\/\/www.bbc.co.uk\/sounds\/play\/live:bbc_radio_one> at 12:45 and 17:45 weekdays - or listen backhere <http:\/\/www.bbc.co.uk\/programmes\/b006wkry\/episodes\/player>. "}