{"author":"","title":"Paradise Wildlife Park opens new habitats after two-year delay","news_category":"general","content":"A family-run zoo has opened two new habitats for threatened species after a two-year delay.Jaguar Jungle and Sun Bear Heights at Paradise Wildlife Park in Broxbourne, Hertfordshire were due to open in 2021.The \"UK-first habitats\" open to the public on the zoo's 39th anniversary, exactly a year before the attraction is rebranded as Hertfordshire Zoo.Aaron Whitnall, one of the brothers who runs the zoo, said the new enclosures were \"just the tip of the iceberg\".Three brothers - Aaron, Tyler and Cameron - work at the wildlife park, which has about 800 animals and was built on land near Broxbourne bought by their grandfather in the early 1980s.The habitats in the £1.5m project were due to open in the months after the third Covid lockdown <https:\/\/www.bbc.co.uk\/news\/uk-england-beds-bucks-herts-56428715>, but it took longer to recover from the previous 12 months than anticipated and the zoo said Brexit regulations then affected suppliers.Sun Bear Heights introduces to the park three species listed as vulnerable on theInternational Union for Conservation of Nature's Red List <https:\/\/www.iucnredlist.org\/>, and which are usually found in South East Asia - bears Kyra and Indera, a pair of binturong and two Asian small-clawed otters.The park has also welcomed jaguars Kumal and Kedera back from their sister siteThe Big Cat Sanctuary <https:\/\/thebigcatsanctuary.org\/>. They will be in a South American-themed area about three times larger than their previous enclosure, with a pool and a tree top walkway.The zoo said that as well as immersing visitors in the culture of the animals' countries and highlighting the need for conservation, it hopes that all the species will become part of the international breeding programme.Mr Whitnall, who previously said the project's delay was \"a blessing in disguise\" <https:\/\/www.bbc.co.uk\/news\/uk-england-beds-bucks-herts-64808711> and the zoo' s ongoing plan was to be at the forefront of wildlife conservation.\"In the past six years we've invested heavily, but that's just the tip of the iceberg,\" he said.\"We're working incredibly hard on both our parks with the ambition that we try to focus on the species that need our help.\"We believe that the direction we're moving in is something that all good zoos are doing around the world and should be aspiring to do.\"He added that both habitats allow visitors to see the animals living in a similar way to how they do in the wild.\"Both [sun bears and jaguars] spend an awful lot of time climbing around in treetops so to be able to get up to the same sort of heights as them is hopefully a perspective you will really remember,\" he said.\"We are also the only place in the UK where you will be able to see [jaguars] swimming under water when they do actually build up the confidence to start having a bit of a splash around.\"His mother, chief executive officer Lynn Whitnall, said: \"The wait is officially over and we are very excited to introduce you all to new and returning species at the zoo.\"Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk"}