{"author":"By Daniel Davies","title":"Children in care warning from justice commission in Wales","news_category":"general","content":"Children's interests are being neglected in court cases that decide who looks after them, a major report has warned.The Commission on Justice in Wales also raised alarm at the very high numbers of children being taken into care.It found \"stark\" differences in this rate between Welsh councils.But stopping so many children going into care would need a \"profound change in culture\" within the legal system, councils and Welsh Government.Despite the growing cost and \"overwhelming evidence\" that being in care can have negative consequences for children, until recently the Welsh Government had given the impression of \"drift\", the commission found.The two-year wide-ranging review of the justice system in Wales <https:\/\/www.bbc.co.uk\/news\/uk-wales-50128933>, led by former senior judge Lord Thomas, calls for the devolution of powers over family courts.Although the care system is controlled from the assembly, family courts are not.Social services can ask courts to put a child in care or up for adoption when there is a risk of them being harmed at home.There were 6,405 looked after children last year - a 52% increase since 2003. Wales is predicted to soon overtake Scotland to become the UK nation with the highest proportion of children in care.Torfaen has the highest rate of looked after children in England and Wales. Neighbouring Blaenau Gwent is ranked third.A Torfaen council spokesman said there were a \"number of complex factors\" putting more demand on children's services.Most of the children it looked after had been placed in care by courts because they were at risk of significant harm at home, he said.\"The council is well aware it has a high number of children who are looked after and is responding through its transformation programme which aims to manage demand for children's services while continuing to keep children safe,\" he added.The report offered multiple possible explanations for the rise, including deprivation <https:\/\/www.bbc.co.uk\/news\/uk-wales-47190227>. It also noted how children from the worst-off places were far more likely to be taken into care that those from the most affluent communities.It also highlights the \"very significant\" cost and the \"overwhelming evidence that many children in care are seriously disadvantaged in later life\".Advocates for children and social services bosses said courts \"were generally not the best way\" to make decisions, they were \"too adversarial\" and the \"children's best interests were neglected\".Ministers announced in July that councils would be expected to meet targets on reducing the number of children going into care <https:\/\/www.bbc.co.uk\/news\/uk-wales-politics-48844075>, following a leadership-campaign pledge by Mark Drakeford.But before that \"there was the clear impression of drift\", the report says.A timetable to reverse the trend was \"urgently\" required, but there would also need to be \"constant pressure on those responsible for delivery\".Lord Thomas said: \"We can challenge this through more effective early intervention and setting up problem-solving courts. Much more should be done to prevent families getting into a position where their children are at risk of being taken into care.\"In England, Family Drug and Alcohol Courts (FDACs) help solve the problems of families at risk of losing children to care.The Welsh Government's reasons for not doing the same thing were \"difficult to follow\", the report said.Health, education and social services policies introduced since 1999 meant there were now lots of differences between family law in Wales and England, even though both nations share the same court system.The report calls for the creation of \"one coherent legal system\" in Wales.This is the latest warning that too many children are going into the care system, with consequences for the public purse and - more importantly - the children involved.Doing something about it is a priority for First Minister Mark Drakeford. He took up the reins with a pledge to set targets.Some people have deep misgivings, but this report endorses his approach.Even so, it begs the question: how were things allowed to reach this point?It is a difficult question to answer, because family courts hold care proceedings in private to protect the children involved.Academics are researching what is going on. Their findings will be \"vital\" to help understand why councils are now responsible for the care of so many children, says the Thomas review.The leader of Isle of Anglesey council, which has refused to accept the Welsh Government's targets, blamed austerity for driving more children into care.Plaid Cymru's Llinos Medi said: \"Every authority has had 10 years of cuts.\"We have tried to save the services that protect the most vulnerable people, but in the meantime we have taken away services that prevent people from becoming vulnerable and put more resilience into communities.\"Ministers had told her in meetings they still expect councils to intervene when children are in danger.\"If they don't want you to not protect children, then what's the point of it?\" she said.Voices from Care programme manager Chris Dunne said there was no \"simplistic\" answer to the rising rate.\"What we don't know is whether local authorities are getting better at preventing abuse and neglect or potential abuse and neglect,\" he said.Some young people had described the \"intimidating situation\" of court proceedings, he said.\"A lot of it is they would actually just like to meet the decision-makers some times.\""}