{"author":"","title":"Butchers to shut after 91 years as bills rise","news_category":"general","content":"Clive Ashpole said he was emotional about closing the shopA Kempston butcher's shop is closing after 91 years in businessOwner Clive Ashpole said it was due to a 300% increase in energy costsThe shop was opened by his grandfather in 1932Mr Ashpole said he was now going to \"go on holiday\"A butcher's shop is closing after 91 years in business due to rising energy prices and falling trade.Clive Ashpole in Kempston, Bedford, said he was faced with a 300% increase in his fuel costs this year.P J Ashpole and Son was opened by his grandfather in 1932, with the 67-year-old taking over the business in 2012 when his father died.He said he could not pass on the energy price increase to the customer, so \"decided to retire\".Mr Ashpole said there had also been a decline in footfall to the shopMr Ashpole said when his energy contract ended in February he was quoted a new one with the increased price.He said he \"didn't want to have the worry\" of the higher bill, so decided to close the shop before the end of the financial year.\"I couldn't afford to pay those overheads,\" he said.He added that he felt \"sorry\" for businesses in a similar position to him.Mr Ashpole had worked in the shop for 50 years, since the age of 16, and said it was \"really emotional\" to close.He said: \"It's been been a real pleasure, I've really enjoyed it.\"People are giving me cards and saying 'thank you very much', it's really humbling.\"I will miss it dreadfully. I'll miss the customers and the banter, and a laugh and a joke.\"He said he would now \"go on a holiday\" and visit his grandchildren and great grandchildren in his free time.Find BBC News: East of England on Facebook, external <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram, external <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter, external <https:\/\/twitter.com\/bbclookeast>. If you have a story for us, email eastofenglandnews@bbc.co.uk, external <mailto:eastofenglandnews@bbc.co.uk>"}