{"author":"By Sam Francis","title":"TfL junk food advert ban: Has the policy cut obesity?","news_category":"general","content":"A new study from top academics has claimed 100,000 obesity cases have been prevented due to a ban on junk food advertising on the Transport for London (TfL) network.But is it true?Since February 2019, adverts for foods high in calories from sugar or fat, or high in salt, have been banned across the TfL network.Food and drink brands, restaurants, takeaways and delivery services are only allowed to place adverts that promote healthier products - rather than simply publicising brands.The measures were introduced to help tackle child obesity, the mayor of London confirmed when the project was launched <https:\/\/tfl.gov.uk\/info-for\/media\/press-releases\/2018\/november\/mayor-confirms-ban-on-junk-food-advertising-on-transport-netwo>.The scheme received 82% support during a public consultation.The ban directly led to 94,867 fewer cases of obesity than expected, a 4.8% decrease, analysis by the University of Sheffield and the London School of Hygiene & Tropical Medicine (LSHTM) found.The same study found the policy has led to 2,857 fewer cases of diabetes, and 1,915 fewer cases of cardiovascular disease.Decreases this large would save the NHS an estimated £218m over the lifetime of the current population, the researchers said.These conclusions are based on a previous study into the purchasing habits of nearly 1,000 Londoners following the advertising ban, compared to 1,000 people in the north-east of England.The initial research, published in February <https:\/\/journals.plos.org\/plosmedicine\/article?id=10.1371\/journal.pmed.1003915>, estimated the ban contributed to a 1,001 calorie decrease in people's weekly shopping. Purchases of food containing high levels of fat, sugar or salt also decreased.And the effect for the subgroup of people \"where the main food shopper reported public transport use\" was an even greater reduction, of 1,307 calories.Academics at the University of Sheffield and LSHTM then used a \"microsimulation model\" to estimate what would happen to people's health if this reduction in buying junk food happened in all London households.\"All modelling is assumptions and this makes some very heroic assumptions,\" according to one professor who spoke to the BBC anonymously.Others put it more bluntly.\"This modelling study is one of the worst pieces of junk science I have ever come across in a journal,\" said Christopher Snowdon, from the free market think tank the Institute of Economic Affairs.\"It builds on an earlier modelling study which falsely claimed that the advertising ban caused Londoners to consume 1,000 fewer calories.\"The report \"makes various back-of-the-envelope calculations based on that factoid\", Mr Snowdon said.Critics can point to NHS data that shows child obesity <https:\/\/digital.nhs.uk\/data-and-information\/publications\/statistical\/national-child-measurement-programme\/2020-21-school-year> rates, which the advert ban was introduced to tackle, have increased in London faster than average since the start of the junk food advertising ban.Mayor of London Sadiq Khan said: \"Advertising undoubtedly plays a significant role in promoting and encouraging the consumption of less healthy foods.\"This study, which builds on research from earlier this year, demonstrates yet again that the ground-breaking restrictions we introduced could not only influence behaviour and ultimately save lives but could directly save our NHS hundreds of millions of pounds.\"I am determined to continue this work to improve the health of Londoners, alleviating some of the burden on our overstretched health service and building a better London for everyone.\"Dr Chloe Thomas, the lead author of the study, said the research had \"shown what an important tool advertising restrictions can be in order to help people lead healthier lives without costing them more money\".\"We hope that demonstrating the policy's significant benefits in preventing obesity and the diseases exacerbated by obesity will lead to it being rolled out on a national scale,\" she added.Dr Oliver Mytton said the report that found households were buying 1,001 fewer calories of food - which he worked on - is \"our best estimate to what the impact of the ban has been\".\"It's certainly not 100% accurate, but it's not a rubbish estimate either,\" said Dr Mytton, a public health consultant at the UCL Great Ormond Street Hospital Institute for Child Health.\"The nature of science is there is always a degree of uncertainty.\" But Dr Mytton, an expert in microsimulations, believes the health impact of the advertising ban is clear.\"There is a body of information that links advertising to purchasing and eating of food,\" he said.\"From there the impact on calorie consumption, its effect on body weight and health outcomes, is pretty predictable.\"This study is still pushing things in the right direction.\""}