{"author":"By Robert Cuffe & Christine Jeavans","title":"What is happening to house prices, and could there be a crash?","news_category":"general","content":"House prices have fallen in recent months, as rising interest rates have made mortgages more expensive, and high inflation has reduced people's spending power.But mortgage interest rates may be stabilising. How might this affect house prices?Prices rose steeply - by about 25% - across most of the UK from the start of 2020 until Autumn 2022.But they have fallen by more than 4% from that peak, according to March's figures from the Nationwide Building Society <https:\/\/www.bbc.co.uk\/news\/business-65135405>. These figures, which take seasonal peaks and troughs into account, show the largest fall in Scotland and the smallest in the West Midlands.Those recent changes build on very different patterns of growth over the last 15 years.Northern Ireland's house prices have still not returned to the levels seen before the 2008 global financial crisis.In contrast, London and the South East saw prices recover quickly up until 2015, then saw less growth during the race-for-space period of the pandemic, which saw many people relocate to cheaper areas.The biggest immediate effect is on people who want to move.Some sellers may delay putting their homes on the market. Homeowners who are considering moving may find they have less money to spend.Asking prices have not fallen far enough to balance the increased cost of interest rates, so first-time buyers are unlikely to find buying a house more affordable in the short term.In the longer run, if wages increase faster than house prices recover, housing will become more affordable.Those longer term trends also depend on whether housebuilding keeps up with demand.The UK's largest lender, Lloyds, is planning for a 7% fall in 2023. In March, the Office for Budget Responsibility (OBR), which advises the government on the health of the economy <https:\/\/www.bbc.co.uk\/news\/explainers-63159607>, predicted that house prices will drop by 10% over the next two years.That would be about half the size of the fall seen during the financial crisis of 2008 and put prices back to where they were in autumn 2021.But predictions are very uncertain.Interest rates may stabilise. The rates offered for fixed-rate mortgage deals have come down from their peak, and experts hope that the rate that sets the cost for trackers or variable rate mortgages may also be at or close to the top.But interest rates are still higher than they were a year ago, and that has affected the market.A small uptick in the number of new mortgages in February did not undo the sharp falls seen at the end of 2022.About 100,000 households come off a fixed-price mortgage each month. They will be hit by new, higher rates.Some homeowners may find their new monthly payments unaffordable <https:\/\/www.bbc.co.uk\/news\/business-64569995>, making them more likely to sell, possibly pushing prices down.The Financial Conduct Authority believes that there are more potentially \"financially stretching\" mortgages <https:\/\/www.fca.org.uk\/publication\/research-notes\/research-note-mortgage-borrowers-macroeconomic-developments.pdf> in London and the South East than in the rest of the country.Loans in the south tend to be very high compared with borrowers' incomes. This can make the loans difficult to repay when mortgage rates rise or inflation bites.This analysis is one way to look for potential areas of weakness in the market.But it doesn't guarantee that people in these areas will fall behind on their mortgage payments.Most borrowers in recent years have had their ability to pay checked against higher interest rates than the ones we're currently seeing.Lending rules were tightened after the 2008 crash to help ensure people were better prepared for a more difficult economic climate.Fortunately, the number of people behind on their mortgages did not rise significantly in 2022 and was still at half the 2008 level.The number of repossessions in 2022 was also less than a tenth of what was seen in the years after the crash.The amount people can spend of their mortgage also depends on wider cost-of-living pressures: on energy bills, wages and job security.And these factors can all change significantly. The future of house prices depends on the economy as a whole, and that picture is also uncertain.Data visualisation by Rob England and Jana Tauschinski. Additional reporting by Jack Rodgers and Helena Rosiecka"}