{"author":"","title":"Fix NHS staffing crisis to tackle waiting lists backlog, warn MPs","news_category":"general","content":"A long-term plan to fix the staffing crisis in the NHS is needed to cut record waiting lists for treatment, the government is being warned.Currently, nearly six million people in England are waiting for routine operations and procedures - many of whom are in pain.A report from MPs says the government needs to address staff shortages - or NHS workers will quit.The government pointed to the extra £5.9bn allocated to tackle the issue.There have been repeated warnings over the length of hospital waiting lists in England.As of September 2021, a record 5.8 million patients were waiting for surgery - such as hip or knee replacements - with 300,000 waiting more than a year compared with just 1,600 before the pandemic.In the autumn Budget, the government announced <https:\/\/www.bbc.co.uk\/news\/uk-59030945> an extra £5.9bn for the NHS in England to help clear the backlog. This was on top ofanother funding package in September <https:\/\/www.bbc.co.uk\/news\/uk-politics-58463493> to create an extra nine million checks, scans and operations.But in its report published on Thursday, the Commons health and social care select committee said the health service was hugely understaffed and was facing an \"unquantifiable challenge\" in tackling the backlog.While it welcomed the government funding, the committee said NHS England was yet to publish \"how it plans to meet its workforce requirements\", despite this being promised by Health Secretary Sajid Javid by the end of November. It said it wanted the government to draw up a recovery plan for services by April.The report said many NHS staff were feeling under pressure and could quit unless they saw the \"light at the end of the tunnel\" of more staff coming.Jeremy Hunt - the former health secretary who now chairs the committee - said the NHS was short of 93,000 workers and there was \"no sign of any plan to address this\".He described the staffing crisis as \"entirely predictable\", adding: \"The current wave of Omicron is exacerbating the problem, but we already had a serious staffing crisis, with a burnt-out workforce.\"Far from tackling the backlog, the NHS will be able to deliver little more than day-to-day firefighting unless the government wakes up to the scale of the staffing crisis facing the NHS.\"Matt Cudworth, 44, needs urgent open heart surgery, but on New Year's Eve he was told his operation - due this week - had been cancelled.\"My whole life's on hold,\" he told BBC Breakfast. He said he feels stuck in a vicious circle: \"One of the things they've said to me is 'don't get stressed, take it easy'... and yet when things like this happen you're naturally more stressed... which creates more problems.\"Following successful treatment for an aggressive form of breast cancer, Shirley Cochrane was told she needed check ups every six months, but that hasn't happened and her doctor told her to \"self manage\".She said: \"When you've had cancer, the fear of it returning is massive.\" She said she understood the pressures of the pandemic, but the lack of regular contact with her cancer team left her feeling \"abandoned by the NHS\".David Ibbotson has been waiting for a hip replacement for three years - and this week his operation was cancelled for the third time. He struggles with pain while walking and said: \"If I don't get it done soon the joint in the hip will get worse and worse.\"Think tank The Health Foundation estimates that nearly 19,000 more nurses and more than 4,000 more doctors are needed in order to get back to the 18-week standard waiting time for treatment.The MPs also want the government to publish an independent assessment of projected staff numbers every two years. It said it had previously recommended something similar - but it had been voted down by the government.The report said without a forecast of future workforce needs it was impossible to know whether enough doctors, nurses or care staff were being trained.It said it was also concerned about the social care workforce, which has about 105,000 vacancies.Doctors have welcomed the report for highlighting the staffing crisis, with the British Medical Association saying it \"clearly lays out what a gargantuan challenge the NHS faces\".\"The biggest barrier to tackling the backlog caused by the pandemic is a severe staffing crisis and our calls for improved workforce planning have thankfully been heard. It's now time for the government to listen too.\"The Royal College of Surgeons said the main issue right now was that more than one in 10 NHS staff members were at home ill or self-isolating.It said it supported the committee's call for independent workforce projections, including an assessment of whether enough staff are being trained.And Minesh Patel, head of policy at Macmillan Cancer Support, said: \"After years of failing to deliver the long-term funding and planning the NHS needs, the government must now urgently commit the resources required to support and grow the cancer workforce, so that it can tackle the backlog and provide urgent cancer care to everyone who needs it.\"The Department of Health and Social Care said in a statement that, alongside the £5.9bn, it was investing £36bn over three years on checks, scans and for patients.\"We have over 5,100 doctors and nearly 10,000 more nurses in the NHS compared to last year and we're committed to delivering 50,000 more nurses by the end of this Parliament,\" it said.Many NHS trusts are currently struggling to cope amid the Omicron wave and staff shortages, and some hospitals have cancelled operations and declared critical incidents."}