{"author":"By Adam Easton","title":"Entire Russian spy network dismantled in Poland","news_category":"general","content":"Poland has charged six foreign citizens with preparing acts of sabotage and spying for Russia, interior minister Mariusz Kaminski has said.Mr Kaminski said the six were \"foreigners from across the eastern border\" and they had sought to disrupt military and aid supplies to Ukraine.Prosecutors are currently preparing proceedings against three other people also detained in the operation.Mr Kaminski said the cell had been preparing \"sabotage actions\" in Poland.\"Evidence indicates that this group monitored railway lines. Their tasks included recognising, monitoring and documenting weapons' transports to Ukraine,\" Mr Kaminski told a news briefing on Thursday morning.\"The suspects were also preparing sabotage actions aimed at paralysing the supply of equipment, weapons and aid to Ukraine.\"Six of the suspects have been charged with conducting espionage for Russia and participation in an organised criminal group, after they were detained as part of an operation conducted by Poland's Internal Security Agency (ABW).ABW officers found cameras, electronic equipment and GPS transmitters that were to be mounted on aid transports to Ukraine.The group were also tasked with carrying out propaganda activities to disrupt Polish-Ukrainian relations and incite hostile attitudes towards Poland among Nato, Mr Kaminski said.ABW has evidence the group were paid by Russian intelligence. On Wednesday, the Polish radio station, RMF FM reported that some cameras were found near the small regional Rzeszow-Jasionka airport, which has been converted into an international logistics hub supplying military and humanitarian supplies to Ukraine.Military and cargo aircraft from the US and across Europe regularly fly in and out of the airport, where American troops can be seen beside their Humvees, to deliver supplies to waiting trucks that make the 100km (62 mile) journey to the Ukrainian border.The site is considered so sensitive, Washington has deployed US Patriot air defence systems to protect the airfield. Last month, US President Joe Biden landed at the airport on his way to Kyiv.The decades-long spy conflict between Russia and the West has intensified since the Ukraine war.Poland is one of Ukraine's strongest allies and its security forces have arrested several people on suspicion of spying for Russia since the invasion last February.Last month, prosecutors charged a Russian citizen, who is a long-term resident in Poland, with spying for Russia between 2015 and 2022.The man, who ran a business in Poland, was allegedly involved with historical reconstruction groups, where he made contacts with Polish military personnel.He was arrested in April last year following an investigation that found he allegedly collected information on the organisational structure of Polish military units in the north-east of the country.A Spanish national of Russian origin, who was identified as an agent for Russia's military intelligence agency (GRU) was arrested in Przemysl, south-eastern Poland, by the ABW last year on suspicion of spying for Moscow.In March last year, a Polish employee of the Warsaw Registry Office, identified as Tomasz L., was arrested on suspicion of transferring operationally valuable data to the Russian intelligence services.Additional reporting by Bartosz Kielak"}