{"author":"","title":"Bloody Sunday: What happened on Sunday 30 January 1972?","news_category":"general","content":"Thirteen people were shot dead and at least 15 others injured when members of the Army's Parachute Regiment opened fire on civil rights demonstrators in the Bogside - a predominantly Catholic part of Londonderry - on Sunday 30 January 1972.The day became known as Bloody Sunday.It is widely regarded as one of the darkest days of the Northern Ireland Troubles <https:\/\/www.bbc.co.uk\/news\/av\/uk-northern-ireland-49299800>.About 15,000 people gathered in the Creggan area of Derry on the morning of 30 January 1972 to take part in a civil rights march.Five months earlier, in August 1971 and against a backdrop of escalating violence and increased bombings in Northern Ireland, a new law was introduced giving the authorities the power to imprison people without trial - internment. The government had decided it was the only way it could restore order.Thousands gathered in Derry on that January day for a rally organised by the Northern Ireland Civil Rights Association to protest at internment.The Stormont government had banned such protests.Troops were deployed to police the march. The march began shortly after 15:00 GMT and the intended destination was the city centre.However, Army barricades blocked marchers.The majority of demonstrators were instead directed towards Free Derry Corner in the Bogside.After prolonged skirmishes between groups of youths and the Army, soldiers from the Parachute Regiment moved in to make arrests.Just before 16:00 GMT, stones were thrown and soldiers responded with rubber bullets, tear gas and water cannon. Two men were shot and wounded.At 16:07 GMT, paratroopers moved to arrest as many marchers as possible. At 16:10 GMT, soldiers began to open fire.According to Army evidence, 21 soldiers fired their weapons, discharging 108 live rounds between them.The shootings led to widespread anger in Derry and further afield.The British Embassy in Dublin was burned to the ground by an angry crowd.The day after Bloody Sunday the government announced there would be an inquiry led by the Lord Chief Justice, Lord Widgery.The Widgery Tribunal largely cleared the soldiers and British authorities of blame, although he described the soldiers' shooting as \"bordering on the reckless\".It was derided as a whitewash by the victims' families, who spent years campaigning for a fresh public inquiry.Prime Minister Tony Blair announced that a new inquiry would be held, headed by judge Lord Saville.It was set up in 1998 and reported back in 2010, becoming the longest-running inquiry in British legal history and costing about £200m.The inquiry found that none of the casualties were posing a threat or doing anything that would justify their shooting.It said no warning was given to any civilians before the soldiers opened fire and that none of the soldiers fired in response to attacks by petrol bombers or stone throwers.Saville found there was \"some firing by republican paramilitaries\" but that on balance the Army fired first.Prime Minister David Cameron said the killings were \"unjustified and unjustifiable\".The Police Service of Northern Ireland (PSNI) began a murder investigation after the Saville report was released.It took a number of years to complete and detectives then submitted their files to the Public Prosecution Service <http:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-foyle-west-38234012> towards the end of 2016.Having weighed up 125,000 pages of material, prosecutors said on 14 March that they will prosecute Soldier F for the murders of James Wray and William McKinney.He had also faced charges for the attempted murders of Patrick O'Donnell, Joseph Friel, Joe Mahon and Michael Quinn.On 2 July 2021, it was announced Soldier F would not face trial following a decision by the Public Prosecution Service (PPS).In a statement, the PPS said after \"careful consideration\" the decision had been taken due to another recent court ruling which found evidence being relied upon in the prosecutionof Soldier A and Soldier C for the killing of Joe McCann <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-56948155> was inadmissible. This was due to the circumstances in which the evidence was obtained. The decision not to proceed with the case is now the subject of live judicial review proceedings following a legal challenge brought by the brother of one of the Bloody Sunday victims."}