{"author":"By Chelsea Rocks","title":"Cost of living: ‘I have to ration my ADHD medication’","news_category":"general","content":"A woman with adult ADHD is rationing her medicine to save money while she waits for the diagnosis to be recognised by the health service.Symptoms of Attention Deficit Hyperactivity Disorder (ADHD) include inattentiveness and anxiety.Nicole Nadler got a private diagnosis of the condition after learning some adults could take years to be assessed on the NHS.But her GP wants the diagnosis to come from an NHS assessment, meaning Nicole can't get her prescription for free.Waiting times across most of the NHS have been lengthened as a result of the Covid pandemic and NHS Lothian said its mental health services were facing \"unprecedented pressure\".The Scottish government said consultations with an NHS specialists were needed to \"ensure safe and effective prescribing\".But campaign groups say it is a mixed picture across Scotland with some private ADHD diagnosis provided by a General Medical Council-registered clinicians accepted by GPs and others finding themselves in the same position as Nicole.Nicole, from Edinburgh, is paying between £130 and £140 a month for her medicine and has appealed against the decision by her GP to NHS Lothian.The 32-year-old said the medication allows her to work, function and maintain relationships but she is now having to make it \"stretch a little bit further\" as she deals with the rising cost of living.She explained: \"By missing it on the weekends it obviously doesn't disrupt my work life, which is most important to me, the thing I'm most concerned about.\"I'm now paying for it every five or six weeks instead of every four.\"Nicole paid £350 for her private ADHD assessment with a view to getting a \"shared care\" agreement where a private diagnosis is accepted by the NHS which then funds prescription medication.She continued: \"They said they would be denying me shared care on the basis that I did not see an NHS doctor. I was caught off guard.\"If I'd been seen by an NHS doctor, I wouldn't need to apply for shared care because everything would've been done under the NHS.\"Mrs Nadler expressed concern for people in her position but on lower incomes. \"There are so many people who couldn't come up with £140 a month. I mean it's not life saving in that it keeps your heart beating but, but it is life saving in the sense that a lot of people feel if they can get their life back and they can just function,\" she said.\"They can do things and they have the ability to regulate themselves, if you're really struggling medication gives you the ability to just function.\"Dr Tony Lloyd, chief executive of the charity The ADHD Foundation, said they have been contacted by many people who are in the same position as Nicole and described the situation as \"very alarming and very concerning\".He added: \"A private diagnosis is not an excuse or a way of bypassing the NHS, it is about people who have a desperate need for help and support so that they can lead happy, healthier, successful lives.\"There is no national collection of waiting times for adult diagnosis of ADHD. Jenny Long, director of primary care at NHS Lothian, said she was unable to discuss the care of individual patients but it was reviewing Nicole's complaint.She added: \"As a result of the Covid pandemic, our mental health services have come under unprecedented pressure.\"We would reassure patients that we are actively redesigning processes, recruiting more clinicians and increasing our clinical capacity to boost support and the numbers of assessments and appointments available for those patients most in need.\"Dr Catriona Morton, of the Royal College of General Practitioners, said: \"In the case of ADHD, we know that some patients are, understandably, turning to private providers when the alternative can often be long waiting lists for diagnosis and treatment.\"We recognise that in some cases, patients who seek a diagnosis from a private service can then experience delays when they then seek a prescription from their GP.\"Kevin Stewart, minister for mental wellbeing, said four health boards in Scotland were piloting a \"single diagnostic pathway\" for ADHD diagnosis as part of a bid to improve the system.He added: \"We want patients to get the help they need, when they need it, and we understand how important a timely ADHD diagnosis is for individuals.\"Recommendations from specialists for ongoing prescribing on the NHS must be made at an NHS consultation with an NHS specialist to ensure safe and effective prescribing.\"A Scottish government spokesman added that although some health boards have shared care policies it was \"at individual GPs' clinical discretion to decide what is in the best interest of their patients\"."}