{"author":"By Tom Edgington","title":"Brexit: What are the Northern Ireland Protocol and Windsor Framework?","news_category":"general","content":"A new Brexit deal for Northern Ireland has been announced.It builds on the Northern Ireland Protocol, which led to significant disagreements between the UK and European Union (EU).Trade between Northern Ireland and the Republic of Ireland was easy before Brexit - both were in the EU and shared the same trade rules.However, when Northern Ireland left the EU, a deal was required to prevent checks being introduced.That's because the EU has strict food rules and requires border checks when certain goods - such as milk and eggs - arrive from non-EU countries like the UK. Paperwork is also required for other goods.The land border is a sensitive issue because of Northern Ireland's troubled political history. It was feared that introducing cameras or border posts as part of checks on goods could lead to instability.This video can not be playedWatch: Key moments from the PM's NI Brexit deal speechFormer Prime Minister Boris Johnson agreed the Northern Ireland Protocol with the EU. It became part of international law and came into force on 1 January 2021.Under the Northern Ireland Protocol, new checks were introduced. Rather than taking place at the Irish border, inspection and document checks are carried out at Northern Ireland's ports. This applies to goods travelling from Great Britain (England, Scotland and Wales) to Northern Ireland.The checks apply even if the goods are due to remain in Northern Ireland.Unionist parties - which support Northern Ireland being part of the UK - say these checks create an effective border between Northern Ireland and the rest of the UK.Businesses have also complained the checks mean extra costs and delays.The new deal is aimed at significantly reducing the number of checks.Two lanes would be created for goods arriving in Northern Ireland from Great Britain:Products going through the green lane would see checks and paperwork scrapped.Red lane goods would still be subject to checks.Bans on certain products - like chilled sausages - entering Northern Ireland from Great Britain would be removed.Northern Ireland would also no longer have to follow certain EU rules, for example on VAT and alcohol duties.Under the previous deal, some EU laws still applied in Northern Ireland. However, politicians at Stormont had no way of influencing them.The new agreement introduces a \"Stormont brake\". This would allow the Northern Ireland Assembly - which creates laws in Northern Ireland - to object to new EU rules.The process would be triggered if 30 Northern Ireland politicians from two or more parties sign a petition.The brake could not be used for \"trivial reasons\" and would be reserved for \"significantly different\" rules.The threshold would be \"really high\" according to EU law professor Catherine Barnard. \"It's a security measure, but one that's not meant to be used very often\" she says.Once the UK tells the EU the brake has been triggered, the rule cannot be implemented.The process would not be overseen by the European Court of Justice, but the court would still have a final say on whether Northern Ireland is following certain EU rules (known as single market rules).The deal is almost certain to be accepted by the UK Parliament as opposition parties have indicated they will support it. There also appears to be little opposition among Tory MPs.It's still unclear whether the new deal will be acceptable to Northern Ireland's largest unionist party, the Democratic Unionist Party (DUP).Its opposition was so strong to the current protocol that it has refused to take part in Northern Ireland's power-sharing government unless its concerns are addressed.DUP leader Sir Jeffrey Donaldson has said his party would study the deal before delivering a \"collective view\" on whether to support it."}