{"author":"By David Grundy","title":"Fossils: Boy finds 200-million-year-old ammonite on beach","news_category":"general","content":"This video can not be playedNine-year-old Eli spotted a 200-million-year-old fossil in a rocky cliff faceA nine-year-old fossil hunter had the find of his life when he stumbled on a 200-million-year-old ammonite.Eli was out on Sunday with his family at Llantwit Major beach in Vale of Glamorgan when he spotted the preserved mollusc in a cliff face.Experts said its size - about 1ft (0.3m) across - and quality made it unusual for the area.The Swansea schoolboy said: \"I was just sitting here and looked up and thought 'Oh my God, that's big!'\"Eli has a collection of smaller fossils he keeps at home. They are dotted around the lounge, kitchen, stairs and his bedroom.He said: \"They're just interesting and I like their shape and the texture. It's just cool.\"Eli's dad, Glenn Morris, said he and his son often went fossil hunting, but usually do it closer to their home in Birchgrove, Swansea.\"We're always on the coast somewhere, usually down Gower way, but this was our first time here, so it was beginner's luck really,\" he said.\"I was a bit of a nerd growing up and liked dinosaurs and rocks and the same things he's into to be honest and I think I've passed it onto him.\"The rocks that form Llantwit Major's beach and cliffs are from the Jurassic period and are about 200 million years old.The rock is made up of a mix of limestone and mudstone, called a blue lias formation <https:\/\/webapps.bgs.ac.uk\/lexicon\/lexicon.cfm?pub=BLI>.Swansea University's physical geography lecturer Dr Nick Felstead said: \"The fossil Eli found is an ammonite, which was a type of mollusc closely related to octopuses, squid and cuttlefish, which is a rare find at Llantwit Major.\"We can see that the inner chambers that would have been used for buoyancy of the ammonite have been infilled with quartz during fossilisation, which is even rarer, and makes this one especially pretty.\"Eli's fossil is thought to be 134 million years older than the 66 million he and his dad initially estimated.Despite his gift for finding prehistoric preservations Eli does not want to be a palaeontologist when he gets older.\"I want to be a footballer,\" he said."}