{"author":"","title":"Cheltenham: Baby death prompts change in hospital's guidelines","news_category":"general","content":"A hospital's guidelines for referring mums-to-be for specialist maternity help have been changed after the death of a baby at a midwife-run NHS centre.Margot Frances Bowtell was born 14 May 2020 at a unit in Cheltenham but died of a brain injury at three days old.A report by the Healthcare Safety Investigation Branch (HSIB) found there was a failure to update mother Laura Harvey's risk assessment after a bleed.Gloucestershire Hospitals NHS Foundation Trust accepted liability.In a statement, the hospital said it acknowledged the \"failures in care\" and said it had \"fully implemented the safety recommendations by HSIB\".Ms Harvey said if things had been done earlier in her pregnancy Margot \"would be a two-year-old, running around now\".She said Margot \"was gorgeous\". She had \"a beautiful forehead of dark brown hair\" and her father's blue eyes, Ms Harvey said.\"Saying goodbye to our beautiful baby girl is the hardest thing I have ever had to do and knowing it could have been prevented is even harder to live with.\"The HSIB reported there was a failure to update Ms Harvey's risk assessment at 36 weeks after she experienced a bleed at 34 weeks, which would affect the urgency of her care.As a result, she was admitted to a low-risk midwife-led unit instead of the the high-risk, consultant-led unit when she went into labour at 41 weeks, just after midnight on 14 May 2020.Ms Harvey had bleeding a few hours later but the details were not handed over during the midwife shift change at 07:30 BST, according to the report.Solicitor Sarah Stocker of Tees Law said: \"The midwives failed to follow national, and the hospital's own, guidelines on multiple occasions during Laura's labour.\"Ms Stocker said: \"Had the midwives acted appropriately at 03:50, 06:10 or 07:30 BST, Laura would have been transferred for obstetric-led care.\"There would have been continuous CTG monitoring of Margot, and she would have been delivered at the first sign of fetal distress,\" she added.Margot was delivered at 13.31 BST in \"poor condition\" and needed resuscitation. She died three days later on 17 May 2020.Ms Harvey said: \"The personal guilt I carry will always stay with me, even knowing now it was nothing I did wrong.\"All I can do now is help raise awareness. And help prevent the devastating loss of another baby the way in which it happened to Margot.\"Follow BBC West on Facebook <https:\/\/www.facebook.com\/pointswest>, Twitter <https:\/\/twitter.com\/bbcbristol> and Instagram <https:\/\/www.instagram.com\/bbcwest>. Send your story ideas to: bristol@bbc.co.uk <mailto:bristol@bbc.co.uk>"}