{"author":"","title":"Southern Water named among worst for pollution","news_category":"general","content":"A water company fined a record £90m for deliberately dumping raw sewage into the sea has come under fire again for its environmental performance.Southern Water has been ranked one of England's worst water companies for pollution incidents last year, according to Environment Agency data.It comes days after the firm was fined after admitting 6,971 illegal spills <https:\/\/www.bbc.co.uk\/news\/uk-england-kent-57777935>. Southern Water said its performance was improving and it was investing £1bn over the next four years.The Environment Agency has warned Southern Water and South West Water's performance in looking after the environment has been \"consistently unacceptable\".Across England, water pollution incidents are on the rise <https:\/\/www.bbc.co.uk\/news\/uk-england-57804260>. In the year from March 2020 to March 2021, there were 325 serious incidents logged with the EA, up 23% on the previous 12-month period.For many groups and campaigners in the South East, it is a problem that needs tackling head-on.Charles Watson, of River Action UK, told BBC South East: \"Quite soon our rivers will die and there will be nothing left. It's a matter of absolute urgency that this problem is addressed.\"Sewage and slurry were the two most commonly identified pollutants over the past year, according to BBC analysis.In its latest report monitoring the performance of water companies, the Environment Agency said serious water pollution incidents \"were at their lowest ever recorded level\".However, it added the performance of some companies still gave them \"serious cause for concern\".Environment Agency chair Emma Howard Boyd said: \"Over half the water sector is now achieving the highest industry rating, showing that clear targets and regulatory focus combined with investment in the environment delivers change in the water sector.\"But, some companies are still failing in their duty to the environment and there remains a tendency to reach for excuses rather than grasp the nettle.\"Environment Minister Rebecca Pow said the agency report made for extremely disappointing reading.She said: \"Getting the basics right is critical for water companies and then they need to go further in playing their part in achieving a higher level of ambition for our precious water environment.\"Southern Water said: \"As a company in transformation, we recognise there is a more to do.\"We now lead the industry in self-reporting pollution, thanks to continuing investment in IT, telemetry, people and processes and underlining the commitments to openness and transparency we have made.\"Follow BBC South East on Facebook <https:\/\/www.facebook.com\/BBCSE\/>, on Twitter <https:\/\/twitter.com\/bbcsoutheast>, and on Instagram <https:\/\/www.instagram.com\/bbcsoutheast\/>. Send your story ideas to southeasttoday@bbc.co.uk"}