{"author":"By India Pollock","title":"Children in care: 'Money not spent in the best way'","news_category":"general","content":"Children in care in Wales are being let down by a system that costs too much and delivers poor outcomes, a group of assembly members have warned.The Public Accounts Committee <http:\/\/www.assembly.wales\/en\/bus-home\/committees\/Pages\/Committee-Profile.aspx?cid=441> said it was \"unconvinced\" money is being spent in the best way to support children in care to reach their full potential.Access to timely mental health services was highlighted by the AMs' report.The Welsh Government said it was fully committed to giving children and young people the best care and support.There are at least 6,500 children in care in Wales - but the report said that it was difficult for them to access therapeutic support <http:\/\/senedd.assembly.wales\/documents\/s68143\/Focus%20Group%20Summary%20-%20October%202017.pdf>.The AMs said lack of consistency was an issue for people in care, especially the disruptive number of placements and changes to their social workers.One young person told the committee: \"I noted the number of social workers I had. In the 12 years I was in care, I had about 40 maybe.\"The committee said young people described the detrimental effect moving to different care placements - such as changing foster carers - had on them.\"I had a few different placements at first which was unsettling and traumatic. It feels like you have to keep starting life all over again.\"Then I had a long-term placement for eight years and it felt like hitting the jackpot.\"I had a family that cared, a support network and people to talk to every day. That emotional help is as important as any practical support.\"There needs to be more consistency, more mental health check-ups and after-care support.\"Sometimes it feels the system forgets you're a human being and just treats you as a case.\"I lost count of how many social workers I had, but it only takes one to make a real difference.\"They said there was a shortage of council placements, leading to local authorities \"desperately searching\" for placements and taking what was available, rather than choosing what best met the child's needs.This was poor value for money and not in the best interests of the children, added the committee report.The average cost of a local authority placement is £23,327 a year, while that of an independent placement was £43,378.AMs said they supported more money being used for preventative spending, to deliver high-quality services that provide support early on.The committee said those services could reduce the need for more expensive services in the future, such as dealing with poor mental health or offending behaviour.Committee chair Nick Ramsay said it was vital children received high-quality, joined-up care tailored to individual needs, adding services were under significant pressure and facing serious challenges.The Welsh Government said it welcomed the report and would respond fully in due course, adding it had announced a£15m investment last week <https:\/\/www.bbc.co.uk\/news\/uk-wales-46186103> to prevent children from entering the care system, and to support those in care."}