{"author":"","title":"St Athan: Bottled water delivered after supply contaminated","news_category":"general","content":"Bottled water is being delivered to residents of an estate in south Wales after they were told their mains supply was contaminated.Some people living in St Athan, Vale of Glamorgan, received the warning in a letter from water company Ancala on Thursday.The firm has not made clear how long the problem could continue.Householders were also warned not to give the water to pets or use the water for cooking or cleaning teeth.The letter said: \"Routine sampling of the water in your area has identified that it is not meeting the high standards required.\"The risk of being ill, it said, was low and the warning was a \"precautionary measure\".Sylvia Cossey did not know anything was wrong until a neighbour told her.The 83-year-old said: \"I had just drunk a cup of coffee and taken tablets. So I said that's no good, is it? And then there was a panic apparently, at around 8pm.\"I can't be the only elderly person around here who couldn't get to a water point and couldn't carry those bottles back home.\"They are too heavy.\" She called on Friday to complain.\"I got a very young lady who had probably had so many complaints and I told her exactly what I thought,\" Ms Cossey said.Lucy Jones did not get water on Thursday because of the queues but made a late night dash at 01:00 BST on Friday.\"I live on my own so it's easy enough for me, but I am aware that there are families, with babies that need water for bottles. It's a lack of communication that is the real issue for people.\"Bernard Cook, 79, lives on one of the streets where bottled water was being delivered and said it was \"chaos\" when delivery lorries turned up.\"People were out here for hours, all up the street,\" he said. \"They were just queuing everywhere here. That was for about three hours.\"I've got problems and I've got to drink water. I have got water, the neighbours have been very kind and brought it across for me. But there are older people on the site, that is my concern.\"An Ancala spokesman said: \"We have issued a precautionary 'do not drink' notice. There is water on site and available for occupants.\"A spokesperson for the Ministry of Defence said: \"The issue regarding the water is for the water company and\/or the local government to answer.\""}