{"author":"","title":"'Secret shower' discovered during renovation works","news_category":"general","content":"This video can not be playedThe shower was discovered after the tiles around the existing shower began to moveA viral video with more than 12 million views has revealed a secret mirror, behind a secret shower, behind a shower.Hannah Otto, from Hampshire, found the second shower after the tiles around her existing shower began to move.She then discovered the original wall behind that, complete with tiles and a mirror.After posting the video on TikTok she received thousands of comments from people with similar experiences.Since purchasing The Otto House in 2020, the 32-year-old has been documenting her home makeover on social media.Ms Otto said she knew her home was full of surprises after the previous owners had left lots of \"DIY mishaps\".\"Downstairs they've put wooden floorboards on top of carpets,\" she explained.\"So I was really shocked but not surprised to find the shower.\"Ms Otto began ripping the original shower out after it started leaking.The interior designer said: \"I could tell the reason it was leaking is because the tiles were moving a bit.\"I kind of guessed that the previous owners had tiled directly onto wood rather than using anything waterproof.\"The idea was just to rip out the tiles and the wood, and then replace it.\"It was supposed to be a quick fix - but it wasn't.\"After posting the first video, thousands of people began to comment on her post.Several followers compared it to a reality-twisting Hollywood movie: 'It's like Inception but for bathrooms.\"Other people shared stories of their own DIY projects.\"I renovated a 100-year-old house and there were 11 layers of flooring in the kitchen,\" one follower explained.Another added: \"My whole house was this way - there were five ceilings in the kitchen and they did this in my bathroom.\"Ms Otto said she has had the area checked for asbestos and is now continuing to rip the rest of the shower out to see how far back it goes.Follow BBC South on Facebook <https:\/\/www.facebook.com\/bbcsouthnews\/>, Twitter <https:\/\/twitter.com\/bbcsouthnews>, or Instagram <https:\/\/www.instagram.com\/bbcsouthnews>. Send your story ideas to south.newsonline@bbc.co.uk <mailto:south.newsonline@bbc.co.uk>."}