{"author":"By Jennifer Harby","title":"Artworks found in storage in Leicester are 'exceptional' originals","news_category":"general","content":"Historical paintings found in storage at a city's museum have been confirmed by an art historian as important original works.The five casta paintings were discovered at Leicester Museum and Art Gallery.They have been recognised as an original set dating from the early 1700s by art expert Ilona Katzew.Now the city council is planning a major exhibition of the works, to take place in September.Casta paintings originate from the Spanish American viceroyalty of Mexico in the 18th Century.They depict interracial mixing resulting from the widespread marriage between Spanish settlers, enslaved and indigenous populations.Ms Katzew said: \"This is an exceptional discovery of some of the most complex paintings of the castas pictorial genre that were previously unaccounted for.\"While most works depict 'racial' types, here the artist clearly intended to individualize the figures.\"Ms Katzew, the curator and department head of Latin American art at the Los Angeles County Museum of Art, attributed the works to Juan Rodríguez Juárez or his circle, an important artist of the time.The paintings were researched and investigated by Tara Munroe, who is the creative director of Leicester arts organisation Opal 22.She said: \"Thirteen years ago, when these paintings were located in the basement of Leicester Museum, I was a trainee curator, at the start of my museum career.\"When I look at these paintings I see so much more than just the beauty of them.\"I see the beginnings of the myth of racial identity and a way to unpack the elements of social and racial stereotyping in today's current climate.\"Opal 22 is working with Leicester City Council to host a major exhibition of the casta paintings, together with others from around the world.The exhibition, funded by the National Lottery Heritage Fund and the Arts Council, is due to take place at Leicester Museum and Art Gallery in September.The city council's museum service is also having the paintings cleaned and conserved, ready for public display.The deputy city mayor for culture, leisure and sport, Piara Singh Clair, said: \"I am very grateful for the hard work which has gone into exploring and identifying these fascinating paintings and the stories behind them.\"Seeing the casta paintings in the context in which they were created is key to understanding their cultural importance, and bringing them to a wider audience gives us the chance to appreciate them once again and consider what they mean to audiences of today.\"Follow BBC East Midlands on Facebook <https:\/\/www.facebook.com\/bbceastmids\/>, onTwitter <https:\/\/twitter.com\/bbcemt>, or on Instagram <https:\/\/www.instagram.com\/bbceastmidlands\/>. Send your story ideas to eastmidsnews@bbc.co.uk <mailto:eastmidsnews@bbc.co.uk>."}