{"author":"","title":"'Breakthrough' cancer study adds to Super Strong Sophie's legacy","news_category":"general","content":"Scientists studying a form of bone cancer that took the life of a \"super strong\" five-year-old girl say they have had a potential breakthrough.Sophie Taylor, from Norwich, died in January 2019 <https:\/\/www.bbc.co.uk\/news\/uk-england-norfolk-46931896>, a year after she was diagnosed with osteosarcoma.Her tumour was donated to researchers who believe they have discovered a way to stop the spread of the devastating childhood cancer.Sophie's father Alex Taylor said it would add to his daughter's legacy.The study <https:\/\/www.nature.com\/articles\/s41388-020-1379-0>, which began in June 2017, has been led by researchers at the University of East Anglia (UEA) and the University of Manchester.Dr Darrell Green, from the UEA, said he was hopeful the work could eventually \"save lives and improve quality of life\".He said the research into 30 patient samples identified a gene pathway associated with cancer spread.When that pathway was engineered out of human cancer cells and implanted into mice, it could no longer spread to the lung.\"We know that removing this gene pathway actually stops cancer spread in a live animal,\" Dr Green said.\"And we also know how and why this is happening - through hijacking the immune system.\"Dr Green, who lost his best friend to the disease as a teenager, said if the findings were effective in clinical trials, treatment could become \"much kinder, compared to the gruelling chemotherapy and life-changing limb amputation that patients receive today\".Source: Dr Darrell Green, UEA Norwich Medical School Sophie, known as \"super strong\" for the way she dealt with her cancer, underwent both chemotherapy and surgery to amputate part of her leg.The cancer had spread to her lungs when she died.Her courage won hearts - including that of Leicester City midfielder James Maddison <https:\/\/www.bbc.co.uk\/news\/uk-england-norfolk-46931896> - with her \"stick tongue out to cancer\" campaign.Mr Taylor said they \"did not hesitate\" in assisting researchers.\"Unfortunately the way Sophie's journey panned out we didn't get to try the options we put on the table but we are extremely pleased that Sophie has been able to help in the way she did,\" he said.\"We are so proud of how she fought and even more so that she has contributed to research which will be lifesaving for future children.\"We will add this to her legacy and share it with pride.\"Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk"}