{"author":"","title":"Commonwealth Games: Birmingham 2022 mascot revealed","news_category":"general","content":"The official mascot for the Birmingham 2022 Commonwealth Games has been revealed.Perry was designed by 10-year-old Emma Lou, from Bolton, Greater Manchester, who won a national competition.The mascot is named after the Perry Barr area of Birmingham, where the Alexander Stadium will host athletics events as well as the opening and closing ceremonies.On hearing she had won, Emma Lou said: \"It feels as if I'm in a dream.\"She added: \"I chose a bull because of the Bullring in Birmingham, and I decided to use hexagons because they are the strongest shape and the whole world depends on each other.\"I am so excited that my design will be seen by so many people.\" The Birmingham Games will take place across the West Midlands from 28 July to 8 August next year and is set to be the most expensive sports event staged in Britain since the London 2012 Olympics.Olympic athlete and gold medal winner Denise Lewis said she believed the games would represent a \"beacon of light\" amid the coronavirus pandemic.\"We know there's an Olympic Games to get through first - a very different Olympics - but the Commonwealth Games in Birmingham, for a lot of people, will be the end of what has happened.\"It is a beacon of light, probably a symbolic sign of what we've come through,\" Lewis, president of Commonwealth Games England, added.The mascot will also be brought to life through augmented reality allowing Facebook and Instagram users to summon an animated version and pose for pictures with him.Chief Executive of Birmingham 2022 Commonwealth Games, Ian Reid, said: \"Perry is everything I hoped our mascot would be and more: bright, colourful, energetic and totally representative of modern Birmingham and the West Midlands. Perry celebrates diversity, community and our region's heritage as well as its future.\"From today, Perry becomes a powerful icon for Birmingham 2022 all over the world, and you'll be seeing a lot more of him during the countdown to the Games.\"Follow BBC West Midlands on Facebook <https:\/\/www.facebook.com\/MidlandsBBC\/>, Twitter <https:\/\/twitter.com\/bbcmtd> and Instagram <https:\/\/www.instagram.com\/bbc_midlands\/?hl=en>. Send your story ideas to: newsonline.westmidlands@bbc.co.uk <mailto:newsonline.westmidlands@bbc.co.uk>"}