{"author":"","title":"PrEP drug uptake 'exceeds predictions'","news_category":"general","content":"This video can not be playedCould the PrEP drug help to eliminate HIV?Almost 1,900 people have been prescribed a drug which dramatically reduces the chances of being infected with HIV, new figures have shown.Scotland was the first part of the UK to make PrEP (pre-exposure prophylaxis) available on the NHS in July 2017.A report from NHS National Services Scotland <https:\/\/www.hps.scot.nhs.uk\/pubs\/detail.aspx?id=3669> said uptake of the drug had \"exceeded predictions\".It said this was partly because many users had never visited a sexual health clinic before.However, the report said it was still too soon to fully evaluate the impact of PrEP in Scotland.The report said: Health Protection Scotland consultant epidemiologist Prof David Goldberg said: \"Sexual health service teams should be congratulated for successfully implementing an exciting new measure which has the potential to be a game-changer in Scotland's drive to eliminate HIV.\"The programme has already entered its second year and the focus is now also on reaching other groups who could benefit from PrEP. These include some women and transgender people.\"PrEP is taken by people who are HIV-negative but at high risk and has been shown to reduce the danger of infection by about 86%.Scotland was the first part of the UK to make the drug widely available on the NHS.There were about 360 new cases of HIV diagnosed in Scotland annually in the five years before it was introduced.Claudia Estcourt, an expert in sexual health at Glasgow Caledonian University, toldBBC Scotland's The Nine <https:\/\/www.bbc.co.uk\/iplayer\/episode\/m0002wtf\/the-nine-25022019> the drug was a \"milestone\".\"Across Scotland most sexual health clinics have been really pleased that people are taking up the offer or they're coming in and asking for more information about PrEP,\" she said.\"Anything that reduces one's risk of contracting HIV has got to be a huge milestone.\"However, there are concerns that the availability of PrEP may lead to a decline in condom use.One study by researchers at the University of New South Wales in Australia found HIV-negative men using PrEP were more likely to have unprotected sex.Ged Kenslea, director of communications at the Los Angeles-based AIDS Healthcare Foundation, warned this could lead to a rise in sexually-transmitted diseases (STDs) like gonorrhoea.\"PrEP does nothing to prevent other sexually transmitted diseases and here in the US we are having an explosion of STDs, particularly among young people,\" he said.About 99% of PrEP users in Scotland are gay men and three quarters take it daily, citing regular unprotected sex with multiple partners as the reason.Nathan Sparling, chief executive of HIV Scotland, added: \"We know that people are accessing PrEP to prevent HIV and we know from this report that more people are considering the importance of good sexual health than ever before.\"People are telling us that PrEP is working for them and we should be very proud of our collective achievement.Dex De Cruz, 31, was diagnosed with HIV before PrEP was made available on the NHS.He is in a polyamorous relationship with Dave Scott and Jordan Gray McSherry.\"I was diagnosed before PrEP was really available,\" said Dex.\"In some respects I'm very… I don't want to say jealous, but it would have been so much better to have had access to something like PrEP and I don't think I would necessarily have ended up being diagnosed.\"There's nothing wrong with having a lifestyle where you don't have to be afraid of having sex with your partner.\"In terms of whether the NHS should or shouldn't pay for it, there are studies that prove it's cheaper to do prevention than it is to pay the costs of lifelong antiviral drugs, treatments for HIV and all the rest of it.\"So if your real measure of what human life is worth and how it should be lived is about the cost, then PrEP is your better, cheaper option.\""}