{"author":"By Steffan Powell","title":"Toxic gaming tackled by Ubisoft's unique police alert system","news_category":"general","content":"Rape jokes, racism, bullying - if you've picked up a controller, or scrolled a mouse, to dabble in some online gaming then you've likely come across plenty.The gaming industry, like others where people interact online, has been trying to figure out how to get to grips with behaviour like this for years.Ubisoft, makers of major franchises like Assassin's Creed and Rainbow Six, has now signed a first-of-its-kind deal with police to try and tackle the issue for its players.The hope is for this agreement to start a conversation within the industry and see others follow suit.Online gaming is a joyful experience for millions of people every day. It's a space where friendships are forged and memorable experienced shared. During the pandemic online games were a saviour for many people's mental health. However its dark side is also plain to see. Abusive behaviour, deaths threats and grooming - can be found in online gaming spaces.\"We want to be on the right side of history,\" says Damien Glorieux a senior director of the Newcastle-based Ubisoft Customer Relationship Centre.It's here, and at four other locations around the world, that staff monitor how players of Ubisoft games are getting on - responding to requests for help and actively getting involved with the communities that have evolved around their titles. They deal with everything from purchasing issues to online toxicity.Other companies have similar set-ups, but what's unique here is the involvement of local law enforcement.The deal between the company and Northumbria Police works in two parts. Firstly, it sees specialist officers share their knowledge and expertise on harmful online interactions with the 200-strong team working at the centre in Newcastle, who then apply that training to their daily work.Secondly, an agreement is in place so that in extreme cases, where there is a threat to life or potential serious harm spotted, staff can fast track the information to police.They will then decide whether or not to act.Glorieux explains to BBC News: \"We have millions of players, and tens of millions of interactions - so how can we spot incidents?\"It is daunting, but at the same time it is very important, which is why we wanted to sign this deal and try to make things right .\"We wanted to focus on the most extreme cases, make sure we do the right thing there because it gives us a solid foundation to build the rest of our work around.\"Less than 0.01% of cases that the centre deals with end up requiring police intervention.That works out as roughly a handful of cases a month. Most of the time, accounts will be temporarily banned or permanently closed if players have breached a code of conduct.Staff in Newcastle can also recommend the company start legal proceedings in some instances.Andrew Holliday and his team deal with the cases that get close to, or reach, the threshold for police intervention: \"This isn't just a gaming problem, it's is an internet problem,\" he begins.\"There's a real appetite to make the whole ecosystem a better place.\"What we're working on closely with police on is triaging, you know, where we look at a case and decide - 'right is this is one we can deal with in-house? Or is this something we need to pass on?'\"Gaming is global and some of the cases seen by staff here cross national borders.Holliday tells us about a recent case in Norway, saying: \"Things were said and behaviours displayed that hit our threshold for intervention. There was a threat to life or serious harm.\"The agreement with Northumbria Police meant that after we flagged it, even though it wasn't a UK citizen - they were able to get Norwegian authorities involved.\"It was a lot quicker, more efficient and safer than trying to do it as a private citizen.\"Some of the staff here argue that the games industry has shied away from talking about the reality of online play for too long. They say it needs to be more open and proactive in talking about the steps being taken to tackle unpleasant, dangerous or threatening behaviour.For Northumbria Police, Detective Chief Superintendent Deborah Alderson has been leading the work with Ubisoft on this agreement.She argues that policing \"is about prioritising protecting the vulnerable\".\"That means all of our communities not just the ones that we see in person, but our online communities as well,\" she adds.\"Policing changes continually, demands evolve and we have different challenges all the time - our job is to evolve with it.\"Deborah Alderson, whose son is a massive Fortnite fan, thinks work like this is vital, as more and more of our lives go online, and more and more people play,She wants this arrangement to be replicated by games companies and other police forces across the UK, and is working with professor of police sciences, Dr Gavin Oxburgh of Northumbria University, to provide a blueprint for how it can be copied by others.The centre in Newcastle was founded in 2014, initially as a call centre to deal with player issues but its role has developed significantly since then.The staff clearly care about their work and the agreement with Northumbria Police has been in the pipeline for some time.However, as well as wanting to lead the conversation within the UK industry on tackling harmful online behaviour, there is also a compelling business case for focusing on customer relations.In an increasingly competitive market place, keeping people playing your games is harder than ever. They're more likely to stick around if they feel safe and listened to.It's been a difficult few months for Ubisoft with games being cancelled and their financial forecast scaled-back. Keeping their player base happy is more important than ever.Andy Millmoor is the player experience director at the centre, and says that when it comes to online behaviour, making people feel \"safe and secure\" is their number one goal.\"Toxicity takes a lot of different shapes,\" he says.\"The important things for us is when you're at home trying to have a good time and relax - our aim is to make sure you're doing that in a safe environment.\"When someone wants entertainment they've got a whole host of things they can do, and if you had a bad experience, if someone's giving you a bad time online - you're just going to go to one of the other options.\"However Ubisoft is not alone, with the cost of living crisis likely to impact more gaming companies in the coming months - it may be another reason why more people in the industry take an interest in how this partnership works and develops.No-one who works in this field expects a quick fix to a problem that has plagued online life since its inception - but here is one companies attempt to make games joyous every time people press play.For more gaming content, go to Press X to Continue, the BBC Sounds gaming Podcast. <https:\/\/www.bbc.co.uk\/programmes\/p08x7kb5>"}