{"author":"","title":"Plans for London-style bus system in Wales","news_category":"general","content":"A major shake-up of the Welsh bus industry is being planned by the Welsh Government.Ministers want to boost services by introducing a London-style system where bus operators bid to provide services.It could allow councils to dictate what bus services are provided, but there are concerns it could put some bus firms out of business.New Welsh Assembly legislation is expected to be published within the next year.It is part of the Welsh Government's legislative programme to be announced on Tuesday <https:\/\/www.bbc.co.uk\/news\/uk-wales-politics-48989918>.Although companies can be subsidised to run unprofitable routes, currently bus firms have a large degree of freedom in what routes they run commercially.In London it works differently - with operators bidding for set routes laid out by Transport for London.Ministers in Wales want to take action to deal with a decline in services and passenger numbers. The number of bus journeys fell from 115.7m in 2011-12 to 99.6m in 2016-17.They want to give local councils the power to award firms the exclusive right to run certain routes, preventing other operators from competing.This could see councils effectively fund bus operators through contracts that dictate what routes the bus firms run.Councils could also be given powers to operate bus services directly - which they have been prevented from doing since the 1980s.The village of Glyncorrwg in the Afan Valley lost its hourly bus service to Port Talbot earlier this year - it is now served by a bus every two hours instead.Mandy Protheroe, 55, who works in Iceland in Port Talbot, said she can no longer use the service to get to work, relying on lifts instead.\"Sometimes I'm not getting home until half past 11 after being in work,\" she said.Independent councillor Nicola Jayne Davies said \"it's very difficult if you don't have a car\".People in the village \"feel they are being made more cut-off from the outside world,\" she said.\"It's hard enough to get to Port Talbot if you've got a car. Catching a bus can take a good hour.\"Lee Waters, deputy transport minister, said: \"London did not privatise and deregulate in the way the rest of the country did. Since the 80s bus use in London has gone up, in the rest of the country it has gone down.\"That is not a coincidence.\"First Minister Mark Drakeford said: \"Passenger numbers are falling just at the point when we want to persuade more people to use public transport, so there's a problem to solve there.\"And deregulation of the bus service means that we think there is a lot of waste in the system as well.\"Given that the vast majority of the funding that goes into buses in Wales is public funding, we think there is a strong case to make sure that that public investment gets a stronger return.\"Bus firms were against the franchising proposal when a consultation was held earlier this year.First Cymru, an operator of bus services in South West Wales, said: \"Franchising is an unnecessary expensive and poor value tool that need not be developed - it effectively acts as a brake on investment and innovation whilst it sits as a threat to operators' businesses.\"Cardiff Bus, one of two bus firms in Wales still owned by councils but operated at \"arms-length\", said it might find its \"entire market taken by a knock-out blow\" from other larger bus companies.Charity Bus Users UK, which is opposing the ministers' plans, said it was concerned \"that franchising would be unsustainable as the model requires intensive ongoing capital and revenue investment in order to be an improvement on the current mixed funding regime\".The Public Transport Consortium, part of the Local Government Association which represents councils, said franchising \"cannot resolve the fundamental issue which is a lack of [council] funding\".\"It is not necessary to take greater control in order to resolve transport issues which may be resolved with existing powers given adequate funding, local expertise and true partnership working,\" it said.\"Franchising stifles innovation, restricts private sector investment through lack of confidence and security, causes detriment to employee pay, terms and conditions (creating a race to the bottom) with employer pension schemes susceptible to failure for incumbent operators failing to secure franchise contracts and moves the revenue risk from the private to the public sector,\" it added."}