{"author":"By Iain Watson","title":"Haringey Labour's Momentum-inspired policy plans revealed","news_category":"general","content":"The London borough of Haringey looks set be one of the first places in the UK where the kind of socialist policies advocated by Jeremy Corbyn-support group Momentum could be put into action. What can residents expect?Haringey Labour Party has recently been in the news for all the wrong reasons - de-selections, division, denunciations.But soon it may come under scrutiny more for policies than its internal processes.Opponents of Jeremy Corbyn say it will become the first Momentum council after May's local elections.Momentum is, of course, the left-wing campaign group set up after Mr Corbyn's initial victory as Labour leader to keep the spirit and politics of his campaign alive.If Labour - as is expected - wins in Haringey in 3 May's local elections, it's unlikely that the majority of councillors will be fully paid-up members of Momentum.But the group's representation will go up, its influence will increase and the council will move to the left - and Momentum know that, in effect, they will be held responsible for its actions.The first stage in agreeing a manifesto for the local council elections will take place on Sunday, when about 300 Labour members will meet for a policy discussion.The BBC has seen ideas Momentum and allies on the party's left will be putting forward.They believe that local government manifestos should be at least as radical as those contained in Labour's 2017 general election manifesto.And that there should be a break from the past.So, while the outgoing Labour council wanted a 50\/50 partnership with the private sector to redevelop a large council estate, the meeting on Sunday will discuss scrapping this and replacing it with an entirely council-run scheme.Beyond that, they are advocating radical ideas to underpin their anti-austerity agenda, including:In addition, Haringey could follow the example of other left-led councils such as Salford, which has given care workers a 10% pay increase, despite overall budget cuts.Sources say some of the previous speculation about what might be in Labour's manifesto - such as capping council salaries above £60,000 - is inaccurate. This idea has already been rejected, and never had widespread support.The hope on Labour's left is that they can turn the scrutiny on Haringey to their advantage and provide inspiration to other Labour councils.But at this stage none of the ideas appear to have costings attached. And that scrutiny may blunt the party's cutting-edge ideas. One way of paying for council tax exemptions would be, for example, significantly hiking the levy on those who do pay - but I understand that there is an aversion to doing so in case the council gets quickly defined more for tax raising than redistribution.The potential policy programme did not impress Nora Mulready. She used to work for local MP David Lammy but has been highly critical of Momentum's growing influence in the borough and the removal of some sitting councillors.She resigned form Labour at the weekend and told the BBC: \"There is a battle for the political soul of the Labour Party between pragmatic people who will use any tools available to alleviate poverty - and those who place an antipathy to the private sector above the needs of people.\"Momentum activists at some point are going to come in to contact with reality and that will dramatically change what they are suggesting can happen.\"But Labour MP Chris Williamson - a close ally of Jeremy Corbyn - hailed the discussions on the party's future direction, saying: \"We have a Labour Party that is mass movement - some of the ideas the members in Haringey are looking at is a great exercise in democracy.\"And he backed the ending of outsourcing, telling the BBC's Daily Politics: \"Most people don't like the fact that the private sector is essentially ripping-off the public purse.\"Surely (it would) be better to have things delivered in-house - dividends dished out to shareholders would not be necessary and those profits could be reinvested and improve services.\"However, the final local election manifesto that emerges in Haringey may not be quite as radical as envisaged.Ultimately, whatever the grassroots think, the current Labour group has to sign it off - and a majority of them oppose Momentum.Although about a third of the current group of Labour councillors will be standing down - or have been deselected by a more left-wing membership - they may still be able to delete policies they don't like before they leave office.But there is a widespread acceptance that the controversial public\/private housing project will be an early casualty of the council's move to the left."}