{"author":"","title":"INF treaty: Russia 'will respond' to new US missiles in Europe","news_category":"general","content":"President Vladimir Putin has warned Russia will respond \"in kind\" if new US nuclear missiles are placed in Europe.Mr Putin said any European countries hosting US missiles would be at risk of Russian strikes.Nato has said it is unlikely to deploy more nuclear weapons to Europe should an arms control treaty between Washington and Moscow collapse.The US says Russia has violated the 1987 Intermediate-Range Nuclear Forces (INF) treaty and plans to withdraw.Nato Secretary-General Jens Stoltenberg agreed that Russia had probably violated the deal. He said Nato did not seek confrontation but stood ready to defend all allies against any threat.Thursday sees Nato begin its largest military exercise since the Cold War. The operation is to repel a mock invasion of Norway and will involve all 29 members, as well as Finland and Sweden.He said it was \"very dangerous\" to dismantle a global arms control system and added: \"There would be nothing left except an arms race.\"Russia's response would be \"very quick and effective\", he said.\"If the US do end up pulling out of the INF treaty, then the most important question is what will they do with the missiles that will reappear again,\" he said, speaking at a news conference after talks with Italian Prime Minister Giuseppe Conte.\"If they are supplied to Europe, then of course we will have to respond in kind, and the European countries that agree to this - if things come to this - should understand that they will be subjecting their own territory to the threat of a possible retaliatory strike,\" he added.Mr Putin added that Russia was concerned that the US had already dropped the Anti-Ballistic Missile (ABM) treaty, wanted to leave the INF treaty, and that the future of the nuclear arms reduction New Start treaty was unclear.Signed by the US and the USSR in 1987, the INF treaty bans all nuclear and non-nuclear missiles with short and medium ranges, except sea-launched weapons.The place where the US and Russia would probably use such missiles against each other is Europe.That is why President Donald Trump's threat to withdraw has led to concerns that a collapse of the INF treaty would mean placing new missiles on the Continent.The US insists that Russia has a new medium-range missile called the Novator 9M729 - known to Nato as the SSC-8.The missile would be a violation of the INF treaty and would enable Russia to launch a conventional or nuclear strike at Nato countries at very short notice.President Trump said the US would not let Russia \"go out and do weapons [while] we're not allowed to\".Russia has said little about its new missile other than to deny that it is in breach of the agreement.Mr Stoltenberg said Nato supported Washington's criticism of Moscow, adding that such agreements only worked if adhered to by both sides.\"We don't have an effective INF treaty if it's only respected by one part,\" Mr Stoltenberg told a press conference.\"That has been and it's the main problem,\" he said. \"All allies have strongly stated that we are concerned about the new missile and that the most plausible explanation is that Russia is in violation of the INF treaty.\"But you also understand that this is not something that can go on because the treaty is not working if it's only respected by one side.\""}