{"author":"By Charlotte Walker","title":"The bittersweet world of mental health online","news_category":"general","content":"A new film executive-produced by Kim Kardashian examines social media and mental health, but being a mentally ill person who's active online can be a bittersweet experience, says Charlotte Walker who has bipolar disorder.Titled #RedFlag, Kim Kardashian's new film highlights how common mental health problems are, and how social media can help. As Kardashian said recently, not everyone has a real life support network and this is where social media can step in to provide a place for people to \"express their depression, loneliness, and isolation\".Speaking from personal experience, I can testify that it is true that the online mental health community can be an amazing place to go if you're struggling.Until a few years ago I never dreamed that a supportive community existed on the net. I used social media in a light-hearted way, keeping in touch with friends on Facebook and I chatted about books and TV on Twitter. But in 2011 after having a devastating bipolar episode, I began blogging as a way to process my feelings. I created a new Twitter account to promote the blog but over time it became an important connection to the mental health community for me.As Kardashian says, loneliness and isolation are major issues for people with mental health problems. Many people who I follow on social media are housebound by conditions like depression, obsessive compulsive disorder or anxiety. Others have partners and friends yet, despite this, don't get the level of support they sometimes need. Well-meaning loved-ones can inadvertently belittle people's difficulties, expect an instant recovery or simply not know how to respond. Social media can help to fill that gap.The online community offers me much needed contact with people who \"get it\", who know what it's like to use mental health services or take heavy-duty medication. Despite having different and varied diagnoses, we have enough common ground to understand one another. Even with a supportive partner I sometimes need Twitter as a place to say the unsayable and bring the very dark side of bipolar into the light. I couldn't count the times someone has generously held my virtual hand through suicidal feelings or debilitating anxiety.The community is also a place where people work together towards common goals. Sometimes it can act as a pressure group to tackle issues like how media uses the term \"psycho\" or the sale of\"mental patient\" Halloween costumes <http:\/\/www.bbc.co.uk\/news\/uk-24280595> we saw last year. Most recently there has been success in challenging the over-use of stock photosaccompanying mental health stories <http:\/\/www.bbc.co.uk\/news\/blogs-ouch-32084441> which showed peple holding their heads in their hands, or #headclutchers as they are known on Twitter.Of course, not everything in the online community is rosy. There are disagreements, sometimes as deep as whether psychiatry or psychology is the better way of addressing mental distress. Differences of opinion are fine, but sometimes things take a nastier turn and I've experienced attempts to undermine my reputation by those who have set up fake accounts and \"trolls\" who've pretended to be me or my family members.If people are outspoken while online, they are more likely to be a target. I'm learning to tolerate them - at least when I'm well.Having bipolar means I sometimes become paranoid, unsure of whether something is real or the product of my own mind. Dealing with fake accounts can feed that paranoia, making me question my perceptions, and it can leave me upset and scared.The most difficult situation is when an online friend says they want to take their own life. Many people use Twitter to vent suicidal feelings, and in most cases people are just trying to work through their thoughts. Occasionally, however, someone mentions a suicide plan and then goes offline, which sets off alarm bells. Many people use pseudonyms online so I often don't have enough real information to contact emergency services, but when I do know who they are, it's a huge dilemma. If I don't call 999 something very terrible could happen - but if someone's just decided to take a Twitter break, they probably won't welcome the police knocking on their door. It's something I agonise over.My advice for those wanting to dip their toe into the waters of online support would be to look for something likeBlack Dog Tribe <http:\/\/www.sane.org.uk\/what_we_do\/bdt>'s moderated message boards. Or if you're looking for real time conversation within a safe environment you could explore a chat room run by peer supporters such as Mind'sElefriends <http:\/\/elefriends.org.uk\/>. If you do feel ready for Twitter, try checking out Mind's recent roundup of the best hashtags (words or phrases with the # sign at the front) used in the mental health community, and see who is taking part in those conversations.Some people will always have reservations about social media, and that's fine. The online mental health community works for me because I can find real friendship built on common ground, even when I'm too depressed to leave the house. And despite its perils and pitfalls, it gives me the strength and the courage to keep on going even when I think I can't.Follow @BBCOuch <https:\/\/twitter.com\/bbcouch> on Twitter and on Facebook <https:\/\/www.facebook.com\/Ouch.BBC>, and listen to our monthly talk show <http:\/\/www.bbc.co.uk\/podcasts\/series\/ouch>"}