{"author":"","title":"Kyiv band press fundraising vinyl in Middlesbrough","news_category":"general","content":"A band based in Kyiv have had their new album which aims to raise funds for Ukraine pressed to limited-edition vinyl in Middlesbrough.Rock band Love'n'Joy say they are using their music to support friends \"defending Ukraine on the front line\".Proceeds from their second album - Half Home - which was released in 2022 go to the Musicians Defend Ukraine Foundation.Lead singer Anton Pushkar says he hopes the funds can \"save a bunch of people\".Love'n'Joy finished recording the nine-track album in their home studio in Kyiv only days before theRussian invasion of Ukraine <https:\/\/www.bbc.co.uk\/news\/world-60525350>. The album \"speaks about the state of uncertainty and isolation from home\", the band said.Ukrainian men have to enrol in the army under current laws - however, the band were given special dispensation to embark on their first UK tour.The psychedelic three-piece have played Newcastle, Manchester, Middlesbrough and will play Birmingham's Artefact on 1 April.Half Home has been pressed to limited-edition yellow vinyl at Middlesbrough's Press-On Vinyl <https:\/\/www.bbc.co.uk\/news\/uk-england-tees-60310464>.Pushkar said the campaign now aimed to fund a vehicle for a friend providing aid in his home country.\"At the beginning we were buying things like first aid kits, helmets, and other protective equipment,\" he said.\"The campaign has got bigger.\"This car can save a bunch of people\".Danny Lowe of Press-On Vinyl Production said the team were \"passionate humanitarians\".\"They don't like to see people suffering,\" he said.\"This kind of thing is mind-blowing. What they've been through to get here... it's probably something we'll never see in our lifetimes\".Follow BBC North East & Cumbria on Twitter <https:\/\/twitter.com\/BBCNEandCumbria>, Facebook <https:\/\/www.facebook.com\/bbcneandcumbria> and Instagram <https:\/\/www.instagram.com\/bbcneandcumbria\/>. Send your story ideas to northeastandcumbria@bbc.co.uk <mailto:northeastandcumbria@bbc.co.uk>."}