{"author":"","title":"Humza Yousaf: What will be in the new first minister's in-tray?","news_category":"general","content":"The new SNP leader Humza Yousaf is set to be formally elected as Scotland's next first minister.He has pledged to be a \"first minister for all of Scotland\" after being chosen by party members to replace Nicola Sturgeon.Mr Yousaf, who had been serving as health secretary, also vowed to \"kickstart\" a grassroots campaign that would \"ensure our drive for independence is in fifth gear\".Our correspondents look at some of the other issues which are looming in his in-tray.Humza Yousaf is well aware of the mammoth task required to fix the problems across health and social care. More than 600,000 people are on a waiting list; A&E departments are regularly full; one in every six patients in hospital cannot get out, despite being ready to be discharged.He is leaving a pretty unpleasant in-tray for whoever he appoints to succeed him as health secretary.Every year more money is channelled into the health service but it is still not enough to meet growing demand.Patients are getting older and sicker, drugs costs are going up, and staff pay demands keep growing. Scotland may have avoided nurses' strikes - but this week junior doctors start a ballot on whether to walk out over pay.The government's track record on the NHS is never far from a political rammy, but increasingly those working within health and social care are asking policy makers to step back from arguing between themselves and give some candid consideration to what kind of reform is needed.The new FM says his priority is to recover and reform the NHS but he won't deviate from its founding principle, to be free at the point of use. But to deliver that will have to involve unpopular decisions about what the healthcare system can and cannot afford.Before the pandemic, the Scottish government saw education as its defining mission. It wanted to be judged by its progress raising attainment and helping children and young people from disadvantaged areas.As the \"continuity candidate\" Mr Yousaf can expect to have his government's performance on education scrutinised closely.Inevitably, the pandemic has thrown up new problems which are still real issues. Some teachers are well aware of the long-term effects the disruption to education during 2020 and 2021 continue to have on both the academic and personal development of some pupils.There has been a rise in the proportion of university students from disadvantaged backgrounds in recent years and universities are on course to meet long-term targets on this. But worries have been expressed that it is sometimes proving harder for other young people - who are not necessarily actively advantaged - to get places on certain courses.There is a legitimate, underlying debate to be had about the extent to which the education system alone can help young people overcome the effects of poverty and disadvantage. Does more of the focus need to be on poverty and disadvantage itself?The Scottish government would argue many of the levers to do this lie at Westminster but opposition parties argue more could be done by Holyrood.Finally there is the relationship between the Scottish government and education professionals. Can the government properly reset its strained relationship with teachers after the recent strike? Will the abolition of the qualifications agency the SQA, announced nearly two years ago, amount to more than a restructuring and a rebrand?Scotland's business lobbies hope for a reset in their relations with Bute House. Several feel their concerns have taken a low priority under Nicola Sturgeon.As evidence, they point to a raft of reforms that are making it more expensive to do business. The highest profile during the leadership campaign has been the deposit return scheme (DRS),All three SNP leadership candidates say it cannot go ahead, at least on its current schedule. This is a policy associated with Green ministers, and change would require negotiation with them. They have signalled a willingness to give ground on the way it impacts small firms.There follow question marks over limiting the marketing of alcohol, the tax and regulations affecting private landlords, marine protections, and growing hostility to further oil and gas investment.There are longer-term challenges: improving road transport as it affects freight, ferries as they affect island economies, and the uncertainty hanging over support for green business activity, such as retrofitting buildings for energy efficiency, which will be necessary to hit climate change targets. There's the clamour, notably from retailers, to reform business rates.And there is a question mark over economic strategy. That starts within devolved powers, where the year-old strategy is seen as more a wish list than an action plan. It extends to a plan for an independent Scotland's economy - its currency, relations with the European Union and trading with the rest of the UK, and how it could spark the growth necessary to fund big ambitions.Tackling climate change was one of Nicola Sturgeon's priorities, with the Scottish Parliament setting some of the most ambitious targets in the world.But year after year those targets have been missed and the government's independent advisers have said Scotland's lead has been lost.So the new first minister will have to take a grasp of these failures, whether they like it or not, because the 2030 and 2045 targets are legally binding.It may not be popular either. It's often been said that we've \"done the easy stuff\" like decarbonising our electricity supply networks.What comes next will require big spending and big change, like installing heat pumps in millions of homes and creating a charging network to facilitate drivers switching to electric vehicles.With environmental groups increasingly using the courts to hold governments to account, this also isn't something that can be put off indefinitely.During her eight years in government, there were few book festivals that Nicola Sturgeon didn't attend as guest chair or simply an avid reader.Passion for culture rarely translates into policy or funding, but her regular attendance of cultural events, far beyond her own constituency, was an important endorsement of the value of culture in Scotland.Humza Yousaf has indicated he would like to continue that support, and indeed make it more of a priority for the Scottish government. He seems to appreciate that it's a vast and differing sector - which contributes to many other strands, such as education, economy and climate change.Many organisations provided an important lifeline during the pandemic - look at Scottish Ballet's dance for health classes, which reached millions online, or Scottish Opera's Breath Cycle project, which aimed to help those whose lung health was compromised by long Covid.The funding body Creative Scotland - and Screen Scotland - warned last year of a \"perfect storm\" caused by cuts, the pandemic and the cost of living crisis.An appeal for extra funding was met instead with the threat of 10% cuts. Although that decision was reversed, it doesn't abate that perfect storm which has already led to the closure of some organisations like the Nevis Ensemble.Brexit and visas are the new concerns for those who've weathered the storm so far. None of these are simple, single issues to be filed away.Whether the new first minister will choose to make them a priority in his burgeoning in-tray is another matter."}