{"author":"By Chris Mason & Hannah Capella","title":"Children in care in England could hit almost 100,000 by 2025","news_category":"general","content":"The number of children in care in England could reach almost 100,000 by 2025, according to new analysis.Research commissioned by county councils said the figure would represent a 36% rise in a decade.And the expected increase is already putting \"unprecedented pressure\" on local authority's budgets.A government spokesman said they were providing £4.8bn in funding to councils to help maintain \"vital front-line services\", including children's care.The chairman of the County Councils Network (CCN), Tim Oliver, will explain the impact of the rising number of children in care to his organisation's annual conference in Marlow, Buckinghamshire, later.Mr Oliver will say \"too many\" vulnerable children are being placed in what he will call \"expensive residential care settings\" and, on average, they are staying in the care system for longer.Taking a child into care is the most serious and expensive decision a local authority has to make.Putting up a child in a children's home costs more than £4,000 per week on average in England.In 2015, 69,000 children in England were looked after by councils - but by March 2020, the figure was 80,080.Projections for the CCN estimate that it could reach 95,000 in just over three years' time.There is a rise in children entering residential care homes, being explained by, among other things, the number of foster carers not keeping up with the increased demand.This video can not be playedOliwia said there was so \"little care\" when she had to leave her mother and it was \"terrifying\"Oliwia was just 16 when she went into emergency foster care. \"It was so terrifying for me at that time,\" she told the BBC. \"I didn't know where I'd end up.\"She had been living in Oxford, but had to move to the other side of the county to find a home able to take her in, due to the lack of availability in her area.\"No one had ever heard of the city,\" she said. \"I was worried how I was going to get to school.\"But they told me they didn't have enough carers in Oxford.\"Once she had settled in though, Oliwia, now 24, had nothing but praise for the foster family she was with and their understanding for her situation.\"We had chats, we got to know each other and it was a really positive experience,\" she said.\"The family was nice, but I just wish it had been in Oxford.\"The CCN's lead for children and Conservative leader of East Sussex County Council, Keith Glazier, said with local authorities spending their money on the growing need, councils \"aren't having the ability to go out and do more early intervention with families, to try and keep families together, rather than having to take children into care\".He added: \"At the end of the day we have to ensure children are safe, that is the prime purpose\".In Warrington, a new children's home - named the Lighthouse by its users - is part of a trial scheme taking place across five counties, looking to address the increase in children coming into care.The No Wrong Door programme is funded in Warrington by both the Department for Education and the local authority, and brings therapists, police and social workers together within the home to try and work with families before they reach crisis.Since the Lighthouse launched in April, the number of children in care aged 12-17 has reduced by 5% in Warrington.The trial is being evaluated by the charity What Works for Children's Social Care and will report back in 2025.Its director of research, Dr Aoife O'Higgins, said: \"Evaluating projects like No Wrong Door in Warrington is vital so we can understand what actually works to reduce the number of children and young people entering care.\"We wouldn't offer a medical treatment without testing it to make sure it works, so we need to be just as rigorous when thinking about how we are supporting some of our most vulnerable children and young people.\"While the scheme appears to be working so far, the council is not immune from the rising costs of finding residential places for children.This video can not be playedSharon Cooper says rising costs for external providers create a dilemma for her councilWarrington's head of service for children in care and care leavers, Sharon Cooper, said she had recently been quoted £22,000 a week for a child to be placed in a children's home.\"When you're faced with the prospect at 17:00 in the evening where you can't find a home for a child who needs to come into our care unfortunately, you're between a rock and a hard place,\" she said.An independent review of children's social care <https:\/\/childrenssocialcare.independent-review.uk\/> is currently being conducted for the government by former teacher and charity boss Josh MacAlister.A government spokesman said: \"We recognise the challenges that councils are facing, including the pressure on children's services, which is why we are providing local authorities councils with £4.8bn in new grant funding to help maintain vital front-line services, including children's social care.\""}