{"author":"","title":"South Yorkshire circus performers caught up in Ukraine war","news_category":"general","content":"A Yorkshire-based circus troupe has been forced to delay its latest tour of the UK after many of its performers were caught up in the war in Ukraine.More than 80% of South Yorkshire's Circus Cortex are Ukrainian. Boss Irina Archer said suspension of UK work visas and the conscription of men into Ukraine's military had stopped some members returning to the UK.Ms Archer, who said she was half-Ukrainian and half-Russian, described the war as \"unbearable\".She said the performers had gone home over the winter to see their families and to renew their work visas and were then trapped when Russia invaded Ukraine in February.The Home Office had since frozen work visa applications from people in Ukraine, Ms Archer added.She said he had kept in touch via messaging and video chats with some of the troupe's performers stuck in Ukraine.One man who performed as a clown for Circus Cortex had been drafted into the Ukrainian army and was now using his talents to entertain children in the breaks between fighting, Ms Archer said.On the day the Russian invasion started, Ms Archer said she watched in disbelief as her circus artists in Ukraine texted her to say the war was under way.\"The whole thing is just unbearable,\" she said.\"The fact that Russia are involved in Ukraine is like the mum is fighting with dad.\"Nearly every Russian has Ukrainian relatives one way or another. They managed to co-exist up until 2014 without any problems.\"The circus had since found 12 alternative Ukrainian performers around the world who had already escaped the country, she added.They were now heading for the UK under the Home for Ukraine scheme, which allows UK families to sponsor Ukrainian refugees and provides a place for them to live.Ms Archer said she was personally taking in four people and, following a post on social media, several families in South Yorkshire would be housing the others.Using the Home for Ukraine scheme would also protect those performers who would be unable to return to their war-torn homeland after the circus tour ended, she added.\"We think the fair thing for them to do is have the same visa all the other refugees are having,\" Ms Archer said.The latest government figures show that 98 sponsorship visas have so far been issued in South Yorkshire.The Circus Cortex UK tour, which was due to start on 8 April, is now expected to start in Sheffield on 25 May.Follow BBC Yorkshire on Facebook <https:\/\/www.facebook.com\/BBCYorkshire\/>, Twitter <https:\/\/twitter.com\/bbclooknorth> and Instagram <https:\/\/www.instagram.com\/bbcyorkshire\/>. Send your story ideas to yorkslincs.news@bbc.co.uk or send video here <https:\/\/www.bbc.co.uk\/send\/u49571818>."}