{"author":"","title":"Austerity blamed for children in care rise in Wales","news_category":"general","content":"Austerity has caused a \"perfect storm\" which has seen a \"huge\" increase in the number of children in care in Wales, according to a council leader.Debbie Wilcox, who leads the Welsh Local Government Association, said families were \"falling apart\" because of poor prospects and welfare cuts.Cardiff University research shows spending on children in care has gone up by £95.9m - 33% - since 2010.The UK government said it was for the Welsh Government to allocate funding.Councils have a legal duty to provide care for children who are in need, for example if their parents are unable to look after them.Ms Wilcox, who is also the leader of Labour-controlled Newport council, blamed cuts to public services and welfare payments for the rise in care cases.\"It's about the perfect storm of austerity. It's about families having issues and problems and falling apart,\" she told the BBC'sSunday Politics Wales <https:\/\/www.bbc.co.uk\/programmes\/b019cfjf> programme.\"The pressures on them with a lack of jobs, a lack of prospects, and those pressures are then coming through the family system and impact upon children and young people.\"So a tremendous uplift (in spending) and every aspect of the children's services across Wales will have seen huge increases.\"Analysis from the Wales Governance Centre at Cardiff University found that in March 2009, the total number of children in care across Wales was 4,695.By March 2018, that figure had risen to 6,405, an increase of 1,710 - 36.4% - in nine years.The rate of children in care in Wales now stands at 102 per 10,000, significantly higher than the rate in England which is 64 per 10,000.30.The centre said spending on children in care accounted for 53.3% of total budgeted expenditure on children's and families' social services in 2018-19.A UK government spokesman said: \"By 2020, the Welsh Government's block grant will have grown to over £16.1bn before adjustments, a real-terms increase in spending power since 2015.\"Local government funding, including council tax rates, is a devolved matter and it is for the Welsh Government to allocate funding between its devolved priorities.\""}