{"author":"","title":"Isle of Man march joins global protests in 'gesture of solidarity'","news_category":"general","content":"Manx demonstrators took to the streets of Douglas at the weekend as a \"gesture of solidarity with people around the world\", an organiser has said.More than a hundred people joined the march against the backdrop of the ongoingCOP26 <https:\/\/www.bbc.co.uk\/news\/topics\/cgdwpywgeegt\/cop26> summit in Glasgow.Pete Christian from the Isle of Man Friends of the Earth said they had a \"small voice but it ought to be heard\".The protestors were among tens of thousands to take part in the global day of action.Mr Christian said it was not a protest against the Manx government but aimed to create a \"louder voice to all governments\".He said it was good for politicians to see the march representing \"a broader interest in common\" rather than \"parochial\" ones.Chairman of the climate change transformation board MHK Daphne Caine led a Manx delegation <https:\/\/www.bbc.co.uk\/news\/world-europe-isle-of-man-59037854> at the conference in Scotland last week.She said: \"I am hoping to deliver the change demanded by the new Chief Minister Alf Cannan, to enable the Isle of Man to meet its commitments under the Climate Change Bill and the Paris Agreement.\"Without the world coming together we won't stop global warming and the destruction of our planet... The time for action is now.\"Mr Christian said the island's emissions had risen dramatically since 1990 across electricity generation, home heating and transport.He said: \"We're pumping more energy into the atmosphere and making the problem worse and worse by the day.\"We really need to focus very closely on 2030 and to get our emissions reduced by roughly half.\"COP26 has now entered its second week <https:\/\/www.bbc.co.uk\/news\/science-environment-59036722> and so far more than 40 countries have promised to phase out coal by 2050.The UK climate conference continues until 12 November.Why not follow BBC Isle of Man on Facebook <https:\/\/en-gb.facebook.com\/bbcisleofman\/> and Twitter <https:\/\/twitter.com\/BBCIsleofMan>? You can also send story ideas to IsleofMan@bbc.co.uk <mailto:IsleofMan@bbc.co.uk>"}