{"author":"By Jenny Rees","title":"Asylum seekers in Wales 'in limbo and unable to work'","news_category":"general","content":"This video can not be playedMostafa is unable to work until the paperwork is completed\"Before I left my country I used to have a car, a good job, a house, but I left because I wanted to be safe.\"Mostafa Alhamad is an asylum-seeker from Syria, living in Cardiff, and one of hundreds in Wales waiting for a decision on their application.One of the consequences of coronavirus has meant the already overloaded system has ground to a halt.Mostafa was a businessman before the war changed his family's life.But the 30-year-old graduate is unable to work - or study management and fulfil his long-term ambition of opening a restaurant - until the paperwork is completed.Mostafa arrived in the UK from Lebanon nearly a year ago, having initially fled war-torn Syria. He has been in Cardiff for the last 10 months.But his story is tinged with tragedy.He and his wife Zainab had left Syria as refugees in 2013 to begin a new life in Lebanon.Mostafa, with a degree in English literature, was required to pick a side in the civil war and enlist.He was the \"perfect age\" to be in the army and his academic background meant he was considered smart and suitable for the front line.\"I had to choose to serve in the army or leave the country, I chose to leave the country because I wanted to live,\" he said.He opened up a restaurant in Lebanon and the couple had two children.All appeared to be going well for six years but visa and citizenship rules there meant they had to sell up and leave last year.Mostafa was not allowed to have a bank account and was unable to control his own finances or business.To avoid a military call-up back in Syria, he sourced an expensive flight out on the black market but couldn't afford for the whole family to leave.His wife returned to Syria to stay with her family in Damascus, but in February last year their three-year old son Mohammad was killed when their flat - damaged in the war - collapsed while Zainab inspected the property.The loss of his young son, he said, changed everything. When you lose a child \"you're not gonna think the same way,\" he said. \"You're not gonna do the same things in the future. All your dreams will be different and almost everything will be different.\"\"I lost many family members in Syria. My son, my uncle, cousins, and many friends in the university - they're all dead now.\"His wife and four year old daughter remain in Damascus. Mostafa has been given accommodation in Cardiff and has £37.75 a week to live on but he is keen to dispel any notion he's in the UK to take advantage of welfare benefits.Under rules he is not able to work.\"Sometimes you have to choose between buying essentials like food - or data to speak to your family,\" he said.\"I haven't any family members in the UK, my wife and daughter are in Syria, my brother is in Turkey.\"He's aware most asylum seekers he comes across have waited two to three years for a decision.In an ideal world, he would return to Syria to start up a business but \"safety is a priority\".\"I wanted to be safe, money isn't important.\"Figures from the Wales Strategic Migration Partnership for last October showed there were 2,626 asylum seekers in Wales.Mostafa was due to have his face-to-face interview with officials - a key part of the process - in March but lockdown was announced three days before his appointment and everything was put on hold.Campaigners believe people seeking refuge from persecution and civil war should be allowed to work, especially now as the numbers waiting for a decision continue to rise.City of Sanctuary supports over 100 groups in the UK who work with asylum seekers and refugees within their communities.The charity said there had been delays in the system for years but the Covid-19 pandemic had created further backlog because face-to-face interviews had to be halted for safety.Figures up to March showed:Maesteg-based Sian Summers-Rees, chief officer of City of Sanctuary, said: \"The asylum system itself is dehumanising. Sometimes the system can take years and the quality of the decision-making by the Home Office is not good.\"The UK's policy on allowing people to work while they await an asylum decision is more restrictive than other countries.\"Unfortunately they are unable to work whilst they're in the asylum process, so what we would be calling for is better-quality decision making, as well as quicker decision making,\" said Ms Summer-Rees.\"But in the meantime for people to be able to work and contribute to society.\"The principle behind the Home Office rules  <https:\/\/assets.publishing.service.gov.uk\/government\/uploads\/system\/uploads\/attachment_data\/file\/803596\/permission-to-work-v8.0-ext.pdf>is to ensure a clear distinction between economic migration and asylum that discourages those who do not need protection from claiming asylum to benefit from economic opportunities they would not otherwise be eligible for.It also aims to prevent illegal migration for economic reasons.While reduced global movement saw a 69% fall in asylum applications in the first four weeks of lockdown in the UK, face-to-face interviews were naturally postponed.The Home Office insists it is carefully considering the arguments over the rights of asylum seekers to work.It said it had restarted interviews at the end of July, when social distancing was possible, on top of video conferencing, and numbers were being completed \"at pace across the UK\".\"Asylum seeker right to work is a complex issue and is under review,\" said a spokesperson.\"However, asylum seekers are permitted to work in jobs on the shortage occupation list if they have been waiting for a decision on their claim for more than 12 months, through no fault of their own.\""}