{"author":"By Jack Grey","title":"Wizz Air: Passengers in limbo after airline axes Cardiff","news_category":"general","content":"This video can not be playedTravel journalist Simon Calder explains your rights after Wizz Air pulled out of Cardiff AirportWizz Air passengers have said they have been left in \"limbo\" after the airline announced it was pulling out of Cardiff Airport.The budget airline said it was unable to continue operating <https:\/\/www.bbc.co.uk\/news\/uk-wales-64224834> from Cardiff due to high costs. One stag party has been left having to replace flights for all 27 members, despite not yet getting a full refund.Wizz Air said it \"sincerely apologises\" for the disruption and customers have the option for a full refund.Matthew Banwell, 51, from Tonyrefail in Rhondda Cynon Taf, said he would never fly with Wizz Air again after the service he had received.He said the 27-strong group, flying to Alicante in Spain in March for his friend's stag do, have had to pay more than £900 for replacement return flights from a different airline.\"We've had to book 27 extra flights home, extra money, extra cost, and I've had to ask the bus driver to pick us up from Bristol instead of Cardiff, which has cost another £250 on top of the bus.\"Mr Banwell said he had been told by Wizz Air that a refund had been deposited as credit into his Wizz Air account, despite him not having an account as the tickets were booked through a third-party site.He added that the group split into three to purchase this tickets, with one of the three groups having received a refund in the form of credit to their account on the third-party site.\"But the other two refunds we haven't got... I'm in limbo with the 27 of us all together without our flights or full refunds,\" he added.\"I would never use Wizz Air again, and when I speak to them I just cannot get anywhere.\"Charlie Ann O'Brien, from Penarth, Vale of Glamorgan, said she has been attempting to get a refund from Wizz Air since a cancelled flight last summer, without any luck.The 37-year-old said her flight to Portugal in June was cancelled on the day of travel, so she had to quickly book another flight and travel to London Gatwick to fly with a different airline.The airline offered her a refund via Wizz Air credit, which Ms O'Brien has said is \"useless\" because she had already booked a replacement flight and now the airline is pulling out of Cardiff.\"I've said to them, 'please I know it's only £86.40, but please, can you give us that, can you refund us?' I'm getting nowhere with it,\" she said.She said despite her attempts she has not been able to get through to a person at Wizz Air to ask about her refund.\"The only way I can get that money back is by booking again with them. And obviously now I don't have a chance to book with them because they're not flying from Cardiff anymore,\" she added.\"What do I do now? They're not flying from Cardiff and I've got credits that I can't use.\"Ms O'Brien said what was happening to Cardiff Airport was \"awful\", especially following Wizz Air's withdrawal.\"I think we've got such a valuable building and resource there, it could be something wonderful,\" she said.\"Years ago we always flew from Cardiff. It wasn't even an option to look at Bristol or Birmingham or anything. It's so sad how its changed over the years.\"When I look up for my family, I don't even consider Cardiff anymore, I go straight to Bristol.\"Simon Marsh, 56, from Barry, Vale of Glamorgan, said he swore to never use Wizz Air again after a cancelled flight last year.However, after deciding to \"give them another chance\" he booked a flight for himself and his wife to Portugal next September, a decision which he says he now regrets.\"It was out there on social media before they actually informed customers that they were pulling out of Cardiff,\" he said.Mr Marsh said that, due to the cancelled flights, friends they were travelling with have had to cut their holiday short by three days just to be able to get home.\"On principle I would not fly with Wizz Air again, and I should have learned my lesson after the first time last year,\" he added.Travel Expert Simon Calder has said Wizz Air was going to have to \"sort out the travel problems that it created by deciding to abandon Cardiff\".\"Europe's air passenger rights rules are on your side. Wizz Air must offer you a full refund of course, but the rules go further than that,\" he said.\"You might well understandably say 'no thanks, I want the transport that I originally booked' and Wizz Air has to find a way to get you to your destination where you were originally booked at its own expense.\"\"That will also include laying on transport to get you to Bristol Airport where you can fly on EasyJet, Ryanair or Jet 2 at Whizz Air's expense.\"However, he added \"saying what the rules are and actually getting your recompense are two different things\".A spokesman for Wizz Air said: \"Wizz Air sincerely apologises for the disruption and inconvenience caused by the closure of its base at Cardiff Airport.\"Affected customers have been notified via e-mail and have the option of either a 100% cash refund, a 120% refund of the original fare in airline credit, or an alternative flight via Birmingham, Bristol, Gatwick, Leeds, Liverpool or London Luton.\"Customers who booked via an online travel agency should request a refund through the agency, as Wizz Air can only process refunds to the booking owner.\""}