{"author":"By Jonathan Beale","title":"Ukraine war: Soldiers master British tanks in Dorset","news_category":"general","content":"Britain was the first country to pledge modern western battle tanks to Ukraine. Now, Kyiv's soldiers are in the UK learning how to operate them.Some, like Sasha, are battle hardened. He's been fighting in eastern Ukraine. But he is swapping his old Russian T-80 tank for the British Army's Challenger 2.His friend, Grisha, was just driving tractors until a few months ago. Now they're both learning to drive a 60-tonne tank - much heavier and more sophisticated than anything they've been used to.The British Army's Challenger 2 may be more than 20 years old, but both Sasha and Grisha see it as a vast improvement on Ukraine's older and lighter Soviet-era tanks.Sasha raves about its suspension and manoeuvrability, and easy access to the engine. The driver is also the mechanic.But he particularly likes the fact that inside there's a very British piece of kit to heat water for cups of tea. He says his old tank didn't have such creature comforts.Grisha's focused on their main purpose. He says Western tanks, like the Challenger 2, are exactly the kind of weapons Ukraine needs to win this war.Britain is giving Ukraine just 14 Challenger 2s. But other nations are now following the UK's lead in providing Ukraine with Western main battle tanks.In all, at least 11 countries have now pledged to do the same, though it's still not clear how many will be delivered or when they'll arrive. Some nations have refused to discuss numbers.Soldiers like Sasha and Grisha have been at a British Army base in Dorset for the past few weeks - driving training vehicles rather than the ones that will eventually be delivered to Ukraine.The Defence Secretary Ben Wallace and the head of the Army, General Sir Patrick Sanders, were among the VIPs to visit them to assess their progress.Mr Wallace says it's not just about learning to drive and fire the Challenger, but how to \"weave them together\" with armoured vehicles and artillery to create \"a combined arms effect\".In other words, how to use them for offensive operations to take back ground from Russia.Posing for a photograph with grateful Ukrainian soldiers on top of a Challenger, Mr Wallace points to the distance and says \"Crimea that way!\".He jokes that it's more motivation than \"a two-hour speech\" in what sounds like a jibe at President Putin's latest address.As well as the 14 UK Challenger tanks, Britain is also providing Ukraine with 20 Bulldog armoured troop carriers and 30 AS-90 self-propelled artillery guns.When we visit, Ukrainian soldiers are already wielding wrenches and tools - showing they're learning fast to keep them maintained.One of their British trainers, Lance Corporal Zach Reid of the King's Royal Hussars says the Ukrainians have shown they're \"very bright, with technical skills which makes it easy to instruct\".He also believes the arrival of the Challenger 2 could be a \"game changer\" with its heavier armour, its night sights and thermal imaging. Few Russian tanks have the same.The British Army has, in theory, 227 Challenger 2 tanks. In reality fewer than half that number are fit for battle. Built in the late 1990s some are likely to have been cannibalized for spare parts no longer manufactured.But Ben Wallace signals that he could still send more. The head of the Army, General Sir Patrick Sanders, has admitted that just sending 14 tanks has \"temporarily weakened\" the British Army.Mr Wallace himself is pressing the Treasury for more money. He notes that 20 of 30 Nato members have promised to increase their defence spending since Russia's invasion. Britain so far has not.But Mr Wallace's immediate focus is on helping Ukraine win this war, even if it means raiding his own stocks and supplies. As to the question 'could Ukraine be sent more British made tanks?', he says \"I'd be open to giving more if we think that's the right thing to do\".For Sasha and Grisha the next few weeks will involve more training - including learning how to fire the Challenger 2's 120mm rifled gun.The tanks they use are being fitted out elsewhere for battle - including replacing communications systems.Getting them to Ukraine will present another logistics challenge. They're too heavy and big to be flown to Poland by aircraft. But there is a sense of urgency to get them to the front - in time for an expected Ukrainian spring offensive.Britain was the first Western nation to pledge main battle tanks to Ukraine. It wants to be the first to see their tanks join the battle."}