{"author":"By David Deans","title":"Welsh roads review ignored citizens, ex-Labour transport minister says","news_category":"general","content":"A former Labour transport minister has criticised the Welsh government after it cancelled all major road projects.Ken Skates said the roads review stopped most investment in roads without putting in place plans for improving public transport.The backbencher said there should never be another review that \"ignores citizens\".Economy Minister Vaughan Gething said it was \"worth listening\" to what previous ministers had to say.The announcement <https:\/\/www.bbc.co.uk\/news\/uk-wales-64640215> followed a year-long review, and prompted open criticism of the Welsh government from some Labour backbenchers.Defending the decision on Tuesday, Mr Waters said Wales would not get to net-zero carbon emissions \"unless we stop doing the same thing over and over\".\"None of this is easy but neither is the alternative,\" he said.The expert review panel, led by transport consultant Lynn Sloman, assessed 59 road projects and made recommendations on which projects to proceed with, which to abandon and which to reconsider in a different form.Of these, 15 will go ahead, but all the rest have been rejected or will be substantially revised.Mr Skates oversaw transport policy as economy minister until shortly after the last Senedd election in 2021.Speaking to BBC Wales, the MS for Clwyd South said: \"We should never have another review conducted that ignores citizens, and leads to virtually no engagement with key people and public representatives.\"Among the projects scrapped are junction improvements to the A483 around Wrexham.He says the A483 project was \"planned to remove the traffic from those local roads that were polluting the air, [and] that are damaging the environment because of sky-high carbon emissions\".\"I'm concerned that the panel didn't actually engage with any communities, as far as I'm aware. It didn't engage with locally elected members. The engagement with council highways officers was very poor.\"What we had is a diktat which says basically a decision has been made 140 miles away, that vitally important infrastructure works will not go ahead, and by the way there are no alternatives that we can tell you about today.\"Responding to Mr Skates's concerns about the A483 in the Senedd on Tuesday, Mr Waters said ministers would continue to work with the local authority to find a way of addressing the local air quality problems.But he added: \"Building extra road capacity has been shown, time and again, to generate further traffic, which has the overall impact of worsening air quality and damaging the climate.\"So, I appreciate these are difficult trade-offs at times, and we all have local constituency considerations, and he is not the only one with that, but we have to be prepared to follow through on the policies that we've set out.\"Mr Skates said: \"We all want to achieve net-zero targets. But in order to do so you also have to make sure that you bring people with you.\"If you don't want people to use a car you have got to provide an alternative.\"What we had is a road review that has essentially stopped road investment for the most part without a parallel plan or an advanced plan for improving bus, rail or active travel.\"He called for the devolving the responsibility for the trunk road networks to joint committees of councils in north Wales.Mr Skates questioned what the implications were for Cardiff Airport, sea ports and ferry services, and suggested he would have gone about the review differently had he been minister.\"I would have made sure that we collaborate with councils, with communities, we collaborate with as many people, and we don't just rely on the expertise of a few.\"Speaking to Wales Live on Tuesday, Vaughan Gething argued the Welsh government's transport strategy is not about stopping all road building.\"There's both an argument on climate change, but there's also a very practical argument about the fact that our previous road building programme is just not affordable because of the changes to our budget,\" he said. \"It's always worth listening to what previous ministers have to say about how we can help ourselves not just to make choices in policy terms but how we can bring people with us in the future.\"The Welsh government has stated all future roads must pass strict criteria which means they must not increase carbon emissions; they must not increase the number of cars on the road; they must not lead to higher speeds and higher emissions, and they must not negatively impact the environment.Among the projects scrapped is the controversial \"red route\" in Flintshire, which will not go ahead as planned. Instead, improvements will be made to the A494 at Aston Hill.Environmental campaigners called the decision \"world leading and brave\".Christine Boston of cycle charity Sustrans Cymru said: \"Addressing the climate emergency requires bold action.\"Lots of people and organisations are celebrating because this is such a positive step.\"Over the years we've had huge public engagement around developing the future generations act and this decision is completely in line with that. The priority is net zero.\"However there is concern among business groups.Mike Plaut, the former chairman of CBI Wales, said the decision gave the impression Wales was \"closed for business\".\"One of the future generations act aims is a prosperous Wales and this seems to take us in the opposite direction,\" he said.\"We need to work on solutions that don't damage the Welsh economy but benefit jobs.\"We are in danger of becoming an economic backwater.\"The Federation of Small Businesses in Wales head Ben Cottam added: \"Areas of Wales desperately need improvement of existing infrastructure, as well as the certainty of resilience of future infrastructure.\""}