{"author":"","title":"Ukrainian refugee starts 'dream job' in Cambridge","news_category":"general","content":"A Ukrainian refugee has begun her \"dream job\" after arriving in the UK just over a month ago.Valeriia is part of a four-generation family of 10 which moved to a home offered by a businessman <https:\/\/www.bbc.co.uk\/news\/uk-england-cambridgeshire-60846632> in a village near Cambourne, Cambridgeshire.The 37-year-old started working as a nail technician at a beauty salon in central Cambridge on Tuesday.She said: \"It feels great, it feels fantastic, it's just like my normal days.\"The refugee and her family came to the UK under the Ukraine Family Scheme <https:\/\/www.gov.uk\/guidance\/apply-for-a-ukraine-family-scheme-visa>, helped by a relative who is a British citizen.They fled Kharkiv last month and arrived in the UK on 23 March.Valeriia was a nail technician in Ukraine for seven years and said she \"really missed my job\".She said although she had seen other jobs, \"I want to not just earn money but want to enjoy myself\".\"This is my dream job. Nails, that's my passion, that's what I love,\" she said.Valeriia was able to showcase her skills on social media, which helped her get her job and also meant previous customers had been able to get in touch.She said: \"All my clients that are everywhere around the world right now are sending me messages saying 'look at my nails, where are you?'\"Now I can work, I'm so happy about it.\"Charlotte Liddiard, who owns the salon where Valeriia works, said: \"Customers are happy, she's been fully booked, she was fully booked on her first day, she's clearly talented.\"She said giving her the job \"was a small thing I could do which is life-changing for Valeriia\".Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk"}