{"author":"By Pauline McLean","title":"How a champion triathlete found cinema success","news_category":"general","content":"As a world champion triathlete, Lesley Paterson knows more than most about endurance.\"The dedication that comes from doing sport to that level, the obsession that you need, that fire in the belly.\"\"You don't get as good as as I did in sport and sustain it across so many years without really loving the process.\"She applies the same determination to her other passion as a screenwriter.In 2003, she and her husband moved to California and she began to consider whether she could make a film of a book she remembered first reading at school in Stirling.All Quiet on the Western Front was first published in a newspaper in 1928. The author Erich Maria Remarque channelled all the despair and disillusionment of his own experience as a German soldier in the trenches of the first world war.It was made into a Hollywood film in 1930, which won the Oscar for Best Picture.\"I reread it with my then writing\/producing partner Ian Stokell and both of us were like, wow, why has this not been redone. Especially using the technology we now have.\"Universal's rights to the book had long since lapsed and Ian and Lesley approached Remarque's estate to option it. But that wasn't the only obstacle.\"Everything in the film industry is about timing and 16 years ago, WW1 was not in the zeitgeist. It was not a popular war to cover at the cinema and certainly not from the German side.\"Their initial screenplay was in English as they felt it was the only way to get a war film financed. But gradually the film landscape changed.\"Streaming services have come in. Films like Parasite winning an Oscar helped. 1917 came along. It opened up a lot of potential.\"After meeting director Edward Berger, they pitched the film in 2020 as a German language project and were delighted when Netflix commissioned it.\"After 16 years, it happened in a heartbeat. To be honest, the authenticity of it being in German is critical. The essence of the book is there is no hero, it's not an adventure.\"\"The language is in some ways irrelevant. It's the encompassing vision and that's what Edward and Marta Grunert - the producer - brought to it.\"The film was made on location in the Czech Republic in 2021 with Daniel Bruhl and Felix Kammerer in the ensemble cast.One of the opening scenes where women launder the uniforms of dead soldiers so they can be passed to the new recruits came from Lesley.She says she was shocked and saddened to recently read an article about Russians repurposing uniforms in the same way.\"It's as relevant as it was, which is sad. That's why it's a film which needs to be seen and they're showing it in German schools at the moment.That was our hope, that this film would be seen by a younger generation.\"Part of the urgency of the original novel is Remarque's insistence that it shouldn't happen again. But within a decade of publication, his book was banned and a second world war was looming.The new film adds extra scenes not found in the book involving politicians and generals negotiating the ceasefire.\"That was something we felt we needed to put in the script. Because not enough people understand that the actions of World War One led to World War Two.\"The result is a very different war movie, about loss and shame, rather than glory and pride.It's being tipped for awards success. It has 15 nominations on the BAFTA longlist, the largest number for any film. And they're picking up awards all over.\"We actually got an award at the weekend. The national board of review for adapted screenplay in New York.\"I had to give a speech and I looked out on the audience and there, in the front row was Steven Spielberg and alongside him was Daniel Craig.\"And she's not ready to hang up her running shoes yet.\"I'm towards the end of my athletic career but the world championships were a five hour drive from the European premiere in Zurich last year. I hadn't intended to take part but I thought I had to give it a crack.\"A week after the premiere she took part and came fourth.She and her husband Simon - a psychology professor and an uncredited writer on All Quiet - are now concentrating full time on filmmaking. Their next projects include a thriller set in the Scotland, another set in Africa, and one in the travelling community in Ireland.But she says the book she recalls loving as a schoolgirl in Stirling is what started it all.\"It's about taking a risk, right? Never giving up and knowing this will get made. All the naysayers who said give it up, don't bother, why are you spending all this money. You have to take risks. I did that in sport and I was successful and I'm doing the same in film.\""}