{"author":"By Richard Morgan","title":"Wrightbus owner Jo Bamford says coming to NI is revelation","news_category":"general","content":"The chairman of Wrightbus has said the company has 400 employees working in the factory.English industrialist Jo Bamford gave his first broadcast interview since buying the Ballymena-based company.Wrightbus went into administration last year with the loss of 1,200 jobs <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-49818156>.Mr Bamford, the son of JCB chairman Lord Bamford, told BBC News NI he has a keen interest in the use of hydrogen to power buses and that was the main reason he got involved with Wrightbus.\"We've been delighted by Wrightbus and coming to Northern Ireland has been a revelation,\" he said.\"There is a highly-skilled workforce and it's really exciting what we are doing.\"Since it was taken over, the company has been on a recruitment drive and the factory now employs 400 people.The move towards zero-emission buses forms part of the government's climate change targets.Last year, Transport for London ordered 20 hydrogen double-deckers from Wrightbus.On Wednesday, Translink confirmed it had purchased three buses as part of a pilot scheme <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-51296312>. Mr Bamford said there was a global market for a zero-emission solution.\"By the end of this year we will have a battery solution and a hydrogen solution,\" he said.\"The solution is happening so rapidly at the moment and I think we can do a wonderful job here in Northern Ireland with a very hard-working bunch of people.\"On Wednesday night, Wrightbus held an information evening on future recruitment plans.Mr Bamford said he thought the company can grow further. \"We are delighted with Wrightbus,\" he said.\"Our order book is half full for the year already and we haven't yet finished January.\"I'd like to see the business grow. We are on a plane most of the time trying to get sales.\"We do have some orders on the books from countries around the world at the moment. We have just sold a bus to Japan.\"Whoever gets this zero emissions right will grow market share significantly.\""}