{"author":"By Robbie Meredith","title":"BBC Radio Foyle: PM met Tim Davie over cuts, says minister","news_category":"general","content":"Prime Minister Rishi Sunak has met the BBC director general to discuss cuts to BBC local radio, including Radio Foyle.That is according to the Digital, Culture, Media and Sport (DCMS) junior minister Julia Lopez MP.Ms Lopez made the comments during a debate on the BBC in the House of Commons second chamber, Westminster Hall.The debate on the BBC's role in local radio was led by the DUP's East Londonderry MP Gregory Campbell.In November 2022 BBC Northern Ireland decided to cut the daily breakfast news programme and news bulletins on Radio Foyle as part of wider savings plans. <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-63793557>The BBC Director General Tim Davie recently said that the cuts to programming and jobs at Radio Foyle were a\"painful saving\" <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-64246500>. But there have been protests from politicians, clergy and community leaders in Derry <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-64170227> about the plans.Mr Campbell said he had first been interviewed on Radio Foyle in 1979, just after the station opened.\"Local radio often is a lifeline when things are difficult locally,\" Mr Campbell said.\"The past twenty-four hours are a classic example.\"There were 20 road crashes across Londonderry and Strabane and a number of schools closeddue to snow and icy conditions on Tuesday. <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-64301484>\"This all happened in the geographic area of Londonderry, Limavady and Strabane in the north west of Northern Ireland, which is right in the middle of BBC Radio Foyle's catchment area,\" Mr Campbell continued.\"The very programme that the BBC is seeking to axe was able to carry information live to listeners in the catchment area that will be affected by the road closures, the school closures in live time so that people could take action.\"Mr Campbell said that he did not regard the BBC decision about BBC Radio Foyle as \"anti-Londonderry bias\".But he said there was a fear that there would be a \"centralisation\" of the BBC in \"the centre of Belfast\".\"While I would support a cost-effective decision making process it should not be done at the cost of locally based reporting and locally based knowledge,\" he said.DUP MP Jim Shannon said he was also concerned the BBC would become \"the mouthpiece for a political motivated agenda rather than inspiring and uplifting programming\" if the cuts to radio went ahead.During the debate the SDLP leader Colum Eastwood said that Tim Davie should come to Derry to see \"the impact of these cuts, which in my view will end up closing the station\".\"It is absolutely clear that the intention of these cuts is to end up without Radio Foyle,\" he said.He said that without local broadcasters, \"we won't be able to have the same connection to the BBC and the same valuable public service broadcasting.\"The DCMS minister for Media, Data and Digital Infrastructure Julia Lopez responded for the government.Ms Lopez said she was \"disappointed\" that the BBC was planning to reduce local radio programmes and make cuts to Radio Foyle.She said that she had met the BBC's leadership to express her concerns.\"But that has been built on following the issue being raised in Prime Minister's Questions,\" she said.\"The prime minister directly met the director general and the chairman of the BBC.\"Ms Lopez said the government was also concerned \"that we only received notification of these changes on the day on which they were made rather than any advance notice\".\"We want the BBC to continue to succeed for the next century, but that requires the BBC to change but not at the cost of some of the fundamental public service broadcasting responsibilities that it has,\" she said.Ms Lopez also said she had recently met the media watchdog Ofcom, which regulates the BBC.But she said she thought that Ofcom did not have \"quite the same level of concern that we in the house have about these changes\"."}