{"author":"By Lola Mayor","title":"Euro 2020: Ukraine fans in Wales cherish connections between the countries","news_category":"general","content":"For some in Wales, there will be disappointment at Ukraine's defeat at the hands of England in their quarter-final meeting in Euro 2020.This will have been especially true for those with Ukrainian heritage who have settled in Wales and call the country домівка (home).What many people - Welsh and Ukrainian alike - may not realise is that the two countries share some incredible history.Welsh migrants founded a city in what is now modern-day Ukraine, and a journalist from south Wales helped expose genocide in Joseph Stalin's Soviet Union and later died in mysterious circumstances.BBC Wales spoke to some of the fans who were rooting for Andriy Shevchenko's players in one of the team's biggest matches for years, and delved into the history which has bound the two countries together.Father Jacob Siemens lives in Cardiff and said Ukrainian communities in Wales, while more spread out than they once were, would definitely have been gathering for the game on Saturday.He said: \"Since World War Two, the Ukrainian community in Wales has been in its hundreds which - although less than other parts of the UK - has always been significant.He said Ukrainians might not have gathered in pubs, but they would have got together to watch the game in places like Swansea.He said considering the ongoing political issues surrounding Russia and Ukraine <https:\/\/www.bbc.co.uk\/news\/world-europe-56720589>, the game was a \"great source of enjoyment\" for Ukrainian communities.Marion Loeffler, an historian at Cardiff University, said the links between Wales and Ukraine had only been discovered in the past 30 years and new things were being found all the time as the study into Wales' history becomes more prominent.\"What has connected Wales, especially south wales, and Ukraine since the early 19th Century is iron and coal,\" she said.\"Wales' iron built so much of the railways in Ukraine and Europe. and Wales' iron industry led to Hughesovka which was - for all intents and purposes - an all-Wales town.\"But there are also parallels in the countries' developments,\" she added.She said the industries so prominent in south Wales at the time, such as coal mining, were reflected in areas of Ukraine due to Welsh influence.The fifth largest city in Ukraine - now known as Donetsk - was founded by a Welsh ironmaster and migrant workers from south Wales.Cyfarthfa-born industrialist John Hughes was sought out by the Tsarist Russian government, under Emperor Alexander II, which wanted his expertise for a naval fortress on the Baltic Sea - Dr Loeffler said this showed just how important Wales' industrial sector was to the rest of the world.In the 1870s, Hughes and about 100 workers and their families sailed in eight ships to Russia. They built an iron works and collieries and, over the next two decades, established a new town in what is in now Ukraine -Hughesovka <https:\/\/www.bbc.co.uk\/news\/uk-wales-40345030>.Hughes developed his own works in Russia, which included a factory for forging railway lines at a time when large amounts of Welsh steel were used to construct them.The population had grown to 50,000 by the turn of the 20th Century and is now more than a million.Hughesovka became known as Stalino and eventually Donetsk, where mining and metalworking are still important industries today.A statue to Hughes was erected in the city in recent years - and he is still of fascination locally.Another individual with strong links to Ukraine was Welsh journalist Gareth Jones, who was fundamental in helping to expose genocide in Joseph Stalin's Soviet Union.The personal aide to former prime minister David Lloyd George, Jones helped expose the \"Holodomor\" policy of deliberate starvation that claimed the lives of anywhere between four million and 10 million peasant farmers in Ukraine during 1932-33.Born in Barry in 1905, Jones earned a first class degree in French from Aberystwyth University in 1926, securing the same grade in French, Russian and German at Trinity College, Cambridge, three years later.The talented linguist was able to speak to peasant farmers and, in March 1933, he called a press conference in Berlin to reveal the findings of his two months undercover in starving Ukraine.At the time the mainstream media poured scorn on Jones' account, and for a time he was reduced to obscurity. By mid-1933 he had returned home to Barry to live with his parents and worked as a junior reporter on the Western Mail.But in 1935 he was murdered in mysterious circumstances <https:\/\/www.bbc.co.uk\/news\/uk-wales-south-east-wales-18691109> while reporting from Japanese-occupied Mongolia.There is now a street in Kyiv named after him.Member of the Senedd Mick Antoniw is a second generation Ukrainian living in Wales.He said, as a Welsh-speaking Ukrainian politician, he was supporting Ukraine and thought there was \"enormous support\" for Ukraine in Wales.\"Ukraine has long links with Wales, and Ukrainian and Welsh miners have a long solidarity history.\"Culturally, Ukraine and Wales have a lot in common - it's own language, a new emerging democracy, mining, poetry, music and Ukraine has a lot of choirs\".He said he would be wearing his Ukrainian embroidered shirt for the match."}