{"author":"By Ian Youngs","title":"Oldham Coliseum: Historic theatre cancels future shows after losing funding","news_category":"general","content":"The Oldham Coliseum theatre, which has a 135-year history and helped launch a string of stars' careers, has cancelled all shows after March after losing its entire Arts Council England funding.The venue received more than £600,000 a year but became the biggest theatre outside London to lose its subsidy ina shake-up announced in November <https:\/\/www.bbc.co.uk\/news\/entertainment-arts-63512050>.The theatre's new season has now been scrapped and its future is in doubt.Actor Maxine Peake, who has lent her support, said she was \"heartbroken\".The Bafta-nominated star was among those to speak out after the venue lost its grant. \"Oldham is just the tip of the iceberg as we slip into a situation were the arts will recede from view and be only for the privileged few,\" she said on Tuesday.The Coliseum was a training ground for a host of TV soap stars, including Coronation Street's Jean Alexander (Hilda Ogden), Barbara Knox (Rita Sullivan), William Roache (Ken Barlow) and Anne Kirkbride (Deirdre Barlow).Those to have trod its boards more recently include Millie Gibson, who has gone from Corrie to be the new Doctor Who companion; and Olivia Cooke, who stars in Game of Thrones spin-off House of the Dragon.The theatre had announced a new season in December, including a co-production for the stage premiere of Ken Loach's award-winning filmI, Daniel Blake <https:\/\/www.bbc.co.uk\/news\/entertainment-arts-63634833>.In a statement on Tuesday, the theatre said it had been \"working hard to find a solution to this reduction in funding\" but that \"the current financial situation is not sustainable for the season as planned\".It added: \"It has been an incredibly difficult decision to cancel the programme of events and we understand the disappointment this will undoubtedly cause.\"Performances until 26 March will go ahead as planned.Peake said the theatre had been \"producing some of its best work recently and has been hard at work representing the local community with various shows, events and gigs\".\"Towns like Oldham are the very places that need cultural institutions like the Coliseum to survive and thrive,\" she told BBC News. \"They give the population an identity, hope, pride and an outlet to express and to witness.\"They are not just theatres but community centres and safe havens. We need to fight hard to keep them at the centre of that community.\"I hope against hope that a solution can be found and the theatre can continue to inspire, educate and entertain.\"Arts Council England has ringfenced £1.8m - the equivalent of the Coliseum's three-year funding - for culture in the town, and Oldham Council is working on plans for a new arts venue \"with multiple purposes\".An Arts Council spokesperson said: \"We can appreciate how difficult it must have been for the board and team at Oldham Coliseum to take the decision to cancel forthcoming events, and how unsettling this must be for the staff and all those who work with the theatre as well as disappointing for audiences.\"The organisation added that it was \"committed to supporting the future of performing arts in Oldham for the benefit of the local community and to maintaining our investment in the town\".Cllr Amanda Chadderton, leader of Oldham Council, said the £1.8m would \"support the delivery of a programme of performing arts activity, in preparation for a new performing arts centre in the borough\".She added: \"We are working with the Arts Council to ensure this money has the greatest impact for all our residents, in collaboration with arts and culture organisations locally, including Oldham Coliseum.\"Other venues to have had 100% Arts Council cuts include Hampstead Theatre in London, which has said it will no longer operate solely as a new-writing theatre."}