{"author":"","title":"Devon and Cornwall reservoirs less than 30% full","news_category":"general","content":"Reservoir levels in Devon and Cornwall are \"exceptionally low\" said South West Water (SWW).The firm has urged customers to cut back use of water after overall capacity dropped to less than 30% full.Roadford reservoir in west Devon is at 35% full while Wimbleball on Exmoor is at 19% and Colliford on Bodmin Moor is at 17%.SWW said it may have to ask businesses to stop using water for non-essential jobs.In August a drought was declared for the whole of the South West <https:\/\/www.bbc.co.uk\/news\/uk-england-bristol-62723419>.Following the declaration, a hosepipe ban was introduced in Cornwall <https:\/\/www.bbc.co.uk\/news\/uk-england-cornwall-62546790> and parts of North Devon.Dr Lisa Gahan, SWW's director responsible for water resources, told BBC Radio Cornwall <https:\/\/www.bbc.co.uk\/sounds\/play\/p0d86z24> \"some reservoirs\" had benefited from recent downpours, but \"for most it is in effect like it has not rained all year\".The average consumer uses 150 litres of water a day, she said \"and if we can bring that down it really helps\".The firm already offered a number of free water savings devices. <https:\/\/www.southwestwater.co.uk\/services\/save-water\/#\/>She said businesses such as car washes and golf courses could be asked \"in the next few weeks\" to use less water.\"We really want to avoid more restrictions being brought in because nobody wants to see that,\" she said.The firm may also ask the Environment Agency for emergency powers to take more water from rivers.SWW was tackling leaks, but a \"huge part of the solution\" was to reduce usage, she said.She added: \"We are waiting for the rain, we need a lot to get back to healthy levels and that is not forecast.\"Follow BBC News South West on Twitter <https:\/\/twitter.com\/BBCSpotlight>, Facebook <https:\/\/www.facebook.com\/bbcspotlight> and Instagram <https:\/\/instagram.com\/bbcspotlight>. Send your story ideas to spotlight@bbc.co.uk <mailto:spotlight@bbc.co.uk>."}