{"author":"By Max Matza","title":"Donald Trump assails Rupert Murdoch over defamation testimony","news_category":"general","content":"Former President Donald Trump has lashed out at Fox News owner Rupert Murdoch, accusing him of betraying Fox hosts in recent legal testimony.In a defamation lawsuit, Mr Murdoch conceded some Fox hosts had \"endorsed\" baseless claims the 2020 presidential election was stolen by voter fraud.On social media, Mr Trump accused the media mogul of selling out his stars. Dominion Voting Systems argues Fox News aired false and malicious rumours about voter fraud that harmed its business.In its defamation lawsuit, the electronic voting company is suing the conservative outlet for $1.6bn (£1.3bn).On Tuesday, Mr Trump posted: \"Why is Rupert Murdoch throwing his anchors under the table, which also happens to be killing his case and infuriating his viewers, who will again be leaving in droves - they already are.\"The Republican former president went on to repeat his unfounded claims of \"large scale ballot stuffing\".On Monday, a legal filing revealed that Mr Murdoch had told lawyers in the Dominion case that he did not believe Mr Trump's allegations of mass voter fraud and that he thought Fox News should have been \"stronger in denouncing\" them.Fox News has argued that the commentary it aired is protected under the constitutional right to free speech, and that it was only reporting on the then-president's allegations, not supporting them.Dominion's lawsuit argues that Fox embraced the election fraud conspiracy theory because of concerns that loyal conservatives were switching to more pro-Trump media outlets.After Fox was first to declare that Mr Biden had won the pivotal state of Arizona, Mr Murdoch said: \"My friend Jared Kushner called me saying, 'This is terrible,' and I could hear Trump's voice in the background shouting.\"He said that he had told Mr Kushner he could not change the outcome for Mr Trump because \"the numbers are the numbers\".After the Arizona call, Fox executives became alarmed by how many viewers began switching to other channels, the filings suggest.Fox waited to make a final victory call, even after other networks were announcing that Mr Biden had won.Mr Murdoch told his son and Fox Corporation chief executive Lachlan Murdoch in a private message: \"We should and could have gone first but at least being second saves us a Trump explosion!\"Lachlan Murdoch responded: \"I think good to be careful. Especially as we are still somewhat exposed on Arizona.\"Two days after the pro-Trump riot at Capitol Hill, Mr Murdoch emailed a Fox executive to say the network is \"very busy pivoting\".\"We want to make Trump a non person,\" his publicly released emails show. The legal filings also detail efforts Mr Murdoch personally took to aid Mr Trump's campaign against Democrat Joe Biden.\"During Trump's campaign, Rupert provided Trump's son-in-law and senior adviser, Jared Kushner, with Fox confidential information about Biden's ads, along with debate strategy,\" lawyers said in the court filing.It did not specifically disclose what information related to adverts and debate strategy was handed over to the Trump team.But the alleged back channel between Mr Murdoch and the Trump campaign echoed a similar controversy involving Hillary Clinton's team during her 2016 run for the White House.Leaked emails back then revealed that the leader of the Democratic National Committee, who was due to host a primary debate, had tipped off the Clinton team to questions that would come up during the forum."}