{"author":"","title":"Gary Lineker row: Ex-ITN boss John Hardie to lead BBC social media review","news_category":"general","content":"Former ITN chief executive John Hardie is to lead an independent review of BBC social media guidelines in the wake of the furore over Gary Lineker's tweets.The row erupted when the Match of the Day host said the government's language about migrants was \"not dissimilar to that used by Germany in the 30s\".The BBC took him off air, saying he had broken its guidelines on impartiality.But he returned a week later, with the the corporation announcing the review to address \"grey areas\" in its rules.Lineker is one of the BBC's best-known and best-paid stars, but is employed on a freelance basis.The review will examine what freelance presenters working outside news, current affairs and factual journalism should be allowed to say on their personal social media accounts.Mr Hardie ran ITV, Channel 4 and Channel 5's news while chief executive and editor-in-chief of ITN from 2009 to 2018.He said: \"I approach the task with no preconceptions and an open mind. I look forward to hearing from a wide range of voices, from both inside and outside the BBC, as the work progresses.\"The BBC said the review is expected to be completed by the summer, after which any changes to the guidance will be published.Lineker was told to \"step back\" from hosting Match of the Day earlier this month because his tweets about the government's new migration policy were deemed to be \"a breach of our guidelines\" by the BBC.Many other sports presenters and pundits refused to go on air in a show of support, leaving that weekend's TV and radio programming in tatters.\"We have never said that Gary should be an opinion-free zone, or that he can't have a view on issues that matter to him,\" the corporation said at the time. \"But we have said that he should keep well away from taking sides on party political issues or political controversies.\"Journalists working in news programmes have strict rules about what they can say on social media.Some others \"have an additional responsibility to the BBC because of their profile on the BBC\",the current guidelines say <https:\/\/www.bbc.co.uk\/editorialguidelines\/guidance\/individual-use-of-social-media>. \"We expect these individuals to avoid taking sides on party political issues or political controversies and to take care when addressing public policy matters.\"Lineker's agent has said <https:\/\/www.bbc.co.uk\/news\/uk-64976007> the star thought he had a \"special agreement\" with BBC director general Tim Davie to tweet about refugees and immigration.Lineker agreed his return with Mr Davie several days after the original suspension, with the director general announcing the review and \"accepting there was potential confusion caused by the grey areas of the BBC's social media guidance\".He said: \"The BBC has a commitment to impartiality in its Charter and a commitment to freedom of expression. That is a difficult balancing act to get right where people are subject to different contracts and on-air positions, and with different audience and social media profiles.\"Some people have also pointed to tweets containing political opinions by stars of other BBC shows, such as The Apprentice's Lord Sugar."}