{"author":"","title":"Anglesey: 2 Sisters confirms factory closure at end of March","news_category":"general","content":"A chicken processing factory employing 730 people will close on the 31 March, its owner has said.Poultry giant 2 Sisters announced plans in January to shut its premises at Llangefni, Anglesey <https:\/\/www.bbc.co.uk\/news\/uk-wales-64512722>.It said a consultation with unions and staff was at the point where \"it is unlikely any viable alternative to closure will come forward\".The firm said it was trying to move staff to roles in its wider business.\"Clearly this is very upsetting news for all parties concerned and a very difficult time for everyone at the factory,\" a spokesman for the Llangefni site said.\"We are hopeful we can update stakeholders in the coming weeks with some positive news on our efforts to redeploy colleagues within our wider business, as well as helping them find suitable opportunities outside the company,\" the statement added.A 2 Sisters review of the site <https:\/\/www.bbc.co.uk\/news\/uk-wales-64397513> described it as \"not sustainable\" and lacking space to be efficient, despite £5m being invested there.A joint statement from the company and the Unite union said: \"Final one-to-one consultations [with staff] will be carried out in the next couple of weeks\".\"We realise that this has been a distressing and unsettling time for all colleagues and would like to commend everyone on site for their professionalism during this difficult period,\" the statement added.Anglesey Council said 2 Sisters indicated from 1 April an estimated 20 to 25 of the current 730 workforce would still be working at the site.Council leader Llinos Medi called it \"devastating news for the workforce and their families\".\"We must also focus on the long-term future of the site and the impact losing more than 700 jobs will have on the future of the island and regional economy,\" she added.Ynys Môn MP Virginia Crosbie said she would do \"everything in my power to help staff on the island find jobs and training\".She added she was aware of talks between 2 Sisters and the UK government about a £40m cash injection to keep the factory going.\"The company could give no guarantees that the facility would remain open in the medium to long term if such support was given,\" she said.\"I'm sure many people would agree that this could never be a good use of taxpayers' money without a long-term guarantee for the site.\""}