{"author":"By Caleb Spencer","title":"Councils in Wales 'unaware' of unregulated children's homes","news_category":"general","content":"Councils in Wales often have \"no idea\" an unregulated home for vulnerable children has opened in their area, it is claimed.Assembly Member Helen Mary Jones made the remarks at an event marking 20 years since a report into child sex abuse at north Wales care homes.Some accommodation for children 16 and older is not regulated because it provides support rather than care.Council leaders said they shared some concerns around unregulated homes,The Lost in Care report, published in 2000, followed an inquiry by the late Sir Donald Waterhouse who found \"appalling mistreatment\" of children in the former county council areas of Gwynedd and Clwyd in the 1970s and 80s.Voices From Care Cymru organised a conference - Lost in Care: 20 Years On - which took place in Cardiff Bay.Ms Jones, Plaid Cymru AM for Mid and West Wales, said there had been an increase in the placement of children in unregulated homes, often known as semi-independent or supported accommodation.As they are deemed to be providing support rather than care, they are not inspected by regulators Care Inspectorate Wales and Ofsted, despite the vulnerabilities of many of the children.Ms Jones said she had had calls from constituents asking if these types of accommodation are in fact a family home.\"Often local authorities have no idea it is there,\" she said.\"I'm frightened about what might be happening to these children. They have complex needs, complex problems and are among the most vulnerable children. We need to take responsibility for them.\"Ms Jones called for a stronger regulatory framework for this type of accommodation, and to \"take profit out of the system\".There was also a message for council leaders to consider from care leavers.Daniel Pitt, who spent 10 years in care, said he had felt \"unloved\" by some social workers who were \"afraid of giving hugs\".Mr Pitt and other care leavers said the biggest obstacle to building a healthy relationship with social workers is that they \"tend to change a lot\".The Children's Commissioner for Wales, Sally Holland, said she would take action to \"see if we can put some pressure to get some continuity\" with social workers.First Minister Mark Drakeford spoke of the continuing relevance of the report.\"Paradoxically, Waterhouse might be one of those rare reports that is more influential 20 years on than it was in its immediate aftermath - it is a slow burner,\" the first minister said.He identified three ways the report \"remains significant\", including that it \"exposed absolutely the closed institutional world of care\".\"If Waterhouse taught us anything, it is the fallacy that families represent danger and care represents safety,\" he added.\"The legacy of Lost in Care is one which lives with us 20 years on, and we continue to learn from it. It's slow burn is by no means over.\"A Welsh Local Government Association spokesperson said they shared some of the concerns around unregulated homes, which was an \"emerging issue\" for local authorities.\"All local authorities take very seriously their responsibility towards young people and care leavers and, as such, we would welcome collaboration with Welsh Government and Care Inspectorate Wales to establish a broader picture which would help to enable an assessment of the current situation,\" they said."}