{"author":"","title":"Ukraine war: Mariupol civilians evacuated from steelworks bunker","news_category":"general","content":"This video can not be playedWatch: One woman who left the Azovstal steel works said she did not see any sunlight for two monthsDozens of civilians have been evacuated from Mariupol to both Russia-controlled and Ukraine-controlled territory after weeks under siege.Some have left the Azovstal steelworks, the last hold-out of Ukrainian troops in the strategically significant city.Russia said dozens of civilians have arrived in a village it controls.Ukrainian President Volodymyr Zelensky said a large group is also on its way to Zaporizhzhia, which Ukraine maintains control of.\"The first group of about 100 people is already heading to the controlled area,\" he tweeted. \"Tomorrow [Monday} we'll meet them in Zaporizhzhia. Grateful to our team! Now they, together with UN, are working on the evacuation of other civilians from the plant.\"The United Nations confirmed that a \"safe passage operation\" had begun to evacuate the citizens on Saturday, and that it was involved alongside the Red Cross.The evacuation convoy arrived on Saturday morning, the UN said - but did not give details on where people were being taken or how many had left, saying that sharing details could jeopardise the safety of the operation.Reuters footage from the complex show civilians - mainly women and children - being helped to walk over piles of rubble, and boarding a bus with missing windows.One woman with a six-month-old baby said they had been trapped in the steelworks for two months. Another, older woman says they were running out of food.Ukrainian officials said Russian shelling resumed on the steel plant after Sunday's brief ceasefire.While dozens have been rescued, several hundred civilians - including children - are still in the bunkers, Denys Shleha of Ukraine's National Guard was quoted by Reuters as saying on Sunday. He added that at least two more evacuation efforts like this will be needed to get everyone out.One of the evacuees to Russian-held territory told Reuters news agency: \"You just can't imagine what we have been through - the terror.\"\"I feared that the bunker would not withstand it - I had terrible fear,\" 37-year-old Natalia Usmanova said. \"When the bunker started to shake, I was hysterical, my husband can vouch for that: I was so worried the bunker would cave in.\"\"We didn't see the sun for so long.\"In other developments:The first civilians managed to leave the Azovstal plant on Saturday, but their fate was unclear for most of the following day.Now, the Russian defence ministry says some 80 civilians have left the besieged steelworks and were taken to Bezimenne, a village in Russian-held territory in Ukraine. They are being provided with medical care and supplies, it said.In a statement carried by Russian media, the ministry also said that civilians who wanted to leave for Ukraine-controlled areas \"have been handed over to representatives of the UN and the International Committee of the Red Cross\".Reuters news agency reported that one of its photographers stationed in the village had seen more than 50 arrive in a convoy, and reported that UN staff were in the area.Mariupol has come under intense bombardment from Russian artillery for weeks.The Azovstal steelworks - where Ukraine's last defenders are holed up with some remaining civilians - is a vast industrial area with a network of underground tunnels, making its capture difficult for Russian forces.Last month, after declaring that the southern Ukrainian city had been captured, Russian President Vladimir Putin ordered his troops to seal off the steelworks \"so that a fly cannot not pass through.\"The devastation across Mariupol has been some of the most severe in the conflict, with much of the city reduced to rubble and a widespread humanitarian crisis. Fleeing residents have spoken about a lack of food and water, and bodies of the dead being left in the streets.Speaking to the BBC on Saturday, Mariupol mayor Vadym Boychenko said: \"The citizens who left the city say that hell exists and it's in Mariupol.\"With most of the city now under Russian control, the focus remains on the conflict-hit steelworks.Shortly after news of Sunday's wider evacuation project emerged, Mariupol officials said that evacuation from areas of the city other than the Avozstal industrial plant had been put on hold until Monday morning."}