{"author":"By Mark Easton","title":"Channel migrants: Home Office response ineffective, says second report","news_category":"general","content":"The Home Office response to the migrants' crisis in the Channel has been \"ineffective and inefficient\", a much-delayed report has found.The approach exposes security weaknesses while \"leaving vulnerable migrants at risk\", says David Neal, independent chief inspector of Borders and Immigration.The Home Office says arrangements have been transformed since his inspection. This is the second report in two days <https:\/\/www.bbc.co.uk\/news\/uk-62244679> to criticise the official approach.Mr Neal's report <https:\/\/www.gov.uk\/government\/news\/inspection-report-published-an-inspection-of-the-initial-processing-of-migrants-arriving-via-small-boats-at-tug-haven-and-western-jet-foil-december-2> says an inspection of the processing facilities for newly arrived migrants found the Home Office's response to the challenge of increasing numbers of migrants was poor.It notes: \"If we don't have a record of people coming into the country, then we do not know who is threatened or who is threatening,\" Mr Neal says.Earlier this week he expressed his frustration and disappointment that the Home Office had been sitting on his findings for almost five months.In his foreword, the chief inspector says the report was produced in rapid time \"in order that the Home Office can react to its recommendations before crossings increase, in significant numbers, once more\".The department is supposed to publish such reports within eight weeks of receiving them.The Home Office has said that since this inspection, arrangements for the reception and initial processing of people arriving by small boat across the Channel have been \"transformed\".\"There remains work to do, but much of this report is now of a historic character and the criticisms identified reflect processes and procedures not now followed under the new operation,\" the department says.This is the second report in two days to criticise the Home Office's response to the issue of migrants crossing the Channel in small boats.On Wednesday, a review of the Border Force <https:\/\/www.bbc.co.uk\/news\/uk-62244679> commissioned by the home secretary described it as \"ineffective and possibly counter-productive\".Mr Neal has characterised the response as \"ineffective and inefficient\". He argues that the Home Office's \"refusal to transition from an emergency response to what has rapidly become steady state, or business as usual\" lay behind the poor performance.\"Data, the lifeblood of decision-making, is inexcusably awful. Equipment to carry out security checks is often first generation and unreliable. Biometrics, key to locking in an individual's identity, were not always recorded,\" Mr Neal notes."}