{"author":"","title":"Oldham Coliseum £27m relocation project scrapped","news_category":"general","content":"A £27 million project to relocate a historic Victorian theatre in Oldham has been scrapped.Established in 1885, Oldham Coliseum once attracted acts from around the world including Stan Laurel and Charlie Chaplin.Work had been due to start on a replacement venue this year on Union Street, in the town's cultural quarter.However, the plans have been shelved after Oldham Council said funds needed to be spent \"wisely\".Instead, the theatre will remain at its current location on Fairbottom Street.Council leader Sean Fielding said the authority would now explore other options and was \"committed\" to having a \"high-quality performance space\", the Local Democracy Reporter Service said.Mr Fielding said: \"In the current financial climate we've got to spend our funds wisely and that means reviewing our works and costs to ensure we get the best value for money for the taxpayers' of the town.\"A lot has changed since the idea was first discussed six years ago, including the costs involved.\"So at this stage we are not going to continue with the current proposals.\"The Coliseum began life as a circus on Henshaw Street, performing to crowds of 3,000 people.The wooden theatre was then dismantled and moved, plank by plank, to Fairbottom Street in 1887, becoming a popular music hall visited by global stars.More recently, it was the home of the Oldham Repertory Theatre, producing original Coronation Street cast members including William Roache, Jean Alexander and Pat Phoenix.Plans for the relocation were put forward under former council leader Jean Stretton, and would have seen the site expand to a 550-seat main auditorium and a 175-seat studio.The theatre's artistic director Kevin Shaw has announced he is stepping down after 17 years.Mr Fielding said: \"Over the next few months we will continue to draw up plans with the Coliseum and Arts Council England for a fit for purpose facility.\"Meanwhile, the council confirmed plans for a new heritage and arts centre at Oldham library and art gallery are to go ahead after the project received a Heritage Lottery Fund grant of £3.4m.Work could start in early 2019."}