{"author":"By Chris Mason & Richard Morris","title":"Chris Mason: Reflective images of extraordinary year in UK politics","news_category":"general","content":"2022 has been an extraordinary year for British politics, with three prime ministers, cabinet reshuffles, and resignations galore.But move away from the photo-op moment and look at the non-staged images as history unfolds, what does it tell us?Every prime minister faces a weekly grilling in the House of Commons - here, former PM Boris Johnson leaves 10 Downing Street to face MPs and the leader of the opposition, Sir Keir Starmer. The first half of the year was dominated by one question. How long would Mr Johnson last?Plotting, manoeuvring and positioning was going on. Some subtle, some less so. Liz Truss's ambitions were no secret. But as foreign secretary she was already in one of the biggest jobs in government. Here, she awaits an interview with the BBC's Sophie Raworth on Sunday Morning on 27 February. This interview caused a stir as the then foreign secretary said she backed Brits who wantedto go to fight in the war in Ukraine <https:\/\/www.bbc.co.uk\/news\/uk-60544838>. A photo that encapsulates Rishi Sunak's manner: understated, even cautious. A big moment awaits, as the then chancellor facesa grilling from Sophie Raworth <https:\/\/www.bbc.co.uk\/news\/uk-politics-60812549> ahead of his Spring Statement <https:\/\/www.bbc.co.uk\/news\/uk-politics-60848315>. Bigger ones were imminent, it would turn out.Arguably the biggest moment on Liz Truss's journey to Downing Street - she had just made the final two <https:\/\/www.bbc.co.uk\/news\/uk-politics-62241498>candidates to replace Boris Johnson - and was the favourite from the outset to beat Rishi Sunak in a vote of Conservative members.I was sitting a few yards away, alongside our Economics Editor Faisal Islam, at this livePM candidates debate <https:\/\/www.bbc.co.uk\/news\/uk-politics-62252242> in Stoke-on-Trent. Moments later, senior supporters of Liz Truss started to publicly say Mr Sunak has been \"mansplaining\" when he said her economic plans would fail.A summer hurtle around town halls and exhibition centres here, there and everywhere in the UK. Promises, placards and T-shirts as Conservative Party members picked the next prime minister on behalf of everyone else. Here, a protestor interrupts Liz Truss in Eastbourne.A day of two prime ministers and the Queen: the 6 September saw Queen Elizabeth wave off her 14th prime minister, Boris Johnson (pictured here with wife Carrie).And she waved in her 15th, Liz Truss. Her Majesty died just two days later. Downing Street was hit with a cloudburst while journalists awaited the arrival of the new prime minister, Liz Truss. I avoided getting soaked because I was trying to assemble our report for the Six o'clock News at the last minute…and it had gone 5pm.The weather was so grotty Ms Truss's motorcade was doing laps of the block hoping the rain would ease off. And I was nervously watching the clock as a deadline approached.Political correspondent Nick Eardley and BBC News presenter Huw Edwards were among those who needed umbrellas, while they waited for the new PM to arrive.\"It took longer than we thought,\" says Nick, \"because Liz Truss seemed to be taking the long route to Downing Street waiting for the rain to stop. And I remember being impressed by Huw's knowledge of the route through London, as he described her journey on live TV.\"As Liz Truss finished her first address as prime minister <https:\/\/www.bbc.co.uk\/news\/live\/uk-politics-62802807>, and the lectern was immediately whisked away for the shot of her and her husband waving, before entering the famous black door at Number 10. Notice the snazzy style of the spine of the lectern. It was very much a Liz Truss thing. That lectern vanished as quickly as she did.In a ceremony filled with formality, Commons Speaker, Sir Lindsay Hoyle, and other senior MPsattended the visit of King Charles in Parliament <https:\/\/www.bbc.co.uk\/news\/uk-62874346> - the new monarch's first visit as king - on 12 September. I was in the press box at the back of Westminster Hall. Anastonishing thing to witness first hand <https:\/\/www.bbc.co.uk\/news\/uk-politics-62878642>: the sense of sadness, pride and history.The symbolism, even triumphalism of taking me and other reporters up the Empire State Building <https:\/\/www.bbc.co.uk\/news\/uk-politics-62968072> in New York to do interviews, her first in the job. It said oodles about Liz Truss's confidence on taking office. I ended up standing right next to the window for my interview. The prime minister took playful delight in the fact a few of us remarked how close to the window we were and how far down the ground was.Reporters love novelty. And the Labour party conference in Liverpool <https:\/\/www.bbc.co.uk\/news\/av\/uk-politics-63049522> was novel because there was no internal anger. \"There aren't any fights breaking out in the corner,\" one senior figure told me with delight.The Conservative conference in Birmingham, by contrast, was the most astonishing party gathering I have ever been to. I could fill a notebook every 15 minutes. Electric, toxic, volcanic, incredible. A government imploding in public.Travelling to events, make speeches and meet potential voters is a huge part of the job of the leader of the opposition. October saw Sir Keir Starmer taking the train to Brighton to address the Trades Union Congress.A packed Commons, and a new PM: Rishi Sunak's second session of prime minister's questions <https:\/\/www.bbc.co.uk\/news\/av\/uk-politics-63488772> saw Sir Keir Starmer ask questions about the processing of asylum seekers and the Conservative record on migration figures. Mr Sunak sought to bring a quiet seriousness to Downing Street. For the first time in 2022, the intrigue about whether the prime minister, whichever prime minister, would last the week\/month\/year receded.Sweden's Prime Minister, Ulf Kristersson, writes down his contact details for Rishi Sunakduring the Cop27 summit <https:\/\/www.bbc.co.uk\/news\/uk-politics-63536770> at Sharm el-Sheikh in Egypt. This was Sunak's first foreign trip as prime minister. I pointed out to him on the way there that this was my third foreign trip with a prime minister in six months and every time there has been a new prime minister. Downing Street had originally said he wouldn't go to the climate summit. But then he did. It was a first chance to meet fellow leaders face-to- face.Downing Street is often filled with photographers and reporters, there to report the news outside one of the most famous addresses in the world. Nato Secretary General Jens Stoltenbergwas a visitor and spoke to Norwegian media <https:\/\/www.bbc.co.uk\/news\/world-63572502> during a visit in November.A chancellor in waiting? The past year transformed how Labour started being perceived, as opinion polls suggested that the party winning the next election wasn't just possible, it was likely. The scrutiny they will face in 2023 will step up.Politicians, petitioners and protesters all make their way up Downing Street throughout the year. But while Larry, the pet cat, makes a regular appearance in front of the black front door, this fox trotting pastthe traditional Downing Street Christmas tree <https:\/\/www.bbc.co.uk\/news\/uk-england-stoke-staffordshire-63202049> was one of the more unusual visitors of 2022.Additional reporting: Richard Morris"}