{"author":"","title":"Afghanistan conflict: Airlines reroute flights out of Afghan airspace","news_category":"general","content":"This video can not be played2021: Chaotic scenes at Kabul airportAirlines have stopped flying through Afghan airspace after the country's civil aviation authority advised carriers to reroute.British Airways, Virgin Atlantic and United Airlines have stopped using airspace after the Taliban swept into the country's capital, Kabul.Virgin Atlantic said it operated its last flight over Afghanistan on Sunday.It told the BBC it was drawing up new flight paths to reroute services departing on Monday.It is understood the UK government has not yet advised flight operators with UK licences to avoid Afghanistan airspace - airlines have made the decision themselves.Emirates has suspended flights to Kabul until further notice, while Qatar Airways, Singapore Airlines, Taiwan's China Airlines, Air France KLM and Lufthansa have also adjusted flight routes out of Afghan airspace.On Sunday, the Taliban declared victory after Afghan President Ashraf Ghani fled abroad and his government collapsed.Western nations, including the US and UK, are rushing to evacuate staff and citizens. Commercial flights have mostly been suspended, which has sparked chaos atKabul airport as hundreds of Afghans and other foreign nationals try to leave the country. <https:\/\/www.bbc.co.uk\/news\/live\/world-asia-58219963>The Afghanistan Civil Aviation Authority (ACAA) has advised transit aircraft to reroute, Reuters reported. It said journeys through Kabul airspace would be uncontrolled.Virgin Atlantic, who uses Afghan airspace to access some of its key markets in south Asia, said it had been monitoring the situation in Afghanistan.\"The health, safety and security of our customers and people always comes first,\" a statement said.\"Following the latest situation reports in Afghanistan, we will be re-routing our upcoming services to avoid Afghanistan's airspace.\"Industry sources said there have been no direct services from UK to Kabul with commercial operators for more than 20 years.Previously, passengers from the UK could transit in other airports such as Istanbul or Dubai to reach Kabul, but Emirates and Turkish Airlines have now suspended its operations there, as has Pakistan Airlines.The Foreign, Commonwealth & Development Office (FCDO) has advised against all travel to Afghanistan. All British nationals in Afghanistan are advised to leave now by commercial means.An Air India flight from Chicago to Delhi changed course and exited Afghanistan's airspace,according to flight tracking website FlightRadar24. <https:\/\/twitter.com\/flightradar24\/status\/1427147599522435075?web=1&wdLOR=c0210D3D0-6F15-4541-A7B6-10A00155FC25>Another Air India flight carrying 40 Afghans from Delhi to Kabul was told by air traffic controllers todelay landing on Sunday as the Taliban seized the city. <https:\/\/www.bbc.co.uk\/news\/world-asia-india-58228280>It landed after 90 minutes of circling and then later took off with 129 passengers, who included Afghan officials, at least two MPs and a senior adviser to the former president.In July, the US Federal Aviation Administration (FAA) imposed new flight restrictions over Afghanistan for US airlines due to the risk \"posed by extremist\/militant activity\".It said flights operating below 26,000 feet were prohibited in the Kabul Flight Information Region, which largely covers Afghanistan, unless operating in and out of Hamid Karzai International Airport.According to website Safe Airspace, countries such as Canada, Britain, Germany and France have also guided airlines to fly at an altitude of at least 25,000 feet over Afghanistan.In recent years, airlines and governments have provided more guidance on the risks of flying over conflict zones after two planes were shot down.In 2014, a Malaysia Airlines plane was shot down over eastern Ukraine, killing the 298 people on board. In 2020, a Ukraine International Airlines jet was hit by Iran's military, killing all 176 passengers and crew.\"Airlines are very sensitive to flight disruption,\" said aviation consultant John Strickland, \"After the Malaysian Airlines flight over Ukraine came down, it revealed that International guidance was very fragmented and that airlines did different things.\"ICAO, the international aviation regulator, has tried to get international standards sorted, but the challenge is for airlines to manage this.\""}