{"author":"","title":"Spaceport launch will inspire children of Cornwall, team says","news_category":"general","content":"The launch of satellites from Spaceport Cornwall will inspire children to work in the sector, those behind the project have said.The Spaceport and Virgin Orbit are awaiting licences before launching <https:\/\/www.bbc.co.uk\/news\/uk-england-cornwall-63511502> the first such flight from UK soil.The Head of Spaceport Cornwall said her team was driven by \"what we can achieve for Cornwall and children of Cornwall\".Melissa Thorpe said they planned to \"attract other businesses here, but also to inspire the next generation\".\"My team is a small team but we live and breathe this, and our belief in what we can achieve for Cornwall and the children of Cornwall especially.\"The Virgin Orbit plane, called Cosmic Girl, and rocket arrived at Cornwall Airport Newquayin October ahead of the mission <https:\/\/www.bbc.co.uk\/news\/science-environment-63269429>.Cornwall Councillor Louis Gardner said the authority had backed the scheme for the last eight years.\"Many people said we couldn't do it, it couldn't be done. But not only are we here right now - we are the first, not just the first in the UK, we are the first in Europe and that is incredibly special for Cornwall,\" he said.\"We led the world for a long time in science and technology and engineering, and we forgot that. And this has reminded us of that. As a council we haven't just invested in a Spaceport, we have invested in an entire sector.\"And we haven't just invested in that, we have invested in the hope of our children.\"Matt Archer, Spaceflight Programme Director at UK Space Agency, said he believed the launch date was weeks away.\"My expectation is it should be in the next few weeks,\" he said.\"So we are looking at either late November or early December, but that will depend on weather and other things that Virgin Orbit affect how they prepare for launch. But ultimately it will launch when it is safe to do so\".The boss of Virgin Orbit has said he is hopeful a licence will be issued to Spaceport Cornwall in the coming days.Follow BBC News South West on Twitter <https:\/\/twitter.com\/BBCSpotlight>, Facebook <https:\/\/www.facebook.com\/bbcspotlight> and Instagram <https:\/\/instagram.com\/bbcspotlight>. Send your story ideas to spotlight@bbc.co.uk <mailto:spotlight@bbc.co.uk>."}