{"author":"By Joanna Tidman","title":"'Fleecehold': New homes hit by 'hidden costs'","news_category":"general","content":"Paying unexpected costs on new-build homes has been dubbed the next PPI scandal waiting to happen, and has homeowners and MPs alike wanting solutions.But how safe from the charges are you?Owners of leasehold properties, for example, are finding out that while a brand new home may look like a dream, it could turn into a nightmare.They own the leasehold property for a fixed period of time and can also be charged expensive ground rent and other fees which might make their homes difficult to sell in future.But freeholders, who own their homes and the land they're built on, aren't immune from the problem either.Imagine owning a new home on a new estate - along with the land - but having to pay annual fees anyway. That's when freehold becomes \"fleecehold\", critics say.Leasehold owners can end up paying money - including fees for altering the building - to the party which owns the land, often the house builder.While freehold owners might seem exempt at first glance, they can still sign contracts which see them forking out annual maintenance fees for the upkeep of the wider, fledgling neighbourhood.These \"estate fees\" emerge when a local council decides not to adopt the new area, leaving the builder - or more likely a third party management company - with responsibility for roads and green spaces.Freeholders saddled with the charges say it's effectively a second tax on top of the one they already pay to local authorities.They say it's doubly frustrating because the estate for which they pay a private company is nevertheless public space, which can be used by anybody.Criticism ranges from alleged mis-selling to a lack of clear information for prospective buyers about what might lie ahead.Whether freeholder or leaseholder, those liable for charges say they are in a tenant-landlord relationship, despite their new-build homes putting them on the property ladder.Freeholder Terry Stringer moved on to the Church Meadow estate in Bromsgrove, Worcestershire, in 2015. He calls it \"probably the worst mistake of my life\".He pays money to SDL, the company that took over responsibility for the estate from housebuilder Bovis. And the fees are rising.Mr Stringer says he's seen the maintenance bill go from £12,000, shared across 80 estate homes, to £32,000 - £400 per household per year.He said: \"I just wish I wasn't here, I wish I was in the old house.\"I feel abused, ripped off.\"Mr Stringer also feels the price hike has not improved a site he sees as poorly maintained. \"We were told all of these wonderful things about what was happening and how much it was going to cost us and it hasn't transpired.\"He wants the council to take over, especially as \"everybody in the country can use this place\".But Bromsgrove District Council says it can only take on the land at the builder's request, and has not been asked.Meanwhile, SDL says there is still work to be done on the development and it liaises with all stakeholders to inform them of actions being taken.Freeholder Halima Ali has lived on Rochdale's Newbold Hall Drive estate for four years.She faces a £150 annual fee to live there but has refused to pay it, saying the estate's shared spaces are of inadequate standard.Her fears, though, run deeper.She thinks the practice - which makes \"cash cows\" out of homeowners - is not only a dereliction of council duty, but one that leaves residents with potentially unsellable homes.\"Once this scandal becomes more well known, you can imagine how the value of our homes will drop. This is simply unacceptable.\"Our home for the average person is one of our biggest investments and it should not be the case that a third party has an interest in our property.\"The private company managing Newbold Hall Drive was contacted for comment. The estate's builder Persimmon said: \"The residents are legally obliged to pay the fees and have the right and ability to change the management company should they be unhappy with the costs and service provided.\"Those already in the situation cannot avoid them - they are subject to binding contracts between builders and maintenance companies.The key is to be armed with information about the situation before entering into it.But that is not as simple as it sounds and a shortfall in clear information on costs and obligations is something campaigners are worried about.There also seems little protection against a hike in estate fees. Helen Goodman, Labour MP for Bishop Auckland, is seeking to raise the profile of freeholders' plight and wants a cap on the charges. She says freeholders have no legal recourse in the event of a dispute.Campaign group Home Owners Rights Network (HorNet) claims 478 estates - with 87,000 households - are in dispute with management firms.One breakthrough might come by way of local authorities adopting the neighbourhoods that spring up where there were none before.However, a local government expert from the University of Birmingham says that would buck a trend. According to Dr Matt Cole \"councils are quite happy not to add to their burden of work\".The House Builders Federation says councils are even refusing to adopt land, leaving people reliant on the private sector for services publicly delivered to others.Where leaseholders are concerned, there's been some movement.This week, a group of MPs concluded leaseholders in new builds were treated as a source of profit <https:\/\/www.bbc.co.uk\/news\/business-47618086>, adding claims of mis-selling should be investigated.The Communities and Local Government Committee (HCLG) also wants a standardised key features document to be developed for would-be buyers at the start of the sales process.That's because, it said, \"it is clear that many of the leaseholders we heard from were not aware of the differences between freehold and leasehold at the point of purchase\".Meanwhile, Ms Goodman, with a focus on freeholders' problems, says homeowners' complaints have gone from a \"trickle\" to a \"flood\".She says many people feel they have been mis-sold their homes, and the situation is \"increasingly looking like another PPI scandal\".Housing minister Kit Malthouse MP says measures are planned to protect freeholders, with a statutory regime setting out their rights to be introduced within 12 months.Additional reporting by John Newton"}