{"author":"By Mark Savage","title":"Years & Years star Olly Alexander says he was advised to hide his sexuality","news_category":"general","content":"Since Years & Years won the BBC's Sound of 2015, Olly Alexander has been refreshingly open about his sexuality.But the singer says he was advised to keep quiet about being gay when the group got their record deal.Speaking at a Stonewall event, he said the band were getting media training when he asked the trainer how to deal with questions about his sex life.\"She said, with very good intentions I'm sure: 'Why does anybody need to know about your sexuality?'.\"Alexander said that the trainer told him: \"What business is it who you go to bed with? Do you really want to invite personal questions like that? Maybe it's better to not say anything about your sexuality at all'.\"But he added: \"I ignored her advice.\"When a journalist did ask me about my sexuality, I said 'Yes, I'm gay and this song is about a man'.\"I needed to say that for my 15-year old self. I needed to say to him, 'Look, we are not hiding any more'.\"The 27-year-old also talked about how he had struggled with anxiety and depression in his youth, because he had grown up \"in a society that taught me I had to behave in a certain way and that being gay was not normal\".He later made a BBC documentary about his experiences, called Growing Up Gay <https:\/\/www.bbc.co.uk\/iplayer\/episode\/p057nfy7\/sign\/olly-alexander-growing-up-gay>, and said that speaking candidly about homosexuality had helped him combat his anxiety.The response took him by surprise.\"I got so many messages from fans who wanted to share their story, who were struggling with their sexuality or gender identity, had problems at school or at home,\" he said.\"I was honestly quite shocked at the extent of pain people were struggling with. I felt like I was hearing an alarm bell ringing. A cry for help that was largely going ignored.\"That is why I continue to speak out. We have to listen and learn from each other to lift each other up, so we can all live the life we deserve.\"Alexander's emotional speech earned a standing ovation from the audience, which included host June Sarpong, author and trans activist Juno Dawson, swimmer Mark Foster, and TV personalities Gok Wan and Gaby Roslin.Little Mix star Jade Thirlwall, who used her 25th birthday party in December to raise money for Stonewall, was also in attendance.The gala dinner, in London, was held to mark the 30th anniversary of the introduction of Section 28 of the 1988 Local Government Act.The law stated that councils should not \"intentionally promote homosexuality or publish material with the intention of promoting homosexuality\" in their schools or other areas of their work.It faced strong protests led by gay rights and equality campaigners until it was repealed by the devolved administration in Scotland in 2000 and by the UK government with respect to England and Wales in 2003.Follow us on Facebook <https:\/\/www.facebook.com\/BBCEntsNews\/>, on Twitter @BBCNewsEnts <https:\/\/twitter.com\/BBCNewsEnts>, or on Instagram at bbcnewsents <https:\/\/www.instagram.com\/BBCNewsEnts\/>. If you have a story suggestion email entertainment.news@bbc.co.uk <mailto:entertainment.news@bbc.co.uk>."}