{"author":"","title":"UK Shared Proserity Fund not a replacement for EU money, says Mencap","news_category":"general","content":"A £57m UK government package <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-65123873> to support charities and communities groups \"is not a replacement\" for EU funding that came to an end two days ago, the charity Mencap has said.The European Social Fund (ESF), which provided about £40m a year for hundreds of community organisations, was halted as a result of Brexit.The government has replaced it with the Shared Prosperity Fund (UKSPF).However it is understood the £57m is to be spread over two years.This means it is more than £20m short of the ESF fund. The UK government said that about 100 organisations will receive financial backing, but many that applied for a share have been rejected.The news led to a protest in Belfast by staff and organisations affected by the funding crisis.Mencap NI director Grainne Close said the charity, which has received money from UKSPF, still faces a shortfall for the year ahead, adding that there's \"a real smokescreen\" around the numbers provided by the UK government.\"Back about a month ago we put about 50 of our employment-support staff on to protective notice,\" she told the BBC News NI's Sunday Politics programme.\"We're going to save some jobs but we're going to have to reduce the service because it's not like-for-like... we're still losing about 50% and we're going to have to find that from somewhere so there'll be all eyes on central government.\"In a statement on Friday, Northern Ireland Secretary Chris Heaton-Harris said the UKSPF will \"invest in skills training and interventions to support economically inactive people in Northern Ireland\", adding, \"this is key to boosting productivity and harnessing Northern Ireland's growth potential\".The government said one of the successful projects was from Action Mental Health and six partners, including Mencap, who were awarded £12m to deliver a training programme to help people with significant disabilities or health conditions to gain employmentHowever, Ms Close said she is concerned that the UKSPF's focus on economic inactivity could see vulnerable people in Northern Ireland being left behind.\"The priorities of the ESF was to focus on social inclusion, it was working with the most marginalised and disadvantaged in our communities, the UK Shared Prosperity Fund does not do that,\" Ms Close said.She anticipates reduced services will have a \"huge impact\" on those furthest away from the labour market.\"People with a learning disability will not be recognised in the same way or afforded the same rights in terms of that fund, because it's different, it's focusing on pride and place.\"You're going to be looking at the human rights of people with a learning disability here in Northern Ireland, are they being afforded the same as their counterparts in other parts of the UK?\"In a statement on Friday, the government said the the UKSPF will support thousands of people into work via \"transformational projects to tackle economic inactivity, boost job opportunities and grow the local economy\".Levelling Up Minister Dehenna Davison said the £57m announcement was an \"important milestone\".\"We are making the most of opportunities outside the European Union to deliver for people in Northern Ireland,\" she said."}