{"author":"","title":"North Korea threatens to resume nuclear and ICBM testing","news_category":"general","content":"North Korean leader Kim Jong-un has said he is ending the suspension of nuclear and long-range missile tests put in place during talks with the US.Mr Kim also said his country would soon introduce \"a new strategic weapon\". But he left a door open for dialogue, and said the scope of any testing would depend on the US's \"attitude\".The momentum of the past few years has stalled, as Washington refuses to lift sanctions until Pyongyang fully abandons its nuclear programme.The North conducted several smaller weapons tests late in 2019, in what was seen as an attempt to pressure the US into making concessions.But the self-declared moratorium on nuclear tests and tests of intercontinental ballistic missiles (ICBMs) that could reach the US mainland had been one of the foundations of the negotiations with Washington.Pyongyang has not carried out such tests since 2017. Mr Kim's comments came at the end of a four-day gathering of party leaders in Pyongyang, an unusual event for this time of the year.On 1 January, state media reported him as saying North Korea was no longer bound by the self-declared moratorium, as the US continued joint military drills with South Korea and had stepped up their sanctions.\"Under such condition, there is no ground for us to get unilaterally bound to the commitment any longer, the commitment to which there is no opposite party, and this is chilling our efforts for worldwide nuclear disarmament and non-proliferation,\" news agency KCNA quoted him as saying.He threatened that \"the world will witness a new strategic weapon\" from the North \"in the near future\", while giving no further details.Mr Kim's comments to the party meeting also admitted that sanctions have hit the economy and were unlikely to be lifted soon, warning that North Koreans will have to \"tighten our belts\".The North Korean leader did not, however, mention Donald Trump or South Korea by name, seen by observers as a toning-down of language compared to the aggressive rhetoric of recent months.The comments were \"notable for falling short of directly tearing up the April 2018 moratorium on long-range missile and nuclear tests\", Chad O'Carroll of North Korea analysis site NK News told the BBC.\"Instead, Mr Kim's remarks implied that such resumed testing will be contingent on US actions in the weeks and months ahead.\"Mr Kim's published comments appear to have taken the place of his usual New Year's Day speech.Previous addresses have signalled changes in policy direction to Pyongyang's international adversaries and this year's comments appear to have a similar role.This video can not be playedDonald Trump and Kim Jong-un: From enemies to frenemies\"Kim Jong-un knows that President Trump faces an election campaign soon and that renewed North Korean ICBM and nuclear testing would be a major foreign policy embarrassment for the White House,\" said Mr O'Carroll.\"The remarks delivered today communicate a simple message to Washington: provide us with major concessions soon if you want to avoid long-range missile tests during the election campaign.\"There is little indication the White House will give in to that pressure, he adds, so \"we appear headed toward significant turbulence in the year ahead\".As he headed into a New Year event in Florida, Mr Trump told reporters that he and Mr Kim \"did sign a contract, talking about denuclearisation\".\"I think he's a man of his word,\" he said.US Foreign Secretary Mike Pompeo said he hoped the North would choose peace over war.\"If Chairman Kim has reneged on the commitments he made to President Trump, that is deeply disappointing,\" Mr Pompeo told US broadcaster CBS.\"He made those commitments to President Trump in exchange for President Trump agreeing not to conduct large-scale military exercises. We've lived up to our commitments. We continue to hold out hope that he will live up to his as well.\"But relations between the US and North Korea have deteriorated in the months leading up to 2020.This video can not be playedPresident Trump: \"Stepping across that line was a great honour\"Already in May, North Korea had started testing short-range missiles again - though not the long-range missiles capable of reaching the US, which are more controversial - and more recently, the language between the two sides has grown increasingly hostile.Pyongyang had set Washington an end-of-year deadline to offer sanctions relief, threatening that the US could expect a \"Christmas gift\" if it did not comply.So far though, Washington has refused to lift sanctions, insisting that North Korea must first fully abandon its nuclear programme."}