{"author":"","title":"Just Stop Oil QEII Bridge activist 'was delivering climate warning'","news_category":"general","content":"A Just Stop Oil protester has told jurors he climbed the Dartford Crossing bridge to deliver a \"warning message\".Morgan Trowland, 40, of Islington, north London, and Marcus Decker, 34, of no fixed address, are on trial accused of causing a public nuisance.The court has heard the Queen Elizabeth II Bridge, linking the M25 in Essex and Kent, was closed between 04:00 BST on 17 October and 21:00 the following day.Mr Trowland said the bridge was chosen for its proximity to three fuel depots.\"We climbed it to deliver a warning message - to put up a banner saying 'Just Stop Oil' and to speak that message through interviews with journalists,\" he told Basildon Crown Court.He said the group's goal was to get the government to stop licensing oil and gas production, and said the media only reported things that \"cause trouble\".Mr Trowland said he used ropes and other climbing equipment to shuffle 200ft (60m) above the road.Prosecutor Adam King has already said the demonstration cost small businesses \"hundreds of thousands of pounds\" <https:\/\/www.bbc.co.uk\/news\/uk-england-essex-65102021> and some people \"missed loved one's funerals\".Mr Trowland, standing in the witness box on Thursday, compared climate change to an iceberg.\"Think back to the story of the Titanic; why did they get into such a dangerous situation?,\" he said.\"Everyone was in a fantasy that they were in an unsinkable ship.\"Prosecutors said the pair came down from the bridge at 17:30 on 18 October \"with the help of police and a very tall cherry picker crane\".The defendants deny the charges and the trial continues.Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}