{"author":"","title":"Wrightbus: Ballymena firm to supply 800 buses to Ireland","news_category":"general","content":"Ballymena firm Wrightbus has signed an agreement to supply up to 800 electric buses to the Republic of Ireland.The first batch of 120 buses will form the start of a five-year framework agreement.This order represents an investment of about €80.4m (£69m), Ireland's National Transport Authority said.The battery-powered buses - Streetdeck Electroliner BEVs - will be manufactured and assembled at the firm's facility in Galgorm.The National Transport Authority said the framework agreement could amount to the single biggest bus procurement in the history of the Irish state.Neil Collins, managing director of Wrightbus, said: \"We are extremely proud of this historic deal, which is hugely significant for Ireland's decarbonisation ambitions and for us here at Wrightbus.\"This deal further cements the reputation we have built in the zero-emission sector, and follows hot on the heels of historic deals in Australia and Germany.\"He said the deal showed the firm's \"ambition to be at the forefront of the zero emission drives in cities, towns and rural areas across the world\".Ian Paisley, DUP MP for North Antrim, said it was \"wonderful news\" for the company and workforce.\"Such orders only come about because of hard work and the best product,\" he said.\"The Wrightbus transport solutions are the right product for the time and are now part of the mainstay of transport solutions in UK, Republic of Ireland, Germany, Australia and elsewhere.\"The agreement follows an announcement last month for Wrightbus to supply 60 hydrogen buses to Germany. <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-61609108>The National Transport Authority said that, of the 120 buses initially ordered, 100 are destined for use by Dublin Bus on services within the Dublin metropolitan area and 20 for use by Bus Éireann in the Limerick metropolitan area.The remaining buses to be ordered as part of deal will serve other towns and cities, including Cork, Galway and Waterford.The Irish transport minister hailed the deal as a step towards meeting carbon reduction targets.\"Going electric will reduce the carbon footprint of our public transport fleet, and will help us reach our long-term climate goals, as outlined in the Climate Action Plan,\" said Eamon Ryan.\"These new electric buses will also help reduce air pollution, improve public health and improve access to public transport for people of all abilities.\""}