{"author":"","title":"Ukraine crisis: Mark Drakeford urges visa-free UK entry","news_category":"general","content":"Ukrainian refugees should be allowed into the UK without visas, Wales' first minister has said.Mark Drakeford said the UK government \"had to do more\" for people fleeing Ukraine after Russia's invasion just over two weeks ago.The UK government has been criticised for its response to the refugee crisis, taking in about 1,000 people so far.Earlier, Prime Minister Boris Johnson said an upcoming scheme <https:\/\/www.bbc.co.uk\/news\/uk-60701941> would allow Britons to take Ukrainians in.Defending the current rules, Mr Johnson added: \"People want us to be generous but also careful.\"Ukrainians with passports will be able to apply for UK visas entirely online from Tuesday, but countries in the European Union have allowed refugees from Ukraine in for three years without a visa.Speaking ahead of Welsh Labour's spring conference in Llandudno, Mr Drakeford said there was \"clearly a gap\" between what UK ministers were saying and \"what was happening on the ground\".He told BBC Radio Wales Breakfast <https:\/\/www.bbc.co.uk\/programmes\/m00050lj>: \"We still argue that visas are not necessary as they are not necessary in the European Union\".\"We use all those occasions to try to persuade UK ministers to do more to make it easier for people feeling the dreadful scenes we are seeing in Ukraine and who are looking for sanctuary in the United Kingdom and here in Wales.\"Mr Drakeford, Welsh Labour's leader, said he wanted Wales to become a \"nation of sanctuary\" <https:\/\/www.bbc.co.uk\/news\/uk-wales-60527006> following the invasion.More than two million people have fled Ukraine in the past two weeks, with about 1.4 million taken in by Poland, which shares a border with the country.Speaking later, visiting two schools in Holywell, Flintshire, the first minister added: \"I understand why checks are necessary, but I think those checks can be done when people arrive, not before they arrive.\"The people we are talking about, over half the people who are displaced from the Ukraine at the moment, are children.\"The people who are accompanying them are women and elderly people. \"I think a proportionate approach to risk would be to allow people to come to this country and then checks it can be carried out.\"UK Labour has called for emergency protection visas <https:\/\/www.bbc.co.uk\/news\/uk-politics-60616262> for Ukrainian refugees, rather than ditching the documentation.Mr Drakeford said he would be meeting UK party leader Sir Keir Starmer later on Friday.\"We are both calling all the time on the UK government to do more, to make it easier,\" the first minister said.\"People need swift, safe, reliable passages out of a war zone to somewhere like Wales where people can temporarily as I'm sure they will think, regroup, re-establish themselves.\"I get letters every day from people across Wales, offering accommodation, wanting to help. We need a UK government that captures that spirit.\"Meeting pupils at Ysgol Treffynnon and Ysgol Maes y Felin, the first minister also confirmed that free school meals will be available to all eligible children in this year's Easter, Whitsun and summer holidays.The £21.4m cost was included in the final Welsh government budget, published on 1 March.Mark Drakeford said: \"The cost of living crisis is putting families under real pressure.\"Too many are having to make terrible choices between heating or eating as prices soar.\"Mr Drakeford, who will address the Welsh Labour conference on Saturday, added that the funding would \"ensure children get a good meal even when they aren't in school\".Education Minister Jeremy Miles said the funding included a \"discretionary free school meal fund, which will allow schools to provide a free meal to pupils who come to school hungry, including those children who are not normally eligible for free school meals and those who have no recourse to public funding\".This conference is taking place in the run-up to local government elections in May, with recent polling suggesting Welsh Labour is in a strong position.But the backdrop of the war in Ukraine, and rising prices which are being exacerbated by the conflict, will put pressure on all tiers of government in the UK and Wales in the next few months.Welsh Labour government ministers say they want to open the doors to those fleeing the war, but it's local councils whose job it is to provide housing and support.Some of the families who came to Wales from Afghanistan last year have yet to be properly housed, which begs questions about the resourcing being made available to help traumatised people settle once they arrive in Wales.Another question facing Welsh Labour in the medium term is what new electoral system they're prepared to accept if plans to increase the number of MSs go aheadThat will be discussed this weekend, but the final decision is likely to made at a special conference later this year."}