{"author":"","title":"Ukraine families' escape to Wales blocked by visa delay","news_category":"general","content":"A mother-of-two offering shelter to two Ukrainian families has said a \"black hole of missing visas\" puts them in more danger every day.Catherine Hummel is waiting to host two mothers from Odessa, who have three daughters between them, at her family home in Caernarfon, Gwynedd.Their escape route is planned and their tickets booked.The UK government said more than 71,800 visas had been granted and 21,600 Ukrainians had arrived in the UK.After a month's wait, the families still need one more visa before they can leave war-torn Ukraine, Mrs Hummel said.Catherine, who is married to Adam and has two teenage children, Alex and Thea, said the situation was becoming increasingly \"frustrating\" and \"dangerous\".They are among the 10,000 people who have applied for the Homes for Ukraine scheme <https:\/\/www.bbc.co.uk\/news\/uk-wales-60792449>.Others have complained that the system is too slow and bureaucratic <https:\/\/www.bbc.co.uk\/news\/av\/uk-wales-61045224> amid an urgent need to get people to safety.Catherine and one of the mothers she will host, Nataliya Isaieva, spoke to BBC Radio Wales Breakfast <https:\/\/www.bbc.co.uk\/programmes\/m00050lj> about their plight.After appearing on the programme, the families were subsequently awarded the visa they were waiting for.\"Every day and night, rockets are fired in our direction and the situation in our region has changed,\" said Nataliya.\"I can't explain the fear we feel when we hear rockets flying over our house.\"At first we're think 'thank God this rocket is not shooting my house,' but then we understand that it's hit another house and killed another child and it's terrible.\"She said the offer to live in Wales gave her \"the joy of the opportunity to save my children\".\"The plan is to get from Odessa to Poland by train if it will be possible and then by bus we have booked a ticket from Poland to Kent,\" she said.\"[We] haven't received one visa and we may lose this.\"Catherine, who runs a campsite and met both families on Facebook, said: \"It's four weeks today that we applied for the visas, so it's very frustrating, everything is on hold.\"We Zoom at least once a week and it started off fairly upbeat in some peculiar way once we met because we just clicked as two families straight away.\"Every week I would say their mood has changed because they just want to get out to keep their children safe.\"They had two air raid sirens last night, and they usually have more than that so they are having to get up out of bed, go to a safe place so they are having broken sleep every night, so I say they are absolutely exhausted as well.\"Every day, Catherine emails the UK government and visa centres, but said she had been \"sent round and round in a loop and nobody seems to help, they just pass you on\".\"I just don't see this missing visa is ever going to materialise,\" she said.\"There's this black hole of missing visas... something's going wrong somewhere.\"She said she was increasingly worried for the families' safety: \"The longer they are in Odessa the more dangerous it gets.\"The UK government said: \"We are processing thousands of visas a day - this shows the changes we made to streamline the service are working and we'll continue to build on this success so we can speed up the process even further.\""}