{"author":"By Simon Read","title":"House owners rue leasehold purchases","news_category":"general","content":"Almost half the people who bought a leasehold house in the past decade had no idea what they were getting into, according to a new study.Homebuyers faced high fees and charges, with many feeling they were mis-sold.The research follows controversy which led the government to crackdown on \"unjustified\" leasehold houses.The National Association of Estate Agents warned: \"Most buyers have no idea about the trappings of a leasehold contract until it's too late.\"The new property trap affecting thousands <https:\/\/www.bbc.co.uk\/news\/business-38827661>Leasehold house owners are often charged expensive ground rent as well as fees if they want to make changes to their homes.The report found that leaseholders paid an average of £277 per year in ground rent when they moved in, and are currently paying £319, with most having been in their properties for three or four years.It also said that freeholders typically charged home owners £1,422 to install double glazing, £887 to change the kitchen units, and £689 to replace the flooring.Some faced bills of £527 for changing their blinds and £411 for installing a new front door.As a result 94% of housebuyers regretted buying a leasehold while 62% felt they were mis-sold, according to the study.A leasehold house can also be difficult to sell. A third of those currently trying to move said they were struggling to attract a buyer because they do not own the freehold. Meanwhile a quarter said house-hunters who were interested were put off when they found out it was a leasehold home.Mark Hayward, chief executive of NAEA (National Association of Estate Agents) Propertymark, said: \"In most instances, the freehold is sold onto a third party within a few years of the initial sale. This means the terms in the contracts homeowners have signed will change, and any negotiations are made more difficult.\"Housebuilders started offering more and more new leasehold houses because it offered them an extra income stream either through ground rent or from selling on the leases to investment companies.Many of the leases included onerous rising ground rents that have now been outlawed. Last year, Taylor Wimpey, one of the UK's biggest housebuilders,was forced to set aside £130m <https:\/\/www.bbc.co.uk\/news\/business-39732174>to compensate home buyers because of the scandal.Last December, a government crackdown put a stop to the sale of new leasehold houses <https:\/\/www.bbc.co.uk\/news\/business-42439155> in England.And in June, the Secretary of State for Housing, James Brokenshire, announced that housing developers would no longer be able to use any new government funding schemes for unjustified new leasehold houses.Mr Hayward called on the government to ensure that leasehold homeowners were treated transparently and fairly in the future.He said: \"Almost all of the homeowners we surveyed say they wouldn't advise their friends or family to buy a leasehold home, which is a damning indictment on the industry. It's time we listened to this and sought a robust solution for all those affected, unable to sell their homes, and serving a leasehold life sentence.\"He reckons buyers of new-build homes should have access to an ombudsman scheme and that freeholders of leasehold properties should be required to sign up to a redress scheme.A Ministry of Housing, Communities and Local Government spokesman said it was \"unacceptable for home buyers to be exploited through unfair and abusive practices within the leasehold system\".\"This is why we have already announced measures that include a ban on leaseholds for almost all new-build houses and restricting ground rents to a peppercorn.\"He said the government was also working with the Law Commission to support existing leaseholders to make buying a freehold or extending a lease \"faster, fairer and cheaper\".A spokesman for the Home Builders Federation said: \"The vast majority of new-build houses are sold on a freehold basis, but it can be necessary on occasion to sell new houses with leases. As such, leasehold is a well-established and secure tenure with which to own a home.\"In all transactions, builders strive to provide prospective purchasers, their solicitors and their mortgage lenders with all relevant information.\"Purchasers are always advised to engage their own legal advice during the purchase of a home.\"Someone who owns a property outright, including the land it is built on, is a freeholder.Most houses are freehold but some might be leasehold - usually through shared-ownership schemes.With a leasehold, the person owns a lease which gives them the right to use the property.But they still have to get their landlord's permission for any work or changes to their homes. on the flat as it is still their property.Leaseholders have to pay their freeholders ground rent plus other fees in order to make changes to their homes.Non-payment of fees will mean a landlord can apply seek to forfeit the lease at any point.When the lease ends, the property returns to the freeholder unless the person can extend the lease.Some leaseholders wish to buy their freeholds to save themselves these costs.Source: The Money Advice Service\/Leasehold Knowledge Partnership"}