{"author":"By Richard Haugh","title":"Football kit redesigns highlight climate change","news_category":"general","content":"Football kits and badges have been redesigned to highlight how clubs could be affected by climate change in the near future.Kyle Harman-Turner, from Climate Clubs, said he wanted to show how rising water levels could affect football grounds.Ipswich Town, Norwich City and Chelsea are the first to have their kits redesigned, with more to follow.\"Climate problems are the biggest challenge globally, and nothing rallies people like football,\" he said.Mr Harman-Turner, 37, said he set up Climate Clubs <https:\/\/climateclubs.co.uk\/> as a non-profit organisation to combine his two passions - football and sustainability.Flags featuring the repurposed club logos are on sale with profits going to \"organisations tackling climate change\", Climate Clubs said, but the redesigned football shirts are not for general sale.As well as highlighting the threat of flooding, the small collective have also redesigned Nottingham Forest's badge to show the threat of forest fires, and Brentford's crest to raise awareness of the loss of a number of bees.\"People think climate change is this faraway thing and you have these visions in your mind of polar bears on ice caps, but actually it's something that's very close to home,\" Mr Harman-Turner said.\"We have this big belief that football clubs are more influential than governments and we really believe that you can change culture, and the way people behave and think, through football.\"Mr Harman-Turner, who lives in Brockley in south-east London, said he believed football clubs could help lead the way in making fans aware of the issues around climate change, and get them involved in innovative ways.\"Manchester City have been collecting rainwater on the stadium roof and they're turning it into a matchday beer - that's the sort of thing that feels really interesting, and really powerful, as this subject matter can quite often be quite dry,\" he said.\"An example of something we're trying to do at the moment is a matchday programme that is printed on wildflower seed paper.\"So imagine going to a Brentford game and you buy a programme and you can take it home after and bury it in your garden or local community and it sprouts flowers to pollinate for the bees.\"Mr Harman-Turner hopes Climate Clubs will get to work directly with clubs and kit manufacturers in the future.He also has the goal of getting the campaign's reimagined club badges on the Match of the Day opening sequence.But in the meantime, Mr Harman-Turner said he hoped Climate Clubs could help start a conversation between clubs and fans on how to build a more sustainable future - with travel and food seen as two big areas for improvement.\"Lots of clubs are in fear of how they're going to communicate this, because obviously the nature of football, the nature of travelling, means that the clubs inherently feel like they're not sustainable,\" she said.\"But I think the big thing is we've got to move away from this idea of being perfect - none of us are perfect.\"I care passionately, but I'm not perfect. We need lots of people making changes imperfectly, not a few making perfect changes.\"Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}