{"author":"","title":"Olivia Pratt-Korbel: Murder-accused was the gunman, jury told","news_category":"general","content":"The man accused of killing nine-year-old Olivia Pratt-Korbel was trying to \"pull the wool\" over jurors' eyes, the prosecution in his trial has claimed.Thomas Cashman allegedly shot Olivia and injured her mother Cheryl after chasing a convicted drug dealer into their home in Liverpool on 22 August.David McLachlan KC, prosecuting, told the jury Mr Cashman was the gunman but he was \"not prepared to own it\".Mr Cashman, 34, denies all the charges at Manchester Crown Court. In his closing speech, Mr McLachlan said it was a \"case that shocked not simply a city not too far away from here but also a nation\".\"The news at the time made front page headlines across the country and this is a case which will live with you forever,\" he said.He told the jury of 10 men and two women it was not a trial based on sympathy or emotion.Mr McLachlan said: \"The straightforward conclusion, we submit, is the man in the dock, Thomas Cashman, is not the unluckiest man in the world with all these circumstances conspiring against him.\"He is not the victim of a woman trying to stitch him up for murder.\"The man in the dock, we submit, is the gunman who shot Olivia and he is not prepared to own it,\" he said.He added: \"We say - but you will decide - that Thomas Cashman must think that you were all born yesterday.\"Fortunately you were not and every day you have come into this court you have brought something with you.\"That commodity you have brought with you every day is common sense.\"You know better than anyone when someone is trying to pull the wool over your eyes; that's what the prosecution say Thomas Cashman is trying to do.\"He claimed Mr Cashman tried to make his case fit the prosecution evidence.It is alleged that Mr Cashman was \"scoping\" out Joseph Nee, the intended target of the shooting, earlier in the day and after the attack fled to the home of a woman he had a fling with, where she heard him say he had \"done Joey\".But the defendant claimed his activities were due to his work as a \"high-level\" cannabis dealer and the witness, who cannot be named for legal reasons, was lying because she was a \"woman scorned\".Mr McLachlan described Mr Cashman's evidence as a \"dummy's guide to drug dealing in Dovecot\".During the prosecution closing speech, CCTV of the moment the shots were fired was shown to the court.Mr McLachlan said: \"The evidence will lead you to the truth.\"The prosecution say he's not prepared to own it, he never will be, but he knows what the truth is and, with respect, great respect, we respectfully submit that you do, too.\"John Cooper KC, defending, said: \"How can the Crown possibly say they put emotion to one side and keep telling you to put emotion to one side when they finished their speech with playing of the horrific CCTV footage, as if you, members of the jury, hadn't quite got it.\"Do you feel a little bit insulted by that?\"You get it, you get the tragedy, you get the brutality. Let's give you a bit of respect, you don't need it played four times.\"He accused the prosecution of \"Cinderella syndrome\", telling the jury: \"We'll force this evidence into a shoe that doesn't fit and we'll play the banging video again a couple of times.\"Mr Cashman, of Grenadier Drive, Liverpool, denies murdering Olivia, the attempted murder of Mr Nee, wounding with intent to do grievous bodily harm to Ms Korbel, and two counts of possession of a firearm with intent to endanger life.The trial continues. Why not follow BBC North West on Facebook <https:\/\/en-gb.facebook.com\/BBCNW\/>, Twitter <https:\/\/twitter.com\/BBCNWT> and Instagram <https:\/\/www.instagram.com\/bbcnorthwest\/>? You can also send story ideas to northwest.newsonline@bbc.co.uk <mailto:northwest.newsonline@bbc.co.uk>"}