{"author":"","title":"Cornwall dolphin photographed in 'magical' mid-air leap","news_category":"general","content":"A sealife safari group got an eye-popping close encounter with a dolphin as it breached next to the boat.The common dolphin leapt from the sea off Padstow in Cornwall and photographer George Cook got the amazing mid-air shot.Mr Cook, who had never photographed dolphins before, said the \"magical\" leap would stick with him for life.He was with a group of wildlife watchers when a pod of dolphins started leaping into the air.\"I first saw a couple of fins and a baby swimming under the boat,\" said wildlife worker Mr Cook, who was visiting the area from his home in Bristol on 3 June.\"There was a pod that was with us for about 45 minutes, they were so close, jumping out in front of the boat.\"Getting the shot was \"surreal\", he said.\"I was keeping expectations low, but this was spectacular, like they were putting on a show.\"I just feel so lucky to be able to share it with everyone,\" said Mr Cook who posted it on his Instagram page. <https:\/\/www.instagram.com\/p\/CP03HRSAgZD\/>The Padstow Sealife Safaris crew are used to seeing common dolphins, but they said on Instagram it wasthe best photo they had ever seen of a dolphin. <https:\/\/www.instagram.com\/p\/CP21cFXIxzf\/>The team have also spotted bottlenose dolphins.Safari guide Anna Jones said: \"The last time we saw them was in 2019, so it's been a real treat.\"It was Nathaniel Berry from the same team who snapped a walrus, dubbed Wally, in the area in May. <https:\/\/www.bbc.co.uk\/news\/uk-england-cornwall-57173225>Other sightings elsewhere in the region this year include killer whales off the west coast of Cornwall. <https:\/\/www.bbc.co.uk\/news\/uk-england-cornwall-57011389>Follow BBC News South West on Twitter <https:\/\/twitter.com\/BBCSpotlight>, Facebook <https:\/\/www.facebook.com\/bbcspotlight> and Instagram <https:\/\/instagram.com\/bbcspotlight>. Send your story ideas to spotlight@bbc.co.uk <mailto:spotlight@bbc.co.uk>."}