{"author":"By Lucy Hooker","title":"Banks: Is this a banking crisis - how worried should I be?","news_category":"general","content":"This video can not be playedIs this the start of a financial crisis?The news is full of emergency meetings, central banks offering credit lifelines and tumbling bank shares.No wonder people are asking: is this the start of another financial crisis?Politicians, including the UK prime minister, and central banks, say the situation is now stable. But banking shares have continued to fluctuate.So how bad is this and what does it mean for you?Credit Suisse is being taken over by UBS. Both are giant Swiss banks, but their investment banking arms operate all over the world.Swiss banking has the ultimate reputation for financial stability, so the slide into uncertainty for Credit Suisse, and the shotgun marriage to UBS, have left the Swiss rather dazed.Two US banks had already gone under this month - Silicon Valley Bank and Signature Bank - both catering largely to the tech sector. While those are the biggest bank failures in the US since 2008, neither was anywhere near the size of Credit Suisse.No other banks have collapsed, but central banks were worried enough to announce new measures to make extra cash available to make sure financial transactions continue as normal.That is the kind of action that was taken during the financial crisis in 2008 and at the start of the pandemic, designed to shore up confidence and make sure banks can still make loans and pay out to customers who want to take their money out.The Bank of England admitted it had been watching closely as Credit Suisse's fate was determined in a marathon meeting over the weekend, but said there was no reason to worry about a knock-on effect on UK banks.The UK banking system was \"well capitalised and funded, and remains safe and sound\" it said.Both UBS and Credit Suisse have London operations, managing money for wealthy clients and advising on mergers and investments and there may be some job losses where the two banks' businesses overlap.Bank shares have certainly had a wobble over the past week, as confidence was shaken.But there is no reason to expect any further direct impact on UK banks, from either Credit Suisse's demise, or the collapse of the smaller US lenders.Credit Suisse had problems all of its own - missteps over risk management going back years, scandals it was caught up in, including money laundering, and last year it reported a heavy loss.But it found itself in a sudden downward spiral last week, despite a $50bn (£41bn) emergency lifeline from the Swiss National Bank, and its customers began shifting their funds to other banks.The US bank casualties faced different challenges. Signature took a hit from recent big falls in the value of cryptocurrencies, and both found their balance sheets weren't robust enough to cope, when depositors rushed to take their money out.But there is a common factor affecting all three and the banking sector more broadly: sharply rising interest rates.Central banks around the world have been raising the cost of borrowing to try to dampen down rising prices. After years of very low interest rates, that has come as a shock.Banks holding government bonds, that go down in value when interest rates rise, have suddenly found their assets are worth less.That has affected the whole banking sector, but smaller banks are more vulnerable.Wall Street's biggest banks organised a whip-round to bail out another tech-focused bank, San Francisco-based First Republic. And the Federal Reserve, the US central bank, said there had been a surge in emergency lending to US banks generally.Ordinary people have little reason to fear for their funds. In the highly unlikely scenario that a bank or building society actually collapses, then deposit protection is in place.In the UK, that means £85,000 per person, per institution is protected (or £170,000 in a joint account). So, if you have £85,000 in one bank, and another £85,000 in a separately licensed bank, then it is all safe if both went bust, under the Financial Services Compensation Scheme. There is also a higher temporary limit of £1m for six months, if you get a sudden influx of funds, such as an inheritance.Protection is similar in the EU, and the US government has safeguarded deposits of up to $250,000 for a long time.There isn't the same system-wide problem that there was in 2008, when banks around the world suddenly found they were exposed to rotten investments in the US housing market.That led to enormous government bailouts and a global economic recession.Since then, banks have been ordered to hold more capital and regulations around risk have been tightened. So most experts believe the impact of these current troubles will be contained.Still, the world of banking is extremely complicated. It can be hard to identify where new fragilities might lie, until the system comes under pressure, as it did when Liz Truss's government surprised the markets with its new economic strategy in September, and as it is now with higher interest rates, and wavering confidence.Moreover, nervousness around the health of banks is often contagious. And if people start to worry about their deposits they can move them at the click of a mouse.Even if we don't see the total breakdown in trust that characterised the financial crisis, we could still see regulators toughening up the rules further and banks pulling back on their willingness to lend.That could put a chill on the global economy, at a time when it could do without it."}