{"author":"By Mattea Bubalo & Robin Levinson King","title":"What happened between Stormy Daniels and Donald Trump?","news_category":"general","content":"Former US President Donald Trump will be charged with a crime over allegations he covered up hush money payments to ex-porn actress Stormy Daniels.Ms Daniels claims she and Mr Trump had sex, and that she accepted $130,000 (£100,000) from his former lawyer before the 2016 election in exchange for her silence on the encounter.The lawyer, Michael Cohen, was later jailed on multiple charges.The former president has denied he had any sexual involvement with Ms Daniels since the allegations surfaced in 2018.Ms Daniels, whose real name is Stephanie Clifford, has said in media interviews that she met Mr Trump at a charity golf tournament in July 2006.She alleged the pair had sex once in his hotel room at Lake Tahoe, a resort area between California and Nevada. A lawyer for Mr Trump \"vehemently\" denied this at the time.\"He didn't seem worried about it. He was kind of arrogant,\" she said in response to an interviewer's question asking if Mr Trump had told her to keep quiet about their alleged night together.Mr Trump's wife at the time, Melania Trump, was not at the tournament and had just given birth.In 2016, days before the US presidential election, Ms Daniels said Mr Trump's lawyer Michael Cohen paid her $130,000 in \"hush money\" to keep her quiet about the affair.She said she took it because she was concerned for the safety of her family. Ms Daniels said she was legally and physically threatened to stay silent.In 2011, shortly after she agreed to give an interview to In Touch magazine about the alleged affair, she said an unknown man had approached her and her infant daughter in a Las Vegas car park and told her to \"leave Trump alone\".\"That's a beautiful little girl. It'd be a shame if something happened to her mom,\"she recalled him saying, in a 2018 interview with CBS's 60 Minutes. <https:\/\/www.cbsnews.com\/news\/stormy-daniels-describes-her-alleged-affair-with-donald-trump-60-minutes-interview\/>The interview with In Touch would not be published in full until 2018.Before the 60 Minutes episode aired, a shell company linked to Mr Cohen threatened Ms Daniels with a $20m lawsuit, arguing she had broken their non-disclosure deal (NDA), or \"hush agreement\".Ms Daniels told the CBS show she was risking a million-dollar fine by speaking on national television, but \"it was very important to me to be able to defend myself\".This video can not be playedStormy Daniels told CBS News 'I was threatened' in a 2018 interviewIt is not illegal to pay someone compensation in exchange for an NDA. But what has got Mr Trump into trouble is how Mr Cohen's reimbursement was recorded in his accounts. He is accused of falsifying his business records by saying the payment was for legal fees.The payment was also made a month before the presidential election, and Mr Trump's critics argued the money could amount to a campaign violation.In August 2018, Mr Cohen pleaded guilty to tax-evasion and breaking campaign finance rules, in part related to his payment to Ms Daniels and another alleged Trump lover.Although he initially said that Mr Trump had nothing to do with the payments, Mr Cohen later testified under oath that Mr Trump had directed him to make the hush payment of $130,000 days before the 2016 election.He also said the president reimbursed him for the payment. Mr Trump has acknowledged personally reimbursing the payment, which isn't illegal, but denied the affair and any wrongdoing regarding campaign laws.Mr Cohen was jailed on multiple counts after he pleaded guilty to violating laws during the 2016 presidential election.Earlier this year, New York City District Attorney Alvin Bragg set up a grand jury to investigate whether there was enough evidence to pursue a prosecution against the former president over the money paid to Ms Daniels.  A grand jury is held behind closed doors, and set up by a prosecutor to determine whether there is enough evidence to pursue charges in a case.On Thursday, that jury reportedly voted to bring criminal charges, making Mr Trump the first former US president to face them. It is not yet known what charges will be brought. On his social media network, Truth Social, Mr Trump called the investigation a political witch-hunt by a \"corrupt, depraved, and weaponised justice system\"."}