{"author":"","title":"Surge-hit Hemsby worried about winter","news_category":"general","content":"A village devastated by a tidal surge two years ago could face a similar disaster this winter, campaigners say.Several properties were washed away in Hemsby in Norfolk during storms on 5 December 2013.The campaign group Save Hemsby Coastline raised funds to pay for a trial sea defence, but it only covers a short stretch of coastline.Norfolk County Council said sea defences were not its responsibility.Ian Brennan, chairman of the group, said: \"This is their first real test, we haven't had any bad weather yet so we are just hoping it will work.\"We are worried about the winter. If we have another surge, we think the water would just go around the sides and the same thing would happen.\"We are very proud that the community made this happen but it shouldn't just be our problem, we need more help.\"Honeycombed-shaped concrete blocks were installed in June to cover a 361ft (110m) stretch of coastline. Residents raised £70,000 to pay for them and Norfolk County Council contributed £50,000.But villagers say another 1.5km of defences were needed, costing about £1.5m.Mr Brennan said a number of fundraising events were planned for next year to try to raise the funds.A spokeswoman for the council said it had no plans to provide any more money.\"Coastal defences are not our responsibility but we found the funding because we recognised that this was a big problem for residents,\" she said.The government rejected a bid <http:\/\/www.bbc.co.uk\/news\/uk-england-norfolk-28462990> from the village to pay for a more permanent defence earlier this year, saying there had been a \"very high demand\" for funding.Mr Brennan said the campaign group would apply again next year to the Coastal Communities Fund.The Department for the Environment said: \"Over the next six years we will invest over £1bn to manage coastal flooding and erosion.\"Through this funding, we will be better protecting 15,000 properties from coastal erosion.\"When homes are at immediate risk, we work closely with local authorities to help communities adapt to coastal change.\" An Environment Agency spokesman said it was spending £2.3bn over the next six years to protect 15,000 properties from coastal erosion, but it had not received an application for funding from Hemsby."}