{"author":"","title":"Hemsby cliff-top homes remain in 'precarious position'","news_category":"general","content":"This video can not be playedThe homes in Hemsby are \"teetering\" on the cliff edgeCliff-top homes in danger of collapsing into the sea off the Norfolk coast remain in a \"precarious position\", a council leader has said.Great Yarmouth Borough Council leader Graham Plant said it was \"too dangerous\" for residents of 13 chalets close to the cliff edge to return.The Coastguard said a shed and an oil tank fell into the sea at Hemsby as high winds and waves eroded the dunes.One homeowner said it felt like an \"earthquake\" as the cliff gave way.Mr Plant said the homes were being inspected after each high tide, but added it was unlikely residents could return home before Tuesday when he expected the weather to improve.\"It is a sad situation where people may lose their homes but the council will do its best to help residents,\" he said.The cliffs at Hemsby are made of sand which has suffered erosion over many years and the chalets are sited on privately-owned land.Coxswain of Hemsby Lifeboat, Daniel Hurd said a six-metre high (20ft) dune had been eroded in a 24-hour period.Chalet owner Stephen Chadwick said: \"I bought it for sea views, beautiful sea views, and now the sea's taking it away.\"Speaking on Saturday, he added: \"I woke up this morning, had a cup of coffee at half past seven, the back door, and I felt... it was like an earthquake, and the cliff just went.\"I'm just in total shock.\"Ten residents, forced to leave their chalets, spent Saturday night in a nearby hall, pub and holiday chalets.Paul Ray, who returned to his home early on Sunday, said he was \"devastated\" to find it was \"not safe to live there at all\".He had lived in the bungalow for eight years with his wife and two dogs.\"You can't go round the back; if you did you'd go straight on to the beach,\" he said.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Norfolk Police and Gorleston Coastguard have both warned members of the public to stay away from the area due to it being unsafe.\"Not only are you putting your own life at risk, but those that will have to rescue you when it goes wrong,\" a Coastguard spokesman said.The warning came after an individual was spotted taking a selfie near the sea edge where waves up to 3m (almost 10ft) high have been lashing the shore.\"With all this going on, the last thing you would expect to see is irresponsible people taking selfies,\" added the spokesman.During a tidal surge in 2013, seven homes were badly damaged, including three that fell into the sea <http:\/\/www.bbc.co.uk\/news\/uk-england-norfolk-25254808>. In 2014 villagers put in a £2.3m bid to the government for flood defences but failed to secure funding <http:\/\/www.bbc.co.uk\/news\/uk-england-norfolk-28462990> after being told by the Coastal Communities Fund that other applications \"offered us a stronger fit\".However, by June 2015 partial sea defences of honeycombed-shaped concrete blocks were put into the dunes after residents raised £70,000, with Norfolk County Council providing a further £50,000."}