{"author":"","title":"Buses in 'crisis' as 3,000 routes reduced or scrapped","news_category":"general","content":"More than 3,000 bus routes have been cut back or withdrawn in England and Wales in the past eight years, transport campaigners have said.Subsidies for buses fell by £20.5m in the past year, the Campaign for Better Transport (CBT) said.Council bus budgets had been cut by 45% since 2010, it claimed.The government said it provided £250m a year to support bus services and £1bn for free travel for disabled and older people.CBT public transport campaigner Steve Chambers said some 199 bus routes were altered or withdrawn last year amid the decline in funding.Mr Chambers said: \"Our latest report confirms that the slow death of the supported bus continues, with local authority bus budgets suffering yet another cut this year.\"Only when we treat what is happening to buses as a national crisis, rather than a local one, will we start to reverse their decline.\"Analysis of the figures showed spending by councils in south-west England fell by more than a quarter between 2016-17 and 2017-18 alone.Two thirds of councils reduced their spending or spent nothing at all on buses.Oxfordshire, Derby, Swindon and Wiltshire reduced their spending on buses to zero in that period, the CBT said.However, Wiltshire has allocated a budget for 2018-19 of £2,595,500.Across England, excluding London, councils spent £202.7m on subsidising buses in 2017-18. This was down from £222.9m the year before and £374.3m in 2010-11.Since 2010-11, 3,088 bus services in England and 259 in Wales have been \"reduced, altered or withdrawn\", CBT said.The BBC reported in February that Britain's bus network has shrunk <https:\/\/www.bbc.co.uk\/news\/uk-england-42749973> to levels last seen in the last 1980s.Most bus services England outside London are privatised since the deregulation of the industry in 1986.Councils provide funding to operators to keep running routes they would not be able to afford to run commercially. London services are operated by private companies but regulated by Transport for London.The loss of a bus service can have \"huge implications\" such as preventing people accessing jobs and education, increasing congestion due to a reliance on cars and affecting people's physical and mental health by making it harder for them to leave the home, researchers warned.Martin Tett, transport spokesman for the Local Government Association, said councils were \"desperate\" to protect bus services.He said: \"It's nearly impossible for councils to keep subsidising free travel while having to find billions of pounds worth of savings and protect other vital services like caring for the elderly and disabled, protecting children, filling potholes and collecting bins.\"Faced with significant funding pressures, many across the country are being forced into taking difficult decisions to scale back services and review subsidised routes.\"A Government spokeswoman said: \"We recognise that buses are vital in connecting people, homes and businesses, and that's why we have given local councils extra powers to work in partnership with bus companies to improve the services passengers expect and deserve.\""}