{"author":"By Reality Check team","title":"Tomato shortage: How far is Brexit to blame?","news_category":"general","content":"Some of the UK's biggest supermarkets are limiting sales of tomatoes and other salad items.The government says the shortages, which are expected to last for several weeks, have been \"predominantly caused by poor weather in Spain and North Africa where they are produced\".Others highlight the impact of high energy prices <https:\/\/www.bbc.co.uk\/news\/business-64718826> on UK growers, whether the government has done enough to help them and supermarket pricing.Lots of people on social media have also been posting pictures of empty shelves in the UK and contrasting them with plenty of fresh produce in supermarkets in Europe, claiming Brexit is a factor.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.So, what is the evidence for this?The European Commission (EC) told us that \"there is no particular situation of food shortage in EU agricultural markets\".The Spanish government did confirm that \"supplies in Spain are currently lower\".It said this was largely due to the weather: \"unusually high temperatures from the end of the summer period until December\"... followed by a \"sudden arrival of low temperatures in January... resulted in a drop in supply\".There have been some shortages in the Republic of Ireland, another European Union (EU) member, and Irish retailers have blamed freezing weather in Southern Europe and North Africa. But none are rationing fruit and vegetables.EU countries are in the single market - a giant, free-trade zone where countries share the same rules and regulations.This video can not be playedConfused by Brexit jargon? Reality Check unpacks the basics.The UK is no longer in the single market and now has a rule that every consignment of \"plant products\" - such as tomatoes - sent from the EU to the UK, requires customs declarations and pre-notification on the government's IT system.It produced a video <https:\/\/www.youtube.com\/watch?v=jq88Y4F6eiI> on how to do this, using an example of someone trying to import tomatoes.The government says the paperwork is not routinely checked but, from 2024, there will be further paperwork and checks.We spoke to MCE Logistics, a company which processes these forms for dozens of importers of Spanish tomatoes for British supermarkets.It told us it takes around 10-20 minutes to do this per lorry - longer if they are transporting mixed loads of vegetables - and they use specialised software.Guy Singh-Watson who runs the Riverford veg box company, and has farms in England and France,blames \"Brexit paperwork\" for the shortages <https:\/\/twitter.com\/geetiesingh\/status\/1629804200229052417>. Brexit represents \"a challenge for the entire Spanish fruit and vegetable sector\", according to the Spanish government.But it said the current tomato shortages in the UK were \"due to the weather reasons mentioned, and not to Brexit\".We asked the European Commission whether Brexit was a factor. It did not comment on this, but said \"food prices and trade flows are driven by market forces\".One person on social media highlighted the situation in the Netherlands <https:\/\/twitter.com\/LucyWoodslucy70\/status\/1628531606381117442>, another source of tomatoes for the UK.They quoted 'Daniel' saying: \"We have too many tomatoes! We used to export them to the UK but it now takes a truck driver 77 hours of queueing to take tomatoes to the UK and all truck drivers simply refuse.\"This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.We contacted the industry associations in the Netherlands as well as the haulage company pictured in the tweet.The company has not got back to us and the industry association said they were \"not aware of queuing at the ports in the Netherlands for goods leaving to or entering from the UK\".Ksenija Simovic, a senior policy adviser at Copa-Cogeca, a group which represents farmers and farming co-operatives in the EU, said when there is a shortage of supply \"it doesn't help that the UK is out of the EU and single market\".\"But I don't think this is the primary reason the UK is having shortages,\" Ms Simovic added.We asked the UK government if Brexit was a factor but it did not address this point.It said farming minister Mark Spencer had spoken to UK retailers and \"...asked them to look again at how they work with our farmers and how they buy fruit and vegetables\".Of all the tomatoes eaten in the UK - about 500,000 tonnes a year - UK growers produce a fifth <https:\/\/www.britishtomatoes.co.uk\/tomato-facts> or 100,000 tonnes.During the summer, this goes up to around half of all tomatoes bought.There have been shortages of seasonal farm workers, <https:\/\/committees.parliament.uk\/publications\/9580\/documents\/162177\/default\/> including in the glasshouses where tomatoes are grown, that have been blamed on Brexit and the pandemic.The government's Seasonal Workers visa scheme <https:\/\/www.gov.uk\/government\/publications\/workers-and-temporary-workers-guidance-for-sponsors-sponsor-a-seasonal-worker\/workers-and-temporary-workers-guidance-for-sponsors-sponsor-a-seasonal-worker-accessible-version#about-this-guidance> allows workers to stay for six months at a time. Before Brexit, they could come and go - from other EU countries - as part of freedom of movement rules. Now they come from countriesas far away as Nepal <https:\/\/www.bbc.co.uk\/news\/business-61603429>. Dr Sarah Schiffling, a supply chain expert from the Hanken School in Helsinki, told us the season for growing tomatoes in UK glasshouses is about nine months a year. A six-month visa means recruiting and training two sets of workers, adding to the paperwork and cost.In addition, visas are granted only if workers earn at least £10.10 for each hour worked <https:\/\/www.nfuonline.com\/updates-and-information\/seasonal-worker-scheme-wage-requirements\/> - 60p more than the currentNational Minimum Wage <https:\/\/assets.publishing.service.gov.uk\/government\/uploads\/system\/uploads\/attachment_data\/file\/1065743\/The_National_Minimum_Wage_in_2022.pdf>.Dr Schiffling said the difference in pricing strategies between UK and EU supermarkets was a factor in the current shortages.\"The EU supermarkets use 'spot rates' - when there are fewer tomatoes the price goes up, when there are lots then the price goes down.\"In contrast, she said, some UK supermarkets tie producers to longer-term, fixed-price contracts and \"that becomes an issue if the producers' costs rise rapidly, is it worth it for them to still supply those supermarkets?\".More than a third of tomatoes eaten in the UK currently come from Morocco. Growers there have been affected by unusually cold night-time temperatures that affected tomato ripening.Bad weather also led to the cancellations of ferries bringing supplies to the European mainland over the past three to four weeks.After Brexit, the UK signed a trade continuity agreement with Morocco  <https:\/\/www.gov.uk\/government\/publications\/continuing-the-uks-trade-relationship-with-morocco-parliamentary-report\/continuing-the-uks-trade-relationship-with-morocco-parliamentary-report>(replicating the trade deal the UK had with the country as an EU member).In March 2022, Poole Harbour announced a new direct service <https:\/\/www.phc.co.uk\/shipping-link-announced-between-poole-and-morocco\/> connecting the UK and Morocco would be launched \"shortly\".It said it would provide \"an alternative route for exporters from Morocco and Africa currently using road networks to the UK via Europe\". But the route has not been launched.We contacted officials at Poole but have not had a reply."}