{"author":"By Sam Francis","title":"Labour attacks Sir Gavin Williamson over teachers 'insult' in leaked texts","news_category":"general","content":"Gavin Williamson's claims teachers were looking for an \"excuse\" not to work during the pandemic are a \"kick in the teeth\" for the profession, says Labour.Leaked WhatsApp messages show the then-education secretary making the comments in May 2020, as classrooms weredue to reopen <https:\/\/www.bbc.co.uk\/news\/uk-52692017> after the first wave of Covid. Sir Gavin said his comments \"were about some unions and not teachers\".Downing Street said it did not agree, adding that the prime minister \"hugely values our hardworking teachers\".Rishi Sunak's spokesman praised them for doing \"so much during the pandemic to minimise disruption to children's education\".ButLabour's shadow education secretary Bridget Phillipson said Sir Gavin's comments were \"a kick in the teeth for teachers who stretched every sinew for children during the pandemic.\"They add insult to injury at a time when fewer people are joining the profession, and when teachers are leaving classrooms in their droves.\"The Conservatives have shown us today exactly how much they value our teachers.\"More than 100,000 messages sent between ministers and officials during the pandemic, have been passed to the Telegraph by journalist Isabel Oakeshott.A vocal critic of lockdowns, Ms Oakeshott obtained them while helping Mr Hancock, then then former health secretary, write his book, Pandemic Diaries.The journalist has said she broke a non-disclosure agreement to release the messages because they are \"in the public interest\".The BBC has not seen or independently verified the WhatsApp messages nor the context in which they were sent.Messages between Mr Hancock and Sir Gavin show them discussing a shortage of personal protective equipment (PPE) for schools.Sir Gavin said he wanted to make sure the PPE was provided so that schools \"can't use [the shortfall] as a reason not to open\" and that some would want to use it as \"an excuse to avoid having to teach\".Mr Hancock said it would be \"no problem\" to provide the PPE \"on that basis\". Teachers' unions had claimed the 1 June target for reopening schools in England was too soon to be safe.England was the first UK nation to reopen schools before a second wave of Covid infections hit in September 2020.A collection of more than 100,000 messages sent between former Health Secretary Matt Hancock and other ministers and officials at the height of the Covid-19 pandemic have been obtained by the Telegraph. Here are our stories on the leaks:That October, Sir Gavin announced that A-level exams would be delayed by several weeks, a shorter period than some teaching unions had called for.\"Cracking announcement today,\" wrote Mr Hancock to Sir Gavin. \"What a bunch of absolute arses the teaching unions are.\"Sir Gavin replied: \"I know they really really do just hate work.\"General secretary of the Association of School and College Leaders union, Geoff Barton, called the comments \"contemptible\".Mr Barton told the BBC: \"We have to remind ourselves that this was an age of extraordinary anxiety. We hadn't got vaccines.\"And the government was starting to look to the teaching profession to welcome those young people back into school. It was a huge debate going on, very snarky debate about whether face coverings should or shouldn't be worn.\"The very people who then brought those young people back into school are being described in those snide terms by the former education secretary.The \"brightest and best\" becoming teachers is less likely this morning because of that sneering denigration of the teaching profession,\" Mr Barton added.Lib Dem education spokeswoman Munira Wilson said Sir Gavin's comments cement \"his place in history as one of the worst ministers ever to grace government\" and he should apologise.Writing on Twitter following the publication of the texts, Sir Gavin said he wanted to \"clarify that these messages were about some unions and not teachers\".\"I have the utmost respect for teachers who work tirelessly to support students,\" he wrote. \"During the pandemic, teachers went above and beyond during very challenging times.\"Asked if it was concerned the WhatsApp messages could undermine the government's ability to reach a pay deal with teaching unions, the prime minister's spokesman said that was a \"separate issue\".He added: \"We are keen to speak to the school unions. We want them to come in and talk to us about pay. We do value the work they do.\""}