{"author":"","title":"Man Booker Prize: Daisy Johnson is youngest nominee","news_category":"general","content":"Daisy Johnson has become the youngest author ever shortlisted for the Man Booker Prize, at the age of 27.Four women and two men are shortlisted for the prestigious award, which recognises high quality literary fiction written in English.The other writers are Anna Burns, Esi Edugyan, Rachel Kushner, Richard Powers and Robin Robertson.Chair of judges Kwame Anthony Appiah said the shortlisted books were a \"miracle of stylistic invention\".He added that the \"language takes centre stage\".Here's the list in full:Synopsis: Set in the British countryside and centres on the complex relationship between Gretel and her mother, who abandoned her to foster care so she could make a fresh start with a new lover.Judges' comments: \"The twists and turns of the book's stories braid this together with European folk tales to create a strong narrative river that carries us to a conclusion laced with tantalising possibilities.\"Synopsis: A coming-of-age story about a young girl's affair with an older married man, set in a society that closely mirrors Troubles-era Belfast.Judges' comments: \"Simply marvellous; beginning with the distinctive and consistently realised voice of the funny, resilient, astute, plain-spoken, first-person protagonist.\"Synopsis: A friendship between an 11-year-old slave and an abolitionist inventor who together try to escape from Barbados on a quest for freedom.Judges' comments: \"Moments of horrifying cruelty and violence sit alongside episodes of great tenderness and deep connection. A majestic grandeur is achieved with the lightest touch.\"Synopsis: Convict Romy Hall begins two consecutive life sentences at Stanville Woman's Correctional Facility and is confronted with a new reality of institutional living from her previously chaotic life in the outside world.Judges' comments: \"A heartbreaking exploration of lives at the margins of society, mobilising fiercely inventive characters whose lives seem mostly to have been foredoomed.\"Synopsis: Nine unique strangers become summoned by trees and are brought together in a last stand to save the continents few remaining acres of forest.Judges' comments: \"Nine powerfully written, interlinked stories play out in the understory. Along the way there are stirring, lyrical paragraphs on love, photography, the culture of ancient China, game code, science, and maybe most impressively, faith, rendered without sanctimony or reprimand.\"Synopsis: Robertson combines poetry with narrative fiction to tell the story of a D-Day veteran suffering with PTSD, who tries to piece his life together in a nation divided by race and social class.Judges' comments: \"A lyrical tribute to the power of writing and image to convey, and somehow survive, historic and ongoing suffering and injustice.\"Snap by Belinda Bauer and Normal People by Sally Rooney were two prize favourites that didn't make it into the shortlist, to some people's surprise.There are not a lot of laughs in this year's shortlist. These are dark novels written, according to the judges, for dark times.So there are books about slavery, sectarian violence and climate change. And that is just for starters. Post-traumatic stress disorder, poverty and prisons also feature.Although Esi Edugyan has made the list for the second time, and Richard Powers is a prize-winning American novelist, yet again the judges have turned their backs on established literary figures in favour of newer voices.It is a huge achievement for Daisy Johnson to be shortlisted for her debut novel. Everything Under re-imagines the Oedipus myth in modern Britain.Robin Robertson is also an interesting choice. The Scot is the first poet to be shortlisted for the prize for his \"novel in verse\", The Long Take.Explaining the decision, the chair of the judges Kwame Anthony Appiah said: \"If a great poet tells stories, develop plots and makes you want to read further, then the poem is doing what the novel does. So it should be read alongside fiction in prose.\"He went on to say that each of the six books explores \"the anatomy of pain\". And that may not ultimately appeal to readers.This is a challenging list, with much to admire - but not necessarily much to love.Follow us on Facebook <https:\/\/www.facebook.com\/BBCEntsNews\/>, on Twitter @BBCNewsEnts <https:\/\/twitter.com\/BBCNewsEnts>, or on Instagram at bbcnewsents <https:\/\/www.instagram.com\/BBCNewsEnts\/>. If you have a story suggestion email entertainment.news@bbc.co.uk <mailto:entertainment.news@bbc.co.uk>."}