{"author":"By Monica Miller","title":"Taiwanese chip giant invests $40bn in US plant","news_category":"general","content":"Computer chip giant TSMC says it will more than triple its investment in a giant US plant to $40bn (£33bn).It is one of the largest foreign investments in American history.The announcement came as President Joe Biden and the Taiwan-based firm's boss opened the factory in Arizona.The Biden administration is pushing ahead with plans to bring onshore production of key components in everything from phones to military jets.TSMC is the world's largest maker of micro chips for other companies, with clients including Apple.Its Arizona plants will produce 3-nm and 4-nm chips used for iPhone processors. Semiconductors are sometimes referred to as the \"brains\" of electronics like smartphones, car components and AI technology.Mark Liu, TSMC's chairman, said the firm would build two semiconductor fabrication plants with the first one expected to be online by 2024. The overall investment will be approximately $40bn. It is the largest investment the company has made outside of Taiwan.The investment is a boost for Mr Biden following supply chain disruption that has led to chip shortages and amid growing tensions between the US and China.The original deal for TSMC to build a plant in the US came in 2020 when President Donald Trump was in office. The latest announcement vastly increases the size of that investment.\"Today, we're down to producing only around 10 percent of the world's chips, despite leading the world in research and design in new chip technologies,\" said Mr Biden during a speech in Phoenix on Tuesday.The US once made more than 30% of the world's computer chips before the jobs moved overseas, he said.\"The United States is better positioned than any other nation to lead the world economy in the years ahead if we keep our focus,\" he added.The opening ceremony was attended by several heads of technology companies that rely on TSMC production, such as Nvidia and Advanced Micro Devices.Apple's Chief Executive Tim Cook said it was a significant moment. \"We look forward to expanding this work in the years to come as TSMC forms new and deeper roots in America,\" he said.Analysts see TSMC's investment as a potential game changer in the industry.\"The TSMC investment is a significant step for US chip investment over the next decade,\" according to Wedbush analyst Dan Ives. \"This kicks off a legitimate battle between the US and China on chip production with this being a monumental strategic move by TSMC\".In August, President Biden signed a law committing $280bn (£232bn) to high tech manufacturing and scientific research amid fears that the US was losing its technological edge to China. The investments include tax breaks for companies that build computer chip manufacturing plants in the US.The move came at a time when relations between the two countries have soured. This has been fuelled by Beijing's claims over self-ruled Taiwan and its increasing assertiveness in Asia. Beijing sees Taiwan as a part of its territory that must be unified with the mainland, by force if necessary. Taiwan sees itself as distinct from the mainland.The US has responded by restricting access to advanced computer chip technology.That has hit China's export-driven economy which uses the technology to make and sell everything from phones to electric cars.This video can not be playedWatch: How the semiconductor shortage could be a problem for you"}