{"author":"","title":"North Korea's Kim Jong-un gets 'first official portrait'","news_category":"general","content":"North Korea has unveiled what's thought to be the first official painting of Kim Jong-un, lifting the leader to a new level of personality cult.While his predecessors' portraits are all across the country, Kim Jong-un has long been styled as a successor rather than a leader in his own right.His role has seen a gradual change over time though, very much helped by a string of international visits in 2018.The huge new picture was on display during a visit by Cuba's president.Nope. If you remember seeing pictures of Mr Kim then those would have been photographs, not paintings, or unofficial fan art.The new larger-than-life artwork shows him smiling, looking slightly to his left, while wearing a Western style suit and tie.\"That a painted portrait of Kim Jong-un has appeared in this style is a strong hint that the regime could be beginning to take steps to develop the Kim Jong-un personality cult,\" Oliver Hotham, managing editor with NK News, told the BBC.The style of the painting is so evocative of the ever-present portraits of the older Kims, that \"North Koreans will certainly understand the symbolism of this move\".Symbolism and imagery are all-important in North Korea: portraits of Kim Jong-un's father and grandfather portraits hang in every building in the country.Since assuming power in 2011, the current leader has been styled more like a successor and disciple of his two overbearing predecessors, rather than an equal yet.Kim Jong-un moved to the helm of the country rather abruptly when his father died unexpectedly in 2011.He was relatively inexperienced and had not yet been built up as a future leader.Over time though, his image has changed, explains Andray Abrahamian from the Griffith Asia Institute.\"The most important markers have included a raft of songs and cultural products celebrating Kim Jong-un and his family - referred to as the Paektu bloodline - reorganising the government so that a new institution is at its heart, and having a new strategic line, separate to his father's.\"While his father pursued a military-first agenda, Kim Jong-un has pushed for a two-track policy to develop nuclear weapons as well as the economy.\"Everything that's happened in 2018 has also worked to solidify his image,\" says Mr Hotham.\"Eight summit with foreign heads of state have been a delight for Pyongyang's propagandists, helping them paint the leader as an internationally respected statesmen on par with Xi Jinping and Donald Trump.\"So far it's only been on shown on TV during the state visit to Pyongyang of Cuban President Miguel Díaz-Cane.It's not yet clear how Pyongyang will handle the display in the future or whether it will make a regular appearances.For now, the painting will likely end up in tightly guarded storage, said Mr Abrahamian, to be rolled out only on special occasions.Whether it will indeed become a propaganda staple like the portraits of the father and grandfather remains to be seen."}