{"author":"","title":"Miliband: Too little done to integrate UK society","news_category":"general","content":"This video can not be playedEd Miliband: \"Often we were a bit optimistic about how integration would happen\"\"Too little\" has been done to integrate people who have settled in British society, Ed Miliband has said.The Labour leader called for more proficiency in the English language as part of his One Nation ideal.He also admitted Labour had made mistakes in tackling the \"realities of segregation\" in struggling communities.Ministers accused Mr Miliband of \"hollow\" words, saying Labour had failed to back coalition measures to tighten up immigration.The Labour leader said he was proud of \"multi-ethnic, diverse Britain\", but accepted people had anxieties about immigration.Among his proposals to improve integration is banning those without high proficiency in English from some public sector jobs that involve working closely with people, such as home helps.Mr Miliband also said that local authorities should cut their translation services if that would protect their budgets for language classes.His speech in south London came just days after the 2011 Census showed that fewer than half the people living in London are white British.The figures also showed that in 2011, 13% of England and Wales residents - 7.5 million out of a total population of 56.1 million - were born outside the UK.\"People of mixed race are among the fastest-growing group in the population of our country\", and this is \"a development with which our country is at ease\", Mr Miliband said.Mr Miliband - who spoke with pride of his own parents' history as Jewish refugees from the Holocaust - described his enthusiasm for ethnic diversity in the UK.\"We are stronger for it - and I love Britain for it. It gives us access to new ideas, new perspectives, new energies,\" he said.\"But at the same time we know there is anxiety about immigration and what it means for our culture. The answer is not to sweep it under the carpet.\"In part, that means rejecting the idea that people can \"live side by side in their own communities, respecting each other but living separate lives, protected from hatreds but never building a common bond - never learning to appreciate one another\", he explained.On his party's time in government, he said: \"The solutions seemed abstract but the problems were real. We talked about 'shared citizenship'.\"But we did too little to tackle the realities of segregation in communities that were struggling to cope.\"He criticised cuts to English language teaching despite a rising proportion of children who are non-native speakers.\"If we are going to build One Nation, we need to start with everyone in Britain knowing how to speak English. We should expect that of people that come here,\" he said.Labour plans to prioritise spending on English language teaching for recent immigrants over non-essential written translation materials.Under the proposals, parents will be required to take responsibility for their foreign-born children learning English at home, and being able to speak English will be made mandatory in a greater number of public sector jobs.A ban on recruitment agencies advertising only for workers from particular countries will help to end segregation in the workplace, he said.\"There are some shifts in some factories that are still segregated by language and by background. And there are jobs which still recruit far more easily from within one community than from other,\" Mr Miliband said.The Labour leader said he wanted a \"comprehensive strategy for integration\" to bring the UK into line with other European countries.This video can not be playedSadiq Khan: We need a positive strategyMark Harper, minister for immigration, said the speech was a \"big apology\" for Labour's failure to tackle immigration while in governmentHe told BBC News: \"All of these people that were allowed to come to the United Kingdom not able to speak English came here while Ed Miliband was in government.\"We've made changes so that people who come here to study, to work and to live have to be able to speak English because we know that unless you can speak English properly, you can't be integrated properly in the community.\"They failed to back any of those policies in practice.\"Nigel Farage, leader of the UK Independence Party, described Mr Miliband's comments as \"a bit rich and a bit late\" and accused him of failing to face up to future immigration from countries like Romania and Bulgaria.Sir Andrew Green of Migration Watch, a think tank which campaigns for tighter immigration controls, said Labour's proposals were \"pretty trivial\" in the face the \"enormous problem of integration\"."}