{"author":"","title":"George Floyd: Manchester mural defaced with racist slur","news_category":"general","content":"A Manchester mural paying tribute to George Floyd has had a \"sickening\" racist slur spray painted on it.The portrait, in the city's Stevenson Square, was painted by artist Akse P19 in memory of Mr Floyd, whodied after being arrested in the US in May. <https:\/\/www.bbc.co.uk\/news\/world-us-canada-52861726>The city's council said it would \"do everything we can to find out who committed this abhorrent crime\".CCTV footage is being reviewed by police in an attempt to identify the person who caused the damage.The defacement is believed to have happened overnight and was discovered by Greater Manchester Police officers on a routine patrol in the area earlier.A force spokesman said an investigation into the \"racially aggravated criminal damage\" had begun, but no arrests had been made.Akse P19, who has since repaired the mural, said he was \"disgusted\" by what had happened.\"I do not tolerate racism as I have suffered from it since childhood,\" he said.\"It just emphasises the need to carry on the fight against racism.\"Manchester City Council's deputy leader Nigel Murphy said it was \"utterly sickening that this type of behaviour exists in our society\".\"We will do everything we can to find out who committed this abhorrent crime,\" he added.\"Manchester is a place that celebrates our diversity and we will not tolerate hate in our city.\"Mr Floyd's death prompted Black Lives Matter protests across the world, including a rally in Manchester <https:\/\/www.bbc.co.uk\/news\/uk-england-manchester-52944944>.Local group Black Lives Matter Manchester said the graffiti was \"horrible\" and \"explicitly racist\", but added it would \"take a lot more than a few individuals with markers and spray cans to stop us standing on the side of justice\".Why not follow BBC North West on Facebook <https:\/\/en-gb.facebook.com\/BBCNW\/>, Twitter <https:\/\/twitter.com\/BBCNWT> and Instagram <https:\/\/www.instagram.com\/bbcnorthwest\/>? You can also send story ideas to northwest.newsonline@bbc.co.uk <mailto:northwest.newsonline@bbc.co.uk>"}