{"author":"","title":"Bloody Sunday victims should get 'substantial sum'","news_category":"general","content":"A \"very substantial sum\" should be paid to victims of Bloody Sunday for 38 years of state lies about the shootings, the High Court has heard.The comments were made by counsel for a man shot in the face by a soldier in Londonderry in 1972.Michael Quinn's case is one of three test cases selected for arguments on the level of damages to be paid.Thirteen people died after members of the Army's Parachute Regiment opened fire on civil rights demonstrators. <https:\/\/www.bbc.co.uk\/news\/10283900>A fourteenth person died later. In 2010, the Saville inquiry found that those killed or injured on Bloody Sunday were innocent. <https:\/\/www.bbc.co.uk\/news\/10319881>The then prime minister, David Cameron, issued a public apology for the actions of the soldiers, describing the killings as \"unjustified and unjustifiable\".Claims have been brought against the Ministry of Defence by those bereaved or wounded.With liability accepted, three test cases have been selected for arguments on the level of damages.On Monday, Mr Quinn, 63, recalled before the court how he felt an \"explosion\" of bone and blood when he was hit while trying to run for cover.The then schoolboy was so badly wounded he was given the Last Rites in hospital.Mr Quinn had gone to the Northern Ireland Civil Rights Association March with friends.When the army started firing, he fled from the Rossville Street area. He said he saw a soldier emerge from behind flats and look in his direction. \"He raised his rifle, put his hand in a pouch and pulled out a round,\" said Mr Quinn.He told the court he crawled and ran into Glenfada Park North in an attempt to take shelter.While there, he saw the body of Michael Kelly, who had been fatally wounded, being carried away.As others came into the area, warning that soldiers were coming, Mr Quinn then headed towards an alley.He said he made had just made it over a raised area when the bullet him. \"It felt like someone had given me a very hard punch to the face,\" he added. \"Just below my eye I could physically see droplets of blood and bone and skin exploding from my face.\"It felt like slow motion as it was happening, I could see also that someone else was falling beside me.\"I saw his head hit the pavement, he hadn't put out his arms to break the fall.\"The man was James Wray, another of those killed. Mr Quinn told the court he managed to stumble on until he was brought to a first aid post and then taken to Altnagelvin Hospital.He said the hospital was like something he had only previously seen in footage of medical units in a warzone.He added he was \"terrified\" when a priest was brought over to administer the Last Rites due to the extent of his injuries.Mr Quinn said he is reminded of Bloody Sunday every time he looks in the mirror.His counsel said he should not only receive compensation for his facial injuries but also aggravated and exemplary damages for being shot as a completely innocent boy.\"He had to flee through the streets of his own city with blood pouring from a horrible facial wound, and he had to endure the fear his wounds might be fatal or might blind him,\" Brian Fee QC said.\"The false accounts concocted by the defendant's soldiers then rubbed salt into his wounds when, instead of admitting that they had shot at fleeing civilians without any justification at all, they alleged they had only aimed shots at people with lethal weapons.\"They persisted in these lies for 38 years until their account was emphatically rejected by the Saville Report. \"The misconduct of the soldiers in Glenfada Park on Bloody Sunday, as determined by Saville, was wholly outrageous and, if anything, the maintenance of false allegations and accounts for such a duration thereafter constituted even greater misconduct.\"Counsel for the Ministry of Defence, David Ringland QC, told the court he had been in discussions with the plaintiffs' representatives for more than six years after Mr Cameron recommended payments to the Bloody Sunday victims.\"That process proved unfruitful,\" he said.Stressing how the defendant had not raised any argument over potential delay, he added: \"In each case the only issue for the court is the assessment of damages.\"The hearing continues. "}