{"author":"By Russia Editor Steve Rosenberg & Paul Kirby in London","title":"Russian whose daughter drew anti-war picture flees jail term","news_category":"general","content":"A Russian single father whose daughter was reported for drawing an anti-war picture has been given a two-year jail term for discrediting the army.But Alexei Moskalev, 53, was not in court in Yefremov for the verdict. The court press secretary said he had escaped house arrest.\"I don't know where he is,\" his lawyer Vladimir Biliyenko told the BBC.His daughter Masha, 13, was sent to a children's home in early March when the criminal case began.Moskalev was accused of repeatedly criticising the Russian army on social media and had appeared in court the day before.He is only the latest Russian to be given a jail term for discrediting the military, but his case 320km (200 miles) south of Moscow has attracted international attention because of the authorities' decision to remove his daughter from their home early in March.\"I'm in shock,\" Yefremov town councillor Olga Podolskaya said. \"A prison sentence for expressing your opinion is a terrible thing. A two-year jail term is a nightmare.\"\"When I heard that Alexei had gone on the run, that was the second shock. We hope that Alexei is OK and that nothing has happened to him.\"The family's problems began last April, she told the BBC, when Masha Moskaleva's school told the police that the girl had drawn a Ukrainian flag with the words \"Glory to Ukraine\", rockets and a Russian flag bearing the phrase \"No to war!\"Alexei Moskalev had contacted Ms Podolskaya last year to tell her about the pressure he and his daughter were coming under. Masha's mother does not live in the area and is estranged from the family.Moskalev was initially fined for a comment about the war made on a social media network last year. But after his flat was searched in December he was charged under the criminal code because he had already been convicted of a similar offence.He has been recognised as a political prisoner by human rights group Memorial, which has itself been banned by Russia's authorities.Moskalev was not allowed to communicate with the BBC during a visit to his building earlier this month. However, his lawyer said Moskalev was very worried that his daughter was not with him.Social services in Yefremov have officially been tasked with looking after the girl. The local Juvenile Affairs Commission had already taken legal action to restrict her father's parental rights. Last week he wasn't allowed to leave his house arrest to attend a preliminary hearing.Ahead of the verdict on Tuesday Vladimir Biliyenko visited the children's home where Masha has spent most of the month.The director told him that the girl had gone to a children's cooking festival and passed on two drawings she said Masha had done for her father, as well as a letter she had written him. Mr Biliyenko told Sotavision that Masha had written the words: \"Papa you're my hero.\"He later spread the drawings on a table in court. Although Moskalev had turned up the day before, court press secretary Olga Dyachuk said he had escaped house arrest overnight and should have been taken into custody after the verdict.\"To say I'm surprised would be an understatement,\" Mr Biliyenko told the BBC. \"I've never seen anything like it. No client of mine has ever gone missing like this. I don't know when he fled, or if he has.\""}