{"author":"By Catherine Evans","title":"Covid: Why is it getting harder to find a builder?","news_category":"general","content":"If you've moved house or are planning a renovation, you might have found your builder's diary is already pretty full.Demand in the housing market and for home improvements, driven by the pandemic, have led to a boom in the construction industry.But there aren't enough tradespeople to meet demand - and nearly 10,000 extra workers are needed in Wales.The Construction Industry Training Board (CITB) said apprenticeships offered people a promising career <https:\/\/www.bbc.co.uk\/news\/av\/uk-wales-56521774>.By 2025, Welsh construction firms will need to recruit 9,250 new workers just to meet demand, according to the findings of the Construction Skills Network, published on Wednesday.Charlotte Hale initially struggled to find a career after getting pregnant at a young age.She is now an apprentice painter and decorator alongside studying for a diploma at Cardiff and Vale College in Barry, Vale of Glamorgan.\"I'm hoping to get a role with a decorating company for a while once I complete my qualifications, and eventually branch out on my own,\" she said.\"I would like to take on apprentices of my own one day, so that I can pass on all of the knowledge that I have learned.\"Being on-site with her host company has been \"a big eye-opener,\" she said. \"I haven't just been painting walls, I've had the chance to do wood and steelwork too. It's been a really great experience.\"Rob Davies, the CITB's senior engagement manager for Wales, told BBC Radio Wales <https:\/\/www.bbc.co.uk\/sounds\/play\/live:bbc_radio_wales_fm> that recent research showed a \"rosy picture\" for the future of the industry.The amount of construction work in Wales is set to grow by 4.1% annually, on average, until the end of 2025, slightly below the UK average of 4.4%, with private housing the fastest growth area.Welsh construction will need an extra 1,850 workers per year to meet demand. Key trades needed in Wales include an extra 500 bricklayers and 350 electricians each year.Mr Davies said: \"We're looking for an increase in every trade because the industry is buoyant, it's good news.\"The construction industry has been a leading sector to take people out of Covid. It's good news for those people in it, but particularly really exciting for anyone looking for construction as an option as a career pathway.\"Mr Davies said young people should not be put off by outdated notions of what it is like to be a construction worker.\"We're concerned there's still that stereotype image of the industry that is long outdated and my motto is where the money is, you follow,\" he said.\"What we want to do is make it more attractive, make sure that young people are getting the information that they need and the knowledge they need so they get the information, advice and guidance.\"Clearly, careers in construction is going to be a good place to go for a young person if they fancy it.\"Ms Hale agreed more young people should look at getting a career in construction.\"If I could tell my younger self anything, it would be that you're never too old to take an apprenticeship and you're never too old to achieve your goals. I wish I had started 10 years ago,\" she said.According to the CITB, it takes between two and three years to train in the main trades.But it is trying to speed up the process by promoting more apprenticeships and setting up \"skills hubs\" across Wales.\"What we're trying to do is create pathways to make it easier for young people to get qualified,\" said Mr Davies.\"We're looking at the apprenticeship qualifications and saying 'well if you've done one or two years in college, you can top up with a one-year apprenticeship'.\"We're really excited about the future for people coming into the industry.\""}