{"author":"","title":"Southern Water: Illegal spills the fault of a 'small number' of staff","news_category":"general","content":"\"A small number of people\" who \"forced\" staff to do things they should not have were responsible for the illegal dumping of raw sewage by Southern Water, a committee of MPs has heard.Chief executive Ian McAulay told the Environmental Audit Select Committee: \"This is not how it should be done, it makes me angry to this day.\"The firm was fined £90m by a court <https:\/\/www.bbc.co.uk\/news\/uk-england-kent-57777935> after admitting 6,971 illegal spills.It had pumped billions of litres sewage into the sea between 2010 and 2015.It was dumped from 17 sites in Hampshire, Kent and West Sussex.The sewage discharges were discovered during an Environment Agency investigation after shellfish were found to be contaminated with E. coli.Mr McAulay was appointed in 2017, just as proceedings into Southern Water's illegal activity began, which he said \"was a shock\".The spills were deliberate, he told MPs, and the people behind them have been dismissed.He said he \"cannot truly explain\" their motives, and \"they were not making significant financial gain themselves.\"Mr McAulay said: \"It was a strange, almost gaming type approach from a small number of people, who then unduly influenced and forced other people to do things they should not have been doing.\"The Environment Agency inquiry found an \"institutionalised culture of cover-ups\", the committee heard.Investigators were prevented from entering water treatment works and documents were locked in cupboards.Mr McAulay told MPs that an instruction had been given to some members of staff, who were under duress, to not hand over documents when an inspection occurred.The \"rot\" had reached one level below himself, Mr McAulay told the committee, and one member of staff from that level had been dismissed.Since then, he said the firm has made \"significant change\" and there had been a \"transformation of culture\".The company has also introduced a programme for staff to raise issues anonymously.Follow BBC South East on Facebook <https:\/\/www.facebook.com\/BBCSE\/>, on Twitter <https:\/\/twitter.com\/bbcsoutheast>, and on Instagram <https:\/\/www.instagram.com\/bbcsoutheast\/>. Send your story ideas to southeasttoday@bbc.co.uk."}