{"author":"","title":"Hemsby: Two further homes likely to be demolished amid collapse fears","news_category":"general","content":"Two more homes at risk of toppling off crumbling cliffs onto a beach are likely to be demolished, a council said.The owners of the wooden properties in Hemsby, Norfolk, have already been gathering their belongings.Three other properties were demolished over the weekend <https:\/\/www.bbc.co.uk\/news\/uk-england-norfolk-64930989> and debris is being removed from those sites.People began leaving their chalets on The Marrams on Friday due to high tides and strong winds.The latest homeowners have been served Section 77 notices <https:\/\/www.legislation.gov.uk\/ukpga\/1984\/55\/section\/77> by Great Yarmouth Borough Council which state their properties are at risk and asks them to collect their belongings.Those whose homes are at risk had been offered alternative accommodation.This video can not be playedMandy Jephcote said she was left \"in bits\" watching her home being demolishedMandy Jephcote's home was the third to be demolished during the weekend.She said her ex-husband and three daughters helped her remove some furniture but her curtains, bed and some clothes had been left behind.Ms Jephcote, who bought her property four years ago, also lost a tin of possessions belonging to her mum and brother who had passed away.\"I felt physically sick and I haven't really been able to stop shaking since,\" she said.\"I knew I couldn't get everything out the house, they didn't give me enough time.\"She added: \"I'm grateful for what the council has done but I would've been more grateful if they saved my home and everyone else's home.\"The council previously said it understood people's frustrations at the time it took to put in sea defences, but there had been \"so much bureaucracy\".\"It's a real minefield of making sure that what local government and the authorities do is the correct line of procedure,\" said James Bensly, who represents the area on Great Yarmouth Borough Council.It was at Ms Jephcote's property where two chickens were rescued on Friday <https:\/\/www.bbc.co.uk\/news\/uk-england-norfolk-64924782>.She said she had been told by officials they would take care of the birds and put them in a sanctuary.The borough council said road closures remained in place and the beach was closed to the public for safety reasons.It said it was in contact with the landowners to seek their support in addressing the erosion challenges.The demolition work is taking place on the north side of Hemsby gap in the direction of Winterton-on-Sea. The gap is a break in the dunes used by the lifeboat crew to access the beach.Lance Martin, whose home is on the south side of the gap, wants to try to save his home by dragging it further inland, back from the cliff edge.He has been removing items that could be damaged in the move, including his bathtub.Mr Martin, who has lived there for almost six years, said he was determined to save his \"dream home\".He had been working to obtain planning permission over the last five years to be able to move his home.Council leader Carl Smith said the authority would try to assist Mr Martin in \"every way we can\".The Conservative leader said it was \"never expected\" for the north side of the gap to be \"hit how it was\".\"The problems have been to the south of The Marrams so it was a shock to us all what happened at the north and they were all in danger of falling over the cliffs.\"Once there is a danger of them falling over the cliffs, we have to act for safety reasons,\" he said.Lorna Bevan, founder of campaign group Save Hemsby Coastline, said she was \"livid\" that homes had to be pulled down.\"This could have been averted, there was no need for this to have happened this weekend,\" she said.\"We could have at least another 20m (60ft) of beach here, had people listened and had the government stepped in.\"Hemsby Lifeboat coxswain Daniel Hurd said on Monday: \"We are going to carry on helping the community affected.\"There's nothing worse than losing your home. My crew has been absolutely amazing - everybody has pulled together.\"About 1,900 tonnes of granite was expected to arrive on Wednesday, with Great Yarmouth Borough Council saying it was looking toprotect the cliff with rock defences <https:\/\/www.bbc.co.uk\/news\/uk-england-norfolk-64930989> to save road access to a number of other properties.The council said it was waiting for permission from the landowner to put the granite rocks on the beach.The Environment Agency said it worked closely with local authorities to tackle the threat of flooding and coastal change.It said about 2,000 new schemes were being created to manage coastal and flood risk nationally.In Norfolk, it said it was working to trial new schemes to support affected communities.Seven bungalows along The Marrams had to be demolished when the sandy cliffs were washed away in March 2018 <https:\/\/www.bbc.co.uk\/news\/uk-england-norfolk-43472150> and, in December 2013, the worst storm surge in decades destroyed seven homes.Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}