{"author":"By Nadine Yousif","title":"Confidence Man: Key revelations from new book on Donald Trump","news_category":"general","content":"This video can not be playedDonald Trump an enigma to people, says journalist Maggie HabermanFormer US President Donald Trump nearly fired his daughter and routinely flushed documents down the toilet.These explosive details and more are revealed in New York Times journalist Maggie Haberman's highly-anticipated book Confidence Man, which is released on Tuesday.The book follows Mr Trump from his time as a New York businessman to his life after the presidency. It draws from interviews with more than 200 sources, including former aides as well as three interviews with Mr Trump himself.The former president has attacked Haberman, writing on his social media platform that the book contains \"many made up stories with zero fact checking\".Here are eight of Confidence Man's biggest revelations:At a meeting with then Chief of Staff John Kelly and then White House counsel Don McGahn, Haberman writes that Mr Trump was close to tweeting that his daughter, Ivanka, and son-in-law Jared Kushner - both senior White House aides - were leaving their positions.He was stopped by Mr Kelly, who advised him to speak with Ivanka and Mr Kushner first before sending the tweet. Mr Trump never spoke with them, and they both remained White House aides until the end of his presidency.The book also reveals that Mr Trump frequently talked down on his son-in-law, and once commented that Mr Kushner \"sounds like a child\" after hearing a public speech he gave in 2017.Mr Trump has denied ever wanting to fire Ivanka and her husband. \"Pure fiction. Never even crossed my mind,\" he said.Haberman writes that Mr Trump raised the prospect of bombing Mexican drug labs several times - a suggestion that stunned former US Defence Secretary Mark Esper.The idea stemmed from a conversation that Mr Trump had with Brett Giroir, a public health officer and an admiral with the US Public Health Service Commissioned Corps.Mr Giroir walked into the Oval Office wearing a dress uniform - as is customary for public health officers in the corps - and said to Mr Trump that facilities producing illegal drugs in Mexico should be handled by putting \"a lead to target\" to stop illicit substances from coming over the border.Mistaking Mr Giroir for a military officer, Mr Trump then suggested bombing the drug facilities. In response, the White House asked Mr Giroir to stop wearing his uniform.When Mr Trump fell ill with Covid-19 in October 2020, his condition at the White House was worsening and he was fearful of dying.At one point, his deputy chief of staff, Tony Ornato, warned the president that if his health deteriorated further he would have to set in motion procedures to ensure the continuity of government.This fear existed despite several attempts by Mr Trump to minimize the pandemic, as he worried the virus was negatively impacting his image and political motivations. Haberman writes that he asked aides around him to take off their masks, and that he advised then New York governor Andrew Cuomo to not talk about the virus on TV.\"Don't make such a big deal out of this,\" Mr Trump said to Mr Cuomo, according to the book. \"You're going to make it a problem.\"Haberman's book details several encounters between Mr Trump and world leaders. For instance, in his first meeting with then UK Prime Minister Theresa May, Mr Trump spoke about abortion, saying \"some people are pro-life, some people are pro-choice. Imagine if some animals with tattoos raped your daughter and she got pregnant?\"He then changed the subject in a conversation on Northern Ireland to discuss how to block an offshore wind project from being set up near his property.When it became apparent that Mr Trump was losing the 2020 election to US President Joe Biden, he called former New York City mayor and his personal attorney Rudy Giuliani.\"Okay, Rudy, you're in charge. Go wild, do anything you want. I don't care,\" Mr Trump said, after other lawyers refused to go as far as he has requested in his bid to overturn the election results.\"My lawyers are terrible,\" he said to Mr Giuliani, according to the book. He also frequently berated White House counsel Pat Cipollone.The book reveals that at the time, Mr Trump was enamoured with conspiracy theories and sought out lawyers that his own advisers felt were deluded.On a plane while campaigning in 2016, Mr Trump was asked by his campaign manager Corey Lewandowski and his press secretary Hope Hicks to address his refusal to release his tax returns - an issue they saw as a problem for Mr Trump's White House bid.Haberman writes that Mr Trump responded by leaning back before snapping to a sudden thought: \"Well, you know my taxes are under audit, I always get audited,\" he said.\"So what I mean is, well I could just say, 'I'll release them when I'm no longer under audit. 'Cause I'll never not be under audit.\"Since Richard Nixon, every US president has voluntarily released their tax returns. A 2020 New York Times investigation has since revealed that Mr Trump paid $750 (£662) in federal income taxes the year he became president.When Mr Trump was in office, White House staff periodically discovered that the toilet was clogged with printed paper and believed he had flushed documents.He also allegedly tore up documents, which contravenes the Presidential Records Act - a law that says documents created or received by a president are the property of the US government and are to be handled by the US National Archives once the presidency ends.The details are revealed amid wider allegations of missing documents from Mr Trump's White House levelled by the National Archives. Mr Trump also faces a criminal investigation by the Department of Justice for keeping government records at his Mar-a-Lago estate in Florida after leaving office.At a congressional meeting shortly after his 2017 inauguration, Haberman writes that Mr Trump turned to a racially diverse group of Democratic staffers and asked them to fetch canapes, mistaking them for waiters.The book details that Mr Trump made the remarks to staffers for Senator Chuck Schumer and Representative Nancy Pelosi.Haberman also documents a history of homophobic remarks allegedly uttered by Mr Trump."}