{"author":"","title":"Birmingham Hippodrome full audiences 'like coming home'","news_category":"general","content":"Performing to a full theatre for the first time since the pandemic began was like \"coming home\", an actor has said.Nick Hayes stars in Priscilla Queen of the Desert at the Birmingham Hippodrome and said the cast had a \"huge sense of gratitude\" to be back on stage.The venue's Artistic Director Fiona Allan said there had been \"dark months\" since last March where \"we couldn't say see a way through this\".She said opening night on Monday was an \"extraordinary relief\".Mr Hayes said: \"Pre-pandemic we kind of went from job to job and you were just doing your show and it was hard work and you're getting on with it. But post-pandemic, there's just this huge sense of gratitude among the cast, everyone was just happy to be back in work.\"He did a lot of teaching via Zoom to earn an income and tried to access grants through charities and the Theatre Support fund.\"I think a lot of us hit a wall at some point during the pandemic and to come back now and be in a theatre in front of live audiences, it's like coming home.\"Fellow actor Kevin Yates took a job as a track-and-trace call handler to \"keep a roof\" over his head.He said the usual ups and downs of theatre meant, like many actors, he had been used to moving from a stage job to one in a completely different industry.He said it had built up a sense of \"resilience\", but despite that there had also been \"dark points\" over the last year \"when no one knew when theatre was coming back\".Stage technician Kieren Keogh was made redundant at the start of the pandemic after 15 years working at the Hippodrome. He secured a job with Amazon, which paid the bills, but he said it was \"really difficult not being in a theatre\".\"It was heart-breaking, I had to just go back to the the drawing board, so to speak, and start just searching through agencies for work.\"Mr Keogh said the theatre's reopening marked a turning point and he had the \"butterflies back again\".He has been one of the lucky ones to return. Ms Allan said it had been hard to see so many staff made redundant and it had also been tough on those left behind.She said the Hippodrome had been forced to recruit and train a lot of new people to fill the gaps when shows were allowed to restart.Follow BBC West Midlands on Facebook <https:\/\/www.facebook.com\/MidlandsBBC\/>, Twitter <https:\/\/twitter.com\/bbcmtd> and Instagram <https:\/\/www.instagram.com\/bbc_midlands\/?hl=en>. Send your story ideas to: newsonline.westmidlands@bbc.co.uk <mailto:newsonline.westmidlands@bbc.co.uk>"}