{"author":"By Alex Therrien","title":"Gene-editing hope for muscular dystrophy","news_category":"general","content":"Scientists have for the first time used gene-editing to treat Duchenne muscular dystrophy in a large mammal, a significant step towards effective treatment for people with the disorder.The condition, which has no cure, leads to loss of muscle function and strength and ultimately an early death.But in a study on dogs, scientists were able to partially restore the key protein people with DMD cannot make.They hope in the future to test the technique in people.Duchenne muscular dystrophy (DMD) is the most common fatal genetic disease in children and almost entirely affects boys and young men - about 2,500 of them in the UK have the condition.Children born with the degenerative disease have a genetic mutation that stops them producing dystrophin, a protein that is vital for muscle strength and function.The same disorder also occurs in many dog breeds.Using the Crispr gene-editing tool, scientists were able to restore dystrophin in four dogs that had the most common genetic mutation seen in DMD patients, by making a single strategic cut in the faulty DNA.This was done by injecting the dogs, who were one month old, with two harmless viruses that edited the genome of the dog in the cells of the muscles and heart.Within several weeks of the edit made in the dogs, the missing protein was restored in muscle tissue throughout the body, including a 92% correction in the heart and 58% in the diaphragm, the main muscle needed for breathing,according to the study in the journal Science <http:\/\/www.sciencemag.org\/>.Scientists have estimated that a 15% or greater improvement is needed to significantly help patients.The study was a collaboration between the Royal Veterinary College, in London, and the UT Southwestern Medical Center, in the US.Dr Eric Olson, one of the authors, from UT Southwestern, said: \"Children with DMD often die either because their heart loses the strength to pump or their diaphragm becomes too weak to breathe.\"This encouraging level of dystrophin expression would hopefully prevent that from happening.\"Richard Piercy, professor of comparative neuromuscular disease at the Royal Veterinary College, said: \"The ambition is to show that this is safe and effective in dogs and then move into humans trials.\"If that works, then the treatment could also apply to pet dogs that we see in our clinics - and that's what we hope for here at the college, as it's our goal to make animals better.\"Corrections of DMD mutations have been done in mice and human cells before. But this was the first time the technique was carried out in a large mammal.The proof-of-concept study raises hopes that Crispr can ultimately lead to more effective treatments for DMD.At the moment, few treatments are available for the condition, which causes a progressive loss of function in the body and eventually an early death, usually by patients' 20s or early 30s.The technique used in the study was for a genetic fault that affects about 13% of people with DMD. But experts say it could potentially be applied to the many other mutations those with the condition have.The lab will next conduct longer-term studies to measure whether the dystrophin levels remain stable and to ensure there are no adverse side-effects.Dr Olson hopes the next step beyond dogs is a clinical trial in humans.\"Our strategy is different from other therapeutic approaches for DMD because it edits the mutation that causes the disease and restores normal expression of the repaired dystrophin,\" said Dr Leonela Amoasii, lead author of the study.\"But we have more to do before we can use this clinically.\"Independent experts said the study was \"promising\" and might one day be seen as \"ground-breaking\" but pointed out that there were some limitations, including the small group of dogs used.And while dystrophin production was increased, what impact this might have had on improvements in muscle function was not measured.Nevertheless, experts said the findings were an important step towards the use of gene editing for DMD.Darren Griffin, professor of genetics at the University of Kent, said: \"This work represents a small, but very significant step towards the use of gene editing for DMD.\"Any steps towards significant treatment regimes can only be good news. In the fullness of time, this paper may well be seen as one of the ground-breaking studies that led the way to effective treatment.\"Dr Kate Adcock, director of research and innovation at the charity Muscular Dystrophy UK, said: \"The next step will be to conduct larger, longer-term studies to see if the gene editing approach does help to slow the progression of the condition and improve muscle strength.\"This won't be a cure - but that shouldn't obscure that this is a key step forward in proving the Crispr technology could work for Duchenne.\"Follow Alex on Twitter <https:\/\/twitter.com\/Al_Therrien>. "}