{"author":"By Hannah Richardson","title":"Teenage runaways lack safe places to go","news_category":"general","content":"Only a tiny fraction of the estimated 100,000 UK under-16s who run away yearly are given emergency shelter by councils, research suggests.Nearly two-thirds of the 210 English, Welsh and Scottish councils who responded to the Railway Children charity survey offered no under-16s accommodation in the past year.The research found just 157 children were offered this sort of support.Council leaders acknowledged a shortage of emergency accommodation.But only about half the local authorities kept figures on how many times such emergency accommodation was used, the study said.The research was prompted by growing concern about runaway children. It highlighted how all refuges but one for young children had closed by this year.\"Inconsistent use of local authority emergency accommodation was leaving young people without a safe place at the time they need it most,\" it said.Previous research by the Children's Society, cited by the report, suggested that of the 100,000 under-16s generally estimated by child protection organisations to run away each year, 18,000 end up sleeping rough.In-depth interviews with 62 people who work with runaways, defined as those away from home for four weeks or more, mirrored these findings. They suggested many children are ending up in strangers' houses or at the homes of friends or families.Many staff working with children said they were struggling to get social care assessments for the teenagers they support.They also said they were struggling to find safe places for young people to go because of cuts to services and high thresholds for intervention.This was particularly the case for suitable accommodation, counselling, mental health services and social care, they said.Under the Children's Act 1989, local councils have a duty to safeguard and promote the welfare of children. They should provide safe accommodation, usually emergency foster care, to children who run away and cannot return home.Bed-and-breakfast accommodation is not considered suitable for any child under the age of 18 even in an emergency.Police can take children into protective custody with the consent of their parents, or young people can stay in a refuge for 14 days without parental consent.Report author Jane Thompson, the charity's research and policy offer, said: \"Too many children who are at risk and in need of somewhere safe to go are not getting support when they most need it from local authorities.\"Child protection thresholds have continued to rise, making it harder for workers to intervene and protect children.\"She added: \"Risky situations can happen almost immediately. Who you are with is far more critical than how long you've been away.\"When a teenager has run out of favours and sleeping on a friend's sofa is no longer possible, ending up at the home of someone they barely know can happen very quickly.\"Behind closed doors, invisible to police and social workers, they often don't realise the risks until it's too late.\"A Local Government Association spokeswoman said the report laid bare the challenges that many councils are facing in finding emergency accommodation for vulnerable young people.\"Emergency accommodation is just one of a range of measures councils use, which include a strong emphasis on preventing homelessness occurring in the first place.\"Several councils are developing proposals for innovative work that will improve and expand the range of support available for vulnerable children.\"We must learn from this practice, to ensure that all children are given support through accommodation and care that is appropriate, safe, and tailored towards their individual needs.\""}