{"author":"By Jenny Rees","title":"Justice powers for Wales urged by commission","news_category":"general","content":"Wales should have full control of its justice system - with powers to run policing, prisons and appoint its own judges, says an independent commission.People in Wales are \"let down by the system in its current state\", it found.As well as switching funding, including for legal aid, it believes laws applying in Wales should be treated as being distinct from English law.That would mean devolving powers from the Ministry of Justice (MoJ), but it has poured cold water on the idea.The MoJ believes it would be too costly and lead to significant duplication.\"It is our belief that a single jurisdiction is the most effective way to deliver justice across England and Wales,\" said a spokesman.\"We welcome this important and thorough report and will review its content carefully.\"The commission has been chaired by Lord John Thomas of Cwmgiedd who, as former Lord Chief Justice, was once the most senior judge in England and Wales.Over nearly two years, it took dozens of submissions, held consultation events from Rhyl to Butetown, andhas produced 78 different recommendations. <https:\/\/gov.wales\/commission-justice-wales>It is set against a background of 20 years of devolution, with Welsh ministers creating 6,000 different regulations, while 41 acts have been passed by the Welsh assembly in the last seven years alone.But there is a long list of areas which Wales is not responsible for - when laid down in law, this runs to 44 pages - from policing to dangerous dogs.It is felt Wales needs parity with Scotland and Northern Ireland, as it grows, with the system as it stands now too complicated and inefficient.\"The way that responsibilities are split between Westminster and Cardiff has created pointless complexity, confusion and incoherence in justice and policing in Wales,\" said Lord Thomas.He said it was a long report and the MoJ were being quite fair and wanted to consider it.\"I'm sure when they look at the logic of it, think of the position of justice in society, the savings, what can be done in a small nation and how much better it could be, I very much hope the argument will win them round.\"The wide-ranging report says policies should reduce the number of people going to prison, with a greater emphasis on problem solving.But it also calls for sufficient funding to follow the powers, saying Wales has been significantly affected by UK government cuts, with the Welsh Government plugging almost 40% of the gap created.\"This position is unsustainable when the Welsh Government has so little say in justice policy and overall spending,\" says the commission.It is critical of the lack of accountability and how the system's complexity wastes resources.The nine-person commission - which includes lawyers, academics and a former chief constable - also criticises a failure to develop a coherent set of overall policies and the lack of innovation.Some key suggestions:Speakeasy Law Centre in Cardiff is increasingly reliant on charitable grants and donations for its work, providing free legal support for people who are struggling with debt or need help with appeals for benefit problems.Its legal aid funding has dropped from 70% to 20% of its income.\"It's difficult to provide a continuous and effective service,\" said solicitor Warren Palmer.But he said Cardiff was better placed than more rural parts of Wales.\"I'm hoping the commission recognises that investment in advice is worthwhile at an early stage because of the huge impact on mental health,\" he said. \"We can give reassurance when people receive a bailiff letter - that we can deal with it and stop matters escalating. There's also evidence that by not nipping it in the bud, it ends up costing more.\"The report also includes a damning assessment of the duplication and waste of resources with the number of boards and committees across Wales. It calls for mergers where appropriate - aware that its remit does not stretch to assessing the need for fewer local councils in Wales.Over the years, Wales has been developing policies to make change where it can. But in the complex devolved arrangement, that's created a messy picture. Spreading like a weed to fill in the gaps, the picture is tangled, overlapping and complex.The commission believes there is also much that could be done now to simplify that picture.It wants policing devolved - about a third of funding for Welsh forces currently comes from a Home Office grant - but believes the idea of a single Welsh police force should be one to consider in future.Immigration, national security, money laundering, firearms and misuse of drugs are not included - and are not devolved to Scotland or Northern Ireland either.A women's prison for Wales - the commission would like a commitment instead to a number of women's centres offering treatment, training and support as alternatives to custody."}