{"author":"By Andre Rhoden-Paul & Steven McIntosh","title":"Paul O'Grady: TV presenter and comedian dies aged 67","news_category":"general","content":"This video can not be playedWatch: Paul O'Grady's life on screenPresenter and comedian Paul O'Grady has died at the age of 67. He died \"unexpectedly but peacefully\" on Tuesday evening, his husband Andre Portasio said in a statement.O'Grady rose to fame in the 1990s with his drag queen persona Lily Savage, going on to present BBC One game show Blankety Blank and other light entertainment programmes.Later in his career, he went on to host a number of chat shows, and also brought his love of dogs to the screen.This video can not be playedWatch: Paul O'Grady speaks to Michael Parkinson about his alter ego Lily Savage (2002)\"It is with great sadness that I inform you that Paul has passed away unexpectedly but peacefully yesterday evening,\" Mr Portasio said.\"He will be greatly missed by his loved ones, friends, family, animals and all those who enjoyed his humour, wit and compassion.\"I know that he would want me to thank you for all the love you have shown him over the years.\"A statement released on behalf of Queen Consort, Camilla, she was \"deeply saddened to have learned of the death of Paul O'Grady, with whom she worked closely to support the work of Battersea Dogs & Cats Home and whose warm heart and infectious humour lit up the lives of so many\".A spokesperson said she will be \"sharing her sympathies with Paul's family privately in due course\".He had recently been on tour playing Miss Hannigan in the musical Annie.Writing on Instagram a few weeks ago, after returning from performing in Newcastle, O'Grady said he was \"thoroughly enjoying\" playing the role again after so long \"especially with a truly amazing and lovely cast\".The broadcaster left his weekly BBC Radio 2 show in August 2022 <https:\/\/www.bbc.co.uk\/news\/entertainment-arts-62543036>, confirming it was because he was unhappy about sharing his Sunday afternoon slot.He was due to present on Boom Radio in less than two weeks time for Easter Sunday.O'Grady's long-time radio producer Malcolm Prince said he had visited the star at his home on Tuesday afternoon, describing him as \"laughing, smiling, and full of life\".Mr Prince posted on Twitter: \"He was so proud of Annie, so happy to be back on Boom Radio, and he was looking forward to so many new projects.\"And now he's gone. I can't believe it. We have lost a unique talent - and I've lost a dear friend.\"Speaking on her BBC Radio 2 breakfast show on Wednesday, Zoe Ball said: \"We're all heavy of heart here this morning at the news of our dear friend Paul O'Grady. I know he was so loved by the Radio 2 listeners and all of us here.\"O'Grady was described as a \"really special man\" by ITV's Lorraine Kelly. <https:\/\/twitter.com\/reallorraine\/status\/1640908944913711104> \"Such sad news. Paul O'Grady - funny, fearless, brave, kind and wise,\" she tweeted. \"Will be sorely missed.\"Writing on Instagram, TV host Amanda Holden said O'Grady was \"strong, funny, opinionated, no-nonsense, brilliant\", while radio presenterSimon Mayo added <https:\/\/twitter.com\/simonmayo\/status\/1640949771400540160> he was \"a lovely man, always funny and a radio natural\".Singer and TV host Aled Jones described O'Grady <https:\/\/twitter.com\/realaled\/status\/1640931667127697409> as \"a lovely lovely person\", while presenterVernon Kay said <https:\/\/twitter.com\/vernonkay\/status\/1640949453895901188> he was \"one of the nicest and kindest people I've ever met, always a joy to be around and obviously, so much fun\".Danny Beard, winner of the fourth series of Ru Paul's Drag Race UK, told BBC Breakfast O'Grady was \"the most important person in British culture for drag\".Campaigner Peter Tatchell described the presenter as a \"much-admired campaigner for LGBT+ equality and animal rights\".Speaking on BBC Radio 4's Today programme, TV presenter Carol Vorderman said: \"He just fizzed, he was one of those people that just made you feel every part of you was alive.\"He exploded through the daft, made-up rules of society. He was a massive talent, but you can't forget he was a social worker when he was younger, he saved babies and young children from abuse, he lived in Soho before it was gentrified, he never judged the vulnerable, the weak, the misunderstood.\"One of O'Grady's most recent TV appearances was last year with Camilla, the Queen Consort, for a one-off episode of ITV's For The Love of Dogs - a series he helped launch in 2012, following the staff at Battersea Dogs and Cats Home, an organisation for which he was an ambassador.Following his death, the animal home remembered O'Grady as a \"devoted animal lover\" and a \"champion for the underdog\".Former BBC Radio 2 presenter Ken Bruce wrote <https:\/\/twitter.com\/RealKenBruce\/status\/1640961783195107328>: \"Such shocking sad news about Paul O'Grady. A unique and brilliant broadcaster who brightened the nation.\"Top Gear host Paddy McGuinness added <https:\/\/twitter.com\/PaddyMcGuinness\/status\/1640965616239509505>: \"Paul started in the pubs and working men's clubs but finished as an icon of British TV. I'll miss him very much. Rest in peace Paul.\"O'Grady was born in Birkenhead, on the Wirral, Merseyside, in 1955, to a mother whose maiden name was Savage - which is believed to have inspired his famous drag act.He began performing as Lily Savage in the 1970s. The drag queen later performed in a solo show that ran for eight years at London's Royal Vauxhall Tavern, and made a name by speaking out about LGBT issues.Later he hosted chat show The Lily Savage Show for BBC for a short run in 1997, before turning his hand to hosting a revived version of gameshow Blankety Blank, which remained on air until 2002.He later hosted teatime programme The Paul O'Grady Show on ITV from 2004 to 2005, before moving with it to Channel 4 from 2006 until 2009. It was later revived in 2013 on ITV and remained on air for two years.During 2013, the chat show was fronted by guest hosts <https:\/\/www.bbc.co.uk\/news\/entertainment-arts-25000088> after he suffered a health scare. He had previously had heart attacks in 2002 and 2006, the latter requiring a stay in intensive care.The broadcaster also took over the reins presenting Blind Date <https:\/\/www.bbc.co.uk\/news\/entertainment-arts-40258916> from close friend Cilla Black, during a 2017 reboot of the show on Channel 5.During his career O'Grady won a TV Bafta, British Comedy Award and a National Television Award for The Paul O'Grady Show.In 2008, he was made an MBE in the Queen's Birthday Honours for services to entertainment.The TV star had a daughter with his friend Diane Jansen in 1974. He later married a Portuguese lesbian in 1977 in a marriage of convenience and only legally divorced her in 2005.He married his husband at a ceremony in London in 2017. O'Grady, who lived in Aldington, near Ashford, was appointed one of Kent's deputy lieutenants <https:\/\/www.bbc.co.uk\/news\/uk-england-kent-63574946> in November. The role is responsible for representing the King at events in the area."}