{"author":"By Oliver Slow","title":"Ukraine war: Russian hoaxer called Poland's Duda over missile strike","news_category":"general","content":"Polish President Andrzej Duda spoke to a hoaxer posing as France's Emmanuel Macron on the night a missile hit a village near the Ukraine border.His office confirmed the call after two well-known Russian pranksters posted a recording of the caller asking Mr Duda who he thought was responsible.During the call Mr Duda said he was being \"extra careful\" and wanted to avoid war with Russia.He was targeted shortly after the missile killed two people on a farm.The 15 November strike came during one of the biggest Russian missile barrages on neighbouring Ukraine since the start of the war.Poland said initially that the missile that landed in Przewodow, 6km (4 miles) from the border, was Russian-made but later added there were no signs of an intentional attack. Nato Secretary General Jens Stoltenberg said it was \"most likely\" a Ukrainian air defence missile that landed in Poland.A week on, Russian pranksters Vovan and Lexus claimed credit for hoax-calling the Polish president, prompting his office to respond on social media.\"During the call, President Andrzej Duda realised from the unusual way the interlocutor conducted the conversation that there might have been an attempted hoax attempt and ended the conversation,\" it said, adding that an investigation was being conducted into how the callers managed to reach the president.It is the second time he has been targeted by the pranksters, who have made their names targeting politicians and celebrities, especially those opposed to the Kremlin. Two years ago they impersonated UN Secretary General António Guterres.Near the start of the prank call, President Duda said he had spoken with Mr Stoltenberg and US President Joe Biden, and was considering invoking Article 4, which calls for consultations in the face of a security threat of Nato members.The Macron impostor, who began speaking with a French accent that later changed to Russian, asked if President Biden believed Russia was responsible for the strike, to which the Polish President said \"no\".The prankster then asked Mr Duda if he thought Russia was responsible, to which he responded that he didn't know and that an investigation would be conducted.The caller appeared particularly interested in Mr Duda's thoughts on Ukrainian President Volodymyr Zelensky, and his insistence that Russia was responsible for the attack.Mr Duda refused to be drawn further on the Ukrainian president.\"Do you think I want to have war with Russia? Believe me, I don't want to have. I don't want to have war with Russia, and believe me I am extra careful, extra careful,\" he said. \"I'm talking only about Article 4, I don't talk about Article 5,\" he said, referring to the clause that says that an attack on one Nato member is an attack against all members.Eventually, as the caller continued to push Mr Duda on his thoughts on Mr Zelensky, the Polish president ended the call.Although the Kremlin insisted it had nothing to do with the missile deaths, Mr Stoltenberg said after the attack that \"Russia bears ultimate responsibility as it continues its illegal war against Ukraine\". He added: \"Let me be clear, this is not Ukraine's fault.\"Vovan and Lexus deny acting on behalf of the Kremlin but they receive uniformly positive coverage on Russian state TV. Their latest prank was given widespread coverage in Russian media.Three years ago they hoax-called President Macron, pretending to be the Ukrainian president.They have also pranked British singer Elton John, former UK Prime Minister Boris Johnson, and most recently UK Defence Secretary Ben Wallace, who was asked if he backed Ukraine's nuclear ambitions."}