{"author":"By David Lumb","title":"Practise and be humble: Making it as a pro-gamer","news_category":"general","content":"Jake Brown was eight when he discovered a passion for gaming - now 22, his hobby has seen him travel the world and get paid thousands in the process.Known as \"Sloth\", the pro-gamer plays team-based shooter Rainbow Six Siege.In February, Jake, from Shropshire, competed in the Six Invitational - a world championship in Canada where his then team, Heroic, won $55,000.\"There are a lot of instances where I'm like, 'how is this happening? My life is so weird',\" he said.Jake started playing Rainbow Six Siege on his computer about five years ago and his skills eventually caught the eye of German esports firm GamerLegion.As part of a team he began earning 100 euros a month, but after being signed to fellow German esports organisation Cowana, his earnings spiralled as his team shot up the leagues.Last year he was rated number one in Europe and third in the world, earning around 5,000 euros a month - but said he knows of players who are earning up to 20,000.\"When I when I got my first pay cheque in 2021 I didn't know what to do with the money,\" he said.\"I'd never seen that sort of money before in my life.\"He said his parents were initially sceptical but finally got on board when he started earning more money than them.Mum Nicky Brown said: \"I was one of the mums that was 'get off your game and get out into the real world'.\"There was a bit of tension with the amount of time he was playing in his bedroom on the game but it has proved me wrong.\"Over the past five years, Jake has amassed more than 10,000 playing hours - the equivalent of playing the game solidly for well over a year.In the run up to events, he trains for 12 hours a day, which Jake said had an impact on his social life.\"My social life was drastically affected by it. I definitely pushed away some friends. Even family. I was living with my mum but barely saw her,\" he said.But despite the drawbacks, there have been huge benefits, with Jake travelling to Norway, Germany and America to network and compete in competitions.Some events are watched by thousands in packed arenas and hundreds of thousands more online.But for all the glamour, it is also ruthless. Jake said players have no protection and can be released suddenly, while changes to league systems had made the situation even more volatile.Some games, Jake said, are switching from a meritocracy - where teams are able to rise up the leagues via promotions like he did - to an American model where the best teams play each other without jeopardy.Tenstar, based in Birmingham, recently folded as an esports team blaming that change among other economic challenges.The organisation employed five full-time and seven part-time players focusing on the games Rainbow Six Siege and Valorant.Tenstar spokesman Dominic Widdop said: \"Sponsors are not going to take a punt at the lower leagues anymore because the viewership is so low.\"It's a very turbulent environment. I know six or seven teams that have disbanded,\" he said.\"It reminds me of football academies where young players end up getting dropped and don't know where to turn. It's a lot like that.\"Jake is currently looking for a new team and is confident about being picked up.He has an IT qualification to fall back on, however, and aspirations to work in the police or fire service if his gaming career comes to an end.\"These days I am better at understanding my limits - when I need to be outside, see my family,\" he said.\"I am pretty easy going - if it does not work out, it does not work out,\" he added.\"I have achieved a lot I am proud of. I know what I am capable of.\"Follow BBC West Midlands on Facebook <https:\/\/www.facebook.com\/MidlandsBBC\/>, Twitter <https:\/\/twitter.com\/bbcmtd> and Instagram <https:\/\/www.instagram.com\/bbc_midlands\/?hl=en>. Send your story ideas to: newsonline.westmidlands@bbc.co.uk <mailto:newsonline.westmidlands@bbc.co.uk>"}