{"author":"By Galya Dimitrova","title":"Sobell House Hospice postcard art to raise funds for nurses","news_category":"general","content":"The family of a woman who died of bowel cancer have worked with the hospice where she was cared for to set up a community art project in her memory.Sobell House, based on the Churchill Hospital site in Oxford, has invited budding and professional artists to submit postcard-sized artworks.Beth Foreman died aged 32 in 2016. Her brother Guy said the family wanted to give back to those who helped her.The postcards will be sold via an art exhibition and auction.The project is in aid of Beth's Bursary Fund, which supports palliative care nurses with further training and education. To date the fund has raised almost £60,000.Ms Foreman grew up in Watlington and had a degree in fashion design.Mr Foreman said: \"It was obviously an incredibly painful and very difficult situation for us to cope with, particularly as it happened so quickly and she was so young.\"But the care at Sobell and the John Radcliffe Hospital was just fantastic. The nurses at Sobell in particular; it was their bedside manner and ability to empathise with Beth.\"He added: \"We wanted to help palliative care nurses to carry on their supportive and vital work, making people's last time much less painful, not just physically but emotionally.\"The initiative's name - My Lovely Postcards - was partly inspired by the term Ms Foreman's father Neil used for her - \"my lovely\".Family friend Veronica Brooks, who was also involved in setting up the project, described her as a \"lively, creative young woman\".The exhibition and online auction will take place at St John the Evangelist Arts on Iffley Road, Oxford, in the Cloister Gallery from 20 to 28 May.In the meantime here are some of the submissions that have been sent so far...Follow BBC South on Facebook <https:\/\/www.facebook.com\/BBCSouthNews\/>, Twitter <https:\/\/twitter.com\/bbcsouthnews>, or Instagram <https:\/\/www.instagram.com\/bbcsouthnews\/>. Send your story ideas to south.newsonline@bbc.co.uk <mailto:south.newsonline@bbc.co.uk>"}