{"author":"By Jasmine Andersson","title":"Pope could leave hospital in days after bronchitis","news_category":"general","content":"Pope Francis could be discharged from a Rome hospital \"in the coming days\" after he was admitted with a respiratory condition.The pontiff has seen a \"marked improvement in his health\" after he received antibiotics for a bronchitis infection, the Vatican said.The Pope spent the afternoon \"devoting himself to rest, prayer and some work\". He was admitted to Gemelli Hospital on Wednesday, for what was initially said to be a scheduled check-up.There he was then diagnosed with bronchitis, and given an antibiotic infusion, a statement from the Vatican said.\"Based on the expected progress [of his health], the Holy Father could be discharged in the coming days,\" the Vatican statement said, quoting his medical team.Earlier on Thursday, Vatican spokesman Matteo Bruni said the 86-year-old \"rested well during the night\".\"This morning after breakfast, he read some newspapers and resumed work,\" he said.He added that he then went to the chapel of the hospital, where he prayed and received the Eucharist.This is the busiest time of the year for Pope Francis <https:\/\/www.bbc.co.uk\/news\/world-65125655>, with many events and services scheduled ahead of Easter weekend.Palm Sunday Mass takes place this weekend, with Holy Week and Easter celebrations following next week.Italian news agency Ansa <https:\/\/www.ansa.it\/english\/news\/vatican\/2023\/03\/30\/pope-spends-peaceful-night-in-hospital_39b7696c-209a-460f-8c9a-3d2090401097.html> reported nurses were optimistic he would be out of hospital in time for Palm Sunday.The Argentine pontiff marked 10 years as head of the Catholic Church earlier this month. He has suffered a number of health issues throughout his life, including having part of one of his lungs removed at age 21.While keeping a busy schedule and travelling widely, he has for the past year used a wheelchair because of knee pain and admitted last summer he had to slow down."}