{"author":"","title":"Trump Kim summit: What did it actually achieve?","news_category":"general","content":"Now that the dust has settled on the Trump-Kim summit, it is worth taking a moment to assess what, if anything, was achieved. President Trump certainly does diplomacy differently.This was his event - in his view, his success - and as far as he is concerned, the North Korean nuclear problem is well on the way to resolution.But few of the best analysts of US policy towards the Koreas - or, indeed, of US security policy more generally - believe that Mr Trump emerged the winner.The prevailing view is that it was the North Korean leader Kim Jong-un who departed with more tangible gains.The real beneficiaries of the Singapore Summit may be Pyongyang and Beijing. Earlier this week, I caught up with Dr Sue Mi Terry, Senior Fellow for Korea at the Washington DC think tank, the Center for Strategic and International Studies.Speaking at London's International Institute for Strategic Studies, she had come to give her verdict on the summit outcome. She said that she had been left with \"no answers, only questions\".She began by talking about her efforts to put aside her own prejudices and scepticism.On frequent visits to South Korea before the summit, she kept on hearing optimistic predictions.Experts and officials insisted that Mr Kim was \"different\"; that he had an interest in the West; that he was set to rule for a long period of time and thus, once having completed his nuclear programme, might indeed be willing to take his country in a different direction.This video can not be playedTrump Kim summit: Win-win, or a Kim win?Dr Terry said she remained sceptical but was prepared to give this argument a chance, pending the outcome of the Kim-Trump meeting.But even set against her own \"low expectations\", she says she was \"floored\" by what actually emerged.She could not believe that after two visits by the US Secretary of State Mike Pompeo to Pyongyang and all the negotiations surrounding the on, off, on again' summit, the Trump team was able to emerge with quite so little.Indeed, she says that she thought that North Korea would give more, if for no other reason than to silence the sceptics and convince them that the 'Kim is different' narrative really held water.She was singularly unimpressed by the wording of the joint statement. \"Working towards denuclearisation\" is a weaker formula, she noted, than earlier disarmament commitments made by previous North Korean regimes.Dr Terry says that the North Korea leader emerged from this summit with his standing enhanced.Since January, Mr Kim has met the Chinese president twice; the South Korean president; the leadership of Singapore and, finally, the US president.To a large extent, she says, \"he has normalised himself\" and difficult issues like North Korea's extraordinarily bad human rights record have been set to one side.This video can not be playedWhy North Koreans were last to learn of the Trump-Kim summitAs well as bringing his country in from the diplomatic cold, Mr Kim received a free giveaway from President Trump, who unilaterally announced a halt to US-South Korean military exercises <https:\/\/www.bbc.co.uk\/news\/world-us-canada-44462628>.Mr Trump described them not just as too costly, but as \"provocative\" - the very term that is used by Pyongyang.The net result of all this, according to Dr Terry, is that despite Mr Trump's insistence that economic sanctions will not be relaxed soon, the political will to implement tough sanctions has been weakened. The thrust behind the \"maximum pressure\" approach has been dulled considerably.And whatever happens, it is hard to imagine President Trump going back to talk about preventive military strikes.Dr Terry believes that whatever Pyongyang may agree to it will avoid complete and verifiable nuclear disarmament. That of course does not mean that the process has no value.She notes - despite Mr Trump's assertions to the contrary - that it will take considerable time to be able to say that any deal is working. North Korea, in her view is playing for time, hoping to see out the Trump administration.Ultimately, North Korea wants to gain international acceptance of its status as a nuclear weapons state, Dr Terry believes.In her view, there should have been a clearer declaration from Pyongyang that it is committed to denuclearisation; it should have agreed to provide a full inventory of its weaponry and facilities; and it should have accepted that any deal would be fully verifiable.There should also have been, she says, a clear timeline signed up to by both parties.President Trump's decision to halt exercises with the South Korean military and to raise questions about the future of the US military presence there is another win for both Pyongyang and China.Dr Terry's fear is that Mr Trump just does not see a US troop presence in the South as that valuable.And if this is the case what of the US presence in Japan? Kori Schake, another former senior US official who is now the deputy director of the International Institute for Strategic Studies, noted that this tendency to devalue overseas US troop deployments has been a consistent theme of the president, even on the campaign trail.This video can not be playedTrump Kim summit: What happens now?Dr Schake stresses that in terms of the US debate, he is an outlier.She says the prevailing view in Washington remains that the US is better able to shape the international system in its own interests by having a set of relations with countries that share its values.Indeed, US bases and security guarantees can enable host governments to make \"braver\" decisions and she points to South Korea's record of political reform, she argues.Talking of South Korea, its president, Moon Jae-in was in many ways the midwife for this summit.So how has the outcome played out there?Dr Terry says that Seoul has really been driving this process, terrified by the Trump administration's talk of \"bloody nose\" or decapitating strikes against the North.South Korea she says will be alarmed by the unilateral suspension of joint exercises on which they were clearly never consulted.But she believes that their main goal is to keep the process moving forward and in any case they are likely to continue their own dialogue with the North.For all the summit's shortcomings though, most analysts clearly accept that the atmosphere has changed.Washington and Pyongyang have moved away from the rhetoric that appeared to be leading them inexorably towards war.For all intents and purposes Pyongyang's nuclear and missile testing seems to have been halted and joint US-South Korean exercises are suspended for the time being, again removing a source of tension that could spark renewed crisis.But is North Korea really on the path to change? Is it really willing to give up its nuclear weapons?This summit actually offered no answers either way.All of the hard work is still to be done. And North Korea's intentions remain as uncertain as ever."}