{"author":"","title":"Will the cap really fix the social care system?","news_category":"general","content":"Ministers have announced a hike in national insurance to invest more in health and care.As well as boosting NHS spending, the money will be used to pay for a cap on the costs people face if they need social care which includes help at home or a move into a care home.The plan for England sounds simple - from 2023 no-one will pay more than £86,000 for the care they need for daily tasks such as washing, dressing and eating.No longer will people rack up \"catastrophic\" costs, the government says. But as always the devil is in the detail. Much will depend on your individual circumstances, but there are a number of reasons it's not necessarily the silver bullet it may first appear.The cap on care is just that - a limit on how much you pay for care.There was no mention of it in the 33-page plan published <https:\/\/www.gov.uk\/government\/publications\/build-back-better-our-plan-for-health-and-social-care> - but the government confirmed to BBC News the daily living costs in a care home - those associated with food, energy bills and the accommodation - will not count towards the cap.The government has not said how much people should be prepared to contribute for these daily living costs - care homes do not usually itemise them.But previous incarnations of the cap - the coalition government first considered it - suggested people's contribution to these living costs should be fixed at £12,000 a year.That would mean when someone hits the cap they could still face £1,000 monthly bills for living costs.In many ways, this is understandable - after all, they would be liable for living costs if they remained in their own home.But it would mean - based on the average care home cost of £36,000 a year - only £24,000 of the spending counting towards the cap once those £12,000 living costs are taken off.That would mean it would take the average care home resident more than three and a half years to hit it.But the problem is not many people live that long once they move into a care home.Half die in little over a year, with three-quarters not making it past three years.Care you receive in your own home will count towards the cap. But this tends to cost much less and therefore people would normally need to be in receipt of that care for many, many years to hit the cap.What is more, spending on care will count towards the cap only for people assessed by the local council as in need enough to be eligible.Only the very frailest qualify.And more than half requests are turned down - with the County Councils Network predicting this will not change significantly with the changes announced.The only way to widen access would be spending more on services - it has been increasingly squeezed in recent years.But councils worry the money being raised by the National Insurance hike will be largely swallowed up covering the cost of the cap and funding the NHS - a warning that has also been reiterated by the Institute for Fiscal Studiesin its analysis <https:\/\/ifs.org.uk\/publications\/15599> of the tax rise.If these fears are realised, it would mean the system remains on its knees with insufficient staff to provide the care people need, council leaders are warning.And it is why, according to Natasha Curry, of the Nuffield Trust think tank, the changes risk leaving the public and care system \"short-changed\", despite the eye-catching announcements.Ministers may certainly be able to claim they are the first government in more than 20 years not to have dodged the issue - but fixing the problem is another matter.Follow Nick on Twitter <https:\/\/twitter.com\/nicktriggle>.Read more from Nick <http:\/\/www.bbc.co.uk\/nicktriggle>.Do you or a loved one require social care? How will the new tax affect you? Emailhaveyoursay@bbc.co.uk <mailto:haveyoursay@bbc.co.uk?subject=SocialCare58483036>.Please include a contact number if you are willing to speak to a BBC journalist. You can also get in touch in the following ways:If you are reading this page and can't see the form you will need to visit the mobile version of theBBC website <https:\/\/www.bbc.co.uk\/news\/have_your_say> to submit your question or comment or you can email us atHaveYourSay@bbc.co.uk <mailto:Haveyoursay@bbc.co.uk>. Please include your name, age and location with any submission."}