{"author":"By Ross McKee","title":"Mental health: Appeal over EU funding as cuts in NI loom","news_category":"general","content":"A Northern Ireland man who has hailed the benefits of a mental health charity says he is worried its services could be cut as EU funding in Northern Ireland ends.Ross Anderson was housebound for six years due to severe anxiety problems.He says that after six months with Action Mental Health it has given him \"a future that wasn't there\".The charity is concerned the end of European Social Funding will mean a \"significant reduction\" at 10 sites.\"I was at a point where I didn't leave my house for six years, had been through different mental health services and never had that bridge to get back into society,\" says Mr Anderson.\"Action Mental Health was the first place that I have felt that I have that foundation to get back into society.\"It has got me introduced into socialising again and having a structure and a timetable in my life.\"The idea of working was something that was not on my radar but now I am in a position where it is.\"Now I want to go on to mental health advocacy and through them I know that is a reality, it has just given me a future that wasn't there.\"While the UK government has set up UK Shared Prosperity Fund (UKSPF), promising to fill the void left by the removal of EU funds by 2024, there is still a great deal of uncertainty.The European Social Fund (ESF) had previously provided about £40m a year, to which the Stormont executive added another 35% of that figure, but that ends in March.The ESF Peer Group, an umbrella body for a number of groups, has been working to find an adequate funding package to replace the money.Its chairman the Reverend Andrew Irvine estimates that 800 of the 1,700 jobs funded by ESF could be lost in Northern Ireland by the end of March unless any shortfall is addressed.He says that is based on his assessment that £20m to £25m of the 2023-24 UK Shared Prosperity Fund for Northern Ireland of about £50m would be allocated to work previously funded by ESF.\"Groups are concerned that it's an open competition and they might not be successful and they realise that the pot of money available is only about 50% of what was available under ESF,\" he says.Mr Irvine says he is aware that about 250 staff working for organisations in the ESF Peer Group had already received redundancy notices.\"We are looking at a serious decimation of the community sector,\" he says.Grainne Close, director of the charity Mencap NI, says there is concern about the \"detrimental impact\" any funding shortfall was going to have.It would have a significant effect on people in Northern Ireland \"with a learning disability, their families and our communities\", she says.David Babington, chief executive of Action Mental Health, says that without adequate funding in the future \"the most vulnerable people in our society\" would feel abandoned.He also says a \"significant number of jobs are at risk\" at the charity's workforce of about 240.Carol McGoran has been helped by Action Mental Health's services and says its support staff were \"silent saviours\" during the coronavirus lockdown.\"During the Covid period, it wasn't long that I had joined - you were completely lost but you knew at the end of the line or on a Zoom you have a key worker to encourage you and help you through your worst times,\" she adds.She says it would be \"an extremely big mistake\" if those key workers were to lose their jobs.\"If the service wasn't there this place, Northern Ireland, would be in a terrible position.\"Michelle Bolton, service manager with Action Mental Health's New Horizons project in Lisburn, which Ross and Carol both attend, hopes funding concerns are addressed quickly for clients and staff.\"There's a real high need for this service in our area,\" she says.The UK government's Department for Levelling Up, Housing and Communities - which will oversee the replacement of EU funding - says the UK Shared Prosperity Fund \"will, at a minimum, match previous EU funding in Northern Ireland\".\"As EU projects come to an end, funding from UKSPF will increase, reaching over £50m for Northern Ireland in 2023-24 and £74m in 2024-25,\" it adds.If you've been affected by the issues raised in this article, help and support is availablethrough BBC Action Line <https:\/\/www.bbc.co.uk\/programmes\/articles\/2DRkg4JC7SLT3B7hlrn6DKN\/information-and-support-eating-disorders>."}