{"author":"","title":"Olympic Park reopens for public visits","news_category":"general","content":"The Olympic Park, off limits to the public since the end of the London 2012 Games, is reopening for short visits.So far, 20,000 tickets have been sold to people wanting to see the site in Stratford, east London, where Olympic and Paralympic medals were won and lost.The Park in Progress Tours will run on weekends and during school holidays from 29 March to 23 June.Visitors will have to wear hard-hats as the venue is a construction site.When completed it will reopen as the Queen Elizabeth Olympic Park, complete with housing, businesses, parklands and venues to stage sporting, entertainment and community events.Peter Tudor, London Legacy Development Corporation's (LLDC) venues director, said visitors would be \"intrigued\" with their first-look at the £550m transformation.With much of the site being under construction or stripped down, the visit involves a bird's-eye view from the ArcelorMittal Orbit tower which stands next to the Olympic Stadium.The stadium, velodrome and Copperbox venues are still on the park and getting ready for new uses, but the hockey and basketball arenas plus the world's biggest McDonald's are gone.Mr Tudor said: \"So many people want to see the park and to know why it is changing because they loved it so much when they were last here.\"Of course, when you take away the toilets, shops, the McDonald's and all the people, what you end up with is concrete.\"Part of the chance to visit is for people to understand that new things are coming but that it looks like this at the moment.\"Trees and shrubs are to be put in to make it into a greener space ahead of the eye-catching concerts and track events in the summer to help mark the first anniversary of the Games on 27 July.Adults will have to pay £15 while concessions for pensioners and students with NUS cards will cost £10.Tickets for children aged up to 17 will cost £7 while those under four go free. There are also special rates for groups of 10 or more."}