{"author":"","title":"Zoe Zaremba: Care failings led to autistic woman's suicide - inquest","news_category":"general","content":"An autistic woman took her own life following \"systemic failings\" in her care, a coroner has concluded.Zoe Zaremba, 25, was found dead near her home after being misdiagnosed with a personality disorder.An inquest heard she was discharged from hospital weeks earlier with no clear follow-up plan.North Yorkshire assistant coroner John Broadbridge said he would write to ministers and the NHS urging changes in autism care.Zoe's body was found in undergrowth in Aiskew, North Yorkshire, in June 2020.The inquest previously heard that, while under the care of the Tees Esk and Wear Valley NHS Trust, she had fought to have the incorrect diagnosis - a source of great distress - removed from her records.Over a four-year period from 2016, she was taken to A&E 37 times, mostly after taking an overdose, and in 2019 was sectioned under the Mental Health Act.Recording a conclusion of suicide, Mr Broadridge said the arrangements for Zoe's hospital discharge weeks before her death had been improvised \"for want of a coherent care plan\".In the coroner's view she had \"lurched from crisis to crisis\" and the lack of a care co-ordinator was a contributing factor in her death, he said.\"Her death was contributed to by actions and inactions by clinicians in a care system that was underdeveloped to manage an autistic individual with complex needs,\" he said.The coroner said Zoe's condition had not been properly understood at the health trust and while improvements were being made these were from a \"very low base.\"In 2022, he said, mental health services should be better attuned to people with autism.Mr Broadridge said he would write to health minister Gillian Keegan, NHS England and the North Yorkshire Clinical Commissioning Group to urge changes in the care of people with autism.He said he would pen a similar letter to the trust urging more structured care of autistic patients and a review of all personality disorder diagnoses.Ms Zaremba's mother Jean, had told the inquest in Northallerton: \"She cried out for help but she did not receive it. She had lost all hope.\"Giving evidence, witnesses from the trust said improvements were being made.Follow BBC Yorkshire on Facebook <https:\/\/www.facebook.com\/BBCYorkshire\/>, Twitter <https:\/\/twitter.com\/bbclooknorth> and Instagram <https:\/\/www.instagram.com\/bbcyorkshire\/>. Send your story ideas to yorkslincs.news@bbc.co.uk or send video here <https:\/\/www.bbc.co.uk\/send\/u49571818>."}