{"author":"","title":"LGBT: Wales' first non-binary mayor is 'used to abuse'","news_category":"general","content":"\"It has been difficult and it does get disheartening but strangely, not that it is ever OK, I have almost become used to it in a way.\"Owen Hurcum, 23, has become Wales' first openly non-binary mayor after they were chosen by fellow councillors on Bangor City Council in Gwynedd.Owen, who identifies as genderqueer or agender <https:\/\/www.bbc.co.uk\/programmes\/articles\/4hz0K7jCHRkjmDZXD92Rphv\/6-inspirational-stars-who-have-challenged-gender-norms>, is also understood to be Wales' youngest-ever mayor.They thanked fellow councillors for their support when facing online abuse.The independent councillor made headlines earlier in the year when they withdrew from Plaid Cymru after a transgender rights row <https:\/\/www.bbc.co.uk\/news\/uk-wales-56276997>.After the mayoral vote by fellow councillors, they tweeted they were \"beyond humbled\" to become the first openly non-binary mayor \"of any city anywhere\" after fearing coming out would mean they would be \"ostracized by my community or worse\".Speaking to BBC Radio Wales <https:\/\/www.bbc.co.uk\/sounds\/play\/live:bbc_radio_wales_fm>, Owen said it \"wasn't a huge shock\" when they were chosen to take up the reins, having served as a councillor for five years, including one as deputy mayor.But Owen said it was a shock when they were initially asked to put their name forward because fellow councillors felt they would be a good representative for the city.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Although Owen said Bangor might not be perceived as a hub of metropolitan tolerance, they said living there had allowed them to be true to their identity.\"And the council has been fantastic,\" they said.\"There was a trepidation because, obviously, local government has this unfair reputation of possibly being old and backwards, and I was worried that those views may come from fellow councillors.\"But I have had the exact opposite. Every single councillor has been extremely supportive, and the previous mayor has called me when he has seen that I have been getting hate online, and he has said he is there if I need him. It has been really nice.\"Despite being \"difficult\" and \"disheartening\", Owen said they found the stupidity of some of the abuse they received funny.\"They may say I have low testosterone or I am effeminate or I look like a woman,\" they explained.\"I am like, 'oh my God, you are trying to insult me by calling me feminine, even though I am explicitly telling you that I have feminine traits, that I want to celebrate because I am non-binary?'\"As I said, there is a fantastic team of councillors and friends who support me through that, and if I get hate comments, it is worth it when I get all the nice comments as well, or know that I have helped one individual person feel more comfortable in their own skin.\""}