{"author":"By Yogita Limaye","title":"Afghanistan: Parks become latest no-go areas for women in Kabul","news_category":"general","content":"Squeals of delight from young children fill the air as they enjoy the thrills of the Ferris wheel, bumper cars and a small rollercoaster at an amusement park in central Kabul.Their fathers sit on the rides with them, or look on, taking photos - rare moments of joy in Afghanistan where the news is often so bleak.But mothers are now denied the right to share in the memories the children here are making. Women are banned from visiting parks in Kabul by the hardline ruling Taliban.When we visit, dozens of members of the group are enjoying the rides. But the closest women, including us, can get to the park is a restaurant overlooking it. Women were also recently barred from swimming pools and gyms in the capital.It's expected the rules will be extended across the country. As the Taliban further limit what they can do, Afghan women and girls fear what could come next.Some say these moves don't affect most of the country, because for a majority of the people right now, an evening out is a luxury they cannot afford.For many Afghan girls, though, it's not about the scale of the impact, but the symbolism of the move - and what it reveals about the intent of the Taliban since they seized power in August 2021.\"Every day, as girls in Afghanistan, we wake up to new restrictions. It's like we are just sitting and waiting for the next one,\" one female student says. She's not being named to protect her.\"I was lucky I finished secondary school before the Taliban came. But I'm scared now that universities might also be closed for women. My dreams will be over.\"She recently took the university entrance exam and was disappointed to find that the subject she wanted to study - journalism - was no longer available for women, part of another set of restrictions the Taliban recently imposed.\"I can't describe how hard it is. Sometimes you feel like screaming loudly,\" the student says, frustration evident in her voice. \"I feel hopeless.\"With spaces for women shrinking in Afghanistan, some are trying to find ways to counter the Taliban's clampdown.Activist Laila Basim has co-founded a library for women. It has thousands of books in different languages on diverse subjects.\"With this we want to show the Taliban that Afghan women won't stay silent and our second goal is to expand the culture of reading books among women, particularly those girls who are deprived of education,\" she says.She's determined to raise her voice against the men running her country, and has participated in multiple protests since last year.\"We are not afraid of death or that the Taliban will threaten our families. What we are terrified of, is being omitted from society,\" she says.She sees the increasing restrictions on women as worrying and sad. \"It makes me so upset to think of all the freedoms we have lost. The people of other countries are exploring Mars, and here we are still fighting for such basic rights,\" she says.A few weeks ago, women's rights activist Zarifa Yaghoubi and three others were detained. Despite multiple calls for their release from the UN and others, there has been no response from the Taliban.Last week, 12 people including three women were flogged in front of thousands of onlookers at a football stadium in Afghanistan.With each move, the Taliban's current rule increasingly resembles their regime from the 1990s.\"The current policies of the Taliban are the same as 20 years ago. We're trying to tell them that's not acceptable in the 21st Century,\" says Laila Basim.A short drive from the library is the office of the Taliban's morality police, its vice and virtue ministry, another place where Afghan women aren't allowed.\"We have kept a box at the gate where women can drop their complaints. Our director goes to the gate to meet women out of respect for them,\" spokesman Mohammad Akif Muhajer says.He defends the decision to ban women from parks, saying Islamic Sharia law was not being followed.\"For 15 months we gave our sisters the opportunity to enjoy going to parks. We had told women to follow the practice of wearing the hijab [headscarf] but some were not doing that. We had separate days for men and women to go to the park but that was not being observed,\" he says.When asked why they were clamping down on those protesting for women's rights, Mohammad Akif Muhajer says: \"In every country anyone raising a voice against government orders is arrested. In some countries, they have even been killed.\"We have not done that. But naturally, if someone raises their voice against the national interest, they will be silenced.\"Their words and actions suggest a hardening of the Taliban's stance on women, and anyone critical of their policies. It challenges the more moderate image they have attempted to portray since they seized power last year.\"One day we might be told that women can't go out of their homes any more,\" the young female student said. \"Everything is possible in Afghanistan.\"Disappointment with the international community is also evident among Afghan women.\"The world has turned its back on us,\" Laila Basim says. \"Powerful people all over the world are supporting the women of Iran, but not those of Afghanistan.\"What happens to us doesn't even make front page news. We feel broken and forgotten.\""}