{"author":"","title":"E3 2021: Microsoft shows off Halo Infinite, Starfield and Forza Horizon 5","news_category":"general","content":"This video can not be playedWatch the BBC’s Marc Cieslak talks to Xbox chief Phil Spencer about what’s in storeA Christmas release date for Halo: Infinite was among dozens of announcements at Microsoft's E3 show.It was scheduled for release last year alongside the new Xbox, but was delayed due to the pandemic and amid outcry from players over its graphics.A new Forza racing game and the Xbox release of Flight Simulator were also among the 30 titles revealed.It was the first E3 since Microsoft acquired Bethesda last year for $7.5bn (£5.3bn).Unlike other developers' conferences, the 90-minute Microsoft show was nearly entirely back-to-back game trailers and announcements, with few speeches in-between.Bethesda boss Todd Howard started the event with news of a November 2022 release date for the firm's first new series in 25 years, Starfield.The space-faring game was shown only with some in-game footage of a ship taking off from the surface of another world - revealing no new details about what its gameplay would be like.Halo: Infinite was officially delayed due to the pandemic. But a preview released in July 2020 was widely criticised by fans of the game as looking unpolished, with enemy character models labelled as crude and reminiscent of older games, rather than a next-gen title. The developers pledged to work hard on improving them.Sunday's video showed off the series hero Master Chief meeting a new AI character, as the two discussed a mystery around the fate of Cortana, the game's other long-running protagonist.But it notably did not include the alien enemy models which caused so much controversy last year.Microsoft did, however, show off the game's multiplayer mode for the first time - the main attraction for many players.Sticking to plans to make the multiplayer part of the game a free-to-play package, not requiring a purchase of the main product, Microsoft said it would release it alongside the game for the Christmas shopping season.The company's flagship racing title, Forza Horizon 5, set in Mexico, was also revealed for the first time with a 9 November release date.Developers said parts of Mexico's real landscape had been faithfully recreated using photogrammetry data - the same type of 3D technique used by Microsoft's Flight Simulator to map realistic cities. But in Forza's case, it was used for geographic features such as the caldera of a volcano.A new game mode would allow players to create their own challenges - such as a \"bowling alley\" map where players drove through bowling pins and over ramps.Another impending release was the arrival of Flight Simulator for Xbox consoles on 27 July.The game was first released in August 2020 on PCs, and is notorious for pushing even high-end gaming computers to their limits.A new expansion was also shown off, tied to the Top Gun film series - which will bring official support for fighter-jet style planes for the first time. Previously, such planes have only been available through player mods or paid add-ons.Microsoft's surprise pandemic hit, the pirate-themed Sea of Thieves, is also getting an expansion featuring Pirates of the Caribbean characters - including Captain Jack Sparrow.Other titles announced included: Of the 30 titles unveiled, 27 are included in Xbox's subscription service, Game Pass.Piers Harding-Rolls, games analyst at Ampere, said that Microsoft's strategy was to grow the service to tens of millions of users by accepting a broad range of new games from third party developers.\"It needs to have a constant flow of fresh and appealing content in the pipeline,\" he said.\"Certain types of new games are particularly suited to Game Pass - generally those that benefit more from a ready-made audience compared to just competing with other premium releases in the store.\"Notably absent from Microsoft's show was any mention from Bethesda of the Elder Scrolls 6, the sequel to Skyrim announced at E3 2018.And in a nod to gamer jokes about the Xbox Series X's boxy upright aesthetic, the firm closed the show with the reveal of an Xbox-shaped mini-fridge which it said it would sell near the end of the year.Square Enix followed Microsoft, revealing its new Guardians of the Galaxy title which will be a single-player adventure game, and an expansion for The Avengers which will focus on the Black Panther character.Monday's conferences include Resident Evil maker Capcom.But Microsoft's lengthy showcase is arguably the biggest of the weekend - until Nintendo's 40-minute presentation on Tuesday."}