{"author":"","title":"Southend Hospital nurse quits over Twitter due to pressures","news_category":"general","content":"A NHS nurse who said he could no longer face going into work live-tweeted his resignation.Matt Osborne, a nurse in Southend-on-Sea in Essex, said he had seen an \"exodus of staff. I have seen colleagues commit suicide. I am done, and I am handing in my notice today\".He has been a nurse for 19 years and has worked in emergency care for 14.The trust for Southend University Hospital, where he works, said it had seen an increased number of nurses.The Royal College of Nursing said it was \"awful that people are leaving\" and \"we really need to see change\".Mr Osborne's tweet <https:\/\/twitter.com\/Matthew0sb0rne\/status\/1640931671204589569>, which tagged the Conservative Southend West MP Anna Firth, whose constituency covers the hospital, said he was \"anxiously\" waiting to go in for another emergency shift, and did not want to go in.\"Emergency department care is broken,\" he posted.The 42-year-old told BBC Essex <https:\/\/www.bbc.co.uk\/sounds\/play\/p0f70hh8>: \"No-one goes into healthcare to bad care but in the last decade, despite the best efforts of some amazing colleagues and the best efforts of NHS organisations, I've seen this gradual, almost inevitable, decline in what I'd like to think of as the quality of care and an increasing number of issues over nurse-to-patient ratios.\"Mr Osborne said, as a nurse, he saw patients \"on their best days [and] on the worst days of their lives, you welcome people into the world, you say goodbye to them as they leave\".But, he said: \"That has an emotional toll at the best of times, but obviously when you're then seeing people suffering because they're stuck in an emergency department for hours on end because there's no bed to admit them or they're stuck in a hospital bed because there is no available social care... it all builds up and and there's this constant pressure on a day-to-day basis.\"He praised NHS emergency care for how it dealt with those critically unwell, but he said he spent a lot of time apologising to people for not being able to deliver the \"service they deserve\".Mid and South Essex NHS Foundation Trust, which runs Southend University Hospital, however, said it had seen an increase in the number of nurses and had employed 3,000 new starters.Southend West MP Ms Firth said she was sorry to read an accident and emergency (A&E) staff member was leaving and the hospital was \"working exceptionally hard\" to alleviate the issues its A&E department has been facing.The hospital said it was expanding its A&E department after securing £8m in government funding <https:\/\/www.bbc.co.uk\/news\/uk-england-essex-64417247>.The Department of Health and Social Care said it was recruiting more NHS staff, with almost 11,100 more nurses across the country compared to a year ago.\"The health and wellbeing of staff is of paramount importance and the NHS is providing a package of mental health support,\" a department spokesperson said.\"We will soon publish a long-term workforce plan to support and grow the workforce and ease the pressures on healthcare staff.\"RCN members took strike action in January in a dispute over pay <https:\/\/www.bbc.co.uk\/news\/business-64258402>. A deal with ministers was reached in England earlier this month <https:\/\/www.bbc.co.uk\/news\/health-65001789>.Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk"}