{"author":"By Katie Silver","title":"China's trade practices come under fire","news_category":"general","content":"China's trade policies have come under strong criticism during a review at the World Trade Organization (WTO).The US accused China of \"skewing the playing field\" by using \"unfair trade practices\" such as preferential treatment for state businesses.Meanwhile Australia said the country's behaviour was \"inconsistent\" with its WTO commitments.China said it was committed to deepening reform and opening up its economy. WTO reviews are typically quite routine. Mandated in the organisation's agreements, the trade policies of member countries are examined and evaluated at regular intervals.For the biggest countries, such as China, this happens every two years. This December marks 20 years since China joined the WTO, but critics say the country's market reforms have been inadequate.At the WTO review in Geneva, Australia said China had benefited \"significantly\" since it joined the WTO, but argued it was not acting fairly.In the past 18 months, China has imposed restrictions on many Australian exports including barley, coal, sugar, wine and beef.\"China has increasingly tested global trade rules and norms by engaging in practices that are inconsistent with its WTO commitments,\" the Australian government said in a statement.\"By undermining agreed trade rules China also undermines the multilateral trading system on which all WTO members rely.\"Tensions between Australia and China have hit their lowest level in decades, in part triggered by Australia calling for an international inquiry into the origins of the coronavirus pandemic.The US was similarly critical. Charge d'affaires David Bisbee listed what he called China's \"unfair trade practices\" including preferential treatment for state enterprises, data restrictions, inadequate enforcement of intellectual property rights and cyber theft,\"We also cannot ignore reports of China's use of forced labour in several sectors,\" Mr Bisbee said, in an apparent reference to allegations of Uighurs being subjected to forced labour camps in Xinjiang.Trade sources told the Reuters news agency that Britain, Canada, the European Union and Japan have also called for reforms to make the world's second-largest economy more free and open.China's Commerce Minister, Wang Wentao, told the meeting: \"Since the last review, China has stayed committed to deepening reform, expanding, opening up and growing its open economy at a higher level.\"China has been reinforcing intellectual property protection by legislative, administrative and judicial means, and fulfilling its obligations on transparency.\""}