{"author":"","title":"The Kashmir Files: Row over Israeli filmmaker Nadav Lapid's comment","news_category":"general","content":"Israel's envoy to India has apologised for comments made by Israeli filmmaker Nadav Lapid on a controversial Bollywood film on Kashmir.Nadav Lapid, jury chief at the International Film Festival India (IFFI), criticised the inclusion of The Kashmir Files at the event.Describing the film as \"propaganda\", he said he was \"shocked\" that it was included in the competition category.A huge commercial hit, the film had sparked controversy during its release.Set during the exodus of Hindus from Indian-administered Kashmir in the 1990s, the film tells the fictional story of a university student who discovers his Kashmiri Hindu parents were killed by Islamist militants.In the 1990s, thousands of Kashmir Pandits - a minority group in the region - fled their homes during an armed insurgency against Indian rule which began in the late 1980s. Many who fled the Kashmir Valley never returned.After Mr Lapid's comments generated a huge backlash on social media, the IFFI jury board said <https:\/\/www.ndtv.com\/india-news\/the-kashmir-files-vivek-agnihotra-anupam-kher-iffi-nadav-lapid-the-kashmir-files-remark-jury-heads-personal-opinion-jury-board-3561641> his comments were \"completely his personal opinion\".Naor Gilon, Israel's ambassador to India, also criticised Mr Lapid in an open letter to the filmmaker. <https:\/\/twitter.com\/NaorGilon\/status\/1597421869845860356?s=20&t=27vDfZ5RjhHCrg8qm_UAmw>\"As a human being I feel ashamed and want to apologise to our hosts for the bad manner in which we repaid them for their generosity and friendship,\" he wrote.His statement on Twitter was shared by The Kashmir Files' lead actor Anupam Kher.Despite being a hit at the box-office, the film received middling reviews from critics when it released in March.The film also polarised opinions and set off a heated debate on social media, with supporters praising the film for shining a light on a neglected, bloody part of Kashmir's history. But critics called it \"exploitative\" and Islamophobic.IFFI, an annual film festival, is organised by the government-run National Film Development Corporation of India and the state authorities in Goa.At the closing ceremony of the festival on Monday, Mr Lapid praised \"the cinematic richness, the diversity and complexity\" of the films included in the competition category, and went on to criticise The Kashmir Files.\"That felt to us like a propaganda, vulgar movie, inappropriate for an artistic competitive section of such a prestigious film festival,\"The Indian Express <https:\/\/indianexpress.com\/article\/entertainment\/bollywood\/iffi-2022-jury-head-nadav-lapid-calls-the-kashmir-files-propaganda-vulgar-movie-8294866\/> quoted him as saying.Mr Lapid, whose film Synonyms won the Golden Bear award at the 2019 Berlin International Film Festival, said he felt \"comfortable\" sharing these feelings because \"the spirit we felt in the festival can surely accept a critical discussion which is essential for art and life\".On Tuesday, Mr Kher responded to the comment, saying <https:\/\/twitter.com\/ANI\/status\/1597430627250614273?s=20&t=V7BIZqh8eGAV6D_KcNVTCw>: \"May God give him wisdom so that he doesn't use the tragedy of thousands and lakhs [hundreds of thousands] of people from the stage to fulfil his agenda.\"In a tweet seemingly directed at Mr Lapid, the film's director Vivek Ranjan Agnihotrisaid <https:\/\/twitter.com\/vivekagnihotri\/status\/1597433568837279744?s=20&t=GcZjkVx_0YAOaDq58ZiPzA>: \"Truth is the most dangerous thing. It can make people lie.\"In an interview given later to Israeli news site, Ynet <https:\/\/www.ynet.co.il\/entertainment\/article\/bkco1pmvj>, Mr Lapid said he had been \"apprehensive\" about making the statement.\"In countries that are increasingly losing the ability to speak your mind or speak the truth, someone needs to speak up,\" he said.\"I couldn't help but imagine an Israeli film like this in another year and a half or two,\" he added. \"So I felt I had to [speak].\""}