{"author":"","title":"Dead fin whale washes up on rocks near Cornwall beach","news_category":"general","content":"Rescuers have appealed for the public's help after a fin whale, the world's second largest animal, washed up dead on Cornwall's south coast.Members of British Divers Marine Life Rescue (BDMLR) received a report of a stranded whale near Perranuthnoe Beach at about 15:00 GMT on Thursday.However, it was confirmed the 12 to 15m (40 to 50ft) rare whale was already dead when volunteers arrived.The mammal washed out to sea before a post-mortem could be conducted.The Cornwall Wildlife Trust said initial observations indicated the whale was female and in poor nutritional condition.The trust appealed for public assistance to help locate the remains of the whale so a cause of death could be established.Abby Crosby, marine conservation officer at the trust, said: \"To see the body of this majestic mammal onshore is extremely upsetting and sad.\"But, if the animal is found again, it provides a fantastic opportunity for us to examine the individual and collect scientifically robust evidence that will help us conserve our marine megafauna for the future.\"The organisation said sightings of large whales, including fin and humpback whales, were becoming more common along the Cornish coastline.Dan Jarvis, from BDMLR, said it was difficult for volunteers to get close to the whale.\"The whale was not very easy to spot, being some distance along the coast on a headland and mostly still submerged,\" he said.\"Only its head was really noticeable having been forced up on to the rocks by the rough sea, while the rest of its body was very much in motion with the tide and waves.\"The fin whale - known as \"greyhounds of the sea\" - can grow up to 80ft (24m) and weigh up to 120 tonnes.They can be found all over the world's oceans but were heavily hunted during the 19th and 20th Centuries.Follow BBC News South West on Twitter <https:\/\/twitter.com\/BBCSpotlight>, Facebook <https:\/\/www.facebook.com\/bbcspotlight> and Instagram <https:\/\/instagram.com\/bbcspotlight>. Send your story ideas to spotlight@bbc.co.uk <mailto:spotlight@bbc.co.uk>."}