{"author":"By Monica Rimmer","title":"Birmingham celebrates Commonwealth Games-hosting win","news_category":"general","content":"Birmingham has been officially announced as the host for the 2022 Commonwealth Games. It has been a rocky road, with the second city facing competition from Liverpool and then having to wait for the announcement after the Commonwealth Games Federation said it needed clarification on a number of issues.A bitter five-month long bin dispute <http:\/\/www.bbc.co.uk\/news\/uk-england-birmingham-42122915>, costing the council £6m, and recent criticism from Communities Secretary Sajid Javid, who said the Labour-administered city council was badly run, may not have helped.So can the Brummies pull it off?It seems Birmingham is continuing the growth that has seen a bid to be Channel 4's new headquarters <http:\/\/www.bbc.co.uk\/news\/uk-england-40506043>, the location for the 2018 Gymnastics World Cup andhosting a controversial 100-mile Velo <http:\/\/www.bbc.co.uk\/news\/av\/uk-england-birmingham-41387917\/was-the-100-mile-velo-birmingham-event-a-success> bike race.The city council's campaign was based on Birmingham being the \"heart of the UK\" and \"soul of the Commonwealth\". And now it will stage the £750m showpiece, billed as being the most expensive sports event in Britain since the London 2012 Olympics.There was also excitement amongst the city's sporting talent, delighted at the promise of a home crowd.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Coventry running legend David Moorcroft, a former 5,000-metre world record holder and ex-head of UK Athletics, thinks the Games are a bonus not just for Birmingham but the wider area.\"I think it's fantastic for Birmingham and it's fantastic for the whole of the West Midlands,\" he said.\"There's so much more than just sport involved in the Commonwealth Games, it connects with the diverse communities that [make up] Birmingham.\"It'll be a great celebration. Birmingham has a good reputation at putting on big sporting events and it does them really well. It's something for loads of young aspiring athletes from the West Midlands to take part in.\"Duncan McKay, editor of Inside the Games <https:\/\/www.insidethegames.biz\/>, said Birmingham already had a lot of plans in place.He said: \"It's a fantastic city: it's got a very diverse population that encapsulates the Commonwealth. It has many of the facilities already, albeit some of it like Alexander Stadium needs a revamp, but it has the infrastructure.\"I think it's going to be a great occasion for the city and it will really benefit from it in the long term.\"Evie Tomlinson, 18, a dairy farmer from Leicestershire visiting Birmingham for the day, said: \"It's not an area that has a lot of publicity... it's such a good thing for them.\"Ms Tomlinson said it could be \"the biggest legacy for Birmingham\". However Michael Haile, 46, an economist who works in Birmingham, said: \"I'm not sure if they can handle the infrastructure. If you go around Birmingham there are quite a few places that need doing up. I'm not sure they'd be able to handle it.\"If I remember rightly, London had a really hard time pulling together the Olympics, so I'm not sure if Birmingham would have the necessary skill sets and funds. That would be my doubt, but for the city it's great.\"James Harris, 25, from Stourport, Worcestershire, a hockey coach, said: \"It's brilliant, it'd get more people involved in the sports. It's just great for the city as a whole.\"We went to the Olympics, that was brilliant. It'd just be good to get people down, loads of people can get into the sport by watching.\"Especially with the hockey, there's nowhere really that has a massive event, you normally have to travel quite far. We had a big [surge of interest] from the Olympics so if they do well here, it'll help even more.\"Gary Dixon, 56, who commutes from Telford to Birmingham each day for work, said: \"I think it's a brilliant thing for Birmingham. Birmingham's having some inward invest at the moment, which is raising the profile.\"It did very well for Glasgow, the Olympic games did brilliantly for London, they redeveloped a lot of areas, I'm hoping the Commonwealth Games will have the same effect here.\"Birmingham has a track record of delivering large international sporting events, recently hosting the ICC Champions Trophy and The Ashes at Edgbaston, Rugby World Cup fixtures at Villa Park, Diamond League athletics meetings at Alexander Stadium and the Aegon Classic tennis championships at Edgbaston Priory Club. There was also the Birmingham Marathon and Velo Birmingham.The council says it has 95% of competition venues already in place, with the only new-build required being the Sandwell Aquatics Centre, which will host swimming and diving events.Alexander Stadium will be expanded to host the athletics events and ceremonies, and it is hoped that Perry Barr, a suburban area in north Birmingham, will be transformed in the same way that east Manchester was revitalised by hosting the Games the last time they were staged in England in 2002.And while Birmingham has won the bid, it will be sharing the glory with other locations across the region.Victoria Park in Leamington Spa is the home of Bowls England and the English National Bowls Championships, so will aptly serve as the venue for lawn bowls and para lawn bowls.Part of the Ricoh Arena in the newly-crowned City of Culture 2021, Coventry will host netball matches, while Sandwell, just a stone's throw away from Birmingham in the Black Country, will host aquatic events in a newly-built arena.It may have failed at a bid to host the Olympics <http:\/\/www.bbc.co.uk\/news\/uk-england-birmingham-29250721> in 1992, but Birmingham appears to be fast becoming the go-to hosting city for major sports events.Additional reporting by Alpha Ceesay."}