{"author":"","title":"Suzy Lamplugh: What do we know about the missing estate agent?","news_category":"general","content":"The case of an estate agent who has been missing for 32 years is back in the spotlight, as police search at a home that used to be owned by the chief suspect's mother.Suzy Lamplugh, who was born in Cheltenham but grew up in south London, alongside three siblings, was described as an outgoing young woman by her father Paul, who said she knew \"how to live life fully\".She had worked as a beautician on the QE2 cruise liner before becoming an estate agent.What do we know about her disappearance? And how has a trust set up in her memory helped others?On the day she vanished, 28 July, 25-year-old Ms Lamplugh went to meet a mystery client - named only as Mr Kipper - in Fulham, west London.The moments leading up to her disappearance are well documented.Ms Lamplugh took her keys and a purse containing £15 to the appointment, but left her handbag at her office when she left at 12:40 BST.Police said she was wearing a grey skirt, dark jacket and low heels when she was last seen.Witnesses reported Ms Lamplugh arguing with a man outside a property in Shorrolds Road, Fulham at about 13:00.It was the last time she was seen alive.After she failed to attend another appointment, her boss at Sturgis estate agents reported her missing.Ms Lamplugh's white Ford Fiesta was later discovered in Stevenage Road, about a mile away from her original appointment.The car had been left with doors unlocked and handbrake off but her keys were missing. Ms Lamplugh's purse was in the driver's door pocket.Her body has never been found.Five years after her disappearance, Ms Lamplugh's mother Diana wrote <https:\/\/www.suzylamplugh.org\/suzys-story>: \"There has not been a single trace of her. Nothing. Just as though she has been erased by a rubber.\"Ms Lamplugh was officially declared dead, presumed murdered, in 1994.No-one has ever been charged in connection with her disappearance, but in 2002 police named convicted killer John Cannan, now 64, as the only suspect.Cannan, who was jailed for life in 1989 for the rape and murder of Bristol newlywed Shirley Banks, has been questioned several times over the murder and continues to deny any involvement.The garden of a home in Sutton Coldfield which once belonged to Cannan's mother is currently being searched.It is not the first site to be excavated in the search for Ms Lamplugh's remains.Police twice carried out digs at sites in Worcestershire, first near Norton Barracks in 2000 and then near the village of Drakes Broughton in 2010.They also searched in Quantock Hills, Somerset for a week without finding any clues.Ms Lamplugh's parents set up the Suzy Lamplugh Trust four months after she disappeared.They wanted to support victims of stalking and protect women from violence, and have helped thousands of people in the three decades since.The charity successfully lobbied for private hire vehicle licensing in London, set up the National Stalking Helpline and campaigned for the Protection from Harassment Act 1997 which tackled stalking.It runs a training programme called Staying Safe With Other People, designed to protect adults with learning disabilities, and continues to support victims of stalking or people at risk of being stalked, such as domestic violence victims.Mr Lamplugh, who died earlier this year, told the BBC that the family had been \"determined to do something that would be useful, something appropriate\" after his daughter went missing.\"What came out was something that we would call personal safety.\"That started because Suzy disappeared in the workplace... so we started working on personal safety for people at work.\"Neither Mrs Lamplugh, who died in 2011 <https:\/\/www.bbc.co.uk\/news\/uk-england-london-14580772>, nor her husband, who died in June <https:\/\/www.suzylamplugh.org\/paul-and-diana-lamplugh>, lived to see their daughter's killer brought to justice.Two years ago, Mr Lamplugh said his daughter's absence had become more difficult as he had grown older.\"I miss Suzy more now... I think the older I get I miss her,\" he said.Responding to the latest search, Ms Lamplugh's sister Lizzie Bingham said the family were still searching for an end to their heartache.\"We have seen various police searches over the years so we are cautious,\" she said.\"But we hope Suzy's body will be found and we can have the closure we really need.\"28 July 1986: Suzy Lamplugh disappears while showing a property to Mr Kipper in FulhamDecember 1986: Suzy Lamplugh Trust established by Paul and Diana LamplughOctober 1987: Metropolitan Police investigation scaled down; DNA tests conducted on 800 unidentified bodies1994: Ms Lamplugh officially declared dead, presumed murderedMay 2000: Police reopen case after tracing car that might have been used to kidnap Ms LamplughFebruary 2001: Police search a site close to Norton Army Barracks <http:\/\/news.bbc.co.uk\/1\/hi\/uk\/551698.stm> near WorcesterApril 2001: Search of Quantock Hills <http:\/\/news.bbc.co.uk\/1\/hi\/uk\/1301487.stm> in SomersetNovember 2002: Convicted murderer John Cannan named as prime suspect <http:\/\/news.bbc.co.uk\/onthisday\/hi\/dates\/stories\/july\/30\/newsid_2492000\/2492647.stm> in the murder, but there is no prosecution through insufficient evidence. Cannan, now 64, has denied any involvement2003: Diana Lamplugh steps down from the Suzy Lamplugh Trust after being diagnosed with Alzheimer's disease following a stroke. Paul Lamplugh also steps down to look after herMay 2008: Police ask to see prosecution files after serial killer Steve Wright <http:\/\/news.bbc.co.uk\/1\/mobile\/england\/london\/7401250.stm> was convicted of the murder of five prostitutes in Suffolk. Wright knew Ms Lamplugh when they both worked on the QE2 cruise ship in the 1980s - no links foundAugust 2010: Police excavate a field near the village of Drakes Broughton in Worcestershire <http:\/\/www.bbc.co.uk\/news\/uk-england-london-10946083>, a few miles from the site of the former Norton Army BarracksAugust 2011: Diana Lamplugh diesJune 2018: Paul Lamplugh diesOctober 2018: Investigators prepare to excavate a garden in Sutton Coldfield in the hope of finding Ms Lamplugh's body"}