{"author":"","title":"Hungary official takes on German MEP in AI 'rap battle'","news_category":"general","content":"It's unlikely to dominate the streaming charts, but Hungarian Prime Minister Viktor Orban has become the subject of a unique diss track.And the man behind the song is no up-and-coming artist or future festival headliner.It's a member of European Parliament from Germany, Daniel Freund - a fierce critic of Mr Orban.The lyrics refer to \"scams and hustles\" and take aim at alleged corruption in Hungary.\"From football clubs to luxury castles; Orban's empire is built on scams and hustles; It's time to clean up, it's time to fight; We won't back down until Orban's out of sight,\" the lyrics say.If you're surprised at the Green politician's decision to make his point through rap lyrics - you'd be right to be sceptical.That's because it was actually written by an artificial intelligence (AI) chatbot - ChatGPT.ChatGPT, which reacts to users in a conversational way, provides convincingly human responses to questions using information from the internet. It can write essays, computing code and poems among many other things.Mr Freund asked the tool to produce a rap about corruption in Hungary. \"I was quite impressed how it put widely known accusations against the Orban government into a rap text,\" he told AFP news agency on Tuesday.Hungary is an EU member but has frequently clashed with the bloc.It recently dropped to last place among members in a Transparency International corruption ranking that alleged \"political elites\" misused state and EU funds.The diss track touched a nerve in Budapest and drew a swift response - initiating what may well be the strangest rap battle in history.Hungarian government spokesman Zoltan Kovacs posted a ChatGPT rap about Mr Freund which called him a \"fighter for democracy\" whose \"agenda is shining bright\".In his view, the lyrics proved ChatGPT was \"nothing more than a [expletive] generator\".So is the AI tool the future of rap? Well it's fair to say that judging by both efforts, the answer is a resounding no."}