{"author":"By Jennifer Harby","title":"Appeal made for photos for Derby night out exhibition","news_category":"general","content":"The organisers of a new exhibition are appealing for photographs from Derby's dancing past.We Danced in Derby, a nostalgic exhibition, is running at Déda as part of a photography festival.To compliment the exhibition, the organisers are seeking pictures of people out in Derby during the 60s and 70s or parents and grandparents in their finery.The organisers said they were excited to see what would get sent in.They were also hoping they would receive stories of nights out from days gone by.The images can be sent to Déda - a city dance centre - directly on email <mailto:j.hill@deda.uk.com> or people can visit the centre's cafe and scan in the pictures from original prints, at a booth which will be available until 29 April.Parmjit Sagoo, a producer with Format, which is organising the festival, said: \"Do you have some old photos from the 1960s and 70s tucked away in an old tin or envelope or memories?\"We'd love to hear from you to help us present a celebration of how We Danced in Derby.\"We are excited to see what amazing images from Derby's historic nightlife are waiting to be revealed.\"The exhibition celebrates how the 1960s changed the way people danced and the music that inspired this transformation.Created in collaboration with Roger Smith, a local writer and heritage researcher, it features images of the popular Derby social venues of the time, alongside visual, written and oral history of memoriesIt will be on display in Déda until 9 April.A further dance-themed exhibition, Radical Souls, which includes work by international artists, will run at the Quad Gallery until 2 July.We Danced in Derby is part of Format's International Photography Festival which features exhibitions across Derby including Quad, Déda, Artcore and the Museum of Making.Follow BBC East Midlands on Facebook <https:\/\/www.facebook.com\/bbceastmids\/>, onTwitter <https:\/\/twitter.com\/bbcemt>, or on Instagram <https:\/\/www.instagram.com\/bbceastmidlands\/>. Send your story ideas to eastmidsnews@bbc.co.uk <mailto:eastmidsnews@bbc.co.uk>."}