{"author":"","title":"Ukraine conflict: Wales ready to welcome refugees","news_category":"general","content":"Wales will welcome refugees from Ukraine displaced by the Russian invasion, the first minister has said.Mark Drakeford said Wales wants to be a \"nation of sanctuary\", having previously taken in families from Syria and Afghanistan following conflict.Russian troops have been filmed entering the outskirts of the Ukrainian capital Kyiv <https:\/\/www.bbc.co.uk\/news\/world-europe-60513116> on the second day of fighting.The UN warned five million people could be displaced by Russia's invasion.Mr Drakeford said: \"I've had a number of opportunities to talk to UK ministers about the fact the dreadful scenes in Ukraine will undoubtedly drive a wave of refugees across Europe as people flee and have to remake their lives in the most awful circumstances.\"We have an ambition in Wales to be a nation of sanctuary. \"We have welcomed in very recent years families from Syria, families from Afghanistan to come and remake their lives here and we will want to do the same in the face of the awful events we see in the Ukraine.\"Charities have urged the UK to welcome thousands of refugees from Ukraine <https:\/\/www.bbc.co.uk\/news\/uk-60518801>, matching the effort made after the 1990s conflict in the former Yugoslavia.Save the Children and Amnesty International, among others, said in a letter to the Times <https:\/\/www.thetimes.co.uk\/article\/times-letters-west-must-repel-russias-invasion-of-ukraine-m2jcqjnzm> the UK should play a leading role in providing sanctuary.This video can not be playedWatch: Missile strikes, tanks and buildings destroyed in KyivLocal councils in Wales said they would do all they could to support any such effort.Andrew Morgan, leader of the Welsh Local Government Association (WLGA), said: \"Everyone across Welsh local government have been horrified to see the devastation unfolding in Ukraine.\"A request for resettlement has not yet been received from the UK government. \"Councils are experienced in helping to resettle people from war-torn countries, and they would do all they can to help support any such efforts.\"Mr Drakeford has supported UK sanctions against Russia but admitted people in Wales will need to be prepared to \"make sacrifices\" <https:\/\/www.bbc.co.uk\/news\/uk-60518801> as any retaliatory moves would likely affect everyone in the UK."}