{"author":"By Davide Ghiglione & Alys Davies","title":"Pope Francis spends 'calm' night in hospital","news_category":"general","content":"Pope Francis spent a calm night in hospital after being admitted for a respiratory infection and is expected to remain there for a few days for treatment, a Vatican source has said.Italian news agency Ansa reported <https:\/\/www.ansa.it\/english\/news\/vatican\/2023\/03\/30\/pope-spends-peaceful-night-in-hospital_39b7696c-209a-460f-8c9a-3d2090401097.html> nurses were optimistic he would be out of hospital in time for Palm Sunday this weekend.It added tests had ruled out heart problems and pneumonia. The 86-year-old pontiff entered hospital on Wednesday.In a statement, the Vatican said said Pope Francis had a respiratory infection and would need to remain there for a few days.The 86-year-old has had breathing difficulties in recent days, but does not have Covid, its statement said.\"Pope Francis is touched by the many messages received and expresses his gratitude for the closeness and prayer,\" the statement added.His closest staff, including security, spent the night at the Gemelli Hospital, a person with direct knowledge told the BBC.This is the busiest time of the year for Pope Francis, with many events and services scheduled ahead of Easter weekend.A Palm Sunday Mass is scheduled this weekend, with Holy Week and Easter celebrations next week.He is also scheduled to visit Hungary at the end of April.On Wednesday morning, he presided over his weekly general audience in St Peter's Square. He appeared in good spirits, but was seen grimacing as he was helped into his vehicle.The Vatican initially said the Pope had gone to hospital for a previously scheduled check-up, but Italian media questioned this account after a television interview was cancelled at short notice.Reacting to the news, President Joe Biden asked people to make an \"extra prayer\" for the Pope's recovery.Mr Biden, who is only the second Roman Catholic to be elected leader of the US, also described the pontiff as one of the \"most Christ-like figures I've ever met\".People in the Pope's home city of Buenos Aires, Argentina, shared their feelings with Reuters news agency. One man, Daniel Saco, said the pontiff \"must ask himself whether he can continue\".\"It is very sad because, as a Latin American, I feel represented by this Pope, who is very open-minded and human,\" said Victoria Veira, who is originally from Brazil.Anibal Pizelle, who met the Pope when he was bishop of Buenos Aires, said she was optimistic for a recovery as Francis was \"physically and mentally strong\" and a \"person with enormous faith\".The Pope has used a wheelchair in recent months because of mobility problems related to his knee.He also underwent surgery to treat a colon problem in 2021. In January, he said the condition had returned.Despite his ailments, the Pope has remained active and has undertaken trips abroad. He visited the Democratic Republic of Congo and South Sudan in February.In January, the Pope led the funeral of his predecessor Pope Benedict XVI - who was the first pope to step down voluntarily for centuries. He said this was due to ill health.Pope Francis has previously indicated that he may also wish to follow in Benedict's footsteps in the event that his health deteriorates.This video can not be playedFrom February: BBC religion editor Aleem Maqbool witnesses the Pope's visit to Kinshasa"}