{"author":"","title":"Space Force: Trump 2020 asks supporters to vote on logo","news_category":"general","content":"This video can not be playedCould Trump's 'Space Force' become a reality?Donald Trump's goal of creating a new military branch has yet to lift off, but his campaign is hoping it will fill their coffers to infinity and beyond.Trump 2020 re-election campaign manager Brad Parscale emailed supporters on Tuesday asking them to vote on a Space Force logo which will be sold later on.The email came as Vice President Mike Pence hailed the proposed Space Force during a speech at the Pentagon.He said the agency would be tasked with winning wars in this \"new battlefield\".\"President Trump wants a SPACE FORCE - a groundbreaking endeavour for the future of America and the final frontier,\" read the email from the Trump campaign.\"As a way to celebrate President Trump's huge announcement, our campaign will be selling a new line of gear.\"Mr Parscale then asked supporters to choose from six logos, one of which includes the phrase: \"Mars awaits.\"Analysis by Anthony Zurcher, WashingtonDonald Trump's Space Force as an actual sixth branch of the US military faces numerous bureaucratic and political obstacles. Space Force as a presidential marketing campaign, however, is already blasting off.Not that any of the proposals are particularly good, of course. One is a direct rip-off of Nasa's logo. Another looks like bad clip-art. And what does defending US commercial and military assets in Earth orbit have to do with Mars?Of course, the real point of the email poll from Trump 2020 campaign manager Brad Parscale becomes obvious after readers choose their favourite graphic, in the form of a campaign fundraising pitch.And if the direct approach doesn't work, there's a potentially more lucrative cash grab on the horizon. The White House Gift Shop is already taking pre-orders for Space Force commemorative coins. Once Space Force merchandise hits the Trump campaign store, it won't be long before it starts showing up at Trump rallies.It's a brilliant bit of marketing from the folks who brought you the ubiquitous \"Make America Great Again\" hat.After selecting a logo, people were then asked to donate money to the Trump campaign.The email came hours after Mr Pence gave a speech at the Pentagon, where he argued that the US must invest in creating a new force in order to counter Russian and Chinese operations.Afterwards, in an apparent sign of approval, Mr Trump tweeted: \"Space Force all the way!\"This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Critics note that the creation of a new military branch would require congressional legislation, and that it would probably balloon the Department of Defense's already massive budget.US military policy in space is already covered by the US Air Force.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Retired Nasa astronaut Scott Kelly told CNN that cyber security was more urgent of a priority.His twin brother, astronaut Mark Kelly, called it \"redundant and wasteful\".This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’."}