{"author":"By Jared Lawthom","title":"It's A Sin: The woman who inspired Russell T Davies' Aids drama","news_category":"general","content":"This video can not be playedJill Nalder's story is the inspiration behind hit TV show It's A Sin, penned by friend Russell T DaviesJill Nalder, who lost three friends to Aids in the 1980s, inspired one of the characters in the Channel 4 hit It's A Sin. She remembers how young men who contracted the virus at the time would \"disappear\".In the 1980s, when Jill Nalder was studying in London, she noticed young men were leaving and not coming back.They would go home and \"sort of disappear\". Her friends were dying, often in secret, of Aids.She was aware of HIV from the start because of rumours \"about this 'gay flu' coming from the States\". \"Nobody really knew anything but we heard it was killing young, fit, healthy gay men,\" the 60-year-old said.\"Then it started to creep into our lives. The first one I remember was someone I knew in college.\"He went home. Jill and her friends didn't know why.\"After that we heard he'd died,\" said Jill, from Neath in south Wales, who performs in West End musicals.\"We didn't even know he'd died of Aids, it was just rumours. That happened a lot in the beginning. Boys would go home and sort of disappear. I lost three of my best friends in 18 months.\"Her story is the inspiration behind hit TV show It's A Sin, penned by friend Russell T Davies.Jill can remember her first friend telling her he was HIV positive. \"He wrote me a letter and told me,\" she said. \"When he came back to London he said his parents could never find out because they didn't know he was gay. I had to keep it a secret.\"One friend kept his illness secret until six weeks before he died.\"He probably knew he was HIV positive for four years,\" said Jill. \"He told nobody. But there came a point where he couldn't hide it anymore.\"HIV left untreated develops into Aids and no effective treatment was available in the UK until 1997. Until then it was a death sentence.\"It was a devastating time,\" Jill says. She visited one friend in hospital a week before he died: \"He never got another visitor after that. I didn't know his family well enough to contact them, but I know that he had no other visitors.\"With shame and guilt surrounding Aids, Jill's life was a \"minefield of secrecy\".She would make hospital visits to friends who had the virus, without telling anybody.\"One night I was waiting for a friend at the stage door after a show because we were going out,\" she said. \"He didn't turn up. An hour later there was still no sign. I knew there was something wrong.\"She started dialling numbers from a call box near the West End's Palace Theatre.\"I had to start ringing hospitals trying to find him when I didn't even have a name to give - because the boys with HIV never used their real names when they were admitted,\" Jill said. \"I must have sounded mad.\"It took three hours to find him. \"He had had a seizure,\" Jill said. \"The hospital didn't know why - they probably thought he was drunk.\"Some parents never found out their sons had died from Aids.\"The parents just weren't aware,\" she added. \"They thought it was something like cancer. They didn't understand that Aids even existed and their sons were too afraid to tell them.\"The boys didn't want to worry their mums and dads. They just wanted their parents to be proud of them. They didn't want to let them down.\"In Channel 4's It's A Sin, Lydia West plays a version of Jill, called Jill Baxter, while Jill herself plays the mother of the character she inspired. The show has already had more than 6.5 million streams.Every Friday when an episode is aired on Channel 4 #bemorejill starts trending.Writer Russell T Davies is one of Jill's childhood friends from Neath. He told her she inspired him to write the series.\"I knew Russell from when we were at the West Glamorgan Youth Theatre in the '70s,\" she said. \"It was such a joyous time.\"On moving to London at 18 to study musical theatre at Mountview Academy she and three friends lived in a flat they dubbed \"The Pink Palace\".\"It was so exciting,\" said Jill. \"I was young, carefree and studying the thing I love.\"They paid £80 a week for the apartment after seeing an advert in the paper.\"It was fantastic,\" she said. \"Most of it was pink. Pink curtains, a big pink dralon sofa and even a massive pink drain. It had three big chandeliers and silver service cutlery everywhere.\"We thought 'oh my word, it's like a palace'. So we called it the Pink Palace. It was a real fun time.\"Jill can relate to her It's A Sin character.\"The two things I relate to the most is frantically searching for information about the virus,\" she said. \"I became like a dictionary of Aids-related infections.\"And the hospital visits. Walking down the corridors and looking into the rooms and in each one seeing people around my age dying with Aids. Seeing people with the kaposi sarcoma, the black marks on the skin, for the first time.\"Kaposi's sarcoma is a rare cancer caused by a virus. It's often associated with HIV.\"Those images of the devastation that Aids causes the body will always stay with me,\" Jill added.But she remembers the good times too. In the late 1980s she helped set up a charity called West End Cares, which raised over £2m in its first few years.\"We'd do cabaret nights in West End pubs, and even put on late night performances of full West End shows. It was a great laugh,\" she said.Now called Theatre MAD - which stands for Make a Difference - the charity has raised about £14m.This week is National HIV Testing week.A lot has changed since the first case of HIV was recorded in the UK in 1981. Today, people with HIV can live long and healthy lives with the help of medication.They can also achieve an \"undetectable\" status, which means they cannot pass the virus on. The prescription drug PrEP - pre-exposure prophylaxis - also stops people from catching HIV.\"We have come so far since those days,\" said Jill. \"But what we see here in the UK is not a reflection of the entire global pandemic.\"There are still Aids orphans in Africa, and countries that still criminalize homosexual men. But I think in this country, we think - it's okay, we got over it, and haven't thought about it for a very long time.\"Jill said It's A Sin will make people realise how much times have changed.\"It is for them,\" said Jill. \"For the brave boys we lost.\"They were trailblazers fighting on the frontline. And we should never forget them.\""}