{"author":"By Oliver Smith","title":"Energy bill help cut: ‘We can only work four days'","news_category":"general","content":"Firms have warned they have had to cut hours due to high energy bills, ahead of government help being scaled back.From Saturday, firms will get a discount on wholesale prices, as the government said the current scheme which caps costs was too expensive.The boss of knitwear firm Jack Masters, Snahal Patel, told the BBC it had already shifted to a four-day week after its annual energy bill tripled.\"We're stuck. We want to produce more but it'll cost more,\" he said.Business groups have warned thousands of firms may have to shrink or close altogether when the level of support becomes less generous.Data from analysis firm Cornwall Insights, shared exclusively with the BBC, found the changes mean some businesses could see their bills more than double from 1 April.In 2021, Leicester-based Jack Masters was spending about £60,000 a year on energy for the business, but it is now looking at an annual bill of between £180,000 to £200,000.\"We've cut back on the number of days we're switching on our gas boiler and we've had to reduce staff shifts,\" said Mr Patel, the managing director of the family-run firm, which specialises in making Christmas jumpers.The Treasury says that under the new scheme, bills will automatically be discounted by up to £6.97 per megawatt hour (Mwh) for gas bills and up to £19.61 per Mwh for electricity.Heavy users of energy such as steel and glass makers will get a larger discount than other sectors.Mr Patel said his firm has benefited from government support, but said his bills were still unsustainably high and threaten the future growth of the business.\"What are we going to do over the next 12 months? I think we're going to reduce investment across the board, and I doubt we'll take any new staff on unless we get some really big new orders,\" he said.The research from Cornwall Insight found that in a worst-case scenario firms could see their bills increasing by as much as 133%.It added the more typical bill increase for the average business would be 5-10% from 1 April. However, Cornwall Insight consultant Craig Lowry said while that might sound quite small, businesses are already paying energy prices that are two to three times higher than they were in 2019.Speaking to the BBC, Mr Lowry said bills would continue to stay high in the coming years, and small businesses - especially those in sectors such as hospitality who are only just recovering from the impact of the Covid pandemic - \"will find it increasingly tough to manage their bills in the current climate\".In Leicester city centre, Shaf Islam is also grappling with the impact of high energy costs for his restaurant, Chutney Ivy. His bill has quadrupled, from £1,000 in 2021, to about £4,400 this year.\"It leaves us with absolutely nothing,\" he said.\"It puts pressure on us when other big bills are due like VAT. And we're dealing with huge food price increases at the same time.\"Late last year, gas and electricity prices were so high that Mr Islam jumped at the chance to keep costs down by signing up to a deal at a lower rate.Since then, wholesale energy prices have fallen substantially, although they are still high historically, and it has left Mr Islam locked into his expensive contract for a year.\"Prices were all over the place last year. At one point they were eight times what I was paying,\" he said.\"We leapt on a contract that offered us just four times what I was paying. But now prices have plummeted and I feel trapped.\"Mr Islam would like the opportunity to renegotiate his contract, and he is not alone. The Federation of Small Businesses (FSB) estimates that more than 300,000 firms who locked into expensive contracts last year may have to downsize, restructure, or even close in the coming months.It is urging energy companies to show leniency to firms stuck on high contracts.\"There's much that could and should be done rather than leaving small firms high and dry,\" said Tina McKenzie, policy chairwoman at the FSB.\"Allowing the most vulnerable small businesses to renegotiate or 'blend and extend' their energy contracts to be better reflect wholesale energy prices is the least the government and energy suppliers could do,\" she added.A spokesperson for the government said: \"Companies large and small will benefit from the baseline discount through our new energy bills scheme and do not need to apply for it, and a higher level of support will be provided to the most energy and trade intensive businesses of all sizes.\"Energy UK, which represents energy firms, said it was continuing to work with regulator Ofgem, the government and business groups on the issues.\"It's a commercial issue for suppliers when contracts have been agreed and signed and energy already purchased - but suppliers are trying to come up with innovative solutions that will help customers afford their bills,\" it said."}