{"author":"By Laurence Cawley & Martin Barber","title":"Hemsby: Cliff-top homes evacuated as collapse risk grows","news_category":"general","content":"This video can not be played\"Literally as we speak more chunks [of the sandy cliff] are just sliding down,\" said Alan Jones from Hemsby's lifeboat crewA number of residents have left their homes which are at risk of collapse as high tides cut into sandy cliffs in Norfolk.The wooden properties at Hemsby are getting increasingly close to the edge.Fire crews have been knocking on doors, urging anybody still in the affected properties to leave their homes.High tide hit at about 21:00 GMT <https:\/\/www.metoffice.gov.uk\/weather\/forecast\/u135wx0y1#?date=2023-03-10> amid fears homes could fall into the sea. Preparations are under way to demolish three homes close to the cliff edge.Emergency services are working with officers from Great Yarmouth Borough Council.Mary and Pat Whitey are among those who have left their bungalows to take shelter provided by Great Yarmouth Borough Council on Thursday night.\"It was a bit dangerous to stay there - the tide was really hitting the sand dunes,\" said Mr Whitey.\"If [the house] isn't going to go [on Thursday], it will go next week, or the week after, or the week after next - I've accepted that now.\"The 79-year-old, who has lived in his home for 35 years, said his immediate neighbour evacuated her bungalow earlier in the day.He and Mrs Whitey were persuaded to move to the hotel after it agreed they could bring their pet cat.This video can not be playedThe wooden properties at Hemsby are getting increasingly close to the edgeAlan Jones, of Hemsby Independent Lifeboat, said more properties might need to be evacuated because of damage to an access road.\"If that road goes then there's no access at all by road,\" he said. \"We know there are a couple of people down there who are ill and a couple on medication.\"We didn't expect it to be as severe as it is at the moment.\"A council spokesman said because it was a \"dynamic situation\" he did not know exactly how many people had left their homes to seek refuge in council-provided accommodation.Jane Beck, Great Yarmouth Borough Council's head of property and asset management, said: \"We have evacuated cars from the access road to the southern part of The Marrams at Hemsby as a precaution.\"At the moment we've dealt with the three properties that are quite close and with coastal erosion you never know what the outcome might be.\"On Thursday night, resident Lance Martin had about 5m (15ft) of garden behind his home. When he awoke on Friday he had just 3m (9ft).He remains hopeful his home can be saved.\"I'm positive that we can save it [the house], we just need to get the land sorted out at the back of me,\" he said.\"It can be done, I know it can be done. So we just got to wait the worst of the weather out.\"Mr Martin has now left his property but is hoping to return when it is safe to do so.High spring tides were forecast for a 48-hour period and easterly winds were expected to reach 35mph (56km\/h).The village, near Great Yarmouth, is home to about 3,000 people and was once home to a Pontins holiday camp.Seven bungalows along The Marrams had to be demolished when sandy cliffs washed away in March 2018 <https:\/\/www.bbc.co.uk\/news\/uk-england-norfolk-43472150> and, in December 2013, \"the worst storm surge in 60 years\", destroyed seven homes.The beach has been closed since 25 February <https:\/\/www.bbc.co.uk\/news\/uk-england-norfolk-64772348> because of recent erosion.It is understood up to three homes are currently at immediate risk.Officers from the council are at the scene and trying to work out if and how quickly any properties might need to be demolished.Andrew Turner, BBC Radio NorfolkIt's like a battle scene on Hemsby's front line. Homes are being evacuated, people led to safety, police and council staff making sure people are kept safe.And there are casualties. The porch of a house lost in 2018 - which has stood defiantly on the roadside has now gone.The old concrete road - abandoned and diverted from - has collapsed onto the beach below and the attack of the relentless waves driven by a strong easterly wind continue to gain ground.This morning's high tide has passed and, unless the wind changes, tonight's could do even more damage and could claim more properties.Work is also under way to work out how to store household belongings that need might need removing.A council spokesman also said granite rock could be placed in front of the dunes as a \"short-term interim option\" - pending any necessary planning permission - to help protect the dunes and the \"main access road for 62 properties\".Last year, a 1.3km (0.8 mile) rock berm at the base of the cliff at Hemsby was approved in principle, but the council funding for the £15m scheme was \"challenging to obtain\", with just £2.5m available from the government.Such a measure could slow down coastal erosion, which has severely affected the area.On Friday the Marine Management Organisation <https:\/\/www.gov.uk\/government\/organisations\/marine-management-organisation> (MMO) said it had been \"working proactively\" with the council to streamline the requirements for the application.\"The marine licence application is on hold awaiting further information on the Environmental Impact Assessment decision from Great Yarmouth Borough Council,\" a spokesperson said.\"Once this information is received the MMO will proceed to make a determination on the application as soon as possible.\"Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}