{"author":"By Brandon Drenon","title":"Florida's DeSantis pushes expansion of so-called 'Don't Say Gay' law","news_category":"general","content":"This video can not be playedWatch: Five things to know about Ron DeSantisFlorida's governor has moved to expand a controversial law barring public schools from teaching about sexual education and gender identity.Governor Ron DeSantis is seeking to extend it to all grades, through to the final year of high school.Teachers who violate the law - denounced by critics as \"Don't Say Gay\" - face being suspended or losing their teaching licences.The Board of Education is expected to vote on the proposed rule next month.It was put forth by the state Department of Education and will not need legislative approval to take effect, according to local media reports.Both the education department and the board are led by appointees of Mr DeSantis.The law, officially titled the Parental Rights in Education Act, passed last year and is currently in effect for public schools from kindergarten through third grade.Cultural issues have been a priority for Mr DeSantis. The Republican, who won re-election last year in a landslide, is widely expected to announce he will run for president in 2024.Gov DeSantis has sought to amplify his image as the antidote to what he calls \"liberal indoctrination\" by Democrats.Mr DeSantis and other Republicans who support the law say it shields children from inappropriate content that does not belong in schools. They argue that parents, not teachers, should be holding discussions on topics like sexual orientation and gender identity with their children.Florida Commissioner of Education Manny Diaz Jr said in a tweet that: \"Students should be spending their time in school learning core academic subjects, not being force-fed radical gender and sexual ideology.\"Critics, including LGBT rights groups and the Biden administration, say it could marginalise LGBT youth as they come to terms with their identity.\"This is an assault and a culture war against LGBTQ families,\" said Michael Rajner, 52, an LGBT rights advocate who lives in Fort Lauderdale, Florida. \"We are living at a time where we are finding an erosion of the rights and protections that so many communities of people have worked so hard to achieve.\"Critics also say the language within the law is vague and that restrictions against \"age appropriate or developmentally appropriate\" LGBT-related content are hard to define.There is concern teachers will avoid discussing topics on sexual orientation and gender identity entirely over fear of penalty."}