{"author":"By Paul Melly","title":"Why France faces so much anger in West Africa","news_category":"general","content":"It all started so positively. Where have things gone wrong? Why does France now appear so unpopular in Africa?French President Emmanuel Macron has increased aid to the continent, begun the return of cultural artefacts stolen during the colonial wars <https:\/\/www.bbc.co.uk\/news\/topics\/ce1qrvlelw0t\/benin?ns_mchannel=social&ns_source=twitter&ns_campaign=bbc_live&ns_linkname=618a8516f425de0f2968334a%26France%20hands%20back%20historic%20looted%20Benin%20treasure%262021-11-09T15%3A02%3A18.068Z&ns_fee=0&pinned_post_locator=urn:asset:b7a5792f-885c-4560-88f8-7573c77baced&pinned_post_asset_id=618a8516f425de0f2968334a&pinned_post_type=share> and reached out beyond the usual inter-government ties to engage younger generations and civil society.He has kept French troops in the Sahel to fight the jihadist militants that kill so many local civilians, police and soldiers and supported the regional bloc Ecowas as it tries to defend electoral politics against military takeovers.This year he flew to Rwanda to publicly acknowledge French failures during the 1994 genocide <https:\/\/www.bbc.co.uk\/news\/world-europe-57270099>.Yet his country is now the target of embittered African complaints and criticism on a scale that is probably unprecedented.Last month, a convoy of French troops heading north to support the fight against Islamist militants was repeatedly blockaded by protesters as it crossed Burkina Faso and Niger.In September Mali's Prime Minister Choguel Maïga was met with a wave of sympathetic comment when he used a speech at the UN to accuse France of \"abandoning his country in mid-flight\", after Mr Macron began to scale back the deployment of troops in the country.Among progressive West African commentators and urban youth, it is now commonplaceto hear calls for the abolition of the CFA franc <https:\/\/www.bbc.co.uk\/news\/world-africa-41094094> - the regional currency used by many francophone countries and which is pegged to the euro under a French government guarantee. Its critics say this enables France to control the economies of those countries which use it, while France says it guarantees economic stability.What explains this paradox? How is it that a president more concerned for Africa than most recent predecessors, and more aware too of how the continent is changing, encounters a level of French unpopularity not felt for decades?Certainly, Mr Macron's self-confident - critics would say arrogant - personal style is a factor.He has made his share of diplomatic blunders.After 13 French troops died in a helicopter crash in Mali in November 2019 <https:\/\/www.bbc.co.uk\/news\/world-africa-50557511> he demanded that West African leaders fly to France for an emergency summit, an outburst perceived as neo-colonial arrogance, particularly as Mali and Niger had suffered far heavier recent military losses.President Macron was forced into a rapid course-correction, flying to Niamey, Niger's capital, to pay his respects to the Nigérien military dead and postponing the summit until January 2020.But the causes of France's current discomfort also extend back to decades before Mr Macron's election in 2017.\"You can cite historical controversies linked to colonisation. Many of us are the children of parents who knew the colonial period and its humiliations,\" explains Ivorian political analyst Sylvain Nguessan.During the early post-independence decades, France maintained a dense web of personal connections with African leaders and elites - dubbed \"françafrique\" - which too often slid into a mutual protection of vested interests, with little regard for human rights or transparency.Among outside powers, Paris was far from alone in colluding with dictatorial allies, but its relationships were particularly close and unquestioning.The most damning failure came in Rwanda in 1994, when France failed to act even as its ally, the regime of then-President Juvenal Habyarimana, began to prepare genocide.From the mid-1990s onwards several governments worked to reform France's engagement with Africa and give more priority to development and democratic governance.But momentum later faltered.Nicolas Sarkozy began his tenure as president in 2007 by remarking, with a spectacular lack of tact, that \"the African man has not sufficiently entered into history\". He favoured old allies such as the Bongo family, who have governed Gabon since 1967.When François Hollande became president in 2012 he had no choice but to focus on security issues in the Sahel - a swathe of land south of the Sahara desert. He never really had the political strength to revive reform efforts.But with Mr Macron's accession to office, France had a president fully aware of the need for change - and with the political clout and personal enthusiasm to attack the task.In 2017 he told students in the Burkinabe capital, Ouagadougou, that France would back a reform of the CFA franc if African governments wanted this. He also invited civil society, youth and cultural figures to this year's France-Africa summit in Montpellier, rather than the usual flock of presidents.Yet his readiness to speak plainly, challenge old structures and question comfortable assumptions has not always played well, even among those who are clamouring for change.Moreover, the situation in the Sahel has deteriorated into a festering wound. The French military presence fuels an increasingly widespread sense of grievance across West Africa.Despite a massive and sustained military effort - with more than 5,000 troops deployed and more than 50 killed - France has not been able to decisively overcome the threat from jihadists, whose attacks on local communities and security forces continue.The reasons are complex, both military and social, environmental and economic. Yet a significant proportion of local public opinion feels that France, as a high-tech Western military power, should have been able to \"sort\" the problem and should now get out of the way if it cannot do so.Those feelings seem to have motivated the protesters who blockaded the French army convoy.And this comes after earlier causes of resentments, as Mr Nguessan points out: \"The speeches of Sarkozy in Dakar, Macron in Ouagadougou; the war in Ivory Coast; the discouraging results of the campaign against terrorism.\"Questions related to the currency, debt, support for local dictators and ill-chosen words.\"But underlying social and communal factors also shape the attitudes of some.One senior Sahel military officer says he sees the French as allies of Tuareg former separatist rebels in northern Mali - an allegation fiercely and credibly denied in Paris.Similar complexities surround France's support for West Africa regional body Ecowas - which is currently trying to pressure coup leaders in Mali and Guinea to rapidly return their countries to civilian constitutional rule.A growing number of young people regard the regional bloc as an incumbent presidents' club, too slow to criticise civilian rulers who manipulate democratic rules and unwilling to acknowledge the strength of popular support for military leaders promising reform.So in backing Ecowas as the legitimate African crisis management institution, France ends up being perceived as a prop for the old guard establishment.Paul Melly is a consulting fellow with the Africa Programme at the think-tank Chatham House in London."}