{"author":"","title":"Social care: What is happening to the cap on care costs?","news_category":"general","content":"A cap on the amount people in England pay for social care is to be postponed by two years.Councils had warned adult care services could worsen if the rollout was not delayed.The cap on care costs was due to be introduced in October 2023. The delay was announced in Chancellor Jeremy Hunt's Autumn Statement.It means some people will continue to pay more than £86,000 for lifelong care needs.Following concern over challenges including staffing and financial pressures <https:\/\/www.bbc.co.uk\/news\/uk-politics-63146985>, the government said an extra £2.8bn would be available for adult social care next year and £4.7bn the following year.This includes delaying the cap on social care costs, allowing councils to increase council tax by up to 5% and £1bn of extra funding next year, followed by £1.7bn the next year.Health Secretary Stephen Barclay said 200,000 more care packages would be delivered with this funding.Sir Andrew Dilnot, who helped to devise the care cap plan, said the delay was \"extraordinarily disappointing\". He said Mr Hunt had broken the government's2019 manifesto commitment <https:\/\/www.conservatives.com\/our-plan\/conservative-party-manifesto-2019> to fix social care.However, the National Care Forum - which represents not-for-profit health and social care providers - said funding increases were welcome, but \"much more is needed to put the sector on a sustainable long-term footing\".MPs back change to social care funding in England <https:\/\/www.bbc.co.uk\/news\/uk-politics-59365729>What are the challenges facing social care? <https:\/\/www.bbc.co.uk\/news\/health-50377846>Critics warned that people with fewer savings might end up using a bigger proportion of their own assets than better-off people.For example, after reaching the £86,000 cap, someone with a £100,000 house would be left with £20,000 - 20% of the value. (The first £20,000 of someone's assets is protected under the proposals).However, someone with a £500,000 house would be left with £414,000 after reaching the cap - leaving them about 83% of the value.Also under the proposals:So, if someone's care costs £860 a week and they were meeting the cost themselves, it would take 100 weeks to hit the cap.However, if the same person received council help it would take longer than 100 weeks.That means poorer people receiving means-tested help would make contributions from their own money for longer.The cap wouldn't cover living costs, like rent, food and utility bills. The guidance says people would have to meet these themselves - \"including after they reach the cap\".The government said living costs would be up to £200 a week.Social care works differently across the UK. Scotland, Wales and Northern Ireland have the power to set their own policies.Personal care, such as help with washing and dressing, is currently free <https:\/\/www.gov.scot\/health-and-social-care\/> in Scotland for those assessed by their local authority as needing it.The Scottish government is set to launch a new National Care Service, which it says will bethe biggest shakeup of public services since the creation of the NHS and will end the current social care \"postcode lottery\" <https:\/\/www.bbc.co.uk\/news\/uk-scotland-scotland-politics-63542742>.Some care costs are already capped <https:\/\/www.bbc.co.uk\/news\/uk-wales-58475047> in Wales. Home care is free for over-75s <https:\/\/www.nidirect.gov.uk\/articles\/arranging-health-and-social-care> in Northern Ireland."}