{"author":"By John Campbell","title":"NI projects given £12m in funding to replace EU aid","news_category":"general","content":"Projects in Northern Ireland will get £12m in the first round of UK government funding to replace EU aid.The Community Renewal Fund (CRF) is effectively a pilot for the bigger Shared Prosperity Fund (SPF) which is due to start next year.The single biggest CRF grant is £1.8m is for a business training programme backed by four local councils.Northern Ireland will continue to get some EU funds up to 2027 <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-55361921> under the Peace Plus scheme.The CRF will be used to invest in skills, education, local businesses and employment.A total of 31 projects in Northern Ireland have received funding <https:\/\/www.gov.uk\/government\/publications\/uk-community-renewal-fund-successful-bids>, with the recipients including the National Trust, Ulster University and Belfast City Airport.About 6% of the initial funding has been allocated to Northern Ireland, with 9% to Scotland, 23% to Wales and 62% to England.In Great Britain bids were submitted via local authorities, while in Northern Ireland applicants applied directly to the UK government.Eighty-three bids were submitted from organisations in Northern Ireland, of which 73 were eligible for funding.The UK Department for Levelling Up, Housing and Communities, which runs the CRF, said: \"In Northern Ireland bids were ranked by score.\"A small number of projects scored the same, though the funding envelope did not allow all to be funded.\"As per the published prospectus ministers applied discretion to determine which of those projects received funding; this was based on achieving a balanced spread of projects across Northern Ireland.\"The Treasury has previously pledged that funding under the SPF will \"at least\" match EU funding for the poorest regions.At last week's Budget, Chancellor Rishi Sunak said that \"over time\" it will match EU funding of about £1.5bn a year - as EU funds taper off until they are fully replaced by UK government funds.The fund allows the UK government to directly invest in areas such as education and economic development that would otherwise be controlled by politicians in Cardiff, Edinburgh and Belfast.Under the UK Internal Market Act - a new law passed last year - the UK government gained new powers to spend in areas such as infrastructure, education and economic development that would otherwise be devolved."}