{"author":"","title":"Service charge for leaseholders probed by OFT","news_category":"general","content":"The sometimes fraught relationship between leaseholders and their freeholders is going to be investigated by the Office of Fair Trading (OFT).The enquiry will look at the way freeholders charge for the management and maintenance of leasehold homes in England and Wales.The OFT will look at the behaviour of council and housing association freeholders as well as private ones.The enquiry will report by the end of 2014.The OFT estimates that there are about five million people in England and Wales living in flats they own as leaseholders.That is where the flat is owned by someone with a lease, but the ownership of the building, whether a block of flats or a converted house, is in the hands of a separate freeholder.The leaseholders typically pay an annual service charge to their freeholder for the upkeep of the building.It has long been claimed that some freeholders, or the managing agents they employ, overcharge for the cost of cleaning, maintenance or repair.Rogue freeholders are frequently accused of:\"Service charges for the maintenance of a building can be substantial and we want to make sure that leaseholders are getting a fair deal,\" said Rachel Merelie of the OFT.\"We are concerned that management agents and freeholders may not be incentivised to keep maintenance costs down and that leaseholders may not receive value for money,\" she added.The OFT said it had received more than 250 responses when it first consulted on having an enquiry. These came from leaseholders, residents' associations, property managers, freeholders, trade associations and action groups.It was particularly concerned by stories of elderly leaseholders living in retirement flats who were being exploited by their freeholders.Joe Oldman of the charity Age UK said he was very pleased the OFT was taking action.\"We have dealt with many cases of older people in retirement homes being unhappy with unfair service charges and not being able to untangle them.\"Sometimes they are not told what the charges are before they move into retirement accommodation, or about the exit charges if they leave,\" he said."}