{"author":"By Peter Shuttleworth","title":"Children as young as six self-harming in Wales schools","news_category":"general","content":"Children as young as six have been recorded as self-harming in schools, a Freedom of Information request by BBC Wales has found.One council said self-harm referrals to social services by their schools had risen six-fold in three years.The National Education Union (NEU) has urged the Welsh Government to introduce wellbeing officers into schools.The government said its education and health ministers had been in talks and would make an announcement \"shortly\".Only three of Wales' 22 councils provided responses to the request about the number of incidents within local authority schools.Pembrokeshire council said there were 48 incidents in its schools in 2016-17 - up from eight in 2014-15 - with the youngest pupil aged six. All 48 pupils were referred to social services.Schools in the Merthyr council area made 22 self-harm referrals to social services last year - the youngest aged 11 - down from 54 in 2015-16.And schools in Gwynedd made 150 referrals to social services last year - down from 195 in 2014-15 - but that was referrals for all concerns, not just self-harm.Meanwhile, figures from the NSPCC for young people hospitalised because of self-harm in Wales has risen by 41% in three years - up 350 to 1,193 in 2015-16.The NEU said some schools had dedicated wellbeing teams while others gave the responsibility to a teacher.\"Having a more standardised approach ensuring additional funding is put into schools to employ people specifically trained for wellbeing could certainly be looked at,\" Owen Hathway, Wales policy officer at NEU Cymru, said.Wales is the only UK country where schools have a legal requirement to make counselling available for children older than year six, but the children's commissioner for Wales said that was \"not enough\".This video can not be playedThe children's commissioner for Wales Sally Holland wants schools to be 'sites of excellence'\"That has been a big step forward,\" Prof Sally Holland said.\"But what we are hearing from schools is that is not enough. We probably need therapists in schools with a range of different skills and support.\"Advice if you think a young person is, or considering, self-harming:This video can not be playedHollie Thomas from Barnardos Cymru, encourages young people to find \"coping strategies\"Source: NSPCCShe added: \"I don't think teachers can be expected to undertake the mental health work in schools, there are experts who can come into schools to do that with the necessary expertise and training.\"Schools need better and more direct access to mental health services so teachers have someone they can pick up the phone to or speak to in school to get the expert help they need.\"The NSPCC said self-harm takes \"many forms\" such as cutting, burning, scratching, poisoning and overdosing - and in Wales volunteers undertook 1,366 counselling sessions last year.The NEU said pupils could \"slip through the net\" without in-school mental health specialists.\"It is extremely tough for teachers,\" said Mr Hathway.\"They are adept at picking up warning signs but there's always areas where they are not trained specifically and don't have the expertise.\"Ultimately they didn't train to go into social services, it's an aspect of the role that has developed over time, and teaching staff have an obligation and are judged around academic outcomes.\"The Welsh Government is drafting plans for a reform of education and mental health, but Prof Holland has written to Health Secretary Vaughan Gething and Education Secretary Kirsty Williams as she said the programmes \"are not working closely enough together\".\"Both are trying to work hard on how we make schools nurturing places to prevent mental ill health,\" she said.\"We need health and education experts, youth and social workers and the voluntary sector to be working together with young children and their families.\"We need to assist children who are starting to show signs like self-harm so it doesn't become a mental health emergency.\"We have the expertise and willingness in Wales but we need those programmes to join up.\"The Welsh Government said its Talk to Me 2 strategy supported young people \"known to be most vulnerable to suicide and self-harm\".\"The education secretary and health secretary have been considering how emotional resilience and mental health can be strengthened in school settings and we'll be making a significant announcement shortly,\" a spokesman said."}