{"author":"By Steffan Powell","title":"E3 2021: Gaming bonanza or Covid-hit bore?","news_category":"general","content":"It's perhaps no surprise that there were only a few genuinely new games announced at this year's E3 convention.Game development has been severely affected by Covid - as seen by the many delayed game releases recently,Press X to Continue reviewer Shay Thompson says this year's event had \"a lot of padding\". Her colleague Gav Murphy wonders if they couldn't have \"just taken another year off\".But some new games and plenty of fresh footage was shown off.So what were the highlights?A mysterious red-black flame flickers.There are flashes of a blonde hero struggling, and then falling, as the screen fades to darkness.The opening moments of the trailer to the sequel of Nintendo game Breath of the Wild sent fans into raptures online, with the news that it'll come out in 2022.The lack of a specific release date may concern some, but the gameplay that was shown seemed to go down a storm with fans.It was the climax of the entire convention - although there may be some frustration that there was little else of that calibre shown by Nintendo.Racing game Forza Horizon 5 was announced at Microsoft's conference on Sunday and will be set in Mexico. <https:\/\/www.bbc.co.uk\/news\/newsbeat-57477059>It was later voted <https:\/\/www.gamesindustry.biz\/articles\/2021-06-16-forza-horizon-5-voted-most-anticipated-game-in-official-e3-2021-awards> the most-anticipated game to be announced at the convention.\"It looks like so much fun,\" says Shay.\"It has arcade style gameplay goodness and you can tell the team has spent a lot of time researching the location and that's been translated into the game.\"It looks how games should look on the new generation of consoles.\"The game is also one of the few major releases that's due to be playable this year - other titles, like Starfield and Elden Ring, are slated for 2022.But some will have been disappointed that Playground Games, the studio that make Forza Horizon, didn't have anything to show of their work on the latest Fable game that we know is in development.Ever since being teased in 2018 there have been questions as to what it is. We now know the intriguing role-playing game, Starfield, will involve flying a spaceship, exploring a galaxy and going on adventures hundreds of years in the future.The first new franchise created in 25 years by Fallout and Elder Scrolls developer, Bethesda, will be an Xbox exclusive.It's due for release in 2022.For Gav, it was the surprise collaboration between Sea of Thieves and Pirates of the Caribbean that stole the show.\"It's adding more story-based content into the game,\" he says.\"You'll be able to go off on missions with Pirates of the Caribbean characters - but the world won't be overtaken by them, so this doesn't feel to me like some weird, cynical cash-in.\"Sea of Thieves is at its best when you're doing cool missions with friends and this is adding more content like that.\"A question that has been answered this week is: \"What is Elden Ring?\"The collaboration between Game of Thrones author George R.R Martin and legendary games maker Hidetaka Miyazaki has finally got a release date.Some had started to worry we would ever get to play the game first announced in 2019 - after a serious lack of updates.But a lot of the game's dark and mysterious setting has been shown off and developers say it will be on our consoles in January 2022.Marvel fans were pleased to see an unexpected tie-in with The Guardians of the Galaxy, announced by publisher Square Enix.Released this October, the title puts you in the role of star lord Peter Quill and the trailer was full of his signature quips and one-liners.But without the rights to use the likenesses of the actors from Hollywood, the game hasn't won everyone over.Shay describes what was shown as old fashioned: \"It looks like it came out 10 years ago.\"Having these character models, that are pretty generic, not the Hollywood faces - it was pretty strange.\"For Press X to Continue's Inel Tomlinson, the stars of this year's convention were not the major titles but rather some independent releases teased at the event.\"I really enjoyed the indie games being pushed to the forefront of everyone's attention this year at the conferences,\" he says.\"I liked the game Replaced, with it's cool pixelated art mixed, and 12 minutes starring Willem Dafoe.\"There are lots of smaller independent titles to get excited about.\" For more gaming content head to Press X To Continue on BBC Sounds. <https:\/\/www.bbc.co.uk\/sounds\/search?q=press+x>Follow Newsbeat on Instagram <https:\/\/www.instagram.com\/bbcnewsbeat\/>, Facebook <https:\/\/www.facebook.com\/bbcnewsbeat\/>, Twitter <https:\/\/twitter.com\/BBCNewsbeat> and YouTube <https:\/\/www.youtube.com\/channel\/UCe1Ef-K5jpnRsmVY5hCBhOw>.Listen to Newsbeat live <https:\/\/www.bbc.co.uk\/sounds\/play\/live:bbc_radio_one> at 12:45 and 17:45 weekdays - or listen backhere <http:\/\/www.bbc.co.uk\/programmes\/b006wkry\/episodes\/player>."}