{"author":"By Daniel Davies","title":"Children in Welsh care system feel 'bought and sold'","news_category":"general","content":"Action needs to be taken to stop children feeling like they are being \"bought and sold\" in the care system, says Wales' children's commissioner.Sally Holland has used her annual report to call for private companies to be prevented from making profits on children's homes or foster care.Nearly 80% of the 770 Welsh care home places are run by private firms.Care industry bodies argue costs are rising as children enter the system with increasingly complex needs.But in her report, Ms Holland said the Welsh Government \"must commit to taking concrete actions within the next year\".She said there should be moves \"towards reducing and ultimately ending profit making in children's care services, without detriment to children and young people's current care arrangements\".Her findings have been accepted by the Welsh Government.\"One young person said I'm actually really happy with my foster carers, but I'm really unhappy about the level of profit that goes to some distant company,\" she said.\"They've said to me it actually feels like we're bought and sold on a market.\"She said one child who was threatening to leave her care home was told she could \"because we have queues of children that they want to place here, some of them we can charge a lot more for\".Anna-Louise Edwards, 23, who spent 26 months in care as a teenager, said profits in the industry should be capped.She had a good experience at her privately-run care home in Wrexham, but says some children feared losing their places because of a lack of funding.\"Personally I think it's morally and ethically wrong to feel the need to make profit off the more vulnerable people in our society,\" she said.\"There are such large companies in the private sector and if just one of those companies were to break down it would be scary because so many young people would have their lives destroyed once again.\"The Welsh Government, which wants to cut the number of children in care, says \"rebalancing\" towards public and not-for-profit providers is a priority.It spent £100,000 this year trying to help councils recruit more foster carers.Thirty-six businesses run homes in Wales. The four biggest companies - Orbis, Care Tech, Keys and Priory Education Services - control 28% of the homes.Orbis and Keys declined to respond to the children's commissioner's comments when asked by BBC Wales. The other two have been approached.The commissioner's warning comes as research for councils in England revealed <https:\/\/www.bbc.co.uk\/news\/education-51633080> that six out of the 10 largest providers of children's homes and foster carers are running huge debts.The Local Government Association, which represents English councils, questioned whether some companies had the money to repay their loans.The Independent Children's Homes Association, which represents care companies, said they were dealing with children with increasingly complex needs, leading to higher care costs.Chief executive Peter Sandiford said: \"Profitability is one factor of financing care in complex situations.\""}