{"author":"","title":"London's unsold arts tickets given away to ease cost of living","news_category":"general","content":"Thousands of unsold tickets to cultural events including theatre, comedy and dance, will be made freely available to people struggling with the cost of living.The scheme, called The London Ticket Bank, will see arts organisations work with charities to distribute tickets.One charity said it could \"completely change\" people's lives.It will launch in January 2023 for a year. So far, seven organisations have joined the scheme.The initiative was the brainchild of Chris Sonnex, the artistic director of Cardboard Citizens, which makes theatre for people with lived experience of poverty.He said experiencing arts and culture has a \"massive effect\" on health and wellbeing, but that \"whole rafts of people are being excluded from that because of ticket prices\".Tickets will be made available to those who may not otherwise be able to afford them, such as those who use food banks.The Almeida Theatre, Barbican, Bush Theatre, Gate Theatre, The National Theatre, Roundhouse and Tara Theatre have signed up to the scheme.It's expected that more venues will join in 2023, meaning an estimated 56,000 tickets will be made available over the year.Charities signed up to the scheme will receive access codes that they distribute to users, who can then book tickets on The London Ticket Bank's website. People can either choose to pay nothing or 'donate-what-you-can'.Caroline McCormick, chair of the Cultural Philanthropy Foundation, said the response from arts institutions had been \"overwhelming\".She said, \"Everybody's seen the value, everyone wants to make it work. What's wonderful is the sector uniting behind these issues. We want to ensure that people can access culture.\"Gillian Jackson from homeless charity The House of St Barnabas said the scheme \"completely aligns with our ethos\".\"Culture will always be one of the first things that drops when you're struggling to eat, but equally it is one of the most important things that we have as humans,\" she said.\"We've had some incredible stories about someone going back to the theatre, or going for the first time, and that can be the reignited flame to get their dignity back.\"Clarification 5 January 2023: The article refers to the London Ticket Bank, which is distinct from the Ticket Bank.Follow BBC London on Facebook <https:\/\/www.facebook.com\/BBCLondon>, Twitter  <https:\/\/twitter.com\/BBCLondonNews>and Instagram <https:\/\/www.instagram.com\/bbclondon\/?hl=en>. Send your story ideas to hellobbclondon@bbc.co.uk <mailto:hellobbclondon@bbc.co.uk>"}