{"author":"By Antoinette Radford","title":"Russia to offer food for North Korean weapons - US","news_category":"general","content":"Russia is sending a delegation to North Korea to offer food in exchange for weapons, US national security spokesperson John Kirby has said.Mr Kirby said any arms deal between North Korea and Russia would violate UN Security Council resolutions.The US has previously accused North Korea of supplying arms to the Russian military <https:\/\/www.bbc.co.uk\/news\/world-europe-62804825> in Ukraine and the Wagner group of Russia mercenaries. <https:\/\/www.bbc.co.uk\/news\/world-europe-64072570>Pyongyang earlier denied the claims.Mr Kirby told a news conference the US had new information about a deal.\"We also understand that Russia is seeking to send a delegation in North Korea and that Russia is offering North Korea food in exchange for munitions,\" he said.The security spokesperson said the US was monitoring the situation, and the alleged deal, closely.North Korea is one of the poorest countries in the world and has experienced chronic food shortages for decades, including adevastating famine <https:\/\/www.bbc.co.uk\/programmes\/w3ct1x7s> in the mid-to-late 1990s. In February, experts warned the country, which has one of the most authoritarian governments in the world, wasfacing a critical food crisis <https:\/\/www.bbc.co.uk\/news\/world-asia-64701184> due to a significant drop in production - worsened by poor weather, strict border controls and the effect of international sanctions.Satellite imagery from South Korean authorities shows that the North produced 180,000 tonnes less food in 2022 than in 2021.Earlier on Thursday, the US Treasury blacklisted a Slovak man in a separate case - for acting as a broker between Russia and North Korea.The treasury said Ashot Mkrtychev, 56, had arranged sales and organise deals that would enable North Korea to ship weapons to Russia in late 2022 and early 2023.In return Pyongyang received cash, commercial aircraft, commodities and raw materials, they said.Featuring on the sanctions blacklist means American businesses cannot have dealings with Mr Mkrtychev, and it freezes his US assets.Western sanctions have significantly affected Russia's ability to replace used up or destroyed weapons in its war on Ukraine.The sanctions have prompted Russia to turn to other countries to source weapons.In December last year the US said Iran had become Russia's top military supporter. <https:\/\/www.bbc.co.uk\/news\/world-europe-63921007>"}