{"author":"","title":"Adoption numbers show rise to record high","news_category":"general","content":"A record number of children were adopted in England in 2013-14, according to official figures.Adoptions increased by 58% between 2010 and 2014, from 3,200 to 5,050, the Department for Education figures show.However, only 70 adoptions were for children aged 10 or over, the lowest figure recorded.Adoption UK chief executive Hugh Thornberry said more needed to be done to ensure older children found their \"forever family\".He added: \"Children of all ages need a loving permanent home.\"The total number of adoptions in England has increased by 26% since last year <https:\/\/www.gov.uk\/government\/statistics\/children-looked-after-in-england-including-adoption--2> when 4,010 adoptions took place.The Department for Education says the figures - compiled under current methods since 1992 - are a direct result of government action to reform the adoption system which have been in place over the last 12 months.In a bid to speed up and simplify the adoption process, rules blocking adoption on cultural or bureaucratic grounds were removed.Education Secretary Nicky Morgan said: \"We promised to remove delay and frustration from the process for both children and adopters.\"The figures show that we are delivering on that promise. The system is working more quickly, as well as providing more support to families after an adoption has taken place.\"However, adoption charities say more support is required to find homes for older children after the Department for Education figures revealed 80% of adoptions in the year to the end of March were for the children aged four and under.Andy Elvin, head of fostering and adoption charity Tact, said: \"The statistics show the rise in adoption figures is almost entirely due to an increase in the number of one to four-year-olds adopted.\"Numbers of adopted children older than this have remained static since 2010. \"This shows that the government's adoption reforms are not having an impact upon most children in care.\"Children and families minister Edward Timpson, who has two adopted brothers, said: \"It's great to see that the number of children adopted from care has risen to the highest level yet.\"However, we refuse to be complacent and we know there is more to be done.\"The statistics also showed the total number of children in care rose to 68,840 last year, an increase of 7% on 2010 levels."}