{"author":"By Antoinette Radford","title":"Austria's far right walks out of Zelensky speech","news_category":"general","content":"This video can not be playedAustria's far-right walks out of Zelensky speech (courtesy: Vorarlberger Nachrichten \/ Maximilian Werner)More than 20 far-right Austrian MPs walked out of parliament during a speech by Ukrainian President Volodymyr Zelensky.The politicians from the Freedom Party (FPÖ) argued Mr Zelensky's speech violated Austria's neutrality.They warned ahead of the speech they would hold some form of protest against the address.Austria has previously said it cannot help Ukraine's defence militarily, but does support Kyiv politically.In a video address, Mr Zelensky thanked Austria for its humanitarian assistance and help clearing land mines. He was speaking on the 400th day of Russian invasion.He also invited MPs to travel to Ukraine for themselves and see the destruction caused.The president of Austria's lower house of parliament, Wolfgang Sobotka, pledged more financial and humanitarian assistance to Ukraine and said the country deserved Austria's solidarity.But as Mr Zelensky spoke, a group of politicians walked out and left placards on their desk with the party logo that read \"space for neutrality\" and \"space for peace\".There are 30 FPÖ politicians in Austria's lower chamber and they were the only party to oppose Mr Zelensky's address. However, a number of MPs from the centre-left Social Democrats were also missing from the chamber.The Freedom Party has prompted anger in the past for its pro-Russian stance. In 2018, when the FPÖ's Karin Kneissl was foreign minister,she was criticised for dancing with President Vladimir Putin at her wedding <https:\/\/www.bbc.co.uk\/news\/world-europe-56280898>.Of the five parties in Austria's parliament, they hold the third largest number of seats in the lower house. They have previously been part of Austria's government.Austria's \"permanent neutrality\" has been part of its constitution since 1955.The law states <https:\/\/www.ris.bka.gv.at\/Dokument.wxe?Abfrage=Erv&Dokumentnummer=ERV_1955_211> \"Austria will never in the future accede to any military alliances nor permit the establishment of military bases of foreign states on her territory\"."}