{"author":"By Callum Tulley","title":"Young carers 'average £12,000 of unpaid work a year'","news_category":"general","content":"Young carers spend an average of 25 hours a week looking after loved ones, new research suggests.Their unpaid work is the equivalent of £12,000 a year on a part-time carer's wage, says Action for Children.Describing it as a \"hidden child workforce\", the charity says the amount of responsibility being placed upon children is \"appalling\".The Department for Education says young carers \"should be protected from excessive caring responsibilities\".The pressures of being a young carer <https:\/\/www.bbc.com\/newsround\/35420196>'I missed four weeks' school a year caring for my sick mum'  <https:\/\/www.bbc.co.uk\/news\/education-48594091>A survey of 383 young carers aged between seven and 18 by the children's charity, found their care equated to around £240 a week.There were 491,000 carers aged 24 or younger in the UK, according to the 2011 census.\"I can't be a normal child,\" says Chloe, 16, from Birmingham.She started caring when she was 10 and looks after her mum, who has mental health problems and a lung condition, as well as her dad.\"I do medication for my mum. I do housework. With my younger brother and sister, I do their breakfast and get them ready for school.\"It has made me mature, but it has taken away my childhood. Instead of being out - and being able stay out - I have to come and make sure my mum is taking the medication at the right time.\"Chloe says there have been times when caring has become \"too much\", saying she has suffered with depression.\"I was the mum for her, but she's meant to be my mum. I felt that I had no one.\"Chloe is now getting support from children's charity Spurgeons, but she wants the government to do more for people in situations like hers.\"They allow us to do their work for them and they just turn a blind eye to us,\" she says.\"At times it's frustrating but I have to get on with it because it's not going to change.\"Action for Children is calling on the government to give all young carers access to respite service.It says current provisions are \"patchy\", despite the services being a \"lifeline\" for some young carers.The charity's deputy chief executive, Carol Iddon, says the fact young carers exist at all is \"a sad indictment of our situation\".\"I hear people saying, 'Oh, come on, kids needs to do chores', but this isn't about that. This is about young children taking on quite an adult role and it isn't acceptable.\"In response to the survey, the Department for Education said young carers \"should be protected from excessive caring responsibilities\".\"We expect adult and children's services to work together and take a whole family approach in identifying and supporting young carers.\"Suzanna Salter, from St Ives, Cornwall, relies on care from her 11-year-old daughter Marissa.Suzanna has back problems made worse by a car accident, as well as a lung disease.\"I feel guilty, as if I'm not letting her have a childhood,\" she says. \"It's horrible. She shouldn't have the level of responsibility that she has. She is a child doing an adult job.\"Suzanna says she gets eight hours of care per week on the NHS, adding: \"That is the only time Marissa doesn't have to be on call for me.\"Marissa has missed around a quarter of her school classes in some academic years due to her responsibilities as a carer.She says: \"I love my mum and want to help her but I think we need more support.\"In the mornings I have to get her out of bed, help her put her socks on, and make her coffee.\"I also do the washing up, help with cleaning and the laundry and cooking. And I walk down to the shops to do the shopping because mum isn't supposed to lift anything.\"I also get upset sometimes because I go online and see all my friends are going to places that I want to go to and they haven't told me about it because they know I can't go.\"Follow the BBC's Victoria Derbyshire programme on Facebook <https:\/\/www.facebook.com\/VictoriaDerbyshire> and Twitter <https:\/\/twitter.com\/VictoriaLIVE> - and see more of our stories here <https:\/\/www.bbc.co.uk\/programmes\/b05qqk5c\/clips>. "}