{"author":"","title":"Virgin Orbit: First UK space launch from Cornwall faces delay","news_category":"general","content":"We're going to have to wait a little longer to see the first ever orbital space launch from UK soil.Sir Richard Branson's Virgin Orbit company had pencilled in next Wednesday for the historic Cornwall flight, but it is now going to slip until after Christmas.The firm has cited technical and regulatory challenges in getting ready for the launch.Neither Virgin Orbit nor its passenger satellites have yet been licensed.Everyone involved in a launch has to seek permission for the activity from the Civil Aviation Authority (CAA).Dan Hart, the company CEO, said in a statement: \"With licences still outstanding for the launch itself and for the satellites within the payload, additional technical work needed to establish system health and readiness, and a very limited available launch window of only two days, we have determined that it is prudent to retarget launch for the coming weeks to allow ourselves and our stakeholders time to pave the way for full mission success.\"Virgin Orbit, which is based in California, uses a modified jumbo jet to run its space launch service.The operation is conducted out over the ocean, far from land and above the weather.The 747, nicknamed Cosmic Girl, carries a rocket under its left wing to an altitude of about 35,000ft (10km), where it drops the liquid-fuelled booster into a freefall.Roughly four seconds into that fall, as the jumbo banks hard to the right, the rocket, known as LauncherOne, ignites its first-stage engine to begin the climb to orbit.The mission planned to start from Cornwall Airport Newquay has nine small satellites on its manifest. These spacecraft have already been attached to the top of LauncherOne.At the beginning of 2022, there was high expectation that the first UK space launch would occur at some point during the year. Back in January the talk was of the Virgin flight happening in September.But the complexities, particularly to do with regulatory matters, have inevitably pushed things to the right.Virgin Orbit had published at the end of November what's called a Notam (Notice to Airmen), which would have restricted airspace in the Atlantic next week to make way for its activities. This warning will now be taken down.A new one will be posted when the company is finally ready to run the mission. However, there is a mandatory two-week gap from when a new notice is given to when a launch can occur. This gives us an indication of how long the current delay is likely to be.With licences still pending and the holiday season upon us, sometime in January looks to be the earliest a flight could occur - assuming all outstanding details can be put in place.Melissa Thorpe is head of Spaceport Cornwall. She told BBC Radio Cornwall that some pre-flight tests had not gone quite as expected.\"It was a bit of a down day yesterday to say the least, but it is the right decision and it is not a question of 'if' but 'when',\" she said.\"We would rather wait to get the licence across the line, get the tests exactly where Virgin want them to be, have everybody have a Christmas Day with their families - and as soon as we are able after Christmas we will get back to that launch window.\"And she added: \"It is just weeks away; we are not taking our foot off the pedal at all.\"The CAA made it clear that there was no connection between its licensing process and the technical issues experienced by Virgin Orbit.\"The UK space regulation process is not a barrier to a UK space launch,\" said Tim Johnson, the authority's director for space regulation.\"Virgin Orbit has said in its statement this morning that there are some technical issues that will need to be resolved before launch. These in no way relate to the timing of when a licence will be issued by the Civil Aviation Authority.\"Effective licensing forms an integral part of UK space activity. Spaceport Cornwall's licence already permits Virgin Orbit to undertake its testing programme prior to launch. Our dedicated team has been working closely with all partners to assess applications and issue the remaining licences within the timelines we set at the outset.\"The CAA's goal is to process a licence for a rocket operator within nine to 18 months of receipt of the application. The authority is still within this period in the case of Virgin Orbit.The Cornwall mission, when it finally does take place, will be a big moment for the UK, as it seeks to turn itself into a hub for the launch of small-sized European spacecraft.Internationally renowned for making satellites of all sizes, the UK's space industry has always had to send its products to foreign spaceports to get them into orbit.Adding a launch capability means the sector will in future be able to do everything from first design through to mission operations.Plans are also progressing in Scotland for rocket launches in the county of Sutherland and from Shetland."}