{"author":"","title":"Twitch starts banning users over abuse","news_category":"general","content":"The game streaming site Twitch says it has started banning users following protests about abuse.In a statement online <https:\/\/blog.twitch.tv\/en\/2020\/06\/24\/an-update-to-our-community\/> the streaming giant said it has \"prioritised\" dealing with the \"most severe cases\" of sexual abuse.It says it's assessing cases \"as quickly as possible\", and will be issuing permanent suspensions to some users.Dozens of women have recently claimed they have been sexually assaulted by people in the gaming industry.Streamers across the world had avoided Twitch on Wednesday to bring this to the attention of the company's bosses.Twitch hasn't revealed which users have been banned but on Thursday Brad Jolly, who streams as BlessRNG, was missing from the site among others.He had previously released a statement after he was accused of sexual abuse. He said: \"I without thinking straight did abusive things, and I hate that I did.\"Hold abusers accountable. That includes me.\"Twitch says it encourages anyone with relevant information to come forwards to help them review accusations.It said: \"We are reviewing each case that has come to light as quickly as possible, while ensuring appropriate due diligence as we assess these serious allegations.\"In many of the cases, the alleged incident took place off Twitch, and we need more information to make a determination.\"In some cases we will need to report the case to the proper authorities who are better placed to conduct a more thorough investigation.\"Streamers argued that Twitch hadn't acted quickly enough on abuse claims, as well as banning streamers who used racist or homophobic language.The streaming site says it's also working to improve the technology that picks up offensive language in usernames and messages, and wants to make a \"safer environment\".It thanked those who came forward with stories of assault for their \"strength, vulnerability, and bravery\".Follow Newsbeat on Instagram <https:\/\/www.instagram.com\/bbcnewsbeat\/>, Facebook <https:\/\/www.facebook.com\/bbcnewsbeat\/>, Twitter <https:\/\/twitter.com\/BBCNewsbeat> and YouTube <https:\/\/www.youtube.com\/channel\/UCe1Ef-K5jpnRsmVY5hCBhOw>.Listen to Newsbeat live <https:\/\/www.bbc.co.uk\/sounds\/play\/live:bbc_radio_one> at 12:45 and 17:45 weekdays - or listen backhere <http:\/\/www.bbc.co.uk\/programmes\/b006wkry\/episodes\/player>."}