{"author":"","title":"Christopher Alder death: Vigil to mark anniversary","news_category":"general","content":"A vigil has been held to mark the anniversary of the death of a Hull man whose body was found 11 years after his family thought they had buried him.Christopher Alder, 37, choked to death at Hull's Queen's Gardens police station after his arrest in 1998.He was believed to have been buried in 2000 at Northern Cemetery but his body was found in a mortuary last November.His sister Janet said: \"The respect that he wasn't showed in life and death should be remembered.\"The public vigil was held outside the police station to mark the 14th anniversary of Mr Alder's death.Ms Alder said: \"People have come from all over the place, from Hull, from London, from Preston. Other families that have lost people in these circumstances have come to support us.\"I'd like people to remember Christopher, to remember what happened, because only by remembering what's happened can you change things and have this not happen again to anybody else.\"South Yorkshire Police is investigating a mix-up that led to the body of a woman, Grace Kamara, being buried in Mr Alder's grave.Ms Alder said: \"We still don't have answers to how he died when he did and then to find 13 years later, when we believed that we buried him, that his body's been lying in a mortuary for all these years, it beggars belief really.\"What we need is a full public inquiry into how something like this can happen to an ex-paratrooper in the way that it has and how nobody has been held accountable.\"The family deserve justice.\"Ten years ago, a coroner's jury decided Mr Alder was unlawfully killed and misconduct and manslaughter charges were later brought against five Humberside Police officers.They were acquitted of all criminal charges in 2002.In 2006, an Independent Police Complaints Commission report said four of the officers present in the custody suite when Mr Alder died were guilty of the \"most serious neglect of duty\".Humberside Police Chief Constable Tim Hollis apologised at the time, although the Police Federation said the officers involved \"strongly disputed\" the report's conclusions."}