{"author":"By Douglas Fraser","title":"Rental health: Scotland's landlords versus the rent freeze","news_category":"general","content":"It's April, so the rent freeze must have defrosted. For six months, it has been in place across private rental housing in Scotland, intended to help hard-pressed household budgets get through a winter of high energy and food bills.That affects one in seven Scottish households. The Private Rented Sector more than doubled in size between 1999 and 2019, to 340,000 homes.That has been due to a shortage of social housing, the high barriers to getting into home ownership, and a change in lifestyle choices by younger adults.A century after council housing began to replace privately-owned slums, with landlords notorious for their treatment of tenants, that has gone partly into reverse.The private sector has become necessary to handle Scotland's housing shortage. With rising property values and a stream of income, it became an attractive investment for small-time landlords.But owners find a growing list of costs and reasons to exit the sector. There are warnings from property specialists that a worsening imbalance between demand for homes and the number of units available will only increase rents.For the next six months, rent increases in the Private Rented Sector (PRS) will be limited to 3%, and under specific and limited circumstances, that can go up to 6%.Social housing, including councils and housing associations, saw the rent freeze defrosted in February, but controls still remain.Housing campaigners say the freeze has been a valuable short-term measure, but it hasn't worked entirely as intended. Rents have been able to rise if tenants agree. Why would they? It's claimed some landlords are giving tenants an offer they can't refuse: Accept a rent rise now or face a much bigger increase or eviction when the law is relaxed.More significant is the build-up of backlogged evictions. Legal action can be taken when tenants reach a threshold of arrears, and there are non-financial reasons for evicting tenants, including illegal activity. The caseload in courts is up, so more evictions can be expected towards the end of this year, when the eviction ban is due to be lifted.The tenants' rights minister, Green co-leader Patrick Harvie, is planning new legislation later this year. He says it will address some of the restrictions tenants face, allowing them to keep pets and decorate their homes.The tenant rights and campaign group Living Rent wants to see a stronger enforcement mechanism on maintenance and repairs. That has become a more significant issue in the past year of sky-high heating bills. The private rented sector has much of the worst quality housing stock in Scotland, and many of those flats and houses - rural and urban - have poor insulation and inefficient heating systems.But the big issue is rent. The average rent in Scotland has gone up by nearly 5% in the year to February. That's faster than any other part of the UK.As most rents are held down, that reflects a higher rate of inflation - above 10% - in advertised rates for new tenancies. These don't have rent controls on them, so they reflect rising costs, landlords wishing to get ahead of rent controls and, above all, a shortage of supply.It's not just that rents have been rising, but it's become more of a scramble to get a tenancy. The average time between advertising and signing a tenancy agreement has fallen in less than two years from 35 days to 16 days. It takes longer for bigger homes, but for one and two-bedroom flats, which is most of the market, more than 40% of tenancies are signed up in less than a week.Those factors help explain why it remains so attractive to get on the property housing ladder. At an information session at Edinburgh Solicitor's Property Centre this week, NHS radiotherapist Sophie Brown explained that she got lucky with a city centre tenancy at a good price during the pandemic, but friends and colleagues have not been so fortunate:\"A lot of friends say their prices have gone up recently, which has forced them to move and buy. I've heard of a lot of people who have had to go into big shared houses to make the prices more affordable. A lot of people who are renting say they can't afford to stay in the same conditions, so they've had to move somewhere else to get it cheaper, so they can save to buy somewhere.\"Elizabeth Doyle commented: \"I'm fortunate to have been staying with my family, but I want to break away and have my own place. What I'm finding in the market is (the problem of) affordability. I've looked into shared ownership, but that's proving to be very difficult, because of the affordability of the rent plus the mortgage as well\".In its 24 years, the Scottish Parliament has been quite active in reform of tenants rights, most of them shifting the balance of power in favour of tenants. Seven years ago, legislation brought in new tenancies which made it hard if not impossible to evict someone without good reason.Rent increases and other disputes can be taken to tribunals. And landlords cannot arbitrarily withhold deposits when tenancies end. They are lodged in deposit protection schemes, and disputes about them handled more fairly.England is heading in a similar direction on tenancy reform, but as it does so, the BBC has been highlighting some harsh examples of the way evictions continue to work south of the border.In Scotland, the problem is about availability of homes for rent, particularly in rural housing <https:\/\/www.bbc.co.uk\/news\/uk-scotland-highlands-islands-64785851>. The boom in short-term lets, such as AirBnB, has taken up housing stock, notably in tourism hot spots from Edinburgh to Skye, and regulation of that sector may see it decline, leaving more homes for longer-term rent. Even where city housing seems plentiful, those rising rents are the issue, because of the imbalance between supply and demand.So how could rent controls solve that problem? Short-term, the six-month freeze and continuing 3% ceiling on rent increases are an effective tool to relieve pressure on household budgets. Rent controls could take a different shape with forthcoming legislation. If not a percentage cap, then an inflation-linked cap, or they could be targeted at lower income homes or rent rise hot spots.Patrick Harvie wants a national scheme, and promises draft legislation by early autumn, taking in the views of tenants and landlords.The views of landlords are strong. The controls being used this year mean they absorb rising costs. That puts a squeeze on profits, which may not get much sympathy when it can be perceived as 'unearned income', but it is expected to have a detrimental effect on the market.They are facing much higher borrowing costs since interest rates started their rise to the 4.25% Bank of England base rate. Regulation has piled up, much of it to ensure safety for tenants, but that comes at a cost. The Treasury opted to phase out mortgage tax relief, making ownership for renting a lot less lucrative. And now... rent controls.David Alexander, founder and boss of DJ Alexander, which includes an agency for managing 1200 homes in Scotland on behalf of landlords, says some are choosing to cash in and put their investment into other assets. For every one client he signs up, he says three are exiting the market.\"We've got to look at building more homes. There are hundreds of thousands of people waiting for a council house. We have got to build more homes.\"Then we need to accept the private rented sector actually helps rather than hinders. But there seems to be this pre-conceived idea in government that the private rented sector is a blight on society - causing the problem when it is potentially the answer to the problem.\"If we encourage more people to come into the market, if we produce more stock, rents will control themselves. It's pretty simple thinking.\"In theory, those flats being sold by landlords could lower the entry level for home ownership, and renters become owners. But David Alexander doubts it: \"That isn't possible. There's a number of people who can't afford to buy. There's a number of people who actually want to rent.\"So thinking that if they take these properties out the market and they go back to home ownership, that there'll be no rental market, I'm afraid really is simplicity and a bit of a knowledge vacuum.\"So if we think about a long term plan - about 10 or 15 years, because we can't build houses tomorrow - if there was cross-party agreement to say: Okay, we've got an ageing population, we've got more single family homes, there's an acute shortage, and it's only going to get worse - if we can provide more housing, that surely should help remedy the situation.\"It would encourage more private landlords, encourage more build-to-rent investors, who shy away from Scotland because of its uncertainty - because of rent controls, because of the eviction ban.\"If you're faced with a development in Manchester or Glasgow, the majority of people I speak to say they wouldn't even consider Glasgow because of these factors. So let's turn the dial, encourage people to invest, let's get more stock out there and that will help resolve the problem.\"Build To Rent (BTR) is common in other countries, it's a growing feature of housing in bigger English cities, but it's new-ish to Scotland. Instead of small-scale landlords, typically owning a small number of flats, this involves big institutional investment funds, erecting new blocks, which can be efficiently maintained, all intended for private rental, with the finances based on a revenue stream from rents.There are such projects already opened in Edinburgh Park and the capital's Fountainbridge. On a prominent site next to the M8 Kingston Bridge in Glasgow, 400 units are being built, with permission for another large BTR block next to it.John Boyle, director of research at Rettie property agency in Edinburgh, says there are nearly 17,000 such homes in the planning and construction pipeline. Roughly 2,000 are complete and being occupied, while 6,000 have planning permission, but construction has not begun.Such a delay is not uncommon. It may be because of stickier finance. But John Boyle points to the threat of rent controls as one reason why projects are being stopped.\"Glasgow and Edinburgh are very attractive for BTR investment,\" he says. \"The traffic lights system - size of rental sector, the socio-economics, demographics - they light up green when they do their criteria analysis.\"But if you've got cities that have rent control, and maybe changing rent control regimes over time, against cities in other parts of the UK which don't have rent control, then the funds are going to look at those without the rent controls more favourably. So the investment is not going to happen.\"Political risk is not new to Scotland, he adds: \"Independence, from an institutional fund perspective, creates uncertainty about future taxation, future legislation and particularly around future currency.\"You buy your asset in sterling: what's your rent roll going to be in a few years time? And what happens if that currency depreciates significantly against sterling? Then you've got an exposure to deal with.\"The independence cause can be defended with Scotland's strong performance, relative to other parts of the UK outside London, at attracting foreign direct investment, at least in other sectors. The concern about change of constitution and currency is more often to be heard in the property sector.\"Scotland had a risk premium anyway,\" continues John Boyle. \"That's been elevated by the rent freeze, and a cap from the end of March. For the funds, the arbitrary nature of that, and the quite extreme nature of it, have spooked a number of the funds, including those that have sites in Scotland, and they've decided to put them on hold for a period of time.\"With a national system of rent controls coming in 2025, that's part of the SNP-Green pact, which will be continuing under the new First Minister, that also causes some trepidation amongst the funds. It's not that they're against any form of rent control, but they want to feel engaged and consulted with... and they have not felt that.\"At Holyrood, the minister, Patrick Harvie, says he wants to \"deliver a private rented sector that protects tenants' rights while encouraging responsible landlords\".\"The best way to deliver a strong rented sector is to build more affordable homes,\" says the Glasgow MSP. \"Scotland leads the way in this area, having delivered 118,124 affordable homes since 2007, with 83,291 of these for social rent. We're now working towards our target of delivering 110,000 affordable homes by 2032, of which 70% will be for social rent.\"The social rented sector was also alarmed at the implications for raising finance when the rent freeze was announced. Reaching such new home building targets has not been made any easier."}