{"author":"","title":"Pokemon Go players banned for cheating","news_category":"general","content":"The creators of Pokemon Go have announced they've punished more than five million players for cheating.In a blog post <https:\/\/nianticlabs.com\/blog\/cheatingupdate-022321>, Niantic said it issued sanctions to players across three games - Pokemon Go, Ingress, and Harry Potter Wizards Unite.It said since 2020, more than 20% of those were permanent bans.\"We have made a commitment with all of our players towards promoting fair gameplay...and improving transparency with our players,\" the creator wrote.The three popular games all use augmented reality to combine gaming with the real world.A list on the Niantic website refers to cheating as being things such as GPS location spoofing - which is falsifying locations.That can mean using hacked or unofficial programs, letting users trick the game over its location.So players can play these games from the comfort of their own homes - without actually needing to go outside or to a certain location.Due to the pandemic, Niantic made changes to the games to make it easier to play at home last year, withsome of those <https:\/\/nianticlabs.com\/blog\/pokemon-go-changes\/> now reversed.In what it called \"quite encouraging\", the developer said that over 90% of players stopped cheating after receiving a warning from the company.This video can not be playedThe cheat hackers ‘ruining’ gaming for others\"We continue to find the right balance between punishing casual cheaters versus the more egregious ones.\"The company said they were \"committed to ensuring fair gameplay\".\"We have invested in new and emerging technologies, while continuing to grow our team.\"\"We are continuously working to combat these cheaters and focus on improving our detection and enforcement, as they have no place in our games,\" Niantic added.Follow Newsbeat on Instagram <https:\/\/www.instagram.com\/bbcnewsbeat\/>, Facebook <https:\/\/www.facebook.com\/bbcnewsbeat\/>, Twitter <https:\/\/twitter.com\/BBCNewsbeat> and YouTube <https:\/\/www.youtube.com\/channel\/UCe1Ef-K5jpnRsmVY5hCBhOw>.Listen to Newsbeat live <https:\/\/www.bbc.co.uk\/sounds\/play\/live:bbc_radio_one> at 12:45 and 17:45 weekdays - or listen backhere <http:\/\/www.bbc.co.uk\/programmes\/b006wkry\/episodes\/player>. "}