{"author":"By Frank Gardner, security correspondent & Adam Durbin","title":"Turkey approves Finland Nato membership bid","news_category":"general","content":"Finland will become the 31st member of Nato after Turkey's parliament voted to approve its application.Turkey had delayed Finland's bid to join the West's defensive alliance for months - complaining the Nordic nation was supporting \"terrorists\".Sweden, which applied to join Nato at the same time last May, is still being blocked by Ankara over similar complaints.Any Nato expansion needs the support of all its members. Finland will now be formally admitted into Nato at its next summit, taking place in July in Lithuania.Nato Secretary General Jens Stoltenberg said on Twitter <https:\/\/twitter.com\/jensstoltenberg\/status\/1641716848688349185?s=20>: \"I look forward to raising Finland's flag at Nato HQ in the coming days. Together we are stronger and safer.\"In a statement following the Turkish vote, the Finnish government said joining the alliance would strengthen the country's security, and improve stability and security in the region.\"As allies, we will give and receive security. We will defend each other. Finland stands with Sweden now and in the future and supports its application,\" Prime Minister Sanna Marin wrote on Twitter.Turkish President Recep Tayyip Erdogan gave his approval to Finland's bid earlier this month, praising the country's \"authentic and concrete steps\" on Turkish security.But his ongoing hostility to Sweden was clear - as he again accused the country of embracing Kurdish militants and allowing them to demonstrate on the streets of Stockholm.Ankara's decision to ratify Finland's membership clears the way for one of the most important moments in Nato's recent history.Finland, a country with a 1,340km (832 mile) border with Russia and one of the most powerful arsenals of artillery pieces in Western Europe, is ditching its neutrality and joining the alliance in response to Russia's full-scale invasion of Ukraine.Sweden also abandoned a longstanding commitment to neutrality in applying to join Nato, but unlike its neighbour it does not share a border with Russia.One of Nato's founding principles is the principle of collective defence - meaning an attack on one member nation is treated as an attack on them all.For Russian President Vladimir Putin, Finland's accession is a major strategic setback.He sent his army into Ukraine last year in the expectation it would check Nato's expansion and weaken the West. In fact, it has achieved the exact opposite.Finland is now set to become the seventh Nato country on the Baltic Sea, further isolating Russia's coastal access at St Petersburg and on its small exclave of Kaliningrad.Russia's foreign ministry earlier condemned Finland's decision, saying it was ill-considered and based on Russophobic hysteria.But Finnish public opinion has been radically altered by Russia's invasion of Ukraine. Almost overnight last spring, support for Nato membership leapt from an underwhelming one-third of Finns to almost 80%.Finland simply believes it stands a better chance of not being attacked by Russia if it joins the alliance."}