{"author":"By Mark Savage","title":"BBC Introducing cuts would make UK music poorer, industry leaders say","news_category":"general","content":"Artists and music industry trade bodies have expressed \"grave concerns\" over proposed cuts to BBC Introducing.Established in 2007, Introducing gives aspiring musicians the chance to be heard on their local BBC radio station.It has helped launch the careers of artists like Florence + The Machine, Ed Sheeran, Little Simz and Lewis Capaldi.But proposed cuts to local radio mean the 32 regional Introducing shows that are currently on air could be cut to 11, presenters have been told.The BBC has yet to formally announce any changes, but said on Wednesday it wouldcontinue to broadcast Introducing programmes <https:\/\/www.bbc.co.uk\/mediacentre\/2023\/bbc-plans-modernise-local-services> \"as part of our schedule on Thursday and Saturday\", while \"giving more prominence to new music\" elsewhere on the schedule.It did not confirm how many of the regional shows would remain on air.The broadcaster is currently going ahead with plans to \"reshape local services\", which it says will boost online content and \"help us connect with more people in more communities right across England\".Rumours about the future of Introducing began to circulate last week, when it was claimed the presentation teams had been put on redundancy notice.\"We're all a little bit nervous and frightened,\" says Abbie McCarthy, whose Introducing show on BBC Radio Kent has given early exposure to acts like Everything Everything, Soft Play, Venbee and Mimi Webb.\"We currently have 32 shows around the UK, but it's looking like that number is going to be severely slashed. They haven't been locked in as of yet, but we're doing our best to to fight them.\"\"Regional diversity is integral to balance within the industry,\" said Mercury Prize-shortlisted band Yard Act on Twitter <https:\/\/twitter.com\/YardActBand\/status\/1615337453606547461>. \"Removing local shows presents less opportunities for local voices to break through nationally.\"\"BBC Introducing is a crucial pipeline for anyone trying to break into the industry without the backing of a major label or financial backing of their own,\"added Welsh singer-songwriter Catherine Anne Davies <https:\/\/twitter.com\/The_Anchoress\/status\/1614328386335248389>, who performs as The Anchoress.\"Without it, music will become ever more the preserve of the privileged few. It's vital it continues.\"BBC Radio 6 Music presenter Tom Robinson has urged listeners to voice their support for BBC Introducingon his personal website <https:\/\/freshonthenet.co.uk\/backbone\/>, and is publishing the responses - almost 6,000 in total.They have been backed by the music industry, which has called for reassurances about the future of Introducing.A group of 13 organisations, including the Association of Independent Music, the Music Managers Forum and the Music Venue Trust, have written an open letter to BBC chairman Richard Sharp.\"We want to impress on you very strongly that this would be a fundamental blow to the health of the entire grassroots sector,\" they wrote.\"New and emerging artists already face significant obstacles to breaking into the music industry, challenges that are amplified for those artists and musicians living outside of the major cities.\"Whatever reorganisation might be required to meet the demands of the future stability and viability of the BBC, it should not be the case that BBC Introducing is the unintended victim of those changes.\"The BBC announced a significant number of cuts to its local radio services <https:\/\/www.bbc.co.uk\/news\/entertainment-arts-63455192> last October, with many stations merging their output after 6pm, and one \"all-England\" show from 10pm across the week.In a statement, the corporation said the new schedules \"will not compromise the essence of BBC Introducing\".However, it added: \"We need to acknowledge the changing listening habits of audiences and the intention is to reach even more people.\"Every local radio station has a place on BBC Sounds which has a fixed Introducing slot featuring prominently with more content than radio schedules could ever accommodate.\"We also regularly feature Introducing tracks and artists on breakfast shows and that will continue, too.\""}