{"author":"By Stephen Dempster","title":"Bloody Sunday: Sir Hugh Orde questions investigations","news_category":"general","content":"Former PSNI chief constable Sir Hugh Orde has questioned whether the UK needs to continue investigating Bloody Sunday.Sir Hugh queried whether the state is still obliged to pursue the matter having already investigated it at some cost and length.Members of the Army's Parachute Regiment opened fire on civil rights demonstrators in Londonderry in 1972, killing 13 people.A fourteenth person died later.The Police Service of Northern Ireland (PSNI) began a murder investigation after the Saville Report on the killings in 2010 said that those who were killed or injured on Bloody Sunday were innocent.Sir Hugh's comments come as the families of the Bloody Sunday victims wait to hear if any of the 18 ex-paratroopers being investigated will face charges.There have been a number of investigations into the deaths, including the Widgery Tribunal - which was later described by some as a whitewash - and the Saville Inquiry, which in 2010 led to Prime Minister David Cameron apologising to the Bloody Sunday families <https:\/\/www.bbc.com\/news\/10320609>.The Saville Inquiry lasted eight years and cost over £190m.Sir Hugh, who was PSNI chief constable from 2002 to 2009, was speaking in the context of whether or not prosecutions for Troubles' murders are still possible as time moves on.He said he feels there is no chance of a conviction in most cases and believes people have to start having honest conversations about legacy issues.\"I'm very clear that after 50 years the chances of getting to a standard that allows a prosecutor to stand over a case, and say 'we should prosecute this,' is extraordinarily low,\"Sir Hugh told BBC NI's Spotlight programme. <https:\/\/www.bbc.co.uk\/iplayer\/episode\/b0bjftvf\/spotlight-11092018>\"The chances of a realistic prosecution from a case 50 years ago is highly, highly unlikely.\"He continued: \"Take, for example, Bloody Sunday. There were two investigations. Widgery - described as (an) obscenity of course.\"We had the massive ongoing, hugely expensive inquiry by Saville into Bloody Sunday. We had the prime minister apologising for the behaviour of soldiers on that day.\"There have been investigations into individual soldiers, none of which have succeeded and we're now investigating it all over again.\"I do question what that delivers and whether we have a continuing obligation as the state to yet again investigate members of a parachute regiment after so much time.\"When asked to clarify if he was saying the current criminal investigation into 18 soldiers should stop, Sir Hugh said: \"No, I'm saying has the state discharged its duty in relation to that case?\"One could argue it's done an awful lot.\" He added: \"If I was the chief constable, I would want to be persuaded that there was still a realistic chance of prosecuting someone if I was going to invest that amount in that case because if I'm doing that I'm not investing that amount of police resource in current cases where we have, you know, victims of the day who will be asking for a police response.\"However, Sir Hugh also said you cannot just draw a line under the past, but new ways of dealing with it must be found because, in his judgement, police investigations will not now work.The UK government currently has new proposals out for public consultation <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-45421930> that, if agreed, would create a new historical investigations unit to replace the Historical Enquiries Team (HET); an information commission where former paramilitaries and others could provide information with immunity; and an oral history archive for people to tell their stories of the conflict.Victims and politicians continue to object to elements of the proposals.The Northern Ireland Office was asked about the view that there is continuing political delay in dealing with legacy issues but did not respond to this point.You can watch the BBC Spotlight programme <https:\/\/www.bbc.co.uk\/iplayer\/episode\/b0bjftvf\/spotlight-11092018> on the iplayer."}