{"author":"","title":"Birmingham Airport delays: Woman, 87, misses flight when staff 'fail to help'","news_category":"general","content":"A woman was left \"in tears\" after missing her flight when staff failed to help her board, her son said.Sheila Margaret Cottrill, 87, from Nuneaton, Warwickshire, had booked a flight with assisted passage to visit son Jeremy in Barcelona.But they said she missed her flight due to a shortage of specialist drivers to help those with mobility problems.Birmingham Airport said it will look into the circumstances of anyone who missed their flight.Mrs Cottrill was travelling to visit her son who lives in Spain as the two have been separated throughout the pandemic, and had booked her flight six months prior, with assisted passage to make her travel easier.She arrived at Birmingham Airport three hours before her Ryanair flight on Sunday.She was taken through security by assisted passage staff and left close to her gate, being told someone would return to aid with her boarding, her son said.His mother waited and was forced to watch the flight leave, and only after the plane had departed, Mr Cottrill said, was she told there had been a shortage of \"Ambulift\" drivers to assist her aboard.After arranging a flight for the following day, he said, Mrs Cottrill again arrived three hours early and was taken through security by assisted passage staff and was told they would be with her 45 minutes before her flight.However, when she saw her flight announcing last call was was forced to stop a member of staff who took her to her gate.Again Mr Cottrill said, there were no specialist drivers available, but his mother decided she would leave her wheelchair and do her best to walk to the plane, assisted by the staff member carrying her case.He said the delay had cost them several taxis, a missed day's holiday and left his mother in tears.\"She tried to do the right thing by airline, the airport and herself. \"Help is supposed to be there for disabled people... there was a total lack of care and sympathy.\"Mr Cottrill said he has put in a complaint to both the airport and Ryanair.Mrs Cottrill added: \"I was very upset obviously... It has put me off ever doing it again.\"Birmingham Airport said it is awaiting detail on Mrs Cottrill's experience so it can investigate accordingly.Ryanair said wheelchair services at the airport are operated by an organisation within the airport and it was that service which failed to assist Mrs Cottrill.\"As a gesture of goodwill, Ryanair reaccommodated Ms. Cottrill on the next available flight from Birmingham to Barcelona the next evening at 20:50, 2nd May free of charge,\" the firm said.Air passengers have faced chaos in recent weeks, with flights cancelled and long queues at airports, including at Birmingham, with travellers reporting being forced to wait for several hours to pass through security and passport checksTransport Secretary Grant Shapps has said airlines \"underestimated how much demand there will be\", and a rise in coronavirus cases \"would have caused problems\" with \"a lot of people\" off work.Follow BBC West Midlands on Facebook <https:\/\/www.facebook.com\/MidlandsBBC\/>, Twitter <https:\/\/twitter.com\/bbcmtd> and Instagram <https:\/\/www.instagram.com\/bbc_midlands\/?hl=en>. Send your story ideas to: newsonline.westmidlands@bbc.co.uk <mailto:newsonline.westmidlands@bbc.co.uk>"}