{"author":"By Jennifer Harby","title":"Paramedics could not tell deaf Derby widow her husband had died","news_category":"general","content":"A deaf woman is calling for ambulance crews to learn basic sign language after paramedics were unable to tell her that her husband had died.Elizabeth Corbett was at work when she received a distressed video call from her children to say her husband David, 51, had fallen ill.By the time she got home, paramedics had arrived but could not explain to Mrs Corbett what had happened.East Midlands Ambulance Service (EMAS) said it was deeply sorry.Mrs Corbett, 43, from Chellaston in Derby, eventually learned of her husband's death via a video call to her employer.She said: \"David had been mowing the grass and had sat down for a cool drink with the children when he suddenly stopped talking.\"At first the kids thought he was joking - because he was a big joker - but then they started to panic when they couldn't wake him up.\"They contacted me and I told them to ring for an ambulance, while a colleague drove me home.\"The children were amazing, they performed CPR until the paramedics arrived.\"But when I got there the kids were stood on the lawn crying and the emergency services wouldn't let me in the house.\"Not one of them could communicate with me and I couldn't explain who I was.\"I wanted to know what was happening and the police were asking me questions, but they were all wearing facemasks so I couldn't tell what they were saying.\"Eventually I contacted work and the receptionist spoke to the paramedics who told her that David had died. So I found out over FaceTime that he had gone.\"Mrs Corbett, who was born without hearing, is now calling for all emergency workers to have sign language training and a fully charged iPad so that they can connect to a qualified interpreter instantly.She is also hoping to raise £60,000 for Royal School for the Deaf Derby, which her husband - who was also deaf - had attended and where she works as a teaching assistant.She said once the paramedics had realised she was deaf, they had removed their facemasks.\"But for a deaf person in such a stressful situation it was very difficult to lipread, despite their efforts,\" she said.A post mortem revealed Mr Corbett had had a blood clot which caused a fatal heart attack.The dad-of-two, who had worked at Toyota for almost 30 years, died on 15 June.Craig Whyles, divisional director for Derbyshire at EMAS said: \"We would like to offer our sincere condolences to the patient's family and I am deeply sorry for the poor experience they had with our service.\"We would like to speak to the patient's family about their experience and urge them to get in touch with us at their earliest convenience.\"As an organisation we are currently working with the Nottinghamshire Deaf Society to discuss how we can improve our education to staff around deaf awareness and common emergency communication problems.\"Follow BBC East Midlands on Facebook <https:\/\/www.facebook.com\/bbceastmids\/>, onTwitter <https:\/\/twitter.com\/bbcemt>, or on Instagram <https:\/\/www.instagram.com\/bbceastmidlands\/>. Send your story ideas to eastmidsnews@bbc.co.uk <mailto:eastmidsnews@bbc.co.uk>."}