{"author":"By David Deans","title":"Labour back Senedd vote criticising own Welsh roads review","news_category":"general","content":"Labour politicians, including the first minister, have voted for a Welsh Parliament motion criticising their own roads review.The motion, which regretted the review's \"lack of engagement\" with the public, passed in a vote on Wednesday evening.Mike Hedges, Labour MS for Swansea East, said the review was rushed and \"needs to be rectified\".Ministers say the public would be consulted as schemes are developed.Labour backbenchers have previously attacked the government's policy which saw all major road schemes scrapped.One source suggested the government position changed after some backbenchers had threatened to vote with the Conservatives when ministers asked them to vote against the motion.Deputy Climate Change Minister Lee Waters, who led the Welsh government's response to the roads review, did not take part in the vote, or any other votes on Wednesday.It is understood that he had been expected to go on a trip to France that was cancelled at the last minute - he waspaired <http:\/\/news.bbc.co.uk\/democracylive\/hi\/guides\/newsid_82000\/82599.stm> with a Conservative MS.After the debate the Conservatives accused Labour of admitting their review was flawed.One Labour source, expressing surprise with the whipped vote, said: \"They have thrown the review panel under a bus.\"BBC Wales was told Labour decided to back the opposition motion after a deadline for the Welsh government to submit its own amendment had been missed, and it was decided to let the criticism go.However, others said the decision reflected broader views in the group and among several backbenchers.Mike Hedges said: \"The review was rushed and accepted without public discussion. That was wrong and that has now been accepted and needs to be rectified.\"The expert review panel, led by transport consultant Lynn Sloman, assessed 59 road projects and made recommendations on which projects to proceed with, which to abandon and which to reconsider in a different form.Of these, 15 will go ahead, but all the rest have been rejected or will be substantially revised.The building projects were scrapped over climate change concerns.On Wednesday, the Conservatives tabled a motion which said the Senedd \"regrets the lack of engagement by the roads review panel with the public, elected representatives, local authorities, businesses and the third sector and others during the course of the review\".Labour supported a Plaid Cymru amendment to that motion that left in the text on the lack of engagement.The amended motion - which is not binding on the government - then passed, 53 votes for, with Labour First Minister Mark Drakeford among the backers.It was opposed by Welsh Liberal Democrat Jane Dodds. In the debate, Climate Change Minister Julie James insisted the roads review, was \"not a ban on road building\".\"This is a technical policy exercise,\" she added, \"and not something any government would consult on directly.\"\"The change in approach is undoubtedly the right thing to do but to be effective we need to make the right thing to do the easiest thing to do.\"After the debate, a Welsh government spokesperson said: \"The time to engage the public and stakeholders is as we develop strategy and individual schemes.\"The North Wales Transport Commission is consulting with key stakeholders in developing transport plans for North Wales.\"Corporate joint committees are under a duty to produce their new regional transport plans, and in doing so will bring together views of people right across Wales.\"Welsh Conservative Shadow Transport Minister, Natasha Asghar, who led the debate, said: \"By voting for our motion in the Senedd today, Labour have admitted that their road review was flawed.\"The Labour Party, here in Wales, have been intent on slowing Wales down with their anti-road, anti-motorist agenda.\"Plaid Cymru's Transport spokesperson, Delyth Jewell, said: \"In supporting our motion, the Welsh government agreed that better engagement was needed with communities on the roads review - and what's more, they also agreed with Plaid Cymru's calls for the need for bold and radical action in the transport sector to help reach net-zero emissions before 2050.\"It was welcome to hear a change of tone this week - there were more positive noises in the Senedd about funding for bus services. This must now be firmed up so that we don't cut off communities, and that we take everyone on the net zero journey that we must embark on.\""}