{"author":"By Colin Campbell","title":"Asylum seeker families spend months in hotel rooms amid claim delays","news_category":"general","content":"Asylum seekers are spending months living in hotels due to delays in processing their claims.One family, who have spent nine months in a hotel room in Brighton, East Sussex, said the experience had left their children \"stressed\".It is currently costing the taxpayer almost £5m a day to house asylum seekers in hotels, with average waits of 449 days to process an asylum claim.The Home Office said its new asylum model would reduce the use of hotels.The family, who claim they fled gang violence in El Salvador, said their children do not have enough space to play.\"Most of the time we're in our room and they're stressed, they're crying,\" their mother said.\"Sometimes they fight each other because they don't have anything else to do so they get bored.\"Although food is provided by the hotel, she said it was difficult for her and her husband to supplement it.\"We don't have anywhere to heat up food. We don't have a fridge to put drinks or anything for the children to eat.\"We go to the supermarket to buy something for the children but the food goes off because we don't have a fridge.\"A report published by the Home Affairs Committee on 12 July concluded that, while it agreed with Home Secretary Priti Patel that the asylum system was \"broken,\" it invited her \"to make it clear, given the long-term and growing pressures on the system, that it was not migrants crossing the Channel who broke it\".The report went on: \"Antiquated IT systems, high staff turnover, and too few staff are among the reasons for this slow pace.\"Three seafront hotels in Eastbourne, East Sussex, are now being used exclusively to house asylum seekers.Assam, who is 28 and said he fled the war in Yemen, has been living in one of the hotels for four months, and could be there for another 10 months before his asylum claim is considered.\"Eastbourne is so beautiful,\" he said, \"all of the people are friendly, but there is a problem with the hotel.\"I want to transfer to another, but I can't. I want to cook in my room, but I can't.\"Clare Moseley, founder of the refugee charity Care4Calais, believes the claims backlog is at the root of the asylum system's problems.\"All the problems we've seen I believe come back to the delays in processing claims\" she said.\"When you hear problems about cost it is down to the delays. The cost wouldn't be there if it wasn't for the delays.\"When we hear about problems with the accommodation it comes back to the delays. If people weren't stuck in hotels for months and months there wouldn't be the problems.\"A Home Office spokesperson said: \"The asylum accommodation system is under enormous pressure due to the huge increase in dangerous small boat crossings and illegal migration.\"The new fairer asylum dispersal model will reduce the use of hotels which is costing taxpayers nearly £5m a day.\"Follow BBC South East on Facebook <https:\/\/www.facebook.com\/BBCSE\/>, on Twitter <https:\/\/twitter.com\/bbcsoutheast>, and on Instagram <https:\/\/www.instagram.com\/bbcsoutheast\/>. Send your story ideas to southeasttoday@bbc.co.uk."}