{"author":"","title":"Comedian Rhod Gilbert stands up to shyness","news_category":"general","content":"Comedian Rhod Gilbert is painfully shy, yet he can stand up in front of 20,000 people to make them laugh.He admits to having skipped school, slept rough and even locked himself in a portable toilet for an entire weekend to avoid meeting new people.He explores the roots of his social anxiety in the BBC One documentary Stand Up to Shyness. <http:\/\/www.bbc.co.uk\/programmes\/b09pb7jq>He also revisits his childhood, enrols the help of experts and puts three fellow \"shysters\" to the ultimate test.Gilbert, 49, takes a journey back to his hometown of Carmarthen in search of clues as to why there are two sides to him.Flicking through childhood photos, he recalls not wanting to go to school.\"I used to get this knot in the pit of my stomach... there was nothing wrong with me medically, it was anxiety,\" he says.\"I never spoke about it. I bottled it up, hid it and got on with it.\"Gilbert meets up with lifelong friends who are shocked to hear him \"come out\" as shy.He tells them of an experience at university where he travelled to Spain to study, but slept on the streets because he was too scared to stay in shared accommodation and eat with people he did not know.Gilbert's quest to confront his shyness also takes him to a cafe where he struggles with what would seem like a simple task - buying a cup of coffee and drinking it alone.He says it brings a feeling of \"incredible self-consciousness\" and that he \"felt watched in some way\".He also struggles to approach shoppers in Cardiff to ask if they too are shy. According to experts, half of the population can identify as being shy. \"Some experts say it is learned behaviour, others say it is hereditary. Some say you can cure it with medication, while others offer coping strategies and therapies,\" says Gilbert.He joins a support group in London where participants attempt to overcome their anxieties by taking part in tasks such as making eye contact with a stranger for 60 seconds.Gilbert meets up with an ex-girlfriend who he claims \"dragged him kicking and screaming\" to the stage by enrolling him on to a stand-up comedy course.That is where he met fellow stand-up comedian and actor Greg Davies who, like Gilbert, tackles his shyness by \"wrapping himself in the protective cloak of comedy\".\"If you're someone who has suffered from shyness as I have, you presume everybody else is confident,\" says Davies.\"Going on stage is a weird way of trying to address self-consciousness.\"Gilbert's wife Sian encourages him to embrace his shyness.\"It's a good antidote to your outgoing qualities,\" she tells him.\"I like that you have a side to you that makes you quieter and more reflective... I couldn't relate to the man that is on stage all the time.\"Convinced that comedy can be a cure for shyness, Gilbert recruits three \"guinea pigs\" who struggle with everyday interactions to take part in a social experiment.Jodie Williams from Swansea is a wedding photographer who is too shy to ask people to \"say cheese\"; Mike Powell from Cardiff is a \"serial university dropout\" who has never been on a date; and Kate Hoad from Neath prefers animals to humans.Gilbert challenges them to overcome their shyness and perform their own stand-up routines in front of a comedy club audience.But he has some reservations. \"Most confident, non-shy people would have nightmares about this, so for these guys to put themselves in the firing line and try to do this is enormous.\"If it goes wrong and sets them back, I'm not going to be able to live with myself.\"All three successfully confront their fears using Gilbert's \"comedy behavioural therapy\".He says they stuck \"two fingers up to shyness\" and \"reclaimed a bit of their own lives back\".Rhod Gilbert: Stand Up To Shyness is on BBC One Wales at 21:00 GMT on Wednesday."}