{"author":"","title":"Oldham Coliseum: Historic theatre could close after funding cut","news_category":"general","content":"The historic Oldham Coliseum could close next month after losing its entire Arts Council England funding.The theatre, which has a 135-year history, said it had been unable to come up with a rescue plan following the funding cut.In January, all shows after March were cancelled due to financial uncertainty and the venue will now enter a 30-day consultation period.The theatre said events until 26 March would go ahead as planned.The venue was a training ground for a host of TV soap stars, including Coronation Street's Jean Alexander (Hilda Ogden), Barbara Knox (Rita Sullivan), William Roache (Ken Barlow) and Anne Kirkbride (Deirdre Barlow).The venue had received funding of more than £600,000 a year but became the biggest theatre outside London to lose its subsidy in ashake-up announced in November <https:\/\/www.bbc.co.uk\/news\/entertainment-arts-63512050>.In a statement, a spokesman for the theatre said the current financial situation was \"not sustainable for the running of a full-time theatre\".\"It is with great regret therefore that we announce that we have entered into a consultation period with all staff and it is proposed that Oldham Coliseum theatre will close its doors on on 31 March,\" the spokesman added.\"The coliseum is working with Arts Council England and Oldham Council to ensure a smooth transition period for the company, including funding to enable support for our workforce and honouring commitments to artists.\"Many of the coliseum's staff have lived in Oldham all their lives and worked with the company for over a decade.\"They are the priority for the company at this time.\"Ticket holders for events after 26 March will be refunded over the coming weeks, the spokesman said.Why not follow BBC North West on Facebook <https:\/\/en-gb.facebook.com\/BBCNW\/>, Twitter <https:\/\/twitter.com\/BBCNWT> and Instagram <https:\/\/www.instagram.com\/bbcnorthwest\/>? You can also send story ideas to northwest.newsonline@bbc.co.uk"}