{"author":"By Jon Kelly","title":"The Specials: How Ghost Town defined an era","news_category":"general","content":"Ghost Town by the Specials is 30 years old. How did this strange but unforgettable record capture a moment in history?It starts with a siren and those woozy, lurching organ chords. Then comes the haunted, spectral woodwind, punctuated by blaring brass.Over a sparse reggae bass line, a West Indian vocal mutters warnings of urban decay, unemployment and violence.\"No job to be found in this country,\" one voice cries out. \"The people getting angry,\" booms another, ominously.Few songs evoke their era like the Specials' classic Ghost Town, a depiction of social breakdown that provided the soundtrack to an explosion of civil unrest.Released on 20 June 1981 against a backdrop of rising unemployment, its blend of melancholy, unease and menace took on an entirely new meaning when Britain's streets erupted into rioting almost three weeks later - the day before Ghost Town reached number one in the charts.The song's much-celebrated video <http:\/\/www.youtube.com\/watch?v=1WhhSBgd3KI> - in which the band, crammed into a Vauxhall Cresta, patrol empty, crumbling streets - seems unlikely promotional material for a hit single.And whatever similarities might exist between the tough economic environments of 1981 and 2011, the fact this odd, angular song could become such a massive hit might be astonishing to modern ears.But, clearly, it expressed the mood of the early days of Thatcher's Britain for many. \"It was clear that something was very, very, wrong,\" the song's writer, Jerry Dammers, has said.If the band's ability to articulate the mood of the era can be traced anywhere, it is surely in Coventry, where they were based. The city's car industry had brought prosperity and attracted incomers from across the UK and the Commonwealth, meaning the future Specials grew up in the 1960s listening to a mixture of British and American pop and Jamaican ska.But by 1981, industrial decline had left the city suffering badly. Unemployment was among the highest in the UK.\"When I think about Ghost Town I think about Coventry,\" says Specials drummer John Bradbury, who grew up in the city.\"I saw it develop from a boom town, my family doing very well, through to the collapse of the industry and the bottom falling out of family life. Your economy is destroyed and, to me, that's what Ghost Town is about.\"With a mix of black and white members, The Specials, too, encapsulated Britain's burgeoning multiculturalism. The band's 2 Tone record label gave its name to a genre which fused ska, reggae and new wave and, in turn, inspired a crisply attired youth movement.But, as a consequence, Specials gigs began to attract the hostile presence of groups like the National Front and the British Movement. When vocalist Neville Staple sighed wearily on Ghost Town that there was \"too much fighting on the dance floor\", he sang from personal experience.The violence came even closer to home when guitarist Lynval Golding was badly hurt in a brutal racist attack - an incident documented in Ghost Town's bewildered B-side, Why?As their popularity grew, the band's tours of the UK took them around a country shaken by rising joblessness. Dammers has cited the sight of elderly women in Glasgow selling their household possessions on the street as the song's inspiration.But it was not only economic hardship, industrial dereliction and racial unrest that imbued Ghost Town with paranoia and tension. By the time it was recorded, The Specials were riven by acrimony and distrust. Following their appearance on Top of the Pops to promote the single, frontmen Terry Hall and Neville Staple walked out of the group along with Golding.\"Ghost Town was a rough time for the band members,\" recalls Bradbury. \"We were more or less at each other's throats. It was very intense. That definitely makes you play in a certain way.\"While it may have sounded chaotic, the song had been carefully plotted by Dammers for over a year. Once it became public property, however, Ghost Town took on an entirely new meaning.By mid-1981, the UK was already tense following April's riots in Brixton, which an official report later found were fuelled by indiscriminate use of stop-and-search powers by the police against the local black population. The murder of a Coventry teenager called Satnam Singh Gill in a racist attack prompted The Specials to announce a gig promoting racial unity in their city on the day of Ghost Town's release; the National Front announced a march in the area on the same day.Then, as the single climbed up the charts, Britain's streets ignited. Between 3 and 11 July, serious rioting broke out across the country at Handsworth in Birmingham, Toxteth in Liverpool, Southall in London, and Moss Side in Manchester, while Bedford, Bristol, Edinburgh, Gloucester, Halifax, Leeds, Leicester, Southampton and Wolverhampton all witnessed unrest.By the evening of 10 July, Ghost Town was a number one single.From a 21st Century perspective, the song's nightmarish chanting, portentous lyrics and doom-laden bass all sound remarkably avant garde for a hit song.But according to the Guardian's chief pop and rock critic, Alexis Petridis, the momentum of The Specials' growing fan base and the uneasy mood of the general music-buying public combined were enough to propel it to the summit of the charts.\"There's something frenzied and mad about that record,\" he says. \"It has such a kaleidoscope of influences - jazz, (film score composer) John Barry, Middle Eastern music, a solid reggae undertone and stuff that sounds like nothing else.\"But you don't listen to Ghost Town and think it's weird. I was 11 when it was released and I don't remember going, 'What's this?' At the time there were a lot of political songs in the charts. But if a record like that got to number one today you'd go, 'Wow, that's bizarre.'\"Nonetheless, while it may describe a very specific moment in British history, Ghost Town's popularity has barely dimmed. A re-formed Specials, minus Dammers, are due to tour later in 2011, with the song as the centrepiece of their set.The parallels between the Britain of 1981 and 2011 might be up for debate. But Les Back, professor of sociology at Goldsmiths, University of London, who has studied the 2 Tone phenomenon, is not surprised that the track has endured, regardless of the political context.\"It sums up how it felt to be young at the time,\" he says. \"But at the same time it's timelessly resonant.\"There are a handful of tunes that do that and Ghost Town is one of them.\""}