{"author":"","title":"Southend hospital's A&E given £8m NHS funding","news_category":"general","content":"The director of an under-pressure A&E department said work would start immediately on an £8m expansion.The Department of Health and Social Care has agreed to fund the scheme at Southend University Hospital.Recent NHS figures showed more than a third of A&E patients at Mid and South Essex hospitals were not seen within the four-hour target.\"I am absolutely delighted that we have been given this funding,\" said acting chief executive Hannah Coffey.\"It allows us to remodel our emergency department, providing a bigger and better unit that works for our community.\"The hospital said the project would make sure there was enough space at major treatment, waiting rooms and resuscitation areas.Some of the work was expected to be completed by the winter and the entire scheme by March 2024.The hospital claimed the new ambulance handover unit, installed in its A&E car park in November <https:\/\/www.bbc.co.uk\/news\/uk-england-essex-63446366>, had already improved waiting times.NHS England figures for September showed 35.7% of patients at Mid and South Essex A&E units - which also include Broomfield Hospital in Chelmsford and Basildon University Hospital - werenot seen within the four-hour target, compared with a 29% average for England <https:\/\/www.england.nhs.uk\/statistics\/statistical-work-areas\/ae-waiting-times-and-activity\/ae-attendances-and-emergency-admissions-2022-23\/>.However, the hospital trust saw the second-highest number of A&E patients of any region in England that month.Conservative MP for Southend West, Anna Firth, said the investment was a \"complete game-changer\" for the department.Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}