{"author":"By Peter Gillibrand","title":"LGBT: Ugandan refugees in Wales speak out on anti-gay bill","news_category":"general","content":"Ugandan refugees who fled to Wales because of their sexuality have spoken out about their experiences in their home country.One Ugandan described Uganda as a \"living hell\" for them.The Ugandan Parliament has just passed a new bill <https:\/\/www.bbc.co.uk\/news\/world-africa-65034343> cracking down on homosexual activities which includes the prospect of life in prison or the death penalty.The Welsh government has expressed its shock at the bill. Homosexual acts were already illegal in Uganda but the new bill introduces many new criminal offences.If the bill is adopted into law, even identifying as gay will become illegal for the first time.Friends, family and members of the community would also have a duty to report individuals in same-sex relationships to the authorities.Hamza, 43, felt that, as a proudly gay man, he had no choice but to leave his country.\"They chased me out of the country,\" he said. \"I used to meet with my boyfriend at my house… and in the due course of meeting with him, my neighbours found me in my room with him.\"They wanted to kill us. They started beating us. I had to run away… and hide.\"He added that the new bill was \"interfering with people's lives\", adding he could express his sexuality freely in the UK.\"I can't go back to Uganda because I don't want to be deprived of my chance of doing what I want. I'd be in danger. They would kill me.\"Asylum seeker Rose - not her real name - ended up in Wales after leaving everything behind in a rush to flee Uganda in October after a colleague \"threatened to tell the police and to tell everybody\" about her sexuality.\"I left a family. I had a job. I had to leave everything for my sexuality,\" she said.\"It was horrible. It was fearful. You feel isolated. It's very, very difficult.\"Rose explained that there is a lot of \"mob justice\" in Uganda. \"You fear everybody. I can't even speak properly - it's just too much,\" she said.\"This bill is going to make things worse.\" The so-called \"Anti-Gay\" bill will now go to President Yoweri Museveni who can choose to use his veto or sign it into law.\"I request that we're given freedom,\" said Rose. \"You can't be proud of a place where somebody can be killed because of their sexual identity.\"Mark Lewis, head of Cardiff-based charity Hoops and Loops which works with LGBTQ+ refugees and asylum seekers.\"I work with guys where they've seen partners being burned to death with tyres and petrol.\"I've got one guy who saw his boyfriend being killed by 10 men.\"He said that they then come into Britain in \"fear of being returned and being rejected\".And concern has been heightened by the UK government plan to send some migrants to Rwanda <https:\/\/www.bbc.co.uk\/news\/explainers-61782866> which neighbours Uganda.\"It sent a tidal wave through the group,\" he said.On Sunday, Home Secretary Suella Braverman insisted the plan to send some migrants to Rwanda was legal and that the country was safe <https:\/\/www.bbc.co.uk\/news\/live\/uk-politics-65136202?ns_mchannel=social&ns_source=twitter&ns_campaign=bbc_live&ns_linkname=64293b6f00160305532d67b9%26Rwanda%20is%20a%20safe%20country%20to%20send%20migrants%2C%20insists%20Braveman%262023-04-02T08%3A26%3A41.958Z&ns_fee=0&pinned_post_locator=urn:asset:93112091-d317-48f6-92b1-c05e792f831f&pinned_post_asset_id=64293b6f00160305532d67b9&pinned_post_type=share>.Archbishop of Wales, Andrew John, who has written to the Ugandan Anglican Archbishop, Stephen Kaziimba, said: \"One of the things I want to avoid is any sense of us in the West telling a country in Africa how to run their lives.\"But I think human rights need to belong to all of us.\"They are inalienable and this breach of a human right is deeply regrettable.\"The Welsh government said, through its action plan for Wales and Africa, it was committed to taking \"particular action\" in Eastern Uganda on gender and equality.\"LGBTQ+ people are suffering and this new bill will inflame abhorrent rhetoric,\" it said.\"In Wales, we are fully committed to striving for social justice and will go on promoting an open, progressive nation that is committed to the values of inclusivity and equality.\"The Home Office said: \"No-one should be persecuted because of their sexuality or gender identity and the UK can be rightly proud of its record in providing protection to individuals fleeing persecution based on their sexual orientation or gender identity.\"Individuals claiming to be at risk of persecution on the grounds of their sexual orientation are, however, expected to be able to satisfy us that they are, or are perceived to be, of the orientation in question.\"Confirmation of this is normally obtained through their oral testimony at an interview with trained caseworkers.\""}