{"author":"By Neil Prior","title":"Terrence Higgins' legacy, 30 years after death","news_category":"general","content":"Thirty years after Pembrokeshire-born Terrence (Terry) Higgins became one of the first people in Britain to be claimed by Aids, the trust set up in his name is warning that Wales has once again become complacent about the threat posed by HIV.The number of new cases each year remains low, but there has been a jump from 64 in 2001, to 160 in 2011 - a rise of 150% over the last decade.But while the first, 1980s wave of HIV disproportionately struck young heterosexual professionals, gay people and drug users, the Terrence Higgins Trust warns that a potential second wave in the 21st Century may cross demographics who believed they were safe.Of the 1,600 people in Wales currently living with HIV, it's estimated that 19% are unaware that they have it, and the majority of these are over 50.\"It's dangerous to generalise too much, but there's a significant proportion of the over-50s in Wales who felt they are a group who were completely removed from the original Aids crisis in the 1980s,\" says Joshua Hall, service manager for Terrence Higgins Trust Cymru.At the time a lot of the people were in marriages or monogamous relationships, and so they didn't really need to worry, added Mr Hall.\"But 20 or 30 years on, and we're seeing that a lot of those relationships have broken down, and that the over-50s are just as sexually active as any other group,\" he said.\"What's more, because they're no longer of child-bearing age, over-50s in Wales are much, much less likely to use condoms with new partners.\"Under 25s are also at an increased risk, who have no recollection of the original publicity campaign in 1987.\"The original Aids awareness campaign was probably one of the most successful pieces of public information of all-time,\" Mr Hall said.\"People who were old enough can clearly recall the 'Don't Die of Ignorance' slogan and the tombstone imagery, and as a consequence at-risk groups revolutionised their behaviour and really put the brakes on the spread of HIV.\"But there clearly needs to be a repeat campaign, as young people now seem to have no cultural frame of reference to the dangers posed.\"When we do work in schools, an alarming proportion of the pupils we talk to either don't believe there's such a thing as HIV anymore, or else believe that it's entirely curable.\"Terry Higgins was born in Haverfordwest in 1945, but friends say he left for London as a teenager as he felt uncomfortable growing up as a gay man in west Wales.By day he worked as a reporter for the House of Commons' official record, Hansard, and in the evenings as a nightclub barman and DJ.They were interests which would see him travel to work in New York and Amsterdam during the late 1970s.But in 1980 he was forced to return home to London with a series of persistent and - at the time - unidentifiable illnesses.In the summer of 1982 he collapsed while at work at the Heaven nightclub in London, and on 4 July he died of parasitic pneumonia.Later that year, Martyn Butler, from Newport, along with two of Mr Higgins's other close friends, established the Terrence Higgins Trust in his memory.It started in a London flat, but has grown to become a leading voice on sexual health, as well as providing counselling and clinics.\"Terry was a good friend of mine, but at the time HIV had not been identified, we just knew that something unpleasant was going around in the gay community,\" said Mr Butler.\"We thought Terry may be at risk because he was a great traveller and he spent a lot of time in New York, where there were a lot of cases.\"One thing that Terry's death taught me was that I wanted to be sure that nobody died alone and unaware of what was happening.\"But while the initial focus of the trust's work was on the gay community, Mr Butler explains that this is no longer the case.\"We had to educate the gay community - that was where it was springing up, but that gave it the stigma that still echoes down into a lot of heterosexual boys nowadays,\" he added.\"That is our biggest danger today - the gay community has educated themselves well but the heterosexual community often thinks it is not going to affect them.\"They are not getting tested, and that is a huge worry for me.\""}