{"author":"","title":"No new oil and gas fields, say Scottish ministers","news_category":"general","content":"The Scottish government has announced a presumption against new oil and gas exploration as part of its new energy strategy.Scottish ministers say they can no longer support the previous position of \"maximising economic recovery\" of fossil fuel reserves.Licensing new developments in the sector is reserved to Westminster.The Scottish government's plan for the energy sector over the next 20 years is focused on boosting renewables.The draft energy strategy <https:\/\/www.gov.scot\/publications\/draft-energy-strategy-transition-plan\/#:~:text=Scotland%27s%20Energy%20Strategy%20and%20Just,%2C%20households%2C%20communities%20and%20businesses.> supports \"the fastest possible just transition\" away from oil and gas.It restates the long-standing opposition to new nuclear projects and calls on the UK government to reform the energy market.The Scottish Conservatives say oil and gas workers in north-east Scotland are being regarded as an \"afterthought\".Michel Matheson, net zero and energy secretary, said: \"At a time of unprecedented uncertainty in our energy sector, accelerating the transition towards becoming a renewables powerhouse makes sense for a number of reasons – particularly to helping to mitigate against future global market volatility and the high energy prices which are making life so difficult for so many people across Scotland.\"While we do not hold all the powers to address these issues at source, this strategy sets out how we can achieve an energy transition that ensures we have sufficient, secure and affordable energy to meet our needs, support Scotland's economic growth and capitalise on future sustainable export opportunities.\"The energy strategy suggests increasing the current level of renewable electricity generation capacity and speeding up the decarbonisation of domestic industry, transport and heat in buildings.Liam Kerr, Scottish Conservative energy spokesman, said: \"The cabinet secretary's much delayed energy strategy will represent a far from happy new year for the tens of thousands of workers engaged in oil and gas. These workers often feel like an afterthought for this government and that impression won't improve after today.\"Mr Kerr said the Scottish government \"could provide no evidence\" of how it would hit a target of 77,000 low-carbon jobs by 2050.The energy strategy was published alongside a \"just transition\" plan, which sets out how the shift away from fossil fuels can be done fairly.The UK government published a similar strategy <https:\/\/www.bbc.co.uk\/news\/business-61010605> last year which paved the way for a fresh round of oil and gas licensing. More than 100 new licences are expected to be granted by regulators this year.But Westminster's Environmental Audit Committee has criticised the plan for having \"significant gaps\" and not enough focus on energy saving. The committee called on the UK government toset a date for the end of oil and gas licensing. <https:\/\/www.bbc.com\/news\/science-environment-64168571>Offshore Energies UK (OEUK), which represents more than 400 energy firms, welcomed proposals to create a \"hydrogen economy\" in Scotland.The organisation said it \"strongly\" supports plans to develop the Acorn Project <https:\/\/www.bbc.co.uk\/news\/uk-scotland-scotland-business-58960740>, a carbon capture storage and production facility at St Fergus in Aberdeenshire.However, the organisation expressed concerns about plans to wind down oil and gas production.Jenny Stanning, OEUK's external relations director, said: \"Scotland gets 79% of its total energy from oil and gas according to its latest official figures. Across the UK about 24 million homes (85% of the total) rely on gas boilers for heat and we get 42% of our electricity from gas. We also have 32m vehicles running on petrol and diesel.\"These plain facts means we will need gas and oil for decades to come. Additionally, in Scotland alone, the offshore industry supports 90,000 jobs. Across the UK it's around 200,000.\"So we need to ensure that the final strategy acknowledges the continuing role of oil and gas in Scotland's energy security and economy - as well as our sector's role in a rapid transition to a low-carbon future.\"SSE chief executive Alistair Phillips-Davies welcomed the Scottish government's draft report.He said: \"The draft strategy supports ambitious plans for developing onshore and offshore wind, pumped hydro storage, carbon capture and hydrogen.\"But to get there requires increased pace and we look forward to working with the Scottish government and its agencies to turn the ambitions contained within the strategy and plan into tangible actions that support the clean energy transition, build local supply chains, create good green jobs and work in partnership with communities.\"When the last strategy was published in 2017, a target was set for half of Scotland's energy to come from renewables by 2030.In the last quarter of 2022, 26.7% of Scottish energy consumption came from renewables.Ahead of the publication of the latest strategy, First Minister Nicola Sturgeon said: \"The imperative is clear. In this decade we must set Scotland on the path to an energy system that meets the challenge of becoming a net zero nation by 2045, that supplies safe, secure and affordable energy for all and that generates economic opportunity through a just transition.\"The current energy crisis has demonstrated how vulnerable our energy system is to international price shocks, while laying bare the need for structural reform to ensure affordability for consumers.\"There are many similarities between the draft energy strategies from January 2017 and 2023. More wind, onshore and offshore and continued investment in developing niche marine technologies like wave and tidal.There's still opposition to new nuclear power, although this time we've only one such generating site at Torness.But the big difference is in support for oil and gas exploration and development with ministers then keen to avoid the \"premature cessation\" of production.Now they want to accelerate the shift away from fossil fuels.But Holyrood has limited powers over oil and gas and it's difficult to see what practical steps it can take to bring this about. Although that was true for fracking and they managed to stop that.These are two different responses to an energy crisis from two different governments, with one leaning into oil and gas and the other firmly leaning away."}