{"author":"","title":"Ukraine: Wales refugee super sponsor scheme paused for June","news_category":"general","content":"The Welsh government has announced a \"pause\" to new applications for its super sponsor scheme for Ukrainian refugees during June.More than 2,000 visas have been issued under the scheme, ministers say.The reason for the pause is to \"refine\" arrangements for people arriving and ensure public services \"continue to deliver a high standard of support\", the social justice minister said.The Conservatives called the announcement a \"failure\".Plaid Cymru said it raised questions about the \"effect of the lack of financial support from Westminster\" for Wales efforts to help refugees.Recent UK government figures say 2,453 people have been issued visas, and 480 have arrived, under the scheme.The super sponsor scheme, launched in March, is separate from the rest of the Homes for Ukraine programme where people are sponsored by individuals.Under this 2,456 have received visas and 1,481 have arrived in the UK.The \"temporary operational pause\" will begin this Friday, 10 June.The pause will not affect current applications and people will continue to arrive in Wales as visas are granted and travel arrangements are confirmed, the Welsh government said.Under the Welsh government's scheme, which was initially aimed at supporting around 1,000 refugees, individuals are welcomed to the UK through centres - one of which has been providedby the Urdd <https:\/\/www.bbc.co.uk\/news\/uk-wales-politics-60822798> youth organisation.The Welsh government then takes responsibility for providing housing for the refugees.The Scottish Government runs a similar super sponsorship programme which has not been paused.Social Justice Minister Jane Hutt said: \"We have seen visas granted well in excess of our initial commitment to welcome people.\"This temporary pause will give us the opportunity to refine the arrangements we have put in place to support people on arrival and ensure all public services, in particular local authorities, can continue to deliver a high standard of support.\"She added: \"We can all be proud of the heroic effort in supporting the people of Ukraine, effectively demonstrating that Wales is truly a Nation of Sanctuary.\"Welsh Conservative Senedd leader Andrew RT Davies said he was \"deeply disappointed\" by the announcement.\"No matter how they spin it, this is a failure,\" he said.\"The scheme was introduced with much fanfare in April, and it's only taken eight weeks for Labour ministers to backtrack.\"Ukrainian refugees need support, and Welsh Conservatives want to see the scheme back up and running.\"Sioned Williams, who speaks for Plaid Cymru on social justice matters, said the need to pause the scheme raised questions over the \"effect of the lack of financial support from Westminster on Wales' ability to provide sanctuary and the role of the ongoing visa delays and lack of support available to help families arrive from Ukraine\".\"I hope that the safest routes to Wales as well as the offer of appropriate support when they arrive can be offered to more refugees who wish to come here as soon as possible.\""}