{"author":"By Iain Watson & Alice Thompson","title":"The local battles being fought within Labour","news_category":"general","content":"\"This is a crunch moment for the Labour Party. We are in dark times for moderate Labour.\"I do worry and I do believe that the Labour Party as I've known it in my life is probably finished.\"That's the verdict of Nora Mulready - a Labour activist in Haringey in north London.She used to work for the local MP David Lammy.They don't agree on the council's plans to redevelop Northumberland Park - a sprawling council estate in the north east of the borough.The MP doesn't think the community has been properly involved, but Ms Mulready believes the unimaginatively titled Haringey Development Vehicle is a radical means of improving the borough's most deprived ward, in partnership with the private company Lendlease.And she thinks opposition to the scheme has become a vehicle for something altogether more sinister.She believes the campaign to stop what's known locally as the HDV has provided what she calls \"the hard left\" with an excuse for purging moderate councillors ahead of next year's local elections.The Jeremy Corbyn-supporting Momentum group is very active locally.It was set up nationally after Mr Corbyn's first leadership victory to keep the spirit, and the politics, of his campaign alive.Momentum say they have brought new energy - and new members - to Labour.Nora Mulready believes instead they have brought division and factionalism.\"There's been a targeted campaign of mass de-selections,\" she claims. Around a third of the Haringey Labour group have either been deselected or have stood down.The majority of those who are not contesting their council seats next year have stood aside, fearing they would be ousted in an open selection contest.Jason Arthur is currently a member of Haringey's Labour cabinet - in charge of finance and health. But not for much longer.He has decided not to contest his seat in Crouch End next May.He told us: \"I have been a councillor for last three years. I'm very committed to Haringey but the debate has become very toxic.\"These days, councillors can be reselected on the nod - but local parties can also choose to open up the process to challengers.That's what happened in his case and he withdrew, fearing he would be replaced.\"Haringey - as with lots of local authorities - is facing pressure. Our budget has been cut by 43% in recent years,\" he says.\"The local (anti-HDV) campaign has misrepresented what we want to do on the housing front.\"And there has been a disconnect between fantastic new members with a socialist agenda, but at the same time, local councillors who have to find pragmatic, and not ideal, solutions.\"Those can combine to create tension.\"He is more sorrowful than angry. He says the Labour Party is \"deeply factional\" now but adds: \"My hope is on all sides there'll be efforts to bridge the divide and think about what unites us.\"This video can not be playedNora Mulready: Haringey could become the 'first ever Momentum council'This video can not be playedStuart MacNamara says there is no 'hard left takeover'Nora Mulready is less sanguine. She wants to see the selection process in Haringey challenged.She has written to Labour's general secretary and its national executive claiming the process was flawed.She alleges that sitting councillors were muzzled, while Momentum activists openly campaigned for their deselection.And she points to similarities in literature produced by Haringey Momentum and by the 'Stop HDV' group - which includes campaigners who are not Labour Party members - calling for some councillors to be axed.She says she wants Labour to remain a broad church but at the moment it has something of a revolving door on the left.\"We're about to hand over an entire council to essentially the organised hard left via Momentum.\"My feeling is that if the Labour Party has any fight left in it to save itself - and a borough like Haringey - it has to make a decision about where we draw our lines on membership.\"Do we feel it's OK for us to be a vehicle for the hard left to take power? If so - we have to be honest about that.\"But she isn't holding her breath. Party officials have told me they have received her complaint but can only act if there is evidence the party's processes have been breached.Her argument is that unless the party machine prevents Momentum establishing a bridgehead in north London, the Left in other areas will be inspired to follow suit.But others don't see it that way.Stuart MacNamara is not a member of Momentum. He is a former member of Labour's cabinet of councillors in Haringey. He believes the process to select candidates for next year's council elections was fair.\"You could have called me a Blairite... I thought Tony Blair was brilliant in his day,\" he says.\"I don't think there is one shred of evidence to back up claims that this has been a hostile process.\"\"I am sure there were different groups that handed out leaflets... but for some people, maybe they are not used to having to undergo a democratic selection process.\"This is not the House of Lords. This is not a job for life.\"There are people who have been unsuccessful, a good number of whom have worked really hard as ward councillors.\"This wasn't a political purge of the anti-Corbynistas, he says. Instead quite simply the major issue of the Haringey Development Vehicle dominated.\"It was clear members in their respective wards did not want the HDV.\"He used to be on the council's scrutiny committee but he claims his task was made harder because of difficulties in gaining information about the HDV from his fellow councillors who were making the decisions.He believes it's a financially risky project and neighbouring council Enfield and nearby Camden have found less risky ways of providing new homes for rent despite constrained budgets.And Momentum says that if Labour achieves the same result at next year's council election as it did last time round, then just 17 of the councillors - about a third - would be Momentum members. So it rejects Ms Mulready's description of Haringey as \"the first Momentum council\".Some internal opponents of Jeremy Corbyn haven't lost their seats.This video can not be playedAre Momentum activists trying to oust Labour councillors?For Nora Mulready, though, Momentum would be politically in control - non-members on the council would now know that if they oppose the Left, they too could face deselection.But for Momentum's national training officer Beth Foster-Ogg - who is helping members to campaign more effectively in their communities - the changes in Haringey are exciting.She is 20 years old and believes it would be inspiring for people of her generation to see that politics can make a difference. She believes the controversial housing regeneration scheme can now be stopped\"What has happened in Haringey is very simply that people have said some councillors are going to do bad things to our local community and they have used their rights to stop them from being councillors.\"Now it looks like we might have a Labour council which opposes this redevelopment. The idea that you could campaign for someone and be represented by someone who doesn't share the same politics as you is not inspiring.\"But the idea I could say that person, they have the same politics as me, they have new ideas, that's what's going to get me out of bed on a Saturday morning to campaign for them. That's democracy.\"Momentum now has 32,000 members but the group appears to have had more difficulty in flexing its muscles in areas where there hasn't been - unlike in Haringey - a cause celebre.While some of their supporters have made inroads outside London, success has been limited.In Newcastle, the group's opponents are reluctant to speak on the record but off the record they say there were attempts to deselect sitting councillors.There has been an active anti-cuts campaign with pressure on the Labour council leadership to do more to resist austerity.One councillor told us anonymously: \"There was a clear, consistent attempt to target the council leadership - cabinet members in particular.\"One of their activists unseated the former lord mayor but in other areas while they made headway they lost out - in a couple of cases by just one vote.\"And, they say, the unintended consequence of Momentum's push has been to bring former enemies together.\"It rocked people quite a lot... there will be lot more effort in future to see them off.\"It is quite surreal - people who never got on for years are now coming together in solidarity.\"For example two or three wards in Newcastle East (a Parliamentary constituency) are seen as Blairite and two wards are seen as Brownite - we never really talked.\"Now we get on like a house a fire - we text each other all the time.\"The local Momentum organiser is a longstanding Labour member, Ed Whitby. He says there was nothing sinister or cynical in Momentum's activities on Tyneside.He says he was simply trying to harness the energies of newer members and ensure that they got to know how Labour's often Byzantine structures work.He said: \"Momentum's attitude has always been to encourage people to get involved in all aspects of the Labour Party.\"That means during elections we've been really active in getting people out campaigning - but we want to win those elections so we want the best possible candidates and we want our members to be active in selecting.\"So who are the best possible candidates? This is Ed Whitby's definition: \"In Newcastle, the membership of the party has grown massively since the Corbyn leadership campaign.\"It's definitely the case that we said people who stood on that platform - redistributing wealth, opposing cuts and austerity - we think people who have those ideas actually are going to be the best chance of us winning Labour councillors in future.\"So that means supporting candidates who we think agree with some of the same values that the leadership of the Labour Party stands for.\"But he says, Labour can be quite a conservative organisation - with a small 'c' of course. Change may be coming but not as swiftly as some had hoped, or feared.\"While membership might have radically changed - probably half of the activists - definitely a third - are brand new and weren't involved in the party two years ago - we won't see a third of the Labour Party councillors in Newcastle will have changed.\"Nationally, Labour First is a group that has also brought together what once would have been called Blairites and Brownites, but these days tend to be badged as moderates or centrists.They have a national organiser, Matt Pound, whose job - in part - is to pin back any Momentum advance at the party's grassroots. Labour First have been asking their own members to report any deselection of moderate councillors. Matt Pound told us that Momentum hasn't had, well, quite as much momentum as he had anticipated.\"I have certainly seen a waning of Momentum's influence over the last few months,\" he says.His theory is - ironically enough - that Jeremy Corbyn's strength within the Labour Party has become their weakness.\"Momentum blossomed under the second Corbyn leadership election. And they need that fight to keep going. There needs to be a threat.\"And the truth is that pretty much everyone in the Labour Party now completely accepts that Jeremy Corbyn is the leader and for as long as he wants to be - and that poses a real challenge for Momentum.\"Their campaigning strategy has been 'you are either with the leader or you're not'.\"Well now that everyone is, where do they go from here?\" Many Momentum activists would see this through a rather different prism. They would suggest that their campaigning activities and deft use of social media has benefited Labour as a whole and that they have knocked doors on behalf of candidates who are not from their wing of the party.Many would argue, too, that previous Labour leaders have parachuted favoured candidates into parliamentary seats - and any attempts to get Momentum members selected is more democratic than that.Some, though, go further.They say they are the victims of political stitch-ups by a party establishment determined to keep the newer and more left-wing members at bay.Rhean Davies is a former member of the Socialist Party, one of the successor organisations to the Trotskyite Militant Tendency.She says she has no links to that party now - and she rejoined Labour because was inspired by Jeremy Corbyn's leadership.She said she actively campaigned for a Labour victory at the general election but her offer of contributing more widely to the party has been rebuffed.This video can not be playedMomentum supporter Owen Jones and Progress director Richard Angell on Labour candidate selectionAspiring council candidates are tested for their suitability by a panel of councillors from other areas. Rhean Davies said she was assured that this would be a formality. It was anything but. She was \"sifted out\" of the selection process, preventing her from putting herself forward to party members as a potential candidate in Ealing.She believes she was, in effect, pre-emptively purged: \"We had these screening panels which were meant to just really weed out people who didn't understand what they were standing for, or were legally disqualified.\"We found out these were weaponised to make sure people who supported Jeremy Corbyn were excluded from the panel of candidates.\"I found that I was assessed as not able to understand what a local councillor did and I am a public law lawyer.\"It's what is commonly known as a stitch-up - the very opposite of democracy.\"She has organised a petition calling for all the London council selections to be re-run. Jon Lansman, the founder of Momentum, signed this \"in a personal capacity\".Labour's officials say they are confident proper procedures were followed.Meanwhile Corbyn-supporting candidates who were ousted in another part of London - Redbridge - are threatening legal action.Alongside council selections, Labour has begun the process of choosing candidates in parliamentary seats which are now seen as winnable after the strong performance in the general election.Some of the selections have been uncontroversial.Those that have been more contentious appear to have been following a similar pattern to the local government selections, with no decisive overall victory for any faction or group.So in Norwich North, a candidate who was likely to get the support of Momentum wasn't shortlisted. In Rossendale and Darwen in Lancashire the former parliamentary candidate - a local councillor - saw off a challenge from a Momentum-backed opponent. There was a similar outcome in Carlisle.But in Morecambe and Lunesdale, it is opponents of Momentum who have questioned the shortlisting procedures and the group's role in the selection process.There is a battle for the heart and soul of the Labour Party but it doesn't look like a conventional revolution.It's being fought through selection meetings and interpretations of rule books. Perspiration not inspiration, perhaps.So far, there seems to be no decisive victory either for Momentum's supporters or their opponents.Currently, Labour nationally is undertaking a \"democracy review\" - a look at its internal structures.Some on the left have been pressing for it to recommend that every MP has to face an open selection contest - where they are open to challengers - in every parliament. Currently party members have to vote on whether to open the process up.Momentum's Beth Foster-Ogg says she is listening to her members about what changes they want to see.\"Momentum hasn't supported deselections but we have the democracy review and we have our members telling us what they think should happen and from that we should get some clarity... it's really important that our elected representatives are accountable.\"And it's important new people are given the opportunity to get involved otherwise you can have the same people getting re-elected over and over again with no space for new people with new ideas to be elected.'The party Nora Mulready joined is still recognisable in many parts of the country.She believes that while there may have been a storm in Haringey, elsewhere the political climate has seen a less dramatic shift - but a shift nonetheless, creating an environment more hostile to those who hold her views.Newer left-wing members would argue, though, that it is not enough to be warmly welcomed into Labour - that those who were part of the recent influx now deserve to wield more influence."}