{"author":"","title":"Dover delays see pupils wait hours to arrive for Easter trips","news_category":"general","content":"Easter trips organised by schools in Wales are being disrupted and face cancellation due to delays at Dover.A critical incident has been declared at the port <https:\/\/www.bbc.co.uk\/news\/uk-65143093> as coaches wait to be processed in a spell of bad weather.One parent said it was a \"horrendous start\" to his daughter's first school trip away from home, while a teacher said he is \"shell-shocked\" by the delays.The port has apologised for the \"prolonged delays\".\"The children's faces fell when they heard that the trip could be cancelled,\" said Rhiannon Maguire, a sports teacher at Ysgol Gwynllyw, in Pontypool, Torfaen.\"We've had to cancel the trip several times because of Covid already so some of the pupils have been waiting three years to go.\"She said her pupils arrived at 08:30 BST \"ready to go\" at 09:00 but now face setting off 12 hours later after the bus company they arranged to travel with cancelled, apparently due to the disruption at the port in Kent.About 82 children between the ages of 13 and 15 are going on the trip.Ms Maguire added: \"We are worried that we will be caught in the delays and be stuck on a bus but we're hopeful that we will arrive by tomorrow night.\"We've prepared quizzes on both buses and we have enough DVDs but I hope the children will sleep through it tonight.\"Dafydd Francis, a PE teacher from Seven Sisters, Neath, is travelling in a group of 19 adults and 14 children to Saalbach-Hinterglemm in Austria.They arrived at the port at 23:00 GMT on Friday and were still waiting to board at lunchtime on Saturday.\"[I've)]never seen anything like this,\" he said.\"I have organised various trips since 1998 for school and family and friends, approximately 50 trips.\"We will arrive at the resort 14 hours late if we are lucky. We will fly next time.\"We all feel angry but shell-shocked at the situation.\"Parent Claire Bryant, whose 12-year-old daughter is on her first-ever ski trip with fellow pupils from Cardiff's Radyr Comprehensive, said their \"nightmare\" began on Friday at 18:00 BST and continued on Saturday.Ms Bryant said they had since crossed the Channel but were now waiting for an additional driver in Reims, as their current driver had reached his driving hours' limit.\"They should be skiing right now - instead they're at Burger King,\" she said.\"It was supposed to be a 20-hour journey. I don't know how long it will be for a replacement [driver].\"The port said car volumes had built through the morning and there was a one-hour wait for them to get through border controls.P&O Ferries estimated one to two-hour delays for cars trying to reach the port, and this morning it reported delays of two to three hours for coaches.The port advised passengers to check with their ferry operator for updates, allow plenty of time for their journey and \"ensure they have some food, drink and entertainment with them\".Ysgol Plasmawr, in Cardiff, tweeted to say its pupils had arrived in France at 06:50 local time after a 12-hour coach wait.St Joseph's RC High School, in Newport, said one of its school trips waited more than five-and-a-half hours until they made it to France, while another is due to cross at 15:55 GMT on Saturday, after arriving at the port at 22:00 GMT on Friday.Gareth Williams' daughter is in Year 8 at St Joseph's, and set off on a ski trip to Oberlungau, Austria, at 16:00 GMT on Friday.Gareth said: \"They were supposed to arrive at about 16:00 GMT on Sunday, to get ready for their first day on the slopes on Monday. Now, they will probably arrive at about five in the morning.\"Apparently there was no communication. They just pulled into one of the service stations and waited there because they could see a build-up.\"From what I can tell, nobody has brought them any food or anything, but luckily they were able to get off the bus and walk to a shop to buy water. They were about a quarter of a mile from the terminal for about four to five hours.\"My daughter was ringing me up last night, wanting to come home. As a parent, you worry. It's the first time that she's been away on her own on holiday, and it's a bit of a horrendous start.\"Mr Williams added: \"The port knows how many people booked to go on the ferries, so you would think they would be more prepared for that.\"Stanwell School, in Penarth, Vale of Glamorgan, and Bishopton Comprehensive in Swansea have also said their pupils have arrived at their respective destinations for their Easter getaways."}