{"author":"By James Gregory","title":"Tucker Carlson said he hates Trump 'passionately', lawsuit reveals","news_category":"general","content":"Fox News host Tucker Carlson said in a text message after the 2020 election that he \"passionately hated\" Donald Trump, according to new court filings.Mr Carlson's message to a colleague in January 2021 emerged as part of a defamation lawsuit by Dominion Voting Systems against Fox News.The electronic voting firm accuses the network of promoting baseless claims of vote-rigging in the election.Fox News denies defamation and says on-air comments were taken out of context. The latest filings in the case suggest Mr Carlson expressed his dislike of the outgoing US president two days before Trump supporters stormed the US Capitol to derail lawmakers from certifying Joe Biden's election win.\"We are very, very close to being able to ignore Trump most nights,\" he wrote in a text sent on 4 January 2021. \"I truly can't wait.\"\"I hate him passionately,\" he added. Mr Carlson, the top-rated host on the conservative network, also appeared to denigrate the Trump presidency in these private messages, despite lauding his achievements on air.\"That's the last four years. We're all pretending we've got a lot to show for it, because admitting what a disaster it's been is too tough to digest. But come on. There isn't really an upside to Trump.\"Dominion argues in its lawsuit that top executives and some hosts at the conservative cable network knew that the conspiracy claims pushed by Donald Trump and his allies on Fox News programmes were false but still put them on air.Previous filings have revealed that even Rupert Murdoch, the billionaire owner of Fox News, acknowledged some of the network's stars endorsed false claims that the 2020 election was stolen.In a statement provided to the BBC's US partner CBS News on Tuesday night, Fox News said: \"Thanks to today's filings, Dominion has been caught red-handed again using more distortions and misinformation in their PR campaign to smear Fox News and trample on free speech and freedom of the press.\"A jury trial is expected to begin in Delaware in April.The text message revelations come amid a fresh round of criticism that Mr Carlson misrepresented exclusive security-camera footage given to Fox to downplay the severity of the riot two years ago at Congress.Mr Carlson showed the previously unseen clips on Monday night and argued it \"does not show an insurrection or a riot in progress\", but rather \"mostly peaceful chaos\".Criticism of the segment came from Democrats as well as top Republicans in Washington <https:\/\/www.bbc.com\/news\/world-us-canada-64883668>, the head of Capitol police, and the family of the police officer whose death was mentioned by Mr Carlson on the show."}