{"author":"By Daniel Thomas","title":"Free childcare plan: 'Why do we have to wait?'","news_category":"general","content":"Free childcare for working parents in England will be expanded to children aged nine months and above from September 2025, as the chancellor looks to get more parents back to work.The move could allow around 60,000 more parents of young children to enter employment, a small fraction of the number of people out of work.The new care for parents in England will be introduced in stages:Parents like Natalie, who lives in Surrey and works in commercial real estate in London, says the change isn't happening quickly enough.She and her partner currently can only afford to send their son Giovanni, who is nearly one, to nursery two days a week, though they would love to increase this.Under the plans, Ms Clarkson would only be able to access 15 hours free care by September 2024 - and by September 2025 he will be entitled to 30 hours free care anyway.\"It makes me angry. I just don't understand why it can't be done now? It doesn't make sense,.\"I was excited I would be able to put my kid in for a couple more days, but nope.\"Ms Clarkson is not alone, Lauren McKenzie is also disappointed by how long it will take for help to kick in.Currently, she can only afford to put her son in nursery for two days a week. The other three days she works from home and tries to juggle her duties with caring for Zayd - not easy with an energetic eight-month-old.\"In terms of a vision [this policy change] is positive,\" she tells the BBC. \"But we still feel we're in a challenging position.\"She says she won't be able increase Zayd's nursery hours until September 2024. \"It is unsettling - you wait patiently with excitement. But [help] still feels very far off.\"Currently, working parents with three and four-year-olds are eligible for 30 hours of free childcare per week. But many say this does not go far enough given how high UK childcare costs are. Chancellor Jeremy Hunt admitted it is \"one of the most expensive systems in world\".The government will provide £4.1bn by 2027-28 to cover the plan, although this is far lower than the amount that some estimate is needed.It will also \"substantially\" raise the hourly rate it pays providers to deliver the \"free hours\".Nurseries have long complained that this rate is too low, meaning that some can't afford to offer free childcare hours at all, or have to charge parents extra to cover their losses.The sector also faces soaring energy costs and a recruitment crisis that has forced many nurseries to shut over the past few years. The funding providers get for their current free hours has been cut by 13% in real terms since the peak in 2017, according to economic research group the Institute for Fiscal Studies (IFS).Research from charity Coram shows <https:\/\/www.bbc.co.uk\/news\/education-64865602> only half of local authorities currently have sufficient places for working families, with growing evidence the situation is worse in lower income areas.But Neil Leitch of the Early Years Alliance, a group representing childcare providers, says the new money offered by the government is \"unlikely to match what's needed to put providers on a steady footing\".It also \"raises serious questions about the government's entire approach to costing this policy\".One way the government will save money is by changing staff-to-child ratios for two-year-olds in childcare - moving from one carer for every four children to 1:5 to align with Scotland.Mr Hunt says this will be optional, both for providers and parents. But some people fear quality of care could deteriorate.Joeli Brearley, founder and chief executive of campaign group Pregnant Then Screwed, says: \"There's no evidence that it will reduce costs, but there is evidence that it will reduce quality and of course the first five years of a child's life are foundational to their future and so we will pay for this further down the line.\"Many see a link between the cost of childcare and the number of parents choosing not to work.According to Mr Hunt, a full-time nursery place takes up nearly 30% of the income of a couple with two young children.The Centre for Progressive Policy, which campaigns for fair economic growth, estimates that 1.5 million mothers would work more hours if they could access suitable childcare, which would add £27bn a year to the economy.Christine Farquharson, a senior research economist at the IFS, told the BBC's Today programme childcare was not the only factor that stopped people going to work, but it played a role.\"Already about 70% of mums with a 0-4 year-old are in some form of paid work. If you ask the 30% who aren't what is influencing their decision, about half of them cite childcare as one piece of the puzzle.\"This could change the decision for some families who are out of work but equally preferences - peoples desire to be at home with their children - plays a role too.\""}