{"author":"By Jessica Parker & Eleanor Lawrie","title":"Stonewall boss defends new strategy amid criticism","news_category":"general","content":"This video can not be playedNancy Kelley: \"I’m comfortable with our direction as an organisation\"Stonewall head Nancy Kelley has defended the organisation's position amid a freedom of speech row and criticism from a founder.Matthew Parris said in the Times <https:\/\/www.thetimes.co.uk\/article\/stonewall-should-stay-out-of-trans-rights-war-xcz25nhdt> that Stonewall had become \"tangled up in the trans issue\" and \"cornered into an extremist stance\".But Ms Kelley told the BBC she was \"really comfortable\" with the direction the charity was going in.She likened so-called \"gender critical\" beliefs to anti-Semitism.The Equality and Human Rights Commission (EHRC) has said its defence of the right to hold \"gender critical beliefs\" - that sex cannot be changed - \"does not have an impact on our commitment to uphold the rights of transgender people\".The new EHRC chair, Lady Falkner, has said women have the right to question transgender identity <https:\/\/www.thetimes.co.uk\/article\/women-must-be-heard-on-transgender-identity-says-new-equalities-chief-kqttljxmd> without being abused, stigmatised or risking losing their job.Ms Kelley said while Stonewall believed in freedom of speech, it was \"not without limit\".\"With all beliefs including controversial beliefs there is a right to express those beliefs publicly and where they're harmful or damaging - whether it's anti-Semitic beliefs, gender critical beliefs, beliefs about disability - we have legal systems that are put in place for people who are harmed by that.\"Challenged as to whether it might be considered offensive to compare anti-Semitic beliefs to gender-critical views, she insisted it was appropriate.\"We're talking about protected groups. We're talking about people that are protected on the basis of their sexuality, people that are protected on the basis of gender identity, people who are protected on the basis of race and that's why I think the analogy is apt.\"Journalist and former Tory MP Matthew Parris, one of Stonewall's 14 founders, recently suggested the charity had \"lost its way\".In an article for the Times, he said: \"The organisation is tangled up in the trans issue, cornered into an extremist stance on a debate that a charity formed to help gay men, lesbian women and bisexual people should never have got itself into.\"Ms Kelley said while Mr Parris was entitled to his views, being trans-inclusive was the \"absolute norm\" for LGBT organisations.She also denied Stonewall had approved incorrect advice on transgender issues for the University of Essex, which is part of its Diversity Champions workplace inclusion scheme.A recent report <https:\/\/www.essex.ac.uk\/blog\/posts\/2021\/05\/17\/review-of-two-events-with-external-speakers> found the university had unlawfully blacklisted a speaker after some protesters labelled her a \"transphobe\".Ms Kelley said Stonewall had \"nothing to do\" with the university's process for deciding external speakers and was \"really confident\" in its legal advice.Stonewall's been criticised for using the term \"gender identity\" when referring to the Equality Act's protected characteristic of \"gender reassignment\".But Ms Kelley described that as \"the difference between natural language and statutory language\".She also expressed frustration that the volume of media coverage and debate around trans rights meant \"it can be difficult to get across all the work we do... focusing on the experiences of LGB [lesbian, gay and bisexual] people.\"She said the organisation's work could still benefit people, whether or not they agreed with its position, such as improving access to IVF.That aim is part of the organisation's new \"free to be\" strategy <https:\/\/www.stonewall.org.uk\/stonewall-strategy-free-to-be>, which includes campaigning for \"hate crime and hate speech laws in the UK that protect LGBTQ+ communities\" and a pledge to champion inclusion across schools.The strategy also prioritises a \"legally enforceable ban on conversion therapy\".Ms Kelley said the consultation process, planned for September, was an \"unnecessary delay\" but promised to work closely with the government on the ban.Conversion therapy <https:\/\/www.bbc.co.uk\/news\/explainers-56496423> is defined by health groups, including NHS England, as attempts to change someone's sexuality or gender identity.It is understood part of the consultation will look at how to ensure certain medical or other accredited professionals will not be criminalised.Ms Kelley said a therapist, helping someone explore their gender identity or sexual orientation, wouldn't be caught by a ban, \"because that's not seeking to suppress or change something. That's exploring with you.\"A government Equality Hub spokeswoman said: \"The consultation will seek further views from the public and key stakeholders to ensure that the ban can address the practice while protecting the medical profession; defending freedom of speech; and upholding religious freedom.\"Ms Kelly has also called for an \"individual cabinet level post\" to focus on the equalities brief. Liz Truss holds the role as well as being international trade secretary."}