{"author":"","title":"David Malpass: World Bank leader who was called climate denier quits","news_category":"general","content":"The president of the World Bank will step down from his post in June, leaving the organisation almost a year before his term was due to end.David Malpass announced his decision on social media, without providing a specific reason for his departure.The pick of former US President Donald Trump, he has been criticised as a climate-change denier.Last year, the White House rebuked him after he said he did not know if fossil fuels were driving climate change.He later apologised for the remarks.Mr Malpass started his five-year term in April 2019, after serving in the US Department of Treasury during the Trump administration.In a statement, Mr Malpass said he was proud of what he had accomplished at the bank, which oversees billions of dollars in lending to developing countries each year.Financing \"including climate financing\" had reached record levels under his leadership, he added.\"By the end of the fiscal year, we will be well-positioned to feature sustainability more clearly in the mission of the World Bank Group, align the mission with resources, and set in motion an effective evolution to increase the institution's impact on people in the developing world,\" he wrote in a statement shared on LinkedIn.Mr Malpass, who was sceptical of multilateral institutions, had long been seen as a controversial pick to lead the World Bank.At an event in September, former US Vice President Al Gore called for his replacement, saying the bank was not doing enough to raise funding for climate issues and it was \"ridiculous to have a climate denier as the head of the World Bank.\"Asked later to respond, Mr Malpass defended himself, but declined to say that fossil fuels caused climate change.In a subsequent interview with CNN, he said he had not done a good job answering or hearing the question and that man-made emissions were \"clearly\" contributing.US Treasury Secretary Janet Yellen, who has been pressing for reform at the World Bank and other development banks, thanked Mr Malpass for his service in a statement that alluded to the controversy.\"While we all must continue to raise our collective ambitions in the fight against climate change, during President Malpass' tenure the World Bank has made important recent advances in this area,\" she said.She said the US would put forward a new candidate to lead the bank soon. The US is the World Bank's largest shareholder and a major source of its funding.An American has led the institution since its start in the 1940s, when it was created to help rebuild Europe in the aftermath of the Second World War."}