{"author":"By Roger Harrabin","title":"Is the hydrogen tech 'revolution' hope or hype?","news_category":"general","content":"In his speech on the planned economic recovery, the prime minister said hydrogen technology is an area where the UK leads the world. He hopes it’ll create clean jobs in the future. But is the hydrogen revolution hope or hype?The digger with the long-toothed bucket bites into a pile of stones, tilts up and flexes its sturdy mechanical arm.It swivels, extends the arm and dumps its load on the harsh ground of a Staffordshire quarry.It’s a beast of a machine and from the front it looks like a normal excavator.But from the back you can see its tank full of dirty diesel has been replaced with a hydrogen fuel cell.The excavator is the latest in a generation of vehicles powered by the lightest element on Earth.The compendium of vehicles powered by hydrogen now stretches from diggers to micro-taxis, trucks, boats, vans, single-deck and now double-decker buses – and even small planes.It works by reacting hydrogen with oxygen in a fuel cell to generate electricity. The only direct emission is water.So at last, the long-awaited hydrogen revolution is here. Or is it?Back in the early 2000s, backers of hydrogen thought it would dominate the clean automobile market. <https:\/\/edition.cnn.com\/2003\/ALLPOLITICS\/02\/06\/bush-energy\/>But the promised “hydrogen highway” never materialised, for a couple of crucial reasons.Firstly, hydrogen power needed a new infrastructure, whereas rival battery cars could be charged off the near-ubiquitous electricity grid.Secondly, high-powered batteries at that time were already well-advanced for other uses such as computers, but hydrogen was not.So hydrogen lost the head-on battle for the motor car. But now it’s back in the frame for the sort of transport, industry and heating tasks that batteries are struggling to fulfil.Take our large mechanical digger, a prototype from JCB. It has a little battery-powered cousin – small enough to squeeze through a doorway and work in a building.But JCB say the big digger would need a battery weighing five tonnes, and take hours to refuel. Hydrogen on the other hand, is lighter than air and takes minutes to fill a tank.Lorries fall into the same category as diggers – sometimes the battery would be as heavy as the payload.The same applies to buses, and the Bamford family, which owns JCB, says it has orders for 80 double-deck buses from its Wrightbus factory at Ballymena in Northern Ireland.That still leaves the issue of charging infrastructure – but that can be solved by providing hydrogen pumps on motorways for long-distance truckers.The same network could fuel hybrid battery and hydrogen cars of the future and dispense with the need for ever-heavier batteries in plug-in cars.Buses could use hydrogen stored at depots in Kevlar-lined tanks for safety. <https:\/\/www.gov.uk\/government\/news\/britains-first-all-electric-bus-town-to-pave-the-way-for-green-communities-of-the-future>Past fears of hydrogen tanks exploding have been addressed by the advent of tanks lined with Kevlar and hydrogen release mechanisms in case the tank is struck.Airports could also store hydrogen, and the first test flight of an electric plane in the UK at Cranfield University recently <https:\/\/www.bbc.co.uk\/news\/av\/uk-england-beds-bucks-herts-53191819\/electric-plane-s-milestone-first-uk-test-flight-at-cranfield> was powered by a hydrogen fuel cell.There is – forgive the pun – a head of steam building over hydrogen. Germany is racing ahead with a network of filling stations and a hydrogen train. It’s investing €7bn in a bid to dominate the hydrogen market.The EU Commission wants a slice of the action, too.  <https:\/\/www.euractiv.com\/section\/energy-environment\/news\/timmermans-sees-pivotal-role-for-hydrogen-in-meeting-eu-climate-goals\/>The website Euractiv reported that it plans to publish a hydrogen strategy soon. A leaked draft floated the idea of making the Euro the currency for international hydrogen trades, as the US Dollar is for oil.The UK government also intends to announce a hydrogen strategy before the Parliament closes for the summer, as part of its economic recovery package.It’s being spurred on by rebukes that the UK lost the battle for battery technology to China – so it mustn't let the hydrogen bandwagon escape. The government is advised by its Committee on Climate Change to start large-scale trials in the early 2020s.Indeed, within weeks from now, Britain’s first hydrogen train <https:\/\/www.bbc.co.uk\/news\/business-48698532> – developed by Birmingham University - will be tested on regular tracks.So it looks as though hydrogen has finally made it. But not so fast… because it’s by no means trouble-free.Currently almost all the hydrogen sold in the UK is produced by splitting it from natural gas. But that’s costly and emits lots of planet-heating carbon dioxide.The problem can be tackled by capturing the CO2 at a hydrogen production hub, then burying it with carbon capture and storage. But that will drive the cost up further.The alternative is inherently clean – but very expensive. It entails using surplus renewable electricity, like when the wind blows at night, to split hydrogen from water using a fuel cell.The process is wasteful because it involves turning electricity into a gas, then back into electricity – a two-step shuffle dismissed by Tesla car chief Elon Musk as “staggeringly dumb”. “Fool cells”, he calls them.But hydrogen-lovers believe the future electricity grid will produce so much cheap off-peak power that we’ll need to find other uses for it. And they hope to see the cost of fuel cells plummet following the example of offshore wind.Certainly, recent events have favoured the advance of hydrogen. When the UK had a target of 80% carbon cuts by 2050, that left leeway for polluting forms of fuel to take up the remaining 20% of the carbon “budget”.Now it’s widely accepted that homes with low-carbon heating systems such as heat exchangers will need a boost in a cold snap from another source – and that’s looking increasingly like hydrogen.Trials are already underway using hydrogen blended into natural gas at Keele University.And, depending on how much support it gets from the government - it looks as though a technology that lost its key battle against battery cars two decades ago will still find a place in the zero-carbon economy of tomorrow.Follow Roger on Twitter. <https:\/\/twitter.com\/rharrabin>"}