{"author":"By Laura Devlin and Mariam Issimdar","title":"Coronavirus: Holt rallies after devastating supermarket fire","news_category":"general","content":"When a devastating fire destroyed a town's only supermarket, many feared a lifeline had been destroyed. But from the ashes is emerging a renewed community spirit and the determination to come back stronger.The images spread across social media as quickly as the flames engulfed the building.Budgens, which had served the north Norfolk town of Holt for more than 30 years,was being destroyed by fire <https:\/\/www.bbc.co.uk\/news\/uk-england-norfolk-53126763>. Late into the night on 20 June, crowds gathered to take a closer look as it went up in smoke.The disbelief and sense of loss were palpable.The fire left Holt with no supermarket. Its nearest is seven miles (11km) away in Sheringham andnot all of the town's 3,926 residents - just under half of whom are 65+ <https:\/\/www.north-norfolk.gov.uk\/media\/4094\/settlement-profiles-topic-paper-final-april-2018.pdf> - will be able to get there.Budgens was also Holt's only post office, the community hub, the workplace of neighbours and friends - it seemed everyone knew someone who worked there.At dawn, while firefighters picked over the charred skeleton of an old friend, the community's own emergency response was already under way.Within hours, an online appeal for staff \"who worked so hard to provide a lifeline to our town during coronavirus\" had raised hundreds of pounds and now the total stands at more than £7,000.\"Thank you for being there,\" one of the comments reads, praising Budgens for its deliveries during lockdown.\"The staff were absolutely incredible,\" says another. \"We are thinking of you.\"Duncan Baker, who grew up in the town and is now Conservative MP for North Norfolk, said: \"There's been a huge outpouring of people being very upset. How many towns would see that over a supermarket?\"Budgens wasn't just a supermarket: it was independent, it did an amazing amount of activities, raising thousands of pounds for local charities.\"They would stock huge amounts of local produce that you just wouldn't get in normal supermarkets: daffodils from local growers at Easter, crabs from Cromer fishermen, strawberries from fields just down the road.\"All the people I have spoken to are very supportive - they're very, very sad to see the fire because of how much Budgens meant to them, but I believe Holt will come out of this even stronger.\"You may also like: Budgens has more than 260 stores, all locally owned by independent retailers, and Holt's is owned by CT Baker - which for years had Mr Baker's late stepfather, Michael, as its managing director.Customers were as likely to buy a raffle ticket or stumble across a charity bake sale as they were to pick up groceries.For Bridget Jarvis, who worked at Budgens for 10 years before her retirement, the store's loss was \"horrendous\".\"I shopped in there every day; it was really handy,\" she said.\"We've got nowhere now - it's really bad on the elderly and those that can't drive.\"They rely on Budgens. They're lost, really.\"Throughout lockdown, Budgens delivered to vulnerable customers but had to raise its game when the store went up in smoke.Over the next four days, more than a fifth of calls to North Norfolk District Council's coronavirus helpline were from customers anxious about food supplies.The council and volunteers ensured the most vulnerable had enough supplies, and this week Budgens restarted deliveries from its store in Aylsham, 11 miles (18km) away.A shuttle-bus service to a supermarket was mooted, but coronavirus fears around shared transport meant it was not taken up.Jane Gurney-Read, managing director of CT Baker, said: \"We have some very vulnerable customers in Holt, some who cannot get out or are shielding.\"We were able to do our usual deliveries within a week, and people have had the same delivery driver, Mike, who they are used to seeing.\"Within five days, the town's only post office reappeared as a \"pop-up\" within Bakers and Larners, a department store on the High Street owned by the company.\"The last thing we wanted to do was leave the customers stranded and that has been very well received,\" said Ms Gurney-Read.She said Budgens' 83 staff members would be paid throughout the summer, with hopes that a new supermarket will be up and running as soon as possible.\"They worked very hard during Covid-19 to keep the community looked after.\"When we spoke to them, a lot of them, their first thought was not for themselves, it was for the customers - that just tells you the kind of team we have.\"\"None of us want Holt to be without a supermarket. Once we have plans in place, they will be shared.\"The essential shops on Holt's High Street and among its higgledy-piggledy streets and courtyards, including butchers and greengrocers, have pulled together to try to bridge the gap left behind by Budgens.Joanne Boulter, of B&J Seafoods, which has offered deliveries throughout lockdown, said: \"The trade has picked up - we've tried to stock a bit of fruit and veg, bread and rolls, to help customers.\"We're just helping where we can. Everyone misses it. We didn't see it as a competition - everyone went in there for something.\"It's easy to view Holt, with its handsome Georgian buildings, as a well-heeled town. It is awash with galleries, posh delis and gift shops and is popular with second-homers and holidaymakers.Bakers and Larners has been compared to Fortnum and Mason, and boarding school Gresham's will soon have a new science block, thanks to £18.75m from alumnus Sir James Dyson.But behind the boutiques and antiques, and just yards from Gresham's playing field, is a different town - the one supported by Julie Alford, who runs Holt Youth Project.It hosts a food bank and supports young people, including carers, many of whom are still at primary school.\"The need has been overwhelming this week - so many people needed us,\" she said, from its centre within an area of social housing.Up to 30 food parcels have been delivered to families and young carers who are struggling to get to a supermarket, or are unable to find a delivery slot.Mental health problems, low aspirations and domestic abuse are among the issues she deals with.\"For some, it's like Budgens has burned down and their life has fallen apart,\" she said.Lucy Worrell was making a special trip from a neighbouring village to support the local shops in Holt.\"We've just had this extraordinary period of lockdown and then for this to happen, it couldn't get any worse,\" she said.\"I really hope it will come back.\"Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}