{"author":"","title":"Welsh roads review chair defends work after Labour criticism","news_category":"general","content":"The chair of a controversial roads review panel has defended its work in a letter to Senedd members.The results of the exercise saw the Welsh government scrap all major road building projects.Dr Lynn Sloman said there had been \"considerable engagement\" during the review, despite claims otherwise.She defended not consulting the public - one former transport minister had accused her review of ignoring the wishes of citizens.Ms Sloman's letter to Senedd members directly contradicts part of the text of a motion that Labour MSs backed last week, which a source had said followed a threat of a rebellion from the backbenches.BBC Wales was told the chair's letter reflected unhappiness with how the work of the panel had been portrayed.Ken Skates, Labour MS for Clwyd South, said after the review that it had stopped most investment in roads without putting in place plans for improving public transport.Defending the review on Tuesday, First Minister Mark Drakeford said engagement had been \"extensive\".The Conservative motion, amended by Plaid Cymru, said there was \"lack of engagement by the Roads Review Panel with the public, elected representatives, local authorities, businesses and the third sector and others\".Referring directly to the vote, Dr Sloman wrote \"there was in fact considerable engagement during the roads review\".She said there were \"over 30 meetings with key stakeholder groups\".\"Through workshops and other meetings, we engaged with 14 local authorities and 25 organisations representing business, tourism, freight and logistics sectors; the third sector; professional institutions and young people.\"\"It has been suggested that the panel should have consulted the public,\" she said.\"However the roads review was a technical exercise, reviewing whether schemes were consistent with government policy that had been agreed after the schemes were initiated.\"She said the government policies themselves \"had already been the subject of thorough consultation by the Welsh government\".Dr Sloman added the panel took account of findings from previous road scheme consultations.In the Senedd, Mark Drakeford said the engagement had been \"extensive\".\"There will be further opportunities for public consultation and engagement when particular schemes come forward for their implementation,\" he told Welsh Conservative Senedd leader Andrew RT Davies.Earlier he said: \"We have to reduce our carbon emissions. Transport makes up 15 per cent of our total emissions in Wales and it has been the most stubborn sector in reducing those emissions.\"That's why we have to face up to that fact and take the action that will leave those future generations in a better place than they would be.\"Andrew RT Davies said of the motion: \"There was no ambiguity in what you were voting on.\"Yet you clearly believe that there has been a lack of engagement in formulating this important policy that the government has brought forward.\"Plaid Cymru's transport spokeswoman Delyth Jewell said: \"Securing desire for change is just as important as making the changes to the infrastructure, and part of that is to ensure that the public are in a place where they are on board with the proposed changes. \"We are not yet at that stage, and there is an onus on the Welsh Government to ensure that they outline a route to that new future."}