{"author":"","title":"Father dragged away from ill child's bedside","news_category":"general","content":"A father was dragged away from his child's hospital bedside and arrested after refusing to leave when told her life support should be switched off.Rashid Abbasi's six-year-old daughter Zainab had complex needs due to a rare degenerative condition.There had been disagreements between her parents, who are both doctors, and the hospital about her care.The hospital trust cannot be named for legal reasons but said the decision to involve police was never taken lightly.Zainab suffered from Niemann-Pick Disease and the after-effects of swine flu, which she contracted when she was two.In 2018 she had a flare-up of her lung condition after a viral infection and her parents were advised that \"it would be kind to let her go as she was unlikely to pull through\".However, they refused as they felt that she still had a good quality of life, and she later returned home after responding to treatment.Dr Abbasi said the fact they had disagreed with the trust meant they were labelled as \"argumentative\".Zainab became ill again in the summer of 2019 and was put on life support at the family's local hospital, in the north-east of England.Dr Abbasi said \"It was the same saga all over again, but this time there was a determination.\"The day the police were called we were involved in a meeting lasting about 25 minutes and told they had decided they would take her off the ventilator, remove her tube and allow her to die.\"But the day previous to that they were talking about giving her a chance to survive by withdrawing ventilation more gradually over a period of days.\"But on that day there were not going to go that way. At that point I felt they would be doing it while we were in the meeting so I stood up and went to her bed and the consultant tried to block me.\"The hospital called Northumbria Police and officers arrived while Dr Abbasi was holding his daughter's hand at her bedside and asked him to step away.He said he asked if they had any legal reason to remove him such as a court order or arrest warrant, otherwise he would not go, as he feared he would not be allowed to return and her ventilation tube would be removed.He said: \"One officer came from the right and that was the hand I was holding Zainab's finger, and just grabbed me.\"Another pulled him to the floor, he said, and he was then physically restrained, his legs strapped together, and wheeled out of the area.He was not charged and no action has been taken against him.Zainab died about four weeks later.Dr Abbasi said: \"We are still living the nightmare, I still wake up in the middle of the night feeling someone is pulling a tube from my daughter and tightening my handcuffs.\"The trust said: \"It is essential that we maintain a safe and secure environment for our patients and families.\"Our staff always go to strenuous lengths to ensure that families' wishes are respected, and that they are supported as they approach the end of their child's life, and make all possible efforts to ensure this is peaceful and dignified.\"Northumbria Police said: \"We… responded to a call of a man being violent and abusive towards staff and that he had assaulted a consultant.\"While we recognised this was a very distressing time for him and his family, our duty was to ensure the safety of all those present.\"We are … in the process of reviewing a civil claim, so it would be inappropriate to comment any further.\""}