{"author":"","title":"Christopher Alder death: Police investigate body mix-up","news_category":"general","content":"Police have started an investigation after the body of a man turned up at a mortuary more than 10 years after he was thought to have been buried.Ex-paratrooper Christopher Alder, 37, died in police custody in Hull in 1998.His body was found in a mortuary where it was thought the body of a woman, Grace Kamara, was also kept.South Yorkshire Police will carry out the investigation instead of Humberside Police because of the Humberside force's links with Mr Alder's death.Chief Constable Tim Hollis said: \"Whilst the role of the police is to provide investigative support to the respective authorities I am, naturally, mindful of the strong association of Humberside Police with Christopher Alder's name and his sad death.\"It is, therefore, my decision to invite South Yorkshire Police to provide a team of officers to undertake any necessary investigation into the circumstances that have come to light.\"This investigation will examine the circumstances surrounding the retention and safe keeping of the bodies of Christopher Alder and Grace Kamara and their subsequent release for interment.\"Mr Hollis added: \"On a personal note, my thoughts are with the family of Mrs Kamara who, at this time, still do not know the whereabouts of her body and to Christopher Alder's family who have now been informed that Christopher's body was not buried, as they believed, in November 2000.\"This video can not be playedChristopher Alder's sister Janet: \"I'm just in total shock\"Hull City Council's chief executive said she had requested that police start a criminal investigation into the matter.Nicola Yates said the case was \"extremely distressing\".She said: \"I am appalled and distraught at what we have learned and my first priority has been to make sure the families involved are kept informed and given the necessary support.\"It is vital that the families and the public get a clear view of the facts and understand what happened. A thorough police investigation will make sure this happens.\"Now that the police are carrying out a formal investigation it would be inappropriate for me to comment further.\""}