{"author":"","title":"Birmingham 2022: Commonwealth Games cultural festival awarded £6m","news_category":"general","content":"The 2022 Birmingham Commonwealth Games have been awarded £6m towards a cultural festival.The money has been jointly awarded by the National Lottery Heritage Fund and Arts Council England.The festival will run from March to September 2022, around the city's hosting of the sporting games. <https:\/\/www.bbc.co.uk\/news\/uk-england-birmingham-42424848>It will provide funding for more than 200 creative projects and see artists commissioned to create works showcasing the area's \"rich diversity\".Organisers say 90% of the work commissioned during the festival will be from people based in, or originally from, the West Midlands.Martin Green, chief creative officer of Birmingham 2022 Commonwealth Games, said the investment \"underlines a significant moment of genuine confidence in the West Midlands' arts and heritage sectors\".He said, added to £2m from Birmingham City Council, it took the festival \"halfway\" to its financial target.\"Through the cultural festival, we will support and commission some incredible creative projects that connect communities across Birmingham and the West Midlands,\" he said.\"What we love about the arts and heritage sectors is their uniquely transformative power, and there has never been a greater need for this hope and optimism than right now, as we all stare down the impact that the pandemic has had on the creative industries.\"Oliver Dowden MP, Culture Secretary, said: \"2022 will be a year of national celebration for the UK and the Commonwealth Games' cultural programme will allow the region's diversity and creativity to play a key role in our recovery from the pandemic - driving tourism, investment and cultural renewal.\"Follow BBC West Midlands on Facebook <https:\/\/www.facebook.com\/MidlandsBBC\/>, Twitter <https:\/\/twitter.com\/bbcmtd> and Instagram <https:\/\/www.instagram.com\/bbc_midlands\/?hl=en>. Send your story ideas to: newsonline.westmidlands@bbc.co.uk <mailto:newsonline.westmidlands@bbc.co.uk>"}