{"author":"By David Deans","title":"Bus cuts could be devastating, say Labour council leaders","news_category":"general","content":"Cuts to bus services could be \"devastating\" for groups that rely on public transport, a letter signed by two Labour council leaders has said.Writing on behalf of the Welsh Local Government Association (WLGA), Andrew Morgan and Rob Stewart set out a long list of complaints over Welsh government transport policy.News that Covid bus grants will end sparked fears of large scale cuts <https:\/\/www.bbc.co.uk\/news\/uk-wales-politics-64798117>.The Welsh government declined to comment on \"leaked documents\".The letter to First Minister Mark Drakeford raised concern about the recent roads review that scrapped all major road building projects, plans for the 20mph default speed limit in urban areas and pavement parking fines.Leaked to BBC Wales, the document also criticised the \"tone\" adopted in meetings by the man in charge of the policies, Deputy Climate Change Minister Lee Waters.Plaid Cymru local government spokesman Llyr Gruffydd said: \"At the centre of any plan to ensure a greener future for all of Wales must be a public transport system that is improved and equally available to all.\"Any plan to ensure this must take everyone in Wales along with it.\"Mr Morgan and Mr Stewart are respectively leader and deputy leader of the cross-party WLGA, which represents all of Wales' 22 local authorities.Mr Morgan is Labour leader of Rhondda Cynon Taf council, while Mr Stewart is Labour leader of Swansea council.The letter said Wales' 22 council leaders want an \"urgent\" meeting with Mark Drakeford, and argued bus services are a \"life-line\" for older people, young people, people with disabilities and low income households.\"Loss of bus services is potentially devastating for these groups, impacting on their well-being by restricting access to educational, economic, health and leisure services and to family and social contacts,\" it said.They accused the Welsh government of \"cart-before-horse planning\" for public transport, and called for ways to be found to make Covid bus emergency cash permanent to protect services.\"Whilst passenger numbers have not recovered post-Covid, they never will if services start to be cut across Wales,\" the WLGA leaders wrote.Rural council leaders are worried there could be more areas with no public transport services.\"Attempts to attract businesses to rural areas to create local sources of employment and reduce the need to travel are felt to be at risk if vital highway improvements and access routes are effectively ruled out and public transport options are not available,\" the letter said.Despite the pandemic easing, bus firms are reliant on Covid aid because passenger numbers have not fully recovered.Earlier this year it was extended, but only for three months to June.On Wednesday Mr Waters told the Senedd the government was trying to find a way to bridge the gap between the end of the scheme and plans to reform bus regulation.\"The money simply isn't there to keep all the current services running,\" he said.He said \"in the face of the continued austerity budget that we have\" from the UK government \"we simply do not have the resources available to continue funding the emergency subsidy at the rate that we have\".The WLGA letter also appeared to contradict claims by the roads review chairwoman Lynn Sloman that the exercise conducted\"considerable engagement\" <https:\/\/www.bbc.co.uk\/news\/uk-wales-politics-64954511>.The leaders said there had been \"very limited contact\" with council leaders and only after the review had reached its conclusions.\"Local communities that will be affected by the decisions were given no opportunity to input from their lived experiences,\" the pair wrote.Meanwhile councils were said to be struggling with the \"sheer volume of transport-related issues\", the WLGA leaders wrote, with lots of projects being taken forward at the same time, including pavement parking.The 20mph default speed limit, due to be introduced in September <https:\/\/www.bbc.co.uk\/news\/uk-wales-62020427>, \"will lengthen some home to school journey times\" and add to school transport operator costs, the WLGA argued.\"Taken together, one leader described the situation as a 'perfect storm' for communities,\" the letter said.\"Another referred to the current approach as 'all stick and no carrot'.\"Referring to Mr Waters, it added: \"Whilst we have been grateful to the deputy minister for his readiness to engage with leaders and transport cabinet members on these issues, members have been concerned about the nature of the debate and tone of the meetings.\"Leaders stressed the importance of mutual respect in our discussions,\" it added.The letter said the current set of highways and transport policies \"are all well-intentioned and laudable in their own right, but we feel there is a better way to approach them\".\"Leaders' general feeling was that they are being handed down to councils rather than being developed with us.\""}