{"author":"By Johny Cassidy","title":"How we pay the bills: Skipping meals and fewer car journeys","news_category":"general","content":"About 22 million households are about to have to pay a lot more for their energy bills, a move that could push millions into poverty.As warnings grow of the worst drop in living standards since records began, the BBC will be following a number of people throughout the year to see how they are managing.Ruchita Green has been thinking about spiralling costs for months, as she has watched petrol and food prices go up.The 38-year-old lives near Grimsby in Lincolnshire with her husband Darren, a teacher, their three children and her husband's parents.Their energy bill is already high at £198 a month, which includes the cost of heating an annexe in their home where Darren's parents live. They haven't yet summoned the courage to read their meter, but they are bracing themselves for a steep rise, and to have to tighten their belts. The average annual bill is likely to increase by £693, according to Ofgem - a rise like that would add another £58 to their monthly outgoings.\"We're really starting to worry about how it's all going to work,\" Ruchita says.Darren's salary of about £2,750 a month is their main source of income. Ruchita runs a business teaching people how to cook Indian food in their own homes, but it doesn't bring in much and margins are tight. \"If a client decides they want to have meat for starters and meat as part of the main course my heart sinks,\" she says. She will soon have to decide whether to increase her prices, or only cook cheaper vegetarian meals. She worries either might also cause a drop in her business.The weekly petrol bill for their car has gone from £20 to £30 a week, so she's started to cut down on journeys. For the weekly shop, she's been buying cheaper brands, and buying tinned fruit instead of fresh, and they've cut down on takeaways, which she thinks has saved them at least £80 a month. She's also changed childminder, saving about £20 a week.Another area they've had to cut down on is on some of their other children's after-school activities, which Ruchita says has been tough on their eldest children, aged 11 and six. \"They ask me why can't we do multi-sports any more and I have to tell them it's because we can't afford it.\"At the moment they're just about managing, Ruchita says, but she is aware that further increases could have a bigger impact.Esme Buxton often doesn't earn enough to make ends meet, and regularly relies on family for help.She got a shock in December when her energy supplier told her the £30 monthly direct debit she'd been paying hadn't been enough to cover her energy bills, and it was increasing to £66. \"They then put it up to £75 in February, and then again to £95 in March,\" she says.The 30-year-old lives in a one-bedroom flat in Cheltenham which she shares with her Romanian rescue dog Arlo, and works as a freelance photographer and marketer. She says that the seasonal nature of wedding photography means she finds it hard to balance the books.She knows she is fortunate that her family will help, and she keeps a tight rein on her spending, but looking at her budget from February it's easy to see just how precarious things are.\"I earned £1,188 in February. My total bills came to £1,603. I got £500 of a top-up loan from my dad and grandad,\" she says. \"That left me with a grand total of £85 for any extras.\"Those little extras are things like going swimming or to the gym or to have a coffee in the park with her mum. She was able to go to the cinema this month because of an offer she got with her mobile phone supplier, but as for things like eating out or the pub, they're all gone for the moment.\"I'm constantly worried about money and think about it all the time. I'm always juggling things in my head to try and make everything add up, which it doesn't.\"As well as her £595 rent, £94 council tax and the money for other utility bills such as water and her phone, Esme also puts £300 aside every month for her annual tax bill. But the tax money is what she'll dip into if an unexpected bill comes in, like when she had to pay for a new wheel for her bike after it was stolen from outside her flat.\"The bike saves me money on public transport, so I knew I really needed to get it,\" she says, \"but that money will have to be paid back from next month's budget which will leave me short again.\"To help cut back, she now only uses the heating in the evening. She's even bought an air fryer in an attempt to stop using her oven. \"The air fryer is great,\" she laughs. \"I made donuts in it the other day.\"Esme is also trying to cut back on her food budget. She's allowing herself around £30 a week and now almost exclusively shops in her local Lidl. She has noticed the cost of fresh fruit going up and now buys frozen.The one thing she says she can't really cut back on is food for her dog Arlo. \"I try to shop around online to get a good deal, but even with doing that I'm spending nearly £50 feeding her every month,\" she says. \"I also have to pay pet insurance. If anything happened to her I wouldn't be able to afford the vet bills. All these things add up.\"Andrew McIntyre owes his energy supplier £1,200, and his monthly bill is about to go up from £75 to £120 a month.The 57-year-old lives off universal credit, and already regularly faces a shortfall between what he's got coming in and what he needs to pay on bills.As he gets ready to go to a local food charity for a free meal - something he does one day a week and likes to get dressed up smartly for - he explains that it means he's had to choose between paying his rent and heating his flat.\"Every month I'm robbing Peter to pay Paul,\" he says. Andrew gets £325 a month in universal credit, and £351 a month in housing benefit. He has no savings. He pays £400 for rent, leaving him with £276 for food and bills.Andrew tries to keep his energy use to a minimum. \"During the winter I put on extra layers to keep warm,\" he says. \"If I am really cold sitting watching TV in the evening, I'll get inside my sleeping bag on the sofa and keep warm like that.\"He allows himself about £80 a month on food, but that includes him skipping meals. \"If I can eat late in the morning then I don't have to eat again until my evening meal,\" he says.He has time to go to different supermarkets in his hometown of Walsall in the West Midlands to find the cheapest deals. \"I know the price of everything,\" he laughs. \"A change of only a few pence really makes a difference to how far my money will go.\"The rest of his money goes on paying his phone bill, water bill and council tax.It's particularly important for Andrew that he keeps up with his rent. In 2009, he lost the factory job he'd worked at for nearly 29 years and split from his long-term partner, and he found himself living on the streets for seven months.\"I'll never forget the experience and how it hit me,\" he says. \"If I have to choose between keeping a roof over my head and paying my electric bill, it's an easy choice. There's no way I'll ever end up homeless again.\"Andrew says he really did feel close to the edge at times, but he's also strangely positive now about the experience.\"I can sit on my settee in the evening and be thankful for what I've got. I don't have a lot, but what I do have I'm thankful for,\" he says.We're keen to talk to people who are willing to disclose their incoming and outgoing income as well as track their finances over the year. If you would like to take part emailhaveyoursay@bbc.co.uk <mailto:haveyoursay@bbc.co.uk?subject=costofliving60932732>.Please include a contact number if you are willing to speak to a BBC journalist. You can also get in touch in the following ways:If you are reading this page and can't see the form you will need to visit the mobile version of theBBC website <https:\/\/www.bbc.co.uk\/news\/have_your_say> to submit your question or comment or you can email us atHaveYourSay@bbc.co.uk <mailto:Haveyoursay@bbc.co.uk>. Please include your name, age and location with any submission."}