{"author":"","title":"Doncaster Sheffield Airport: PM Liz Truss vows to fight closure","news_category":"general","content":"This video can not be playedSpeaking to BBC Look North, Ms Truss said: \"I want to make sure that airport survives.\"Prime Minister Liz Truss has pledged to do all she can to save Doncaster Sheffield Airport.On Tuesday, owner Peel Group said the airport, which employs 800 workers, would wind down from 31 October.Speaking to BBC Look North, Ms Truss said: \"I want to make sure that airport survives. I will do what I can, and I will talk to the relevant people.\"Peel Group said the closure was due to a \"fundamental lack of financial viability\".Ms Truss admitted she was \"very concerned\" to hear the decision to close, adding the government was working with local leaders and Peel Group \"to see what can be done\".South Yorkshire's political leaders have offered public money <https:\/\/www.bbc.co.uk\/news\/uk-england-south-yorkshire-63014655> to keep the airport operating into next year.Responding to Ms Truss' comments, South Yorkshire's Mayor Oliver Coppard said: \"I am really glad that the prime minister has said, again, that she is going to step in and help us save Doncaster Sheffield Airport.\"Mr Coppard, who is now awaiting contact with Downing Street, said everything had been done \"locally and regionally\" to keep the airport open.He suggested the government could use measures under the Civil Contingencies Act to save the airport.During the same interview, Ms Truss was asked how, as a mother, she felt about Leeds charity Zarach, which provides beds for children living in poverty, receiving 40 referrals in the first week of the school year.Ms Truss, who grew up in the Roundhay area of the city, replied: \"I feel terrible. I am very concerned about those children's future, and what I am determined to do as prime minister is to make sure that we act to secure a positive future for people in Leeds and right across the country.\"Follow BBC Yorkshire on Facebook <https:\/\/www.facebook.com\/BBCYorkshire\/>, Twitter <https:\/\/twitter.com\/bbclooknorth> and Instagram <https:\/\/www.instagram.com\/bbcyorkshire\/>. Send your story ideas to yorkslincs.news@bbc.co.uk <mailto:yorkslincs.news@bbc.co.uk>."}