{"author":"By Brian Milligan","title":"Service charge complaints 'up 46%' among leaseholders","news_category":"general","content":"Flat-owners' complaints about service charges have risen by 46% in two years to 7,600, figures show.They queried the amount they were being asked to pay for maintenance and repairs, the Leasehold Advisory Service for England and Wales said.In some cases flat-owners have been asked for payments of tens of thousands of pounds by those who manage the blocks they live in.But an agents' association said actual numbers of complaints remained low.Rod Campbell, a former film stuntman from Zimbabwe, lives in a block of flats in Worthing in West Sussex.He and the other 44 leaseholders have been told to pay £11,000 each to cover recent repairs. This included painting and installing new railings.\"The people here are feeling the heat and they are very frustrated,\" he said.\"To find that sort of money, in a one-off payment? Pretty much impossible.\"The managing agents have justified the charges to residents by telling them in a letter that they are trying to \"push for a better future\".There are 2.5 million leaseholders across England and Wales.That refers to people who own their own flat, but who are obliged to pay maintenance and service charges to the owner of the freehold.The flats can be part of a block, or an individual house.Just over 7,600 queries or complaints about one-off charges have been recorded in the last year, according to the Leasehold Advisory Service. That is a 46% increase over two years.Anthony Essien, chief executive of the service, puts that down to the fact that more people are worried about their finances in tougher economic times.But he also said that some managing agents could be overcharging flat-owners.\"There must be, on occasion, some poor behaviour,\" he said. \"It happens.\"Overall he believed that the situation was not as bad as in the mid-1990s.\"However that does not mean that there are not mistakes made, and overcharging.\"Those who own flats previously owned by local authorities can be in an even tougher situation than Rod Campbell.On the Warwick Estate in West London, flat-owners are being charged up to £35,000 each for repairs.In some cases that could be more than they actually paid for the flats in the first place.Westminster Council justifies the charge by saying that no repairs had been done to the tower blocks since the 1950s.They have had new lifts, windows and cladding installed. A spokesperson said the value of the individual flats was likely to increase as a result of the improvements.But Steve O'Connell, who is leading an inquiry into maintenance charges for the Greater London Authority, is not impressed.\"£35,000 is a staggering amount,\" he said.Any recommendations his committee makes before the end of the year could be applied across the country.\"There are a lot of unhappy people out there, and a lot of people who do not understand what they are paying for and what they are getting. I hope we can help them,\" he said.In the early part of this decade, half the homes being developed were flats, as a result of the property boom. That is much higher than the long-term trend.There are now twice as many leaseholders in England and Wales than there used to be.David Hewett, head of the Association of Residential Managing Agents, believes that is one reason for the increase in complaints.\"We have got to get this into perspective,\" he said.\"That is 7,000 complaints for 2.5 million flat-owners.\"Like Anthony Essien, he also believes people are becoming more money conscious in difficult economic times, so are doing all they can to reduce costs.Under the 1985 Landlord and Tenant Act, leaseholders have the right to examine any receipts for maintenance work.That work has to be deemed \"reasonable\".If not, leaseholders can take their managing agents to a Leasehold Valuation Tribunal.But, despite that safeguard, some in the industry are highly concerned that the whole business of property management remains unregulated.However, countries like France and Australia take a very different view. They have a system whereby property managers are licensed."}