{"author":"","title":"Natural Resources Wales: River Llynfi pollution probe 'feeble'","news_category":"general","content":"Natural Resources Wales has been criticised after its probe into a pollution incident which killed about 45,000 fish ended without any action.NRW said it was appalled by the damage on the River Llynfi <https:\/\/www.bbc.co.uk\/news\/uk-wales-53628642>, near Pontithel, Powys, but there was \"no realistic prospect of conviction\".One Powys county councillor tweeted that NRW was \"not fit for purpose\" and another said its response was\"feeble\" <https:\/\/twitter.com\/WmPowell2021\/status\/1454146741561958411>.NRW said it could consider reopening the case <https:\/\/naturalresources.wales\/about-us\/news-and-events\/news\/llynfi-pollution-investigation-ends-without-further-action-being-taken\/?lang=en> if new evidence came to light.The River Llynfi, a tributary to the River Wye, is a Site of Special of Scientific Interest in a special area of conservation.In a tweet <https:\/\/twitter.com\/emilyvdurrant\/status\/1454153463689003008>, Green Party councillor Emily Durrant said she was \"devastated\" by the decision, adding that NRW was \"not fit for purpose if it can't even enforce a major point source pollution event like this one\".This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Welsh Liberal Democrat councillor William Powell, a former Member of the Senedd,tweeted <https:\/\/twitter.com\/WmPowell2021\/status\/1454146741561958411> that it was \"darkest hour in the history\" of the NRW as \"residents... and all fair-minded people have waited patiently for justice\".Ann Weedy, NRW operations manager, said: \"We are very disappointed that we have not been able to bring those responsible to justice.\""}