{"author":"","title":"Olivia Pratt-Korbel: Man accused of murder innocent, witness tells jury","news_category":"general","content":"A man accused of murdering a nine-year-old girl in a botched \"execution\" was innocent, a witness has told a court.Thomas Cashman has been accused of shooting Olivia Pratt-Korbel and injuring her mother Cheryl after chasing a man into their Liverpool home at about 22:00 BST on 22 August 2022.Nicky McHale, 32, told the jury he saw and spoke to the 34-year-old around the time of the shooting.Under cross-examination, he denied lying to \"bail out\" Mr Cashman.The court has heard that Mr Cashman allegedly shot convicted drug dealer Joseph Nee, 36, in the street, before his victim fled into Ms Korbel's home as she tried to block his entry.It has been alleged that Mr Cashman fired again, with the bullet travelling through Ms Korbel's hand before hitting and killing her daughter behind her.Mr McHale said on the night of the shooting, he had been watching football on TV at home on Snowberry Road, Dovecot, and when the match finished, he went outside to smoke a cigarette.He told the jury that while stood on his front door at about 22:00, he looked across the road and saw Mr Cashman smoking cannabis in the front garden of the house opposite.He said the two spoke briefly about the football match before Mr McHale went back inside his home.The jury has heard that after the shooting, Mr Cashman allegedly went to the house of a woman he had a fling with and changed his clothes.The woman, who cannot be identified, told the court she overheard Mr Cashman say he had \"done Joey\".However, Mr McHale said after initially seeing Mr Cashman across the road, the defendant was later in his house to smoke more cannabis and asked for a drink.He said he did not have any in the house, so used Mr Cashman's van to go to a local shop to buy soft drinks, a trip which was caught on CCTV.Under cross-examination, prosecutor David McLachlan KC asked Mr McHale if what he had said \"would give Mr Cashman an alibi?\"\"Are you telling the truth? Or are you just here to try to bail him out?\" he said.\"No,\" the witness replied.Indicating the defendant in the dock, Mr McLachlan then asked if Mr McHale was \"willing to stand there and... willing to say you saw that man there?\"\"That's correct, because I did,\" the witness replied.Mr McHale then denied Mr McLachlan's suggestion that he was \"a liar\" and disagreed with the implication that he had \"been paid to be here\".Asked directly why he was in the court by Mr McLachlan, Mr McHale said he was there \"because I know Thomas Cashman is innocent\".Earlier, under questioning from John Cooper KC, defending, Mr McHale said he had never given evidence in court before and his only previous conviction was for possession with intent to supply £4,000 worth of cannabis.Mr Cashman, of Grenadier Drive, West Derby, Liverpool, has admitted being a \"high-level\" cannabis dealer, making up to £5,000 a week in drugs money, but has denied the murder of Olivia, the attempted murder of Nee, wounding Ms Korbel with intent and two counts of possession of a firearm with intent to endanger life.The trial continues. Why not follow BBC North West on Facebook <https:\/\/en-gb.facebook.com\/BBCNW\/>, Twitter <https:\/\/twitter.com\/BBCNWT> and Instagram <https:\/\/www.instagram.com\/bbcnorthwest\/>? You can also send story ideas to northwest.newsonline@bbc.co.uk <mailto:northwest.newsonline@bbc.co.uk>"}