{"author":"","title":"Man Booker Prize: Anna Burns becomes first winner from Northern Ireland","news_category":"general","content":"This video can not be playedThe moment Anna Burns wins the Man Booker prizeAnna Burns has been named the winner of this year's Man Booker Prize - becoming the first author from Northern Ireland to triumph.Milkman, set in an unnamed city in Northern Ireland during the Troubles, is a coming-of-age story about a young girl's affair with a married man.Burns, who told the BBC she was \"stunned\" to win, will receive £50,000 in prize money.The judges said Milkman was \"simply marvellous\".They highlighted the \"distinctive and consistently realised voice of the funny, resilient, astute, plain-spoken, first-person protagonist\".Speaking on Radio 4's Today programme <https:\/\/www.bbc.co.uk\/sounds\/play\/m0000qks> on Wednesday, Burns said the £50,000 prize would be life-changing.\"I'll pay my debts,\" she said. \"It will make a huge monetary difference and I will become solvent and live on what's left.\"Writers don't earn a lot of money so that's a huge gift that's been given to me,\" she went on.Milkman beat competition from Everything Under by Daisy Johnson - who, at 27, was the youngest nominee in Man Booker history.The other nominees were The Long Take by Robin Robertson, Washington Black by Esi Edugyan, The Mars Room by Rachel Kushner, and The Overstory by Richard Powers.Milkman is the fourth novel to be written by Burns, who was born in Belfast in 1962.Her debut, No Bones, was published in 2001, and followed by Little Constructions six years later. Her most recent work prior to Milkman was Mostly Hero - a novella published in 2014.Speaking to BBC News, Kwame Anthony Appiah, the chairman of the judges, said: \"One of the wonderful things about [Milkman] is the texture of the language.\"It's written in this amazing voice of this woman who is living in a divided society.\"She's being harassed by a man who is sexually interested in her, and he's taking advantage of divisions in the society to use the power he has, because of those divisions, to go after her.\"Burns opted not to give names to her characters in the novel. Wven her narrator refers to herself as \"Middle Sister\".Speaking after her win, Burns told BBC News: \"The book just didn't work with names.\"There's a lack of safety of being straightforward in the book and declaring who you are. But really, if I put in names it lost power, it lost atmosphere.\"Asked how her real-life experience informed her writing, Burns said: \"I was brought up in Belfast and that did have a huge influence on the book, writing about an entire society affected by long-term violence, living under intense pressure, and how that becomes normality.\"Writing in the Guardian <https:\/\/www.theguardian.com\/books\/2018\/may\/31\/milkman-anna-burns-review-northern-ireland>, Claire Kilroy said: \"The narrator of Milkman disrupts the status quo not through being political, heroic or violently opposed, but because she is original, funny, disarmingly oblique and unique: different.\"The same can be said of this book.\"In his five-star review in the Daily Telegraph <https:\/\/www.telegraph.co.uk\/books\/what-to-read\/milkman-anna-burns-review-viciously-funny-take-troubles\/>, Cal Revely-Calder described the novel as \"viciously funny\".\"The pace of Milkman is leisurely at best, because its narrator experiences the plot as an entirely unwelcome event,\" he added.The New Statesman's Catherine Taylor <https:\/\/www.newstatesman.com\/2018\/08\/anna-burns-milkman-review-man-booker> said every character in the novel \"crackles with intellectual verve and droll verbosity\".\"While Milkman is a work of timely universality, it is also a distinctly Irish novel. A darkly mirthful satire with a twist of Beckettian melancholy and an anarchic touch of Swift.\"\"The novel is an unusual and beguiling piece of prose,\" wrote Alison Garden in The Irish Times <https:\/\/www.irishtimes.com\/culture\/books\/in-praise-of-milkman-ireland-s-man-booker-prize-nominee-1.3661398>.\"Burns's novel also makes a searing commentary on the conservative political climate of 2018 and the domestic debris that decades of conflict have left in their wake.\"Kwame Anthony Appiah added that Milkman's lead character was \"an extremely interesting voice\".He said: \"She's witty, and the way you hear her voice in your head - I think you've never heard a voice like it before, it's completely new.\"Asked whether he accepts Milkman is a challenging read, Appiah replied it was \"enormously rewarding\" provided readers persist with it.\"It is true that because of the flow of the language and the length of the sentences and the fact that some of the language is unfamiliar, that it is not a light read.\"It's challenging in the way a walk up Snowdon is challenging - it's definitely worth it because the view is terrific when you get to the top.\"Follow us on Facebook <https:\/\/www.facebook.com\/BBCEntsNews\/>, on Twitter @BBCNewsEnts <https:\/\/twitter.com\/BBCNewsEnts>, or on Instagram at bbcnewsents <https:\/\/www.instagram.com\/BBCNewsEnts\/>. If you have a story suggestion email entertainment.news@bbc.co.uk <mailto:entertainment.news@bbc.co.uk>."}