{"author":"By Jonah Fisher","title":"Carbon capture: What is it and how does it fight climate change?","news_category":"general","content":"The UK government has announced that the first sites in the UK to capture greenhouse gases will be in Teesside.The carbon capture plants are designed to prevent carbon dioxide (CO2) from industrial processes and power stations being released into the atmosphere.The announcement was part of the government's new Net Zero Strategy and aims to move the UK closer to meeting its legally-binding carbon commitments.Burning fossil fuels like oil, gas and coal to generate electricity emits CO2, which is the main driver of climate change.The carbon capture process stops most of the CO2 produced from being released, and either re-uses it or stores it underground.The UK government wants a new power station where carbon dioxide is captured and stored under the North Sea - either in old oil and gas reservoirs, or permeable rocks known as saline aquifers.Carbon capture power plants are part of the government's commitment to remove carbon from UK electricity production by 2035. It hopes to build at least one by the mid 2020s, although that deadline now looks improbable.There has been a big expansion in renewable energy in the last decade - in particular the use of offshore wind - but the unresolved question is how to keep the lights on when the wind isn't blowing.Carbon capture power stations are seen as part of the solution, along with the increased use ofnuclear energy <https:\/\/www.bbc.co.uk\/news\/business-59212992>, and other rapidly-evolving technologies such ashydrogen <https:\/\/www.bbc.co.uk\/news\/av\/science-environment-59092240>. The government has now agreed to go ahead with funding three carbon capture plants near Redcar on Teesside.One will capture carbon from a gas-fired power station and the two others from hydrogen production.All would require the construction of a pipeline to transport the captured CO2 under the North Sea for storage.In 2021, the UK emitted 425 million tonnes of CO2. That's fallen by almost 50% since 1990.The amount being captured at these proposed power stations is very small by comparison.None of the proposed carbon capture plants claims to capture more than two million tonnes a year.The government has set a target to capture between 20 and 30 million tonnes of CO2 a year by 2030. That could involve other industrial processes as well as power generation.The technology has been around for decades. It's mainly been used in industries where captured CO2 can be reused, for example to force out oil and gas from underground reserves.There are no such plans to use the CO2 from the new proposed power stations. The cost of a new gas power station, providing electricity for nearly a million homes, is around £350m.Catherine Raw of energy company SSE told the BBC that building a similar sized gas power station with carbon capture would roughly double the cost.The hope is that the price might fall over time. The cost of renewable energy for example has plummeted in the last decade.There are those who see carbon capture as too expensive and believe the money would be better spent on renewables and power storage (like batteries).\"These power stations look like another excuse for the government to show preference to their friends in the oil and gas industry, making energy more expensive to everyone else's disadvantage,\" says Dr Doug Parr of campaign group Greenpeace UK.In September 2022 there were just 30 carbon capture facilities in the world, according toa report from the Global CCS Institute. <https:\/\/www.globalccsinstitute.com\/resources\/global-status-of-ccs-2022\/>Almost all of these are attached to industrial plants carrying out activities such as natural gas processing or fertiliser production.Once built, it is hoped other industries would use the UK power station's pipeline to store CO2 under the North Sea.The only carbon capture power station currently operating is a coal-fired plant atBoundary Dam in western Canada <https:\/\/www.saskpower.com\/Our-Power-Future\/Our-Electricity\/Electrical-System\/System-Map\/Boundary-Dam-Power-Station>.However, several carbon capture gas power stations similar to those proposed in the UK are in development, mostly in the US."}