{"author":"","title":"Pope Francis hints at 'brief' papacy","news_category":"general","content":"Pope Francis has suggested he may resign his papacy like his predecessor, rather than remain at the Vatican for life.The pontiff made the comments during a interview with Mexican television, marking the second anniversary of his election.\"I have the feeling that my pontificate will be brief. Four or five years; I do not know, even two or three,\" he said.He praised Pope Benedict's decision to step aside in 2013 as \"courageous\". \"Benedict should not be considered an exception, but an institution. Maybe he will be the only one for a long time, maybe he will not be the only one.\"But an institutional door has been opened,\" he told the Televisa channel <http:\/\/noticieros.televisa.com\/mexico\/1503\/papa-francisco-mexico-todo-paz\/>. Pope Francis has hinted in the past that he could retire, but said he was opposed to the idea of an age limit for leaders of the Catholic Church.\"To say that one is in charge up to 80 years, creates a sensation that the pontificate is at its end and that would not be a good thing,\" he added.A papal conclave elected Pope Francis as Benedict XVI's successor on 13 March 2013. He became the first Latin American to lead the Church.During the interview he admitted he was \"surprised\" by the decision and had only carried a small suitcase to Rome, with the expectation he would return to Buenos Aires.Analysis: James Reynolds, BBC News, RomeReporters have asked Pope Francis on at least three occasions whether or not he intends to follow his predecessor Benedict XVI in retiring. On each occasion, the Pope has answered with roughly the same words.\"I think that a Pope emeritus should not be an exception,\" he told reporters in August 2014, \"You can ask me: 'What if one day you don't feel prepared to go on?' I would do the same, I would do the same!\"But the Pope also makes it clear that he will stay in the job as long as he has the physical strength to do so. His interview with Mexican TV makes it clear that he still enjoys his papacy. \"Do you like being Pope?\" the reporter asked. \"It doesn't displease me!\" the Pope replied.His simple style has won him praise from Catholics, as have his promises to reform the Curia - the Church's internal government.However, he said two years of his papacy had now passed and he felt it would not continue for very much longer.\"I do not know. But I feel that the Lord has placed me here for a short time, and nothing more,\" he added.\"But it is a feeling. I always leave the possibility open.\"He told Televisa that he \"did not mind being Pope\", but missed the anonymity associated with life as a priest.\"The only thing I would like is to go out one day, without being recognised, and go to a pizzeria for a pizza.\""}