{"author":"","title":"Paul O'Grady \"stole the show\" at final performances","news_category":"general","content":"Attendees at some of Paul O'Grady's last performances have been paying tribute to the star.The comedian died \"unexpectedly but peacefully\" on Tuesday, <https:\/\/www.bbc.co.uk\/news\/entertainment-arts-65062542> at the age of 67, according to his husband.One of his last roles was to guest star as Miss Hannigan in a UK-wide tour of Annie, playing five sell-out shows at the Edinburgh Playhouse last week.One theatre goer described how he appeared full of energy, and \"stole the show\".O'Grady had a long connection with Edinburgh, having first performed at the Fringe in the 1980s.His larger-than-life performance as persona Lily Savage went down a storm with audiences and he made the shortlist for the Perrier award in 1991, a nomination that is credited for his comedy career taking off.Gavin Scott, a studio manager from Edinburgh who attended one of last week's performances especially to see O'Grady, said his portrayal of the role was \"iconic for Edinburgh\".He said O'Grady \"stole the show\" and there was no indication of poor health during his performance.\"He had loads of energy on stage, that's why it was such a shock. There was big choreography in the show, there was big musical numbers and he didn't hold back.\"Really it was Paul's show, the cheer that went up in the house when he came on to take his bow at the end, was amazing,\" he said.Theatre staff at the Edinburgh Playhouse said the show's success owed much to O'Grady's appearances.Pam Aldred, head of marketing and communications, said the whole team was deeply saddened by the news of his death.She said he became \"part of the team\", making time to speak to everyone and even posing for photos with staff members' pets.\"It doesn't matter that he's the star of the show, he's just Paul,\" she said.Ms Aldred said it was O'Grady's \"charisma\" that made him so popular with audiences.\"I would struggle to think of another actor who could play Miss Hannigan in the way that Paul O'Grady did,\" she said.\"He was an incredibly talented, gifted man. Warm, kind, your best pal.\"She said last week's shows were \"almost like a coming home\" for the performer who visited the venue while playing the same role 20 years ago.\"People want to see Paul. They warm to him, they love him, whether it's Paul or Lily,\" she said.The actor had been expected to return to the show when it visited Southampton in a few weeks' time."}