{"author":"","title":"Kim-Trump personal relations 'not enough to resume' US-North Korea talks","news_category":"general","content":"North Korea has received birthday greetings from US President Donald Trump for Kim Jong-un, but says their personal relationship is not enough to restart nuclear negotiations.Mr Kim could personally like Mr Trump, but would not lead his country on the basis of his feelings, said foreign ministry adviser Kim Kye Gwan.He said no talks were possible unless the US accepted the North's demands.Relations between the two countries have deteriorated in recent months.Mr Kim and Mr Trump held face-to-face talks in 2018 and last year aimed at denuclearisation, but discussions have stalled as the US refuses to lift sanctions until North Korea fully abandons its nuclear programme.In a statement carried out by state news agency KCNA, Mr Kye, a veteran diplomat who was involved in previous disarmament negotiations, said Pyongyang would not give up its nuclear facilities in return for partial sanctions relief.\"The reopening of dialogue between [North Korea] and the US may be possible only under the condition of the latter's absolute agreement on the issues raised by the former, but we know well that the US is neither ready nor able to do so,\" he said.The adviser also said there would \"never be such negotiations as that in Vietnam\" - a reference to the second Trump-Kim summit during which the North offered to dismantle the Yongbyon nuclear complex in return for all sanctions on the country lifted. The talks, held in 2019, broke down after the US refused to do so.This video can not be playedDonald Trump and Kim Jong-un: From enemies to frenemiesEarlier this month, Mr Kim declared that North Korea would abandon its moratorium on nuclear and long-range ballistic missile tests <https:\/\/www.bbc.co.uk\/news\/world-asia-50962768> and said his country would soon introduce \"a new strategic weapon\". But he left a door open for dialogue, saying the scope of any testing would depend on the US \"attitude\".The North conducted several smaller weapons tests late in 2019, in what was seen as an attempt to pressure the US into making concessions.Mr Kye also confirmed the country had received Mr Trump's personal letter congratulating Mr Kim for his birthday, believed to be on 8 January, but said it would be \"absent-minded\" to expect a resumption of negotiations based on their relationship, which he described as \"not bad\".\"Although Chairman Kim Jong-un has good personal feelings about President Trump, they are, in the true sense of the word, 'personal',\" he said. \"We have been deceived by the US, being caught in the dialogue with it for over one year and a half, and that was the lost time for us.\"Prof Mason Richey at Hankuk University of Foreign Studies in Seoul told Reuters news agency: \"[The] statement doesn't close the door on diplomacy any more than it already was, but he underlined how the US and North Korea have fundamentally different strategic interests with almost no meaningful overlap.\"The adviser also warned South Korea against trying to act as a mediator between the US and the North. On Friday, an official from South Korea said Mr Trump had asked the country's authorities to pass on birthday greetings to North Korea.For South Korea to meddle in personal relations between Mr Kim and Mr Trump was \"presumptuous\", Mr Kye said, adding that there was a \"special liaison channel\" between the two leaders. South Korea's presidency has declined to comment."}