{"author":"","title":"Frankie Grogan: Child's parents vow to prevent other sudden deaths","news_category":"general","content":"The parents of a toddler who died in his sleep hope sharing their experience will help prevent other families from enduring the same heartache.Frankie Grogan was aged three when he was found unresponsive at the family home in Altrincham, Greater Manchester, in May 2019.Sarah and James Grogan want to keep his legacy alive by funding research into sudden unexplained death in childhood.Mrs Grogan hopes this will help save other children in the future. She said: \"What happened to Frankie is every parents' worst nightmare. No parent should put their healthy child to bed and wake up in this nightmare.\"Sudden unexplained death in childhood (SUDC) can affect children aged 1-18 years and is recorded in deaths that remain unexplained despite an investigation.While doctors found Frankie had developed a brain defect, it is not known precisely what caused his death and a coroner ruled he died from natural causes.Frankie was born prematurely by three weeks but was deemed healthy as a baby.However, just before his first birthday, he had a febrile seizure <https:\/\/www.nhs.uk\/conditions\/febrile-seizures\/> - a reaction caused by a high temperature - and was taken to hospital.Mrs Grogan, who works as a teacher, said medics had initially reassured them.\"They said he had an infection and that's why his temperature had raised so high. That's what caused him to have this fit. They just said he would grow out of them,\" she said.Between the age of one and his death Frankie went on to have 12 seizures but the family continued to be advised he would \"grow out of them\", they said.On the evening of 18 May 2019, his parents put him to bed as normal for the last time.Finding him unresponsive the following day, his mother immediately started CPR as they waited for an ambulance to arrive but Frankie was later pronounced dead at hospital.As the family tried to come to terms with what happened, they were informed of SUDC.Mrs Grogan said: \"I'd never heard of SUDC. I knew about cot death - that's widely discussed on the news and in magazines.\"But you think by the time your child gets to one that the risk of that has gone in a way.\"It's a naïve way to think but you do think that.\" The following summer, the couple set up Friends of Frankie, <https:\/\/www.facebook.com\/friendsoffrankieFJG\/> which has raised money for Alder Hey Children's Hospital, to fund paediatric first-aid courses for parents and support the work of SUDC UK.\"I want to shine a light on sudden unexplained death in childhood by telling Frankie's story,\" Mrs Grogan said.\"We know the fundamental legacy for Frankie will be about saving children.\"Whether that's in a 100 years' time or 20 years, his legacy will be that children don't fall asleep and don't wake up.\"Or we help provide first-aid courses so he could save children's lives for other reasons.\"Why not follow BBC North West on Facebook <https:\/\/en-gb.facebook.com\/BBCNW\/>, Twitter <https:\/\/twitter.com\/BBCNWT> and Instagram <https:\/\/www.instagram.com\/bbcnorthwest\/>? You can also send story ideas to northwest.newsonline@bbc.co.uk <mailto:northwest.newsonline@bbc.co.uk>"}