{"author":"By Chris Bell and Kerry Allen","title":"Bohemian Rhapsody opens in China, minus all the gay bits","news_category":"general","content":"Oscar-winning Freddie Mercury biopic Bohemian Rhapsody was released in China on Friday, but references to the Queen singer's sexuality and AIDS diagnosis were censored.Several minutes of footage were edited out of the film, including scenes of two men kissing and the word \"gay\".There has been significant reaction to the film's release online. More than 50,000 users have posted reviews on Sina Weibo, China's Twitter-like micro-blogging platform.Though some users complained of \"half watching and half guessing\" as a result of the deleted scenes, others were pleased the film had been released at all.In the Chinese version of the film, several scenes have been amended or deleted.Explicit and implicit references to Mercury's sexuality were edited out, including an important scene in which he comes out to his then-girlfriend.Other scenes to be removed include a close-up of Mercury's crotch as he performs, interactions with his male partner Jim Hutton and the entire sequence in which the character and his onscreen band-mates recreate Queen's iconic music video for 1984 single I Want to Break Free, in which they dress in women's clothes.Thousands of Chinese social media users have been sharing reviews of the film online.Most have been positive, with more than 80% of social media users to post reviews on Weibo awarding the film five stars out of five. However, there has been notable criticism of the revisions.\"If there were no deleted scenes it would have been better,\" one Weibo user wrote.\"Why is it necessary to delete gay-related content? Doesn't a person's life... deserve to be complete?\"\"It's really good that Bohemian Rhapsody is being screened in the mainland,\" said another. \"But the plot was broken because of deleted scenes.\"Homosexuality has been legal in China for more than two decades and the Chinese Society of Psychiatry removed it from the country's classification of mental disorders in 2001. But the movie's censorship was widely anticipated.In recent years, Chinese authorities have embarked on a campaign to purge content it deems inappropriate. Explicit references to same-sex relationships are banned under Chinese regulations. Gay content is frequently removed or censored by Chinese media anxious to ensure compliance.In February, broadcaster Mango TV's Oscars coverage was heavily criticised after it amended a reference to homosexuality <https:\/\/www.bbc.co.uk\/news\/blogs-trending-47370948> in the acceptance speech of Rami Malek, who plays Freddie Mercury in Bohemian Rhapsody. The same outlet was condemned in 2018 forcensoring rainbow flags and tattoos <https:\/\/www.bbc.co.uk\/news\/blogs-trending-44066237> in its broadcast of the Eurovision Song Contest.At the beginning of this year, another streaming service, iQiyi, was mocked for blurring the earlobes of men wearing earrings <https:\/\/www.bbc.co.uk\/news\/blogs-trending-46902973> in what many observers interpreted as a heavy-handed attempt to perpetuate \"traditional\" gender roles."}