{"author":"By Michelle Roberts","title":"Shop-bought menopause tests not worth it, women advised","news_category":"general","content":"Women are wasting their time and money buying do-at-home menopause-testing kits, top UK doctors say.The urine tests are not predictive enough to tell whether a woman is going through the phase when her periods will stop, they warn.Results could cause anxiety and confusion, and might even contribute to unplanned pregnancies, says the British Menopause Society.Manufacturers say the kits should never replace medical advice. One company that makes them said the tests could help women worried about the perimenopause, when periods can become erratic.A few companies sell UK-approved <https:\/\/www.gov.uk\/government\/organisations\/medicines-and-healthcare-products-regulatory-agency> menopause tests online and in shops.They can be bought without a prescription, for about £10 for a pack of two. The tests, which give a result within minutes, accurately measure levels of follicle-stimulating hormone (FSH), which helps manage the menstrual cycle.But experts say it is not a reliable marker of the menopause or perimenopause. The tests can be unhelpful and potentially misleading, the Royal College of Obstetricians and Gynaecologists (RCOG), along with other leading experts in women's health, says.NHS guidelines <https:\/\/cks.nice.org.uk\/topics\/menopause\/diagnosis\/diagnosis-of-menopause-perimenopause\/> also discourage FSH testing for over-45s with classic menopausal symptoms - such as hot flushes - because it adds nothing diagnostically.The manufacturer of the Self Check Menopause test says while menopause cannot be defined by a single simple test, hormonal imbalance is the most important indicator.And a constant high FSH level may indicate \"the ovaries are not working\" and \"no egg production is happening\".But experts say the fact FSH levels fluctuate throughout the menstrual cycle and from month to month makes it a poor indicator.The Co-op Pharmacy website says women can discuss their results with a pharmacist.The Self Check website says its kits \"can alleviate the worry and tension that normally affect women during their menopausal years, especially those women who display acute symptoms that can disturb daily routine\".\"These kits bring a feeling of being in charge of your health by knowing your FSH levels and seeking medical help to combat any of them successfully,\" it says.Director Dr John Rees told BBC News: \"The pack includes two tests, the second test to be taken a week later and only if both tests are positive to consider menopause.\"Whatever the result, users of self-tests, including the Self Check Menopause test are instructed to speak with their doctor before taking any action on the result.\"The instructions provided with the tests are reviewed and agreed with the regulators prior to approval for use.\"Self-test kits are not meant to replace traditional healthcare pathways but can prompt people to speak with their doctor about their health concerns whether they have a positive or negative result.\"A spokeswoman for the makers of another kit said: \"The instructions for use claims only that 'Flourish Menopause Test Kit can detect the presence of FSH in urine as soon as the concentration goes up from 25 mIU\/mL [milli-international units per millilitre] and over' and does not claim that the test directly diagnoses menopause process.\"It should be used as an indicator only in conjunction with other methods.\"Leading menopause and hormone doctor Annice Mukherjee, from the Society of Endocrinology <https:\/\/www.endocrinology.org\/>, said FSH urine tests were \"another example of exploitation of mid-life women by the commercial menopause industry, who have financial conflicts of interest\".She accused them of using misleading information about \"FSH sometimes being a helpful marker of menopause\" and called the perimenopause a \"hormone rollercoaster\".\"It's not helpful for women to access [FSH] directly,\" she said.\"It is not a reliable marker of perimenopause and can causes more confusion among women taking the test.\"At worst, misinterpretation of results can cause harm.\"For example, a women might interpret a high reading to mean she is menopausal and unlikely to be fertile - but high FSH can also be seen just before the ovary releases an egg, so she could become pregnant.Similarly, a negative test does not necessarily indicate someone is not perimenopausal.The kits' instructions explain this - and warn some medications, including oral contraceptives, can make the result unreliable.RCOG <https:\/\/www.rcog.org.uk\/> spokesman consultant gynaecologist Haitham Hamoda, from King's College Hospital, who chairs theBritish Menopause Society <https:\/\/thebms.org.uk\/>, said: \"The RCOG does not recommend over-the-counter menopause tests as they are not a good method of detecting menopause or perimenopause.\"These tests are limited by only measuring FSH, rather than looking at the wider clinical picture.\"We would encourage women to seek support from a healthcare professional if they think they might be experiencing the menopause rather than purchasing these tests.\"Source: NHS <https:\/\/www.nhs.uk\/conditions\/menopause\/>Have you used a menopause home-test kit? Share your experiences by emailing haveyoursay@bbc.co.uk <mailto:haveyoursay@bbc.co.uk?subject=MenopauseTests61340988>.Please include a contact number if you are willing to speak to a BBC journalist. You can also get in touch in the following ways:If you are reading this page and can't see the form you will need to visit the mobile version of theBBC website <https:\/\/www.bbc.co.uk\/news\/have_your_say> to submit your question or comment or you can email us atHaveYourSay@bbc.co.uk <mailto:Haveyoursay@bbc.co.uk>. Please include your name, age and location with any submission."}