{"author":"","title":"Ed Sheeran: CD he wanted to suppress sells for £50k","news_category":"general","content":"A rare demo CD produced by pop star Ed Sheeran when he was 13 has sold for £50,000 at auction.Global chart-topper Sheeran, who grew up in Framlingham, Suffolk, and now lives near the town, self-released the promo CD Spinning Man in 2005.Only 21 CD copies of the recording are known to exist with the majority thought to belong to Sheeran.Sheeran, who is 29, has previously said he did not want anyone to \"get hold of a copy\" <https:\/\/www.bbc.co.uk\/newsround\/53803653> and owns 19 of them himself.As well as paying £50,000 the buyer will also have to pay the auction house premium of 23.34% plus VAT.The CD belonged to someone who worked in the music industry in Ireland, said Omega Auctions, whose brother decided to sell the item.The seller was given the item by Sheeran between 2008 and 2009.The auctioneer's catalogue says the 14-track CD \"bears handwritten title and credit with inlay card featuring a bio of Ed along with credits and thanks to family\".Omega Auctions called the CD an \"important artefact in contemporary music history, a milestone in the development of one of the world's biggest pop stars\".The other copies of the CD come with a sticker saying \"Ed Sheeran Spinning Man\" but this one does not have one, as the seller said Sheeran had run out.Earlier this year, Sheeran's representatives told the BBC: \"All of Ed's early demo's for 'Spinning Man' featured a sticker. Any supposed copies without one are officially counterfeit.\"In his book, Ed Sheeran: A Visual Journey, the singer said: \"There are probably 20 copies of Spinning Man in existence, and I have 19 of them. I don't want anyone else to get hold of a copy! Most of the songs were about a girl called Claire. She was my first love when I was 13.\"Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk"}