{"author":"By Bernd Debusmann Jr","title":"What weapons has the US given Ukraine - and how much do they help?","news_category":"general","content":"The burnt-up wreckage of a Russian tank lies in the dirt, while in an accompanying photo next to it, a Ukrainian soldier carries the armaments said to have caused the destruction.The images posted to Twitter by the Ukrainian Armed Forces are labelled with a triumphant caption, declaring that this was the result of \"hits from Javelins on [Russian] military equipment\".The Javelin, a shoulder-held anti-tank weapon that shoots heat-seeking rockets hurtling towards targets up to 4km (2.5 miles) away, can be controlled by a portable unit that doesn't look much different from a video game console - but can send a metre-long projectile straight through the side or top of an armoured tank.The very presence of the American-made weapons \"causes panic\" among Russian troops, the Ukrainian military claims - and the US has sent thousands of them.Javelin missiles are among the items that have been sent to Ukraine through a series of military assistance packages.In total, more than $3bn in military aid has been sent to Ukraine since Russia invaded on 24 February.The latest $800m (£612.5m) package, announced by President Joe Biden on Thursday, also includes heavy artillery, howitzers and tactical drones to be used on the flat plains in eastern Ukraine. Mr Biden also banned Russian-flagged ships from entering US ports.Other armaments sent so far include drones that can be turned into flying bombs and anti-aircraft weapons that can shoot helicopters from the sky.But will these shipments help Ukraine overcome Russia's more numerous - and better equipped - invasion force?The most recent US security aid package for Ukraine includes \"dozens\" of howitzers - a type of artillery that fires shells at targets on high trajectories - as well as 144,000 rounds of ammunition and tactical drones.\"We're in a critical window now of time where they're going to set the stage for the next phase of this war,\" Mr Biden said on Wednesday, adding that the weapons are a reflection of \"Ukraine's needs\" as the war shifts towards the largely flat terrain of Ukraine's eastern Donbas region.Previous announcements of weapons for Ukraine have included a wide range of military equipment, ranging from body armour, helmets and rifles to radar systems, armoured vehicles and Soviet-designed helicopters that once belonged to Afghanistan.Besides Javelin missiles, the most powerful weapons include Stinger anti-aircraft systems, once famously used to shoot down Soviet planes in Afghanistan.The US has also shipped hundreds of \"Switchblade\" drones, which are designed to be sent crashing into enemy targets before exploding.While US defence officials have been reluctant to provide Ukraine with weapons that its forces weren't already familiar with, this week Pentagon spokesman John Kirby confirmed that a \"small number\" of Ukrainian troops will be trained on how to use the Switchblades, as well as US-supplied artillery systems.\"We're doing the best we can to focus on the kinds of capabilities we know they need and that they want and are using, and...secondary to that, to try to get them systems that they don't need a lot of start-up time for, that they can put in the field almost immediately,\" Mr Kirby said.Additionally, the Pentagon said on Thursday that it is giving Ukraine \"ghost drones\" - similar in capabilities to the Switchblade - that Mr Kirby said were \"rapidly developed by the Air Force in response specifically to Ukrainian requirements\".The range and specific capabilities of the \"ghost drones\", however, are not publicly known.Military experts say that the US-supplied anti-tank weapons have been among the most effective weapons in Ukraine's arsenal since the war began.\"Sometimes we will speak softly and carry a large Javelin, because we're sending a lot of those in as well,\" Mr Biden said this week of US aid to Ukraine.The invading Russian forces \"are primarily mechanised forces\" - meaning armoured convoys - so \"the best thing you can do is take them [the vehicles] out\", said former US Army Colonel Christopher Mayer.Ukraine has received a variety of anti-tank systems from several countries, which helps increase the \"lethality\" of Ukraine's forces against Russian vehicles, Mr Mayer said.\"If you give them a variety of anti-tank systems, it provides them with multiple opportunities to punch through whatever particular defensive armour protection systems that tank has,\" he said.And while their claims can't be independently verified, Ukrainian officials say they are putting the weapons to good use. As of this week, Ukraine claims to have destroyed more than 800 tanks and 2,000 other Russian vehicles.Anti-tank weapons, however, do nothing to help Ukraine combat Russia's air force, which for eight weeks has been striking targets across the country.That requires anti-aircraft weapons, about 25,000 of which had been given to Ukraine by the US and its allies by 7 April.Of these, the most well-known is the man-portable, shoulder-fired Stinger system.The system has been seen in conflicts around the world since 1981. It was most famously used in Afghanistan, where US-supplied Stingers helped bring down hundreds of Russian aircraft and helicopters during the Soviet occupation.It is effective against low-flying helicopters or aircraft at up to about 3,800m (12,400ft), making it relatively useless against higher-flying Russian bombers.Maintaining an ability to strike these aircraft has been a high priority for Ukrainian military planners, particularly since some of its own air defence systems have been destroyed during the war.In mid-April, however, nearby Slovakia sent Ukraine the Soviet-era S-300 anti-aircraft missile, which is designed to strike aircraft at higher altitudes.The shipment was part of a deal with the US, which agreed to deploy US units fielding an American-made anti-aircraft system - Patriot missiles - to Slovakia.The US has so far been reluctant to send Ukraine US-made tanks, arguing that Ukrainian troops aren't familiar with the vehicles.\"The kinds of tanks they know how to use are not the tanks that we have in our armoury,\" Mr Kirby said at the Pentagon on 19 April. \"But other nations have provided some tanks [and] some nations have provided spare parts so that they can get their inoperable tanks operable again.\"Similarly, while the US has so far committed to sending Ukraine 16 Mi-17 helicopters, it has not directly sent aircraft to Ukraine and has described a plan to send Soviet-made Mig-29 jets from other countries - such as Poland - to Ukraine as untenable.US allies, however. have provided spare parts that have allowed its air force to continue to fly limited sorties against a numerically-superior Russian air force.On 20 April, a senior US defence official said that Ukraine has 20 more aircraft available to them now than three weeks ago as a result of allied-supplied spare parts."}