{"author":"By Ayshea Buksh","title":"Carpenters Estate residents 'face uncertain future'","news_category":"general","content":"An estate close to the Olympic Park looks set to be demolished as part of the continuing regeneration of the area.Residents of the Carpenters Estate in Stratford, east London, face an uncertain future.University College London (UCL), one of the UK's top universities, wants to build a campus in its place.It wants to create research facilities for departments such as engineering and population health, along with accommodation for staff and students.These proposals were presented to a packed public meeting on the estate in late September.But Warren Lubin, chairman of the Carpenters Residents Steering Group, rejects the plans.\"Unlike other regeneration schemes in London, there is no strategic plan either by UCL or the council to rehouse us together so that our community could stay together and social support networks be preserved.\"Our cohesive, tolerant community would be no more,\" he said.Newham is one of the poorest boroughs in the UK, with a high demand for social housing .One of the biggest concerns for campaigners is the lack of housing provision in the UCL proposals.In January, Newham's elected mayor Sir Robin Wales told BBC London: \"We want to try and keep communities together. We promise that people can go back if they want.\"But now he has admitted: \"I can only say we'll do the best we can with what we've got.\"What can I say, other than that we'll have property, there'll be some and we'll then say if you want it, you can have that.\"Newham Council has already moved hundreds of residents off the estate in preparation for selling off the site to a developer.But Mr Lubin said: \"There is a serious housing crisis in Newham. Surely this can't be ethical.\"On the estate is a health centre, a convenience store, a pub and two community centres, one with sporting facilities the other with numerous resident-led social events.Tony Bird, an independent housing advisor working on the estate, said: \"All these special community activities would be lost if the Carpenters Estate community is entirely removed.\"Social cleansing is not just about people's homes.\"Mary Finch was one of the first people to move on to the estate in 1970 shortly after it was built.She and her husband Brian bought their house under the Thatcher government's Right To Buy scheme.This year she has attended countless meetings and protests. She also suffered a heart attack, which she believes was partly brought on by stress.\"It's been a dreadful year. The Olympics should have lifted our spirits, but we felt neglected.\"And when it was over we just thought, 'when will they be moving us out?'\"Joe Alexander, from Carpenters Against Regeneration Plans (CARP), said: \"It's depressing for some people.\"It's demoralizing with the decant going on and having the community dismantled in front of your eyes.\"UCL's initial plans were approved by Newham Council's cabinet in October.UCL Provost Malcolm Grant told the BBC: \"It provides real aspiration and hopes for attainment for a local population to be able to set their sights on being part of a global university.\"UCL is a world-leading institution, but our plans for growth are currently limited by our central London location, so we need suitable space to support the development of world-class teaching and research.But a protest at the Bloomsbury campus of UCL in central London saw a group of about 50 UCL students occupy part of the university.Hannah Webb, a community officer at UCL Union, said: \"This proposition goes against the wishes of UCL students and staff and constitutes a desecration of the strong moral principles on which UCL was founded.\"More details of UCL's plans for Stratford are due to come out in the new year."}