{"author":"By Manish Pandey","title":"Harry Potter: Quidditch renamed to Quadball over JK Rowling link","news_category":"general","content":"Quidditch has changed its name to Quadball in a move designed to \"distance\" it from Harry Potter author JK Rowling.A fictional version of the sport, played on flying broomsticks, first appeared in the famous book series.The real-life version is played by nearly 600 teams in 40 countries, but the author has never endorsed it.League bosses previously said Rowling's comments on trans rights were partly behind their desire for a name change.The International Quidditch Association (IQA) and Major League Quidditch (MLQ) said the writer coming \"under scrutiny for her anti-trans positions\" and a desire to grow the sport commercially were factors in the decision.Quidditch is described as a full-contact mixed-gender sport and it encourages those who identify with the trans and non-binary community to take part.The real-life version sees players run with brooms between their legs.Governing body QuidditchUK (QUK) said it was \"happy\" with the change and described it as a \"symbolically and practically significant\".\"The name change indicates a firm stance with our trans players and members, as well as giving us more firm legal footing and opening up greater opportunities for funding and external partners.\"Tom Ffiske started playing the game in Exeter in 2015 and feels the name change to Quadball is \"absolutely the right next step when it comes to the development of the sport\".The 28-year-old from London tells Radio 1 Newsbeat it will enable the game to \"develop its own identity and grow like any other sport\".He says the impact of JK Rowling's comments also means \"it's good to separate one from the other\".But there may be some drawbacks to the name change, in the short-term.The \"bombastic imagery when it comes to saying you play Quidditch\" leaves an impression on people, Tom says, and the name change will lose that aspect of the game.He admits that fewer people may be interested in coming along at events like freshers' week where the name \"Quidditch\" can be a big attraction.\"But I think the benefits outweigh that impression,\" he says.\"Fundamentally it's a professional sport which is played by people who are very good at what they do and it's going towards a direction of wanting to be treated as competitive.\"Tom says he was \"fervent fan\" of Harry Potter as a child and the books \"left an impact\", but he says he didn't enjoy the sport just because of its association with Harry Potter.\"I enjoyed it because of the community and the sport itself, which I got a lot of value from.\"Late last year, US Quidditch and MLQ announced they would carry out a series of surveys to find a new name for the sport, after JK Rowling attracted criticism for her views on gender identity.In the past, the author has said she was partly motivated to speak out about transgender issues because of her experience of domestic abuse and sexual assault.Critics have accused the writer of being transphobic, an allegation which she strongly denies.QUK said at the time the name change was a necessary \"shift towards our own identity\" because of issues surrounding both the Warner Brothers film company trademark and Rowling's remarks.The trademark for \"Quidditch\" is owned by the Warner Brothers film and entertainment company, which currently limits its commercial opportunities.QUK stated: \"More importantly, distancing ourselves from JK Rowling will cement the sport and community as the inclusive space it already is.\"Harry Potter stars Daniel Radcliffe, Rupert Grint and Emma Watson are among those who have distanced themselves from her comments, and Rowling did not participate in the filming of a reunion special aired earlier this year.Warner Bros said it recognised \"the love and passion of our Wizarding World fans\" and the company \"enjoyed individual expressions of that fandom\".The company added that it had \"the right to defend against unauthorised attempts to commercialise the intellectual property contained in our stories\".This video can not be playedQuidditch: Best seekers, chasers, beaters compete in British cupFollow Newsbeat on Instagram <https:\/\/www.instagram.com\/bbcnewsbeat\/>, Facebook <https:\/\/www.facebook.com\/bbcnewsbeat\/>, Twitter <https:\/\/twitter.com\/BBCNewsbeat> and YouTube <https:\/\/www.youtube.com\/channel\/UCe1Ef-K5jpnRsmVY5hCBhOw>.Listen to Newsbeat live <https:\/\/www.bbc.co.uk\/sounds\/play\/live:bbc_radio_one> at 12:45 and 17:45 weekdays - or listen backhere <http:\/\/www.bbc.co.uk\/programmes\/b006wkry\/episodes\/player>. "}