{"author":"By John Campbell","title":"Ballymena: Wrightbus to develop hydrogen production facility","news_category":"general","content":"Wrightbus is planning to develop a green hydrogen production facility at its factory in Ballymena.The proposal is being made in partnership with a sister company, Hygen Energy.Part of the Wrightbus business is the manufacturing of hydrogen-powered buses, some of which are operated by Translink.The new facility would help create a reliable source of fuel for those buses and other hydrogen-powered vehicles.Jo Bamford, chairman of Wrightbus, said: \"Hydrogen is the best means of decarbonising many bus routes, but for this to happen bus operators need a reliable and voluminous supply of low cost, low carbon hydrogen.\"This project will initially be able to produce enough hydrogen to run up to 300 buses, and has the potential to triple in scale as demand for hydrogen increases.\"We hope it will set an example for how these projects will be designed and built.\"Hygen is also working on a similar project at Bradford <https:\/\/www.bbc.co.uk\/news\/articles\/c0vlv2x7lddo> in the north of England. Currently most hydrogen sold in the UK is produced by splitting it from natural gas, a process which emits carbon dioxide.Green hydrogen is made by using renewable electricity to separate water into oxygen and hydrogen - a process called electrolysis.The hydrogen can then be used onsite or transported to where it is needed.Hydrogen does not produce carbon emissions when it is burned, so is considered a likely replacement for fossil fuels in heavy vehicles and industries such as steel and cement-making.The initial plans for Ballymena have not finalised the source of renewable energy for the electrolyser.The options would either be to buy it from an existing renewables generator or develop new renewable capacity such as wind or solar.A community consultation process for the project is now underway and it is intended to submit a planning application in April.The UK government launched a hydrogen strategy <https:\/\/www.gov.uk\/government\/publications\/uk-hydrogen-strategy> in 2021 as part of its Net Zero strategy - the plan to radically reduce greenhouse gas emissions by 2050.There has been some controversy about the best ways to use hydrogen <https:\/\/www.bbc.co.uk\/news\/uk-england-merseyside-64406663>, particularly whether it should have a role in home heating.Last year the House of Commons Science and Technology Committee suggested it is likely to be best suited to applications or places which are:It added that: \"Essential questions remain to be answered as to how in future large quantities of hydrogen can be produced, distributed, and used in ways that are compatible with net zero and cost efficiency.\"John Palmer, chair of Hydrogen NI, said Northern Ireland \"can be a world leader in hydrogen production\".\"We're very much a hydrogen ready country in terms of pushing on for development,\" he told BBC News NI's Good Morning Ulster.He said hydrogen energy can be used to decarbonise industries, as well as offering energy security which can reduce a dependence on overseas fossil fuels."}