{"author":"","title":"April Fools' Day: 10 stories that look like pranks but aren't","news_category":"general","content":"After the past year, you could perhaps forgive people for wanting to have a little fun this April Fools' Day.Many publications and organisations that usually take part in the tradition chose not to last April, but it seems the pranks are back for 2021.But as anyone with a passing knowledge of the news knows, the reporting of strange events and unusual human endeavours is not limited to 1 April. Just as some of the media are having their make-believe fun, the real-life bizarre stories continue elsewhere.Here is our round-up of some of the stranger than fiction stories around this April Fools' Day:1. Plane food may not be everyone's idea of a fancy meal out, but a service offering just that on a parked airliner is selling like hotcakes. Japan's biggest carrier, All Nippon Airways, started selling tickets for dinner on the runway - at $540 (£392) a meal - on Wednesday and has already added more slots for April after the first batch sold out.More details (BBC News)  <https:\/\/www.bbc.co.uk\/news\/business-56598932>2. The Voice judge Will.i.am has described his diet as \"liquitarian\", saying that he refuses to chew food on a Monday. He said since Christmas he only eats solid foods on certain days of the week. On the other days, his meals are all blended and he drinks juice every other hour, he told the Table Manners podcast.More details (The Sun) <https:\/\/www.thesun.co.uk\/tvandshowbiz\/14512331\/the-voice-will-i-am-liquitarian-chew-food-monday\/>3. An eco-friendly hair salon is planning to use customers' hair to help clean up the ocean. Salon owner Gemma Hill, who is to open Luvely in Dalkeith, Midlothian, later this month, said: \"Hair doesn't absorb water but it does absorb oil.\" After having a hair cut, customers' locks will be collected and used to make booms for soaking up coastal oil spills.More details (Edinburgh Evening News)  <https:\/\/www.edinburghnews.scotsman.com\/news\/environment\/midlothians-first-eco-friendly-hair-salon-is-using-customers-hair-to-clean-up-the-ocean-3185449>4. A robot lizard has been built that can climb up walls just like the real thing. A team at the University of the Sunshine Coast, Australia, created the robot to study lizards' movements and what makes them so efficient. They found that, for lizards and robots alike, a \"Goldilocks\" approach of going not too fast and not too slow is best.More details (New Scientist)  <https:\/\/newscientist.com\/article\/2273343-robot-lizard-can-quickly-climb-a-wall-just-like-the-real-thing\/>5. The Queen keeps a personal box of chocolate treats with her, so no-one else can eat them, claims a new ITV documentary. Lady Pamela Hicks, the Queen's second cousin, revealed Her Majesty's sweet tooth in My Years with the Queen.More details (Daily Express) <https:\/\/www.express.co.uk\/news\/royal\/1417677\/hands-off-queen-elizabeth-ii-secret-box-chocolates-royal-news-latest-ont>6. A mystery virus is affecting black bears in the US, making them friendlier than usual towards humans. It's been spreading in the states of Nevada and California, where in one case a young bear seemed totally comfortable around a group of people, picking up an apple and eating it on their back patio. Unfortunately if untreated, the rare condition can be deadly.More details (Daily Star) <https:\/\/www.dailystar.co.uk\/news\/world-news\/unknown-disease-turns-bear-cubs-23829469>7. A rescue pony has been undertaking an unusual role during lockdown - delivering novels to members of a book club. Micky the pony has been providing the service to members of the Hullavington Book Group in Wiltshire so they can continue to meet virtually. Abi Eliot-Williams, whose mother Elizabeth Parry-Williams runs the book group, offered to help out after the group chose to read a book about librarians who deliver books by packhorse.More details (BBC News) <https:\/\/www.bbc.co.uk\/news\/uk-england-wiltshire-56592199>8. Most people hope to leave the supermarket with a bargain - but one unlucky man in New Mexico found 15,000 bees in his car instead. The shopper, who had left his window down while picking up groceries, did not notice the swarm of honey bees until he started driving away. Luckily for him, an off-duty firefighter was able to safely remove the insects.More details (New York Times)  <https:\/\/www.nytimes.com\/2021\/04\/01\/us\/bees-car-new-mexico.html>9. Mary Poppins star Dick Van Dyke has been seen handing out handfuls of cash in the street. The actor, 95, was seen withdrawing money at a bank and then giving it out in Malibu, California, to people queuing at an organisation that helps those out of work find jobs.More details (The Independent) <https:\/\/www.independent.co.uk\/arts-entertainment\/films\/news\/dick-van-dyke-malibu-cash-b1825382.html>10. A comic book is being published about new US First Lady Jill Biden. She follows in the footsteps of others who have been given the treatment including Dolly Parton and Mother Theresa. A matching colouring book will also be launched alongside the book when it is published later this month. It's part of the \"Female Force\" series of books, focusing on women who have made a difference around the world.More details (Daily Express) <https:\/\/www.express.co.uk\/news\/world\/1417663\/flotus-jill-biden-comic-book-biography-mother-theresa-white-house-news-latest-ont>Compiled by Lauren Turner"}