{"author":"","title":"INF treaty: Nato has no plans for more nuclear missiles in Europe","news_category":"general","content":"Nato is unlikely to deploy more nuclear weapons to Europe should an arms control treaty between Washington and Moscow collapse, Secretary-General Jens Stoltenberg has said.Washington accuses Russia of violating the 1987 Intermediate-Range Nuclear Forces (INF) treaty and says it will withdraw from it.Mr Stoltenberg agreed that Russia had probably violated the deal.Thursday sees Nato begin its largest military exercise since the Cold War. The operation is to repel a mock invasion of Norway and will involve all 29 members, as well as Finland and Sweden.Mr Stoltenberg said Nato did not seek confrontation but stood ready to defend all allies against any threat.Signed by the US and the USSR in 1987, the INF bans all nuclear and non-nuclear missiles with short and medium ranges, except sea-launched weapons.The place where the US and Russia would probably use such missiles against each other is Europe.That is why President Donald Trump's threat to withdraw has led to concerns that a collapse of the INF would mean placing new missiles on the Continent.The US insists that Russia has a new medium-range missile called the Novator 9M729 - known to Nato as the SSC-8.The missile would be a violation of the INF and would enable Russia to launch a conventional or nuclear strike at Nato countries at very short notice.President Trump said the US would not let Russia \"go out and do weapons [while] we're not allowed to\".Mr Stoltenberg said Nato supported Washington's criticism of Moscow, adding that such agreements only worked if adhered to by both sides.\"We don't have an effective INF treaty if it's only respected by one part,\" Mr Stoltenberg told a press conference.\"That has been and it's the main problem,\" he said. \"All allies have strongly stated that we are concerned about the new missile and that the most plausible explanation is that Russia is in violation of the INF treaty.\"But you also understand that this is not something that can go on because the treaty is not working if it's only respected by one side.\"Russia has responded to the US threat to withdraw by warning it could trigger a new arms race.\"This would be a very dangerous step,\" Russia's Deputy Foreign Minister Sergei Ryabkov said.The minister told the country's news agency RIA Novosti that if the US left international agreements, \"we will have no choice but to undertake retaliatory measures, including involving military technology\".Russia has said little about its new missile other than to deny that it is in breach of the agreement."}