{"author":"","title":"Ukraine: President Zelensky addresses university students","news_category":"general","content":"Ukrainian President Volodymyr Zelensky has addressed students as part of a live broadcast to a number of UK universities.The event on Friday evening was organised by the Ukrainian Students Union (USU).He spoke about the need for ongoing international support and compared the destruction of the Russian invasion with the Nazi bombing of Coventry.Some students got the chance to pose questions to the leader. Universities taking part included Birmingham, Cambridge, City University of London, Coventry, Glasgow, LSE, Manchester, Oxford and UCL.Earlier this year, students from Ukrainian Societies at UK universities joined to form the USU and it was to members that President Zelensky spoke.Wearing a black t-shirt with a Ukrainian flag either side of him, President Zelensky addressed hundreds of students in the UK over a Zoom call, including the few dozen who snapped up tickets for the event at Coventry University.After a 15-minute opening speech, he answered questions largely focused on rebuilding Ukraine after the war.Pavel Pimkin, 20, the president of Coventry University's Ukraine Society, asked his nation's president about attracting entrepreneurs and start-ups to help with the reconstruction.Speaking to me afterwards, Pavel said he thought it went well, but hoped that Mr Zelensky \"didn't notice my voice shaking a bit\".The Ukraine leader also addressed the issue of the two Britons sentenced to death, saying we \"cannot have any kind of excuses for such actions\".Pavel Pimkin, said: \"It is not just students President Zelensky has engaged with during this war, he's addressed parliaments and welcomed world leaders in Kyiv.\"\"However, I think he understands students are the future of our nation, they've organised protests, fundraised for Ukraine, and been enthusiastic in their support for Ukraine - we have a very powerful voice.\"The student added he hoped to \"help build a bright future for our country\" once the war was over.\"I know that a lot of our foreign partners will help to actually rebuild the cities, rebuild the infrastructure,\" he said.\"I believe that new investments will come up to Ukraine because... they are perfect conditions for investors, start-uppers, small and medium businesses, so we are trying to build that kind of country.\"Coventry University's vice-chancellor, Professor John Latham, said the president's address would be a \"demonstration of the Ukrainian government's continued interest in the power of education, despite the terrible devastation that has been inflicted on the country during this war\".Follow BBC West Midlands on Facebook <https:\/\/www.facebook.com\/MidlandsBBC\/>, Twitter <https:\/\/twitter.com\/bbcmtd> and Instagram <https:\/\/www.instagram.com\/bbc_midlands\/?hl=en>. Send your story ideas to: newsonline.westmidlands@bbc.co.uk <mailto:newsonline.westmidlands@bbc.co.uk>"}