{"author":"By Tim Donovan","title":"London 2012: Olympics jobs legacy 'falls short'","news_category":"general","content":"Delays, underspends and unrealistic targets have blighted London Mayor Boris Johnson's attempts to secure an Olympic jobs legacy for the unemployed, the BBC has learned.In contrast to his success as a public cheerleader for London during the 2012 Games, his key employment projects have stalled and struggled.It has meant chances were missed to get unemployed people into jobs during the Olympics and beyond.Two years ago the mayor declared that using the Olympics to tackle London's high unemployment was \"top priority\" as he promised £20m to provide job advice, training and skills.Details of the disappointing progress of his Olympic projects are not yet publicly available. The mayor's Investment and Performance Board, which has been monitoring them, meets in private and a number of reports and minutes are missing from the public record of the meetings on the mayor's website.However, both the two key schemes - set up by the mayor in 2010 - are falling short of their targets.The 2012 Employment legacy project, costing £4.5m, pledged to provide jobs during and after the Olympics for unemployed people from across London.The Host Borough Employment project, with a budget of £15m, focused on the long-term unemployed in the six Olympic authority areas: Newham, Tower Hamlets, Hackney, Greenwich, Waltham Forest and Barking & Dagenham. Their jobless rates are among the highest in the country.The 2012 legacy project was meant to start in April 2010, with a target of getting 1,400 people into work and keeping them in their jobs for at least a year. The project only got off the ground last autumn, missing the opportunity to capitalise fully on the Olympics because employers had by then already recruited, or made plans to do so.The delay occurred despite clear previous warnings about waiting until 2011 to roll it out.A report by the London Development Agency in 2010 said: \"Many of the contractors would have been appointed for almost a year and their recruitment plans would already be developed.\"The success of the project in terms of sustained employment outcomes would be jeopardised as experience from other projects shows early engagement is critical.\"How far it has fallen short of its targets has not been made public. But a brief update in May reported \"low outputs\" and \"lagging delivery\" last year. Originally £1.5m was earmarked for it last year. That was revised to £570,000, but even then less than half was actually spent.The project appears to have struggled from the start, with the hard-to-reach target group and the payment-by-results model insisted on by the London Development Agency identified as key hindrances.The contractor Seetec receives payments for every individual it gets into a job, but the largest part of the fee - 40% - is only paid if the person stays in work for more than a year. In tough economic times, it has proved difficult to sustain more than a fraction of people in work that long. Jobs working on the Olympics are also, by definition, short-term.No-one from Seetec was available for comment.While payment by outcomes can be an incentive for focusing on keeping people in jobs long-term, it can have the opposite effect if the targets are too rigid and difficult. Organisations and charities helping the jobless are reluctant to invest time and money upfront if they are unlikely to re-coup it in payments later.Despite continuing high unemployment, the future of the scheme appears in doubt, at least in its present form.Similar problems, to a lesser degree, have hampered the Host Borough project which the mayor promised would help 5,000 people from the boroughs closest to the Olympic park back into work.It too was delayed and was then \"\"re-profiled\" when the 12-month sustained employment target proved too difficult.An update in March this year recorded that this project was \"below targets\" and keeping people in work for six months was proving \"challenging\". Only £3.5m was spent out of last year's original £5m budget.The biggest problems have been experienced in the borough of Waltham Forest which covers part of Work and Pensions Secretary Iain Duncan-Smith's Chingford & Woodford Green constituency.Tower Hamlets, Greenwich and Newham - the latter boosted by the opening of the Westfield shopping centre - have performed better.The difficulties have meant that despite the need for investment during a recession the mayor's overall £15m budget for this project has already been cut by at least £2m. During the time, demand increased with the extension of the scheme to cover a sixth borough, Barking & Dagenham.In the first year in Barking and Dagenham, 130 people were registered on the scheme. Some 38 got jobs, but only 12 were still in work six months later. It is understood only a handful, if any, were still in a job 12 months later.Because of the early problems, the local councils - which match-fund the project - sought a relaxation of the mayor's targets and a revision of the payment system. They now get paid more for keeping people in a job for six months, rather than 12, and a person having more than one job in that time now counts towards the target.Mary Conneely, chief adviser to the Host Borough Unit, said there had been difficulties but the project was faring better than other LDA-funded schemes.\"No other Games set targets like London has, and I am sure that eventually London will have a good story to tell,\" she said.It's not clear how far the project has missed its overall targets. According to the minutes of Investment Board meetings it was reviewed earlier this year \"agreeing the best way forward\". But the decision taken, and the results so far, have not been made public on the mayor's website.A spokesman for the mayor said the 2012 project had got 300 people into jobs, and the Host Borough project 3,600.Figures for how many had stayed in work for at least six months were not yet available, but results would be published in the autumn."}