{"author":"","title":"What could Birmingham offer 2022 Commonwealth Games visitors?","news_category":"general","content":"The Qatar World Cup was due to be the context in which TV audiences existed in the summer of 2022 - wall charts and stickers, the lot. But then concerns over the searing heat kicked in and the tournament was shifted to winter.What, then, instead for those from four-and-a-half years into the future missing out on a spot of sport with their after-work ciders, sipped in short sleeves? Whose prowess could pub sages and armchair fans possibly debate?Step in the 2022 Commonwealth Games to punctuate those longer evenings.Where Qatar was concerned, audiences would have been overwhelmed with colour pieces about the country - a host nation, and its cities, tending to capture the imagination.But can the same eight-page pullout flattery be levelled at Birmingham? It is the UK choice for the Games' host city, and on Friday cleared another hurdle to nudge itcloser to that ultimate prize <http:\/\/www.bbc.co.uk\/sport\/athletics\/41440057>. But can England's middle child - neither London nor Manchester - ever pique the interest of audiences domestic and international? And what might one find out about Digbeth as opposed to Doha?It turns out there is more there than a bendy traffic interchange named after pasta <http:\/\/www.bbc.co.uk\/news\/av\/uk-england-birmingham-36645979\/birmingham-s-infamous-spaghetti-junction-set-for-six-months-of-delays>. There is more - to reference recent notoriety - than abacklog of bin bags <http:\/\/www.bbc.co.uk\/news\/uk-england-birmingham-40668249> in a city that once thought a bid to be an Olympic host should look like this...This video can not be playedAccording to this song, bringing the 1992 Olympic Games to Birmingham would be \"the best thing that anybody could do\".In fact, it might be fair, as of 2017, to call it boomtown Brum, at least in terms of investment and shifting national perception.The area seemed on to something when more people leaving London moved to Birmingham than any other UK city -Londoners gave their reasons here <http:\/\/www.bbc.co.uk\/news\/uk-england-37385265>.And to help with those heading a little bit north, the BBC created this handy survival guide <http:\/\/www.bbc.co.uk\/news\/uk-england-birmingham-37584781>, advising sophisticates how to navigate a network of canals, public transport called the \"buzz\" and those riding the \"buzz\" who might call you \"bab\".Speaking of public transport, conditions remain favourable for Birmingham's popularity. High-speed rail line HS2 is set to link London to the second city in a way that will kill boxset-watching time, albeit a few years after a 2022 javelin is thrown in anger.Against this backdrop, HSBC bank announced an HQ relocation from London to Birmingham <http:\/\/www.bbc.co.uk\/news\/business-40772965>, with about 1,000 jobs set to be transferred and the bank describing its new home as a \"growing city\" with \"expertise and infrastructure\".And away from commercial property, house prices in the West Midlands are among those experiencing the biggest increase <http:\/\/www.bbc.co.uk\/news\/business-41439344>as prices in the south east fall. Combined, all this might not amount to Birmingham becoming a London borough by the back door, no matter how many references are made to a symphony orchestra, ballet, Michelin stars and international class stadia.But it remains the case that Birmingham is seeing significant investment, and with it, a changing look that flies in the face of assumptions of a pasta-themed concrete jungle.Earlier in 2017, Deloitte said <http:\/\/www.bbc.co.uk\/news\/uk-england-birmingham-38810232> a \"record number\" of new developments across all sectors meant Birmingham was enjoying \"a well-deserved boom\", with Marketing Birmingham's boss adding the city was \"embarking on an unprecedented construction spree\" to meet \"record demand created by new and relocating businesses\".Among the projects have been a revamp of New Street Station and the shopping centre above it, Grand Central - £600m and £150m schemes respectively.But numbers cannot do all the talking. What do locals think visitors to the Games would make of Birmingham?\"Every year Birmingham is getting more international and in 10 years it'll be an amazing city,\" said Kevin Cunningham.\"When people come, I think they'll be surprised by Birmingham's diversity but also its history.\"Ramavtar saw even more potential, and something of possibly greater value than the economic bounce he expected: \"It'd be perfect, people would get to see more of Birmingham.\"And for Martin, it is seeing that is believing: \"There's been a misconception of Birmingham and there's a certain stereotype, but a lot of people haven't even been here.\""}