{"author":"By Annabel Rackham","title":"Anna Todd: From 1D fan fiction to feature film writer","news_category":"general","content":"At 24 years old, Anna Todd felt her life had come to a bit of a standstill.\"I was a struggling army wife going to community college who didn't know what to do with my life,\" she tells the BBC.\"I would read a lot of fan fiction on [publishing website] Wattpad and felt I had read everything so one day I decided to write a chapter.\"That chapter, the start of a story based on One Direction singer Harry Styles, would eventually be turned into a book series and now a Hollywood film.Now 29, the Ohio native has published five books in the After series and three other novels.The story of a relationship between college student Tessa Young and Harry Styles (who would become Hardin Scott in print) was Anna's passion project as a huge One Direction fan.\"When I started I had no followers but I did it for fun,\" Todd says.\"After I wrote the first chapter I wanted to know what happened so every day I would write a chapter and it became more popular.\"I could see the numbers go up and when I tried to make a Twitter account I couldn't even use my own name because all these fan accounts already existed - I realised people actually cared and loved it.\"Wattpad contacted me and said publishers and agents had reached out, I was even getting messages from agents and didn't understand what was happening.\"I went to New York and met with four publishing houses and there was an auction - every publisher wanted me to take down my online chapters and I didn't want to do it.\"I kept saying no and they gave in.\"Todd wanted to keep her work online so that new people found it and also so she could read comments.To date, her online version has received over 1.5 billion views, whilst her published book has sold over 11 million copies worldwide and has been translated into 30 languages.This article contains content provided by Instagram. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readMeta’s Instagram cookie policy, external <https:\/\/privacycenter.instagram.com\/policies\/cookies\/> and privacy policy, external <https:\/\/privacycenter.instagram.com\/policy> before accepting. To view this content choose‘accept and continue’.Todd is three weeks into her role as producer on After: The Movie and speaks to the BBC from the set, which is based in Atlanta, Georgia.\"Being here feels amazing and really surreal, my entire life has changed. It's crazy seeing these characters come to life and I've been very involved in the re-writes and casting.\"The lead, Hardin Scott is played by Hero Fiennes Tiffin, who is best known for playing young Tom Riddle in Harry Potter and the Half Blood Prince.He is also the nephew of actors Ralph and Joseph Fiennes.His co-lead, Josephine Langford, who also has famous connections as the sister of 13 Reasons Why actress Katherine, plays Tessa Young.This article contains content provided by Instagram. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readMeta’s Instagram cookie policy, external <https:\/\/privacycenter.instagram.com\/policies\/cookies\/> and privacy policy, external <https:\/\/privacycenter.instagram.com\/policy> before accepting. To view this content choose‘accept and continue’.Another important factor for Todd was having a strong female team, in light of the lack of female representation in the Hollywood film industry.\"Our team and crew are nearly all women, so we understand the story and know how to portray those women.\"It's been incredible - we've had a lot of crew members say they've never worked with this many women on a film before.\"Asked if there might be a cameo from Harry Styles, Todd says it's unlikely, but his management know about the fan fiction and the film production.\"Sony (who manage One Direction) paid a writer to make the first original fan fiction about the band - I can't imagine they were upset (to find out about her work).\"And has she met the man himself?\"No! I wish I would have met the band in an organic way - I don't want to make them feel like they have to meet me because I'm a fan girl,\" she says.This article contains content provided by Instagram. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readMeta’s Instagram cookie policy, external <https:\/\/privacycenter.instagram.com\/policies\/cookies\/> and privacy policy, external <https:\/\/privacycenter.instagram.com\/policy> before accepting. To view this content choose‘accept and continue’.Anna Todd is not the first fan fiction writer to have secured a publishing deal and film rights from their work.She's become friends with Fifty Shades author EL James, whose writing started out as a take on Stephanie Meyer's Twilight series and ended up as a million dollar franchise.Todd says their friendship influenced her decision to bring out three books before the After film came out, so she wasn't remembered for only writing One Direction fan fiction.\"With EL James - she and I have become friends now and she told me: 'No matter what I write now people talk about 50 Shades.'\"It's good that I've put out different books apart from After - and before the film comes out.\"The decision to diversify her writing wasn't because Todd was worried about some of the negative connotations that come with online fandom, but this opinion is something she wants to change.\"Ironically, people who called me obsessive would get into a fight over a football game,\" she says.\"You wouldn't say that to someone who queued overnight for sports tickets or a new Apple product, but you'll have a go at teenage girls who like One Direction?\"She says if it wasn't for fandoms she would \"never have been able to publish a novel\".\"For me, One Direction is the only fandom I've been in and I made so many friends.\"The internet can help you come out of your shell and gives you a chance to make friends who have the same passion as you, it's a real community.\"Turns out, if you're really lucky, that community can also get you a book and film deal.Follow us on Facebook <https:\/\/www.facebook.com\/BBCEntsNews\/>, on Twitter @BBCNewsEnts <https:\/\/twitter.com\/BBCNewsEnts>, or on Instagram at bbcnewsents <https:\/\/www.instagram.com\/BBCNewsEnts\/>. If you have a story suggestion email entertainment.news@bbc.co.uk."}