{"author":"","title":"2022 Commonwealth Games: Services 'not affected' by event bill","news_category":"general","content":"Services will not be affected by the financing of the 2022 Commonwealth Games, Birmingham City Council says.The authority is struggling to resolve a long-running pay dispute <http:\/\/www.bbc.co.uk\/news\/uk-england-birmingham-41037764> with its bin workers, but is confident it can be the major contributor towards a potential £180m local bill for the Games.The bid was given the green light by the government on Friday.It was then submitted on Saturday, the official deadline, and looks set to be chosen asno other cities <http:\/\/www.bbc.co.uk\/sport\/41455347> made a bid.The authority said it could not provide a breakdown of costs but guaranteed services would not be affected.The total cost of staging the event is expected to be at least £750m <http:\/\/www.bbc.co.uk\/sport\/athletics\/41440057> - which would be the most expensive sports event in Britain since London 2012, the BBC understands.Local authorities and partners will need to raise 25% of the overall cost of staging the event, with central government providing the remainder.West Midlands mayor Andy Street said the Treasury was happy with the economic case that had been put forward, which was vital for the overall bid to be endorsed.He dismissed claims the Games would be of limited value to the wider area, that some research around the 2014 Games in Glasgow -which cost taxpayers £37m less than expected at £424.5m <http:\/\/www.bbc.co.uk\/news\/uk-scotland-glasgow-west-31840344> - suggested.\"We think we can do better than Glasgow in that way and the significant thing is that central government and Treasury that has looked at the case said yes, there is a good business case here and remember three weeks ago it was subject to that being proven and it's good news that it has,\" he told BBC News.Bin workers began industrial action in June over plans by the Labour-run authority to cut jobs and save money which has seen mountains of rubbish pile up on the city's streets.A deal was finally struck in August after the council said no jobs would be lost. However, two weeks later a council report said the deal was \"unaffordable\" and redundancy notices were issued.Austerity measures means spending on waste management has reduced from £71m in 2011 to £65m in 2017, and the council has said if it does nothing the overspend will be £5.2m in future years.Five years ago the council said it would have to pay at least £757m to settle equal pay claims brought by mainly women who missed out on bonuses.Robert Alden, leader of the Conservative group on the council, said the mishandling of the dispute over a smaller amount of money than the games would cost \"shines a light on the extent of their mismanagement.\"There was a £40m overspend of the council's £3bn budget last year, he said.\"I think it's interesting that we see that the department for Culture Media and Sport are going to be managing the financial planning for the Games and I'm not really surprised as Birmingham's record with looking after its budget would mean our chances of actively hosting a successful games would be much diminished.\"The Conservatives say this cannot be about putting the revenue budget and the people of Birmingham at risk... Birmingham does not have excess cash to fund this directly.\"He added that he would like to see cricket being incorporated in the bid, which would be held at Edgbaston - a 20,000-capacity stadium - that could provide money from ticket sales.A spokesman for the council said: \"Interim leader Ian Ward has made it clear that there is a a red line around the revenue budget - which pays for services - so that means services will not be affected by the authority paying for the Games.\"The whole project is a collaborative one with many other parties including, West Midland Combined Authority, Sandwell Council and three Local Enterprise Partnerships, so there's a range of partners involved and the cost shared and worked out together.\"We are now also working with Department Culture Media and Sport and the Treasury, who obviously also want to offer value for money.\"More definitive figures will be released in due course, the council said."}