{"author":"","title":"Cheap tickets for Christmas theatre to encourage Tube use","news_category":"general","content":"Tickets for London West End shows are to be sold at a discount by Transport for London (TfL) to try to attract people into the capital on the Tube.The \"12 Shows of Christmas\" promotion is part of the mayor's Let's Do London campaign.From 10:00 GMT for 12 consecutive days, 100 tickets will be sold for £30, which is 35-45% of the usual price.It is hoped the campaign will boost sales and tourism after the industry took a hit from the pandemic.People will be able to book a maximum of four tickets for a date of their choice between 1 January and 10 February 2023.The promotion, in partnership with Official London Theatre, will include classics such as The Mousetrap, the West End's longest running show, to the brand new production of As You Like It that opened on 6 December at Soho Place.According to City Hall, the Let's Do London campaign has so far brought an extra 600,000 visitors to the capital.Due to the pandemic, the number of overnight stays made by tourists to the capital in 2021 more than halved to 60.8 million with a spend of £3.8bn.This compares to the 147.4 million overnight visits and spending of £18.8bn in 2019.Claire Walker, of Society of London Theatre, said: \"I think we saw people coming back in waves, and this Christmas is hopefully the first Christmas we will see without the threat of Covid, reminding people of how important it is to come back and enjoy the joy of London theatre.\"Deputy Mayor for Culture and the Creative Industries Justine Simons OBE said: \"Our capital's West End is the envy of the world, but the impact of the pandemic, the cost-of-living crisis and soaring energy bills are having devastating repercussions across theatreland.\"This is a fabulous opportunity to enjoy a great performance while supporting the arts and helping our economy. Together, we can build a better London for everyone.\"Last month, Tube usage returned to the highest level since the start of the Covid-19 pandemic.A return to commuting passenger numbers on weekdays is up to 78% of pre-pandemic levels - a rise from just 45% at the start of this year.But trips for tourism, weekend visits to London and nights out are almost back to pre-2020 capacity, up as high as 99%.Mondays are the quietest day with 70% use since pre-pandemic, and Fridays are the second quietest with 75%.Once the daily allocation of tickets has sold out, people will be able to buy reduced tickets as part of the Official London Theatre's ongoing January sale.The sale will see tickets released for more than 40 of the capital's best loved shows at discounted prices.The Christmas period is crucial for many London businesses but it's also crucial that TfL gets people back on the network.This promotion is a relatively low-cost way of trying to do that.Tfl has to find £600m in savings and the more fares it can bring in the better. Leisure travel has returned strongly with 94% of pre-pandemic levels last weekend.Tfl is also trying to tell people about Tottenham Court Road Elizabeth line station and how that is an easy gateway to the West End.Follow BBC London on Facebook <https:\/\/www.facebook.com\/BBCLondon>, Twitter  <https:\/\/twitter.com\/BBCLondonNews>and Instagram <https:\/\/www.instagram.com\/bbclondon\/?hl=en>. Send your story ideas to hellobbclondon@bbc.co.uk <mailto:hellobbclondon@bbc.co.uk>"}