{"author":"","title":"Storm Darcy: Sea closes in on Hemsby beachfront home","news_category":"general","content":"A man who has spent three years fighting to stop his home falling into the sea said storms demolished metres of cliffs at the end of his garden.Lance Martin lives in Hemsby, near Great Yarmouth, Norfolk, in the only home in a row ofclifftop houses to survive 2018's Beast from the East <https:\/\/www.bbc.co.uk\/news\/uk-england-norfolk-43486116>.Last year, he hired a digger to shore up sea defences <https:\/\/www.bbc.co.uk\/news\/uk-england-norfolk-51479157>, but said he was now in a battle against time.\"We'd lost about 15-20ft (4.6-6.1m) by the time I went to bed,\" he said. The former soldier said Storm Darcy's <https:\/\/www.bbc.co.uk\/news\/uk-55968889> high winds forced the sea over the concrete blocks he had placed along the beach, and on to the base of the dunes on Sunday and Monday.A section of the sandy cliff below Mr Martin's garden was then washed away, turning the once gently sloping edge into a steep drop.Mr Martin said despite plans for a rock berm sea defence at Hemsby to protect it from coastal erosion, he feared for the village's future until then.\"It's all going ahead - it's just time, and we've got very little of that left I'm afraid. That's Mother Nature,\" he said.\"[I feel] let's try and get it in before this happens again and there's no Hemsby for the future.\"After his neighbours lost their chalets three years ago, Mr Martin managed to drag his timber bungalow back <https:\/\/www.bbc.co.uk\/news\/av\/uk-england-norfolk-44010329> 10 metres (32ft) from the cliff edge to save it.He had retired at the age of 60 to the property - which cost him £95,000 - five months before surrounding homes on The Marrams toppled into the sea.Mr Martin said although he had since spent thousands of pounds on his house, he had no regrets.\"I love my home and the area. It's a fantastic community - very tight-knit,\" he said.\"Everybody's shouting out for me - they're all behind me and it's a fantastic feeling.\"Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}