{"author":"","title":"South Wales Police want mental health lessons for young people","news_category":"general","content":"This video can not be playedNaomi Lea, 19, said she suffered mental health problems when she was at schoolPolice have called for better mental health education in schools after a rise in young people being detained under the Mental Health Act.Some 48 children and young people were detained by South Wales Police in 2016-17, up 33% from 36 the year before.The force said \"more robust education\" in schools and care homes was needed to spot signs of mental health problems.The Welsh Government said it has a 28-day waiting time target for children referred to mental health services.Mental health problems among young people have been rising in recent years <http:\/\/www.bbc.co.uk\/news\/uk-wales-41361491>, with some children feeling under pressure to do well in exams while others have said they are being bullied through social media.This video can not be playedMind Cymru's Sara Moseley says schools should step in to address mental health problems soonerSouth Wales Police said detaining children and young people under the Mental Health Act was a last resort for officers and that they were encouraged to take a child into police protection instead so as \"not to stigmatise children\".\"Officers are too often left with no choice but to invoke section 136 (of the Mental Health Act) in the best interests of the child or young person,\" it said in areport <http:\/\/www.senedd.assembly.wales\/ieListDocuments.aspx?CId=443&MId=4528> being considered by the assembly's children, young people and education committee on Wednesday.\"Children do not suddenly become unwell, then have a few months treatment and are cured. Meaningful provision means preventative steps must be taken to protect our young minds from an early age.\"We need far more robust education in our schools and care homes to identify the signs of mental health and strategies and support put in place to help these children and young people.\"North Wales Police said three under-17s were detained under the mental health act in 2015-16 but none had been last year.Gwent and Dyfed-Powys Police were unable to provide their figures.This video can not be playedHollie Thomas from Barnardos Cymru, encourages young people to find \"coping strategies\"Samaritans Cymru said more and more young people were struggling with mental health problems, such as self-harm and eating disorders.The charity said nearly 17,000 young people were admitted to A&E departments in Wales because of self-harm in 2017 - an increase of 41% in three years - while in in 2016, there were 16 suicides in the 15-19 age group in Wales; the highest rate in five years and second highest in 12 years.In evidence submitted to the assembly committee it said: \"The overall strain on mental health services in Wales is increasing; 2012-2016 saw a 100% increase in demand for CAMHS.\"We believe lessons in emotional and mental health should be mandatory for all secondary schools in Wales.\"The assembly committee is holding an inquiry into the emotional and mental health of children and young people.It comes after ministers launched a £1.4m pilot scheme in September where NHS staff will be on hand to give better mental health support in schools in north east and south east Wales and Ceredigion.The National Education Union has previously urged the Welsh Government to introduce wellbeing officers <http:\/\/www.bbc.co.uk\/news\/uk-wales-41267915> into schools.A Welsh Government spokesman said: \"Counselling provision has also been available for learners in year six and all 11 to 18 year olds since 2013.\"Last year we announced funding for a pilot to embed mental health specialists in primary and secondary schools in six local authority areas.\""}