{"author":"By Jonathan Amos","title":"Hidden camera's hugging tiger wins wildlife photo award","news_category":"general","content":"To photograph one of rarest creatures on Earth you have to be incredibly skilled and remarkably lucky.But Sergey Gorshkov is clearly both - as demonstrated by his stunning picture of a Siberian, or Amur, tiger deep in the forests of Russia's Far East.The image has just won him the title of Wildlife Photographer of the Year <https:\/\/www.nhm.ac.uk\/wpy\/>.The female tiger is seen embracing a tree, rubbing herself against the bark to leave her scent and mark territory inLand of the Leopard National Park <https:\/\/leopard-land.ru\/?lang=en>. \"The lighting, the colours, the texture - it's like an oil painting,\" says WPY chair of judges Roz Kidman-Cox.\"It's almost as if the tiger is part of the forest. Her tail blends with the roots of the tree. The two are one,\" she told BBC News.This video can not be playedWatch the moment HRH The Duchess of Cambridge announces the winnerAll the more extraordinary is that this is a camera-trap image. The equipment was set up in the forest and left, waiting to trigger automatically when a tiger came by.Of course, Sergey had to know where he'd be most likely to frame the animal - and that's where the skill of an experienced wildlife photographer comes into play.Eastern Russia's tigers were hunted to near-extinction and probably now number only a few hundred individuals. And with their prey - mostly deer and wild boar - also diminished, it means the Amurs must range over vast distances to find food.It all adds to the difficulty of securing any sort of picture, never mind one that looks as impressive as Sergey's. But consider this: the camera-trap that took the winning picture was left in the field for 10 months before its memory card with its precious image file was recovered.To be a top wildlife photographer you also have to be extremely patient.Sergey's grand prize award was announced by Her Royal Highness The Duchess of Cambridge and TV presenters Chris Packham and Megan McCubbin during an online event organised by London's Natural History Museum.The NHM runs the WPY competition, which is now in its 56th year.This image of a young fox consuming a barnacle goose earned Finnish teenager Liina not only a win in the category for 15-17 yearolds, but the overall grand prize for junior photographers. The fox had forced itself into a crevice to try to stop its siblings getting at the meal.\"The judges particularly liked it because only a really keen young naturalist would have been able to get such a picture,\" explained Roz Kidmand-Cox. \"The composition is wonderful. Liina must have been lying on the ground because she's eye to eye with that young fox.\"A young male proboscis monkey in profile. It is the WPY Animal Portraits winner this year. The picture was taken at the Labuk Bay Proboscis Monkey Sanctuary in Sabah, a Malaysian state on the island of Borneo. That splendid nose will get even bigger as the young primate matures. It'll give his calls a bigger sound, and it will probably come to signal his status in the group.WPY isn't only about animals. This image taken on the north side of Europe's most active volcano won the Earth's Environments category. Luciano Gaudenzio had to brave heat and stinking steam to get close to his subject. He described the scene as hypnotic, the vent resembling \"an open wound on the rough and wrinkled skin of a huge dinosaur\".This glass frog snacking on a spider is the winner in the WPY category for Behaviour: Amphibians and Reptiles. Jaime took this picture in Ecuador's Manduriacu Reserve - during a torrential downpour. He had to hold an umbrella and flash in one hand while operating the camera in the other.A specially built, superfast shutter system was needed to frame and freeze these two wasps in Normandy, northern France. The red-banded sand wasp (left) and the cuckoo wasp are about to enter next-door nest holes. Frank Deschandol wins the Behaviour: Invertebrates category.The Under Water category winner for 2020. This is a tiny diamondback squid. It's a paralarva - meaning it's beyond a hatchling but not quite a subadult. Songda took this on a night dive off the coast of Anilao, in the Philippines. The animal is about 6-7cm in length.These are young Pallas's cats, or manuls, which are found on the remote steppes of the Qinghai-Tibet Plateau in northwest China. Shanyuan captured this image of the playful kittens after six years of tracking and studying the animals. The picture wins the Behaviour: Mammals category.The Wildlife Photographer of the Year awards are normally presented during a gala dinner at the NHM in South Kensington. But, as with so many events in the era of Covid, organisers had no choice but to go virtual this time. The highly popular exhibition will proceed as normal, however. It opens on Friday, but is ticket only. Booking is essential.Entries for next year's awards start being accepted on Monday.Jonathan.Amos-INTERNET@bbc.co.uk <mailto:Jonathan.Amos-INTERNET@bbc.co.uk> and follow meon Twitter. <https:\/\/twitter.com\/#!\/BBCAmos>"}