{"author":"By Jemma Dempsey","title":"Renting: Three ways to win the race to securing a property","news_category":"general","content":"Trying to find a place to rent in today's market and beating your competitors to the front door can feel like a relentless race that you'll never win.Property website Zoopla says the number of available properties to rent is down by a third since before the pandemic.So with such ferocious demand, what can you do to secure your new home? Most people know the importance of having a decent credit rating and their deposit secured.But how do you avoid the bidding wars and massive queues on \"open home\" day and get a landlord to pick you and not someone else?If you're new to the rental race, we've asked agents and landlords to tell us impressed them most and made those hunting for a rental stand out from the crowd.Rightmove said at the beginning of 2023, 70% of rental listings received an email enquiry from a potential tenant looking to view a property within the first day of it being listed on the website.Its property expert Tim Bannister said: \"Tenants need to do their homework and decide what they really want from a home so they can be targeted - online, with agents, friends and family.\"Then when instant alerts come through they can move quickly and get to the front of the queue. Be focussed and be prepared. Being first won't necessarily guarantee you the property but it will help.\"Campaign group Generation Rent agreed. Spokesman Dan Wilson Craw said it was essential to know what the property needs to have, such as storage for a bike or a washing machine already installed.\"That way if you view a property that ticks all the right boxes you can apply for a tenancy on the spot,\" he said.Being loaded with information really helps landlords and agents when looking to choose a tenant.Rightmove's Tim Bannister said: \"That means making sure you've got as much information as possible, for example multiple references with contacts available.\"Be clear about your circumstances and how flexible you can be with your timelines. Be upfront and provide clarity. The more you can do to work with a landlord, the better.\"Generation Rent said aside from having the holding deposit worth one week's rent in your account, prospective tenants needed to provide evidence of their income.That includes letting your employer and current landlord know they'll need to provide a reference.If you have exhausted your time trying to find a rental in your perfect area try thinking outside the box. Zoopla said atravel time search <https:\/\/www.zoopla.co.uk\/travel-time\/?search-section=to-rent> can bring more properties into your orbit which you might not have considered.Geographically, a home may look too far away but its travel time might be quicker than you thought. This can can open up your search to cheaper areas or slower rental markets.Mr Bannister said rental searches on Rightmove had expanded since the pandemic with many approaching reaching 50km2 (19.3m2).Victoria Tolmie-Loverseed helps students find accommodation with Unipol, a charity based in Bradford, Leeds and Nottingham.A rising student population not matched by an increased supply of housing has resulted in a crisis for young people often living away from home for the first time.\"Be flexible about where you're willing to live, cast your net wider into non-student areas and be willing to travel a little bit further,\" Ms Tolmie-Loverseed said.\"Know your budget, have your deposit sorted, know who your guarantor will be,\" she added."}