{"author":"","title":"Yorkshire village raises thousands for Ukraine refugees","news_category":"general","content":"A village has raised more than £8,000 in seven days to help support Ukrainian refugees.The cash raised by the community in Tockwith, in North Yorkshire, is being sent to Milanowek in Poland.About 900 refugees are being housed in the town, which is 25 miles (40km) from Warsaw.\"We feel exactly as every other village, town and city in the UK feels - we want to help,\" organiser Jim Tinsley said.Mr Tinsley and other residents set up their Go Fund Me Page on 2 March aiming to raise £2,000. The figure was achieved within 48 hours.He said they had wanted to do something practical to help, as well as making a gesture of support by lighting the village church in the colours of the Ukrainian flag.The link with Milanowek comes though an ex-pat friend of Mr Tinsley, Andy Eddles.Mr Eddles has taken a family of seven Ukrainians into his flat.\"There's a family of six kids and a mum and they've moved in,\" he said.Other ex-pats in the town are also taking in refugees, with the effort being co-ordinated by volunteers at the local fire station.\"My mate Steven had four big rooms and he's equipping them with bunk beds in every room with some of the money that was sent over by the Tockwith crew,\" Mr Eddles said.More than 2.5 million people have so far fled Ukraine, about 1.5 million of them are in Poland.The money being sent to Poland will also be used to buy beds, mattresses and phones to enable families to stay in touch with relatives still in Ukraine.\"We are sending direct aid, we're sending cash directly to Poland, and that seems to be the only way we, community to community, can help,\" Mr Tinsley said.Follow BBC Yorkshire on Facebook <https:\/\/www.facebook.com\/BBCYorkshire\/>, Twitter <https:\/\/twitter.com\/bbclooknorth> and Instagram <https:\/\/www.instagram.com\/bbcyorkshire\/>. Send your story ideas to yorkslincs.news@bbc.co.uk or send video here <https:\/\/www.bbc.co.uk\/send\/u49571818>."}