{"author":"","title":"Suzy Lamplugh: Father 'little hope left' after 30-year search","news_category":"general","content":"The father of Suzy Lamplugh, who has been missing for 30 years, says he has little hope left of finding out what happened to her.Paul Lamplugh said his estate agent daughter knew \"how to live life fully but no-one taught her how to be safe\".The 25-year-old disappeared on 28 July 1986, after going to meet a client - named as Mr Kipper - in Fulham.Marking the anniversary, the Suzy Lamplugh Trust - a workplace safety charity - aims to raise £30,000.The trust - set up by Miss Lamplugh's parents in December 1986 - needs the cash for its Right To Be Safe appeal, designed to educate young people about their safety during working hours.Miss Lamplugh was officially declared dead in 1994, presumed murdered.Her 85-year-old father, who lives in the family home in East Sheen where Suzy, her two sisters and brother were born and brought up, said he has now lost hope he will find out more.\"I don't have very much hope that I will find out what happened,\" said Mr Lamplugh, whose wife Diana died in 2011.\"I miss Suzy more now... I think the older I get I miss her.\"I particularly remember a conversation when Diana was chiding her for doing too much and she said 'Come on mum life is for living'.\"Suzy did know how to live life fully but no-one taught her how to be safe.\"The grandfather of seven stressed the charity's focus on young people, adding it was \"a life skill, once learned it lasts forever\".The charity has trained more than 50,000 people in the past three decades and has successfully campaigned for private hire vehicle licensing in London, bringing about the Protection from Harassment Act 1997 which dealt with stalkers, and setting up the National Stalking Helpline.Rachel Griffin, director of the charity, said this year the focus was on people aged in their mid-teens to early 20s and teaching them how to keep safe so they could pass on the message.\"Young people experience violence in the online world too,\" she said. \"When we were young, bullying ended when you left the playground but now it follows you around as it is at the end of your phone.\"At least 144 workers were killed at work and 76,000 others injured in 2015-16, figures from the Health and Safety Executive show.Suzy Lamplugh timeline28 July 1986: Suzy Lamplugh disappears while showing a property to Mr Kipper in FulhamDecember 1986: Suzy Lamplugh Trust established by Paul and Diana LamplughOctober 1987: Metropolitan Police investigation scaled down DNA tests conducted on 800 unidentified bodies1990: Missing Person's Helpline is launched. This began as the Trust's Missing Person's Unit and developed into the National Missing Person's Helpline.1994: Suzy Lamplugh officially declared dead, presumed murdered1997: The trust was instrumental in bringing about the Protection from Harassment Act 1997 which dealt with stalkers1998: Private Hire Vehicle (London) Act 1998 was passedMay 2000: Police reopen case after tracing of car that might have been used to kidnap herFebruary 2001: Police search a site close to Norton Army Barracks <http:\/\/news.bbc.co.uk\/1\/hi\/uk\/551698.stm> near Worcester - but fail to find a bodyApril 2001: Search of Quantock Hills <http:\/\/news.bbc.co.uk\/1\/hi\/uk\/1301487.stm> in Somerset - again no body foundNovember 2002: Convicted murderer John Cannan named as prime suspect <http:\/\/news.bbc.co.uk\/onthisday\/hi\/dates\/stories\/july\/30\/newsid_2492000\/2492647.stm> for the murder, but there is no prosecution through insufficient evidence. Cannan, 47, has denied any involvement2003: Diana Lamplugh steps down from charity after being diagnosed with Alzheimer's disease following a stroke. Paul Lamplugh also steps down to look after herSeptember 2005: Milly Dowler charity hands over £800,000 <http:\/\/news.bbc.co.uk\/1\/hi\/england\/southern_counties\/4267000.stm> raised to the Suzy Lamplugh Trust2006: The trust works in partnership with the Home Office's Prostitution Strategy Team and Crimestoppers to devise a pilot initiative focusing on the personal safety of sex workersMay 2008: Police ask to see prosecution files after serial killer Steve Wright <http:\/\/news.bbc.co.uk\/1\/mobile\/england\/london\/7401250.stm> was convicted for the murder of five prostitutes in Suffolk in 2006. Wright knew Miss Lamplugh when they both worked on the QE2 cruise ship in the 1980s - no links foundAugust 2010: Police excavate a field near the village of Drakes Broughton in Worcestershire <http:\/\/www.bbc.co.uk\/news\/uk-england-london-10946083> - a few miles from the site of the former Norton Army BarracksAugust 2011: Diana Lamplugh dies"}