{"author":"By Abdirahim Saeed","title":"Taliban start buying blue ticks on Twitter","news_category":"general","content":"The Taliban have started using Twitter's paid-for verification feature, meaning some now have blue ticks on their accounts.Previously, the blue tick indicated \"active, notable, and authentic accounts of public interest\" verified by Twitter, and could not be purchased.But now, users can buy them through the new Twitter Blue service.At least two Taliban officials and four prominent supporters in Afghanistan are currently using the checkmarks.Hedayatullah Hedayat, the head of the Taliban's department for \"access to information\", now has the tick.His account has 187,000 followers and he regularly posts information related to the Taliban administration. He had his paid-for blue tick removed last month, according to local media, but it has now returned.Abdul Haq Hammad, head of the media watchdog at the Afghan Ministry of Information and Culture, also has a blue tick on his account that has 170,000 followers.Prominent Taliban supporters have acquired the blue tick too.Muhammad Jalal, who previously identified as a Taliban official, praised the new owner of Twitter on Monday, declaring that Elon Musk was \"making Twitter great again\".The presence of the hard-line Islamists on Twitter has been a topic of controversy for some time.In October 2021, former US President Donald Trump - who was suspended from the platform after his supporters stormed the US Capitol - said: \"We live in a world where the Taliban has a huge presence on Twitter, yet your favorite American President has been silenced.\"This is unacceptable.\"The Twitter Blue service was introduced in December.It costs $8 per month, and an increased fee of $11 is paid by those using the Twitter app on Apple devices.Subscribers to Twitter Blue benefit from \"priority ranking in search, mentions, and replies\" to help fight spam and bots,according to the platform. <https:\/\/twitter.com\/TwitterBlue\/status\/1602426811656413189?s=20&t=kpMNq63QYJVRG96AAyK-9g>Before the introduction of Twitter Blue, none of the observed accounts for Taliban officials carried the blue tick mark - that was then used to indicate the identities of users verified by Twitter.After their return to power in Kabul in August 2021, the group took over verified accounts run by the previous administration, including the Afghanistan Cricket Board. The sporting body's account now carries a gold tick.Under Twitter's new policies, gold checkmarks indicate businesses, while grey ones are for other users, such as governing authorities.Taliban officials and supporters are prolific users of Twitter, using the platform to disseminate key messages.Twitter did not respond to a request for comment. "}