{"author":"","title":"DaBaby: US rapper apologises for hitting female fan","news_category":"general","content":"US rapper DaBaby has apologised after a video emerged of him hitting a female fan in the face in Florida.In the footage, a fan can be seen holding her smartphone up to the rapper's eye with the flash on while he is walking through a crowd. He is then seen striking the woman.\"I do sincerely apologise. I do,\" DaBaby said in a statement on his Instagram story.The chart-topping star said he had not realised the fan was a woman.\"I'm very sorry that there was a female on the other end of that flashlight on their phone,\" he continued.\"But you know, keep in mind, I couldn't see you because you got the flash this close to me. Which is okay, it's no problem. A lot of people did - they didn't put it as close as you put it - but a lot of people had flash on me, and that's okay. That's what I signed up for.\"The crowd booed the star after he struck the woman, and he left the venue without performing any songs.The star, whose real name is Jonathan Kirk, reiterated that the issue was the fact the flash was so close to his eye, and said he would also have punched the person if it had been a man.\"Out of all those fans - how many people know how to zoom in? Just zoom in instead of popping me in the eye with the phone,\" he said.\"But I do apologise that there was a female on the other end. I think by this time, you know it's a well known fact that male or female, I would've responded the same exact way.\"DaBaby's most recent album, Kirk, topped the US Billboard chart when it was released in November.He received two nominations at this year's Grammy Awards - for best rap song and best rap performance for his single Suge. He also appears on Camila Cabello's current single My Oh My.But DaBaby has had several brushes with the law since he's been in the limelight. In January, he was arrested on a battery charge in Miami after arguing with a music promoter over payment for a performance.Follow us on Facebook <https:\/\/www.facebook.com\/BBCEntsNews\/>, or on Twitter @BBCNewsEnts <https:\/\/twitter.com\/BBCNewsEnts>. If you have a story suggestion emailentertainment.news@bbc.co.uk <mailto:entertainment.news@bbc.co.uk>."}