{"author":"By Jack Grey","title":"Ukraine invasion: Welsh donations for refugees 'overwhelming'","news_category":"general","content":"You can barely walk amid the piles of donated items destined for Ukrainian refugees at one donation centre.\"It's absolutely amazing,\" said organiser Kamila Jarczak, who is from Poland and lives in Newport.In total about 70 volunteers have pitched in to sort through the thousands of items at the Westgate Hotel in Newport.Medical supplies and essentials such as nappies, clothes and toiletries are being sent to Ukraine and Poland.\"We have collections from all over, south Wales, north Wales, we've lost the plot from where in Wales,\" said Ms Jarczak, 40, who runs the Women of Newport group, which organised the collection.\"We thought it would be just from Newport, nobody was expecting having messages all the way from Tenby [in Pembrokeshire].\"Ms Jarczak said people had been so generous that \"we have to stop, no more donations, we cannot handle anymore\".One volunteer helping sort through donations fled the Ukrainian city of Lutsk only last Friday.She is from Ukraine but lives in Cardiff, and doesn't want to be named to protect her family's safety.\"I woke up to the sound of explosions,\" she said, adding that the airport next to her city was one of the early targets of the Russian attack.\"I saw first hand women carrying their kids for the 20km queue to try and cross the border,\" she said.She fled Ukraine with her mother, but said her grandmother, uncle and aunty had to stay as they are Ukrainian nationals. \"We had no way of getting them out,\" she said.\"It's incredible to see the support, we've so many random people turning up wearing Ukrainian colours and bringing whatever they can, the support and kindness have been overwhelming.\"For me being Ukrainian, it just means so much.\"\"Hope that if I was in the same situation of the Ukrainian people somebody would help me as well,\" said 24-year-old Anna Chendynska, from Poland.She came to help with the donations as soon as she saw the campaign promoted on social media.\"I had to come and help,\" she said, adding \"we are neighbours, Ukraine and Poland, it's so important to help each other in times like this.\"It made me so happy when I came here for the first time and saw all the stuff, I thought 'wow that's amazing'.\"David Daniel, who manages the Westgate Hotel, said he was \"blown away\" by the level of donations.\"If I'm honest I thought 'yeah you can use some space, maybe they'll fill the ballroom', but it's just been incredible,\" he said.\"There's items on all the stairs, and all behind the bar, I'm just blown away by it, not just the amount of donations, but the amount of volunteers arriving.\"The level of response just indicated how much everybody feels about what is happening in Ukraine.\"Everybody wants to help.\""}