{"author":"","title":"Finland country profile","news_category":"general","content":"In spite of its relatively small population, Finland has been a trendsetter in many fields since independence in 1917.It scores consistently well on international ratings for stability, freedom, public safety and social progressIts parliament was the first to adopt full gender equality, granting men and women the right not only to vote but also to stand for election in 1906.Finland declared independence from Russia in 1917 but, following its defeat at the hands of the Soviet Union in World War Two, it had to tolerate strong influence from Moscow until the end of the Cold War.Read more country profiles <http:\/\/news.bbc.co.uk\/1\/hi\/country_profiles\/> - Profiles byBBC Monitoring <http:\/\/www.bbc.co.uk\/monitoring>President: Sauli NiinistoSauli Niinisto won the presidential election in 2012 to become the country's first conservative head of state in five decades.The victory of the pro-Europe politician suggested that voters wanted to keep the country in the eurozone, despite misgivings over European Union bailouts.Mr Niinisto is credited with leading Finland's economy towards growth following the collapse of the Soviet Union during his tenure as finance minister from 1996 to 2001.Finland's president has a largely ceremonial role with fewer powers now than in previous decades, but can be an important shaper of public opinion.Mr Niinisto comfortably won a second term in the January 2018 election.Prime Minister: Sanna MarinSocial Democrat Sanna Marin took over as prime minister of a centre-left coalition in December 2019, after her predecessor Antti Rinne resigned over his handling of a postal strike. Mr Rinne, the leader of the Social Democratic Party, had come to power in June 2019 after defeating the centre-right government in April elections.His coalition, the first to be led by the Social Democrats since 2003, pledged to increase taxes and spending to preserve the country's generous welfare state.Ms Marin, who was 34 when she took office, is Finland's youngest prime minister.TV is the most popular medium. Public broadcaster Yle operates alongside commercial networks.The state of media freedom is rated highly by international press freedom organisations.Some key events in Finland's history:1100s - Swedish crusades subjugate Finns and convert them to Christianity.1808 - Russian invasion of Sweden supported by Napoleon.1809 - Finland is ceded to Russia by the Swedes. The Finns retain a considerable amount of autonomy. They keep their own legal system, religion, and are exempt from Russian military service.1899 onwards - Attempt at Russification of Finland, including conscription of Finnish men into the Russian army and the imposition of Russian as an official language. Campaign of civil disobedience begins.1906 - Parliament Act establishes universal suffrage, including the right for women to stand for elected office, for the first time in Europe.1917 - The Russian Revolution allows Finland to declare its independence.1918 - Civil war. A rebellion by left-wing Red Guards is put down by General Carl Gustaf Emil Mannerheim.1939 - Winter War: despite fierce resistance to invading Soviet troops, the Finns are forced to concede 10% of their territory.1941-44 - The Continuation War: conflict between Finland and the Soviet Union during World War Two, ends in an armistice and Finland having to pay reparations.1948 - Finland signs friendship treaty with the Soviet Union, and throughout Cold War pursues a policy of friendly neutrality towards Moscow.1955 - Finland joins United Nations and Nordic Council.1992 - Friendship treaty with Soviet Union of 1948 declared null and void following the collapse of the Soviet Union. Finland turns increasingly towards the west.1995 - Finland joins the European Union.2000 - Tarja Halonen elected as Finland's first female president.2002 - Euro replaces the Finnish mark.2010 - Finland becomes world's first country to give its citizens a legal right to broadband internet.2016 - Finland signs an agreement on closer defence collaboration with the United States amid growing concern over Russian military activities in the Baltic Sea region.2022 - In response to Russia's invasion of Ukraine, Finland and Sweden apply for Nato membership"}