{"author":"By Aled Huw","title":"Welsh language lessons for refugees and asylum seekers","news_category":"general","content":"For refugees and asylum seekers living in Wales, learning the language has become another part of the journey.Xiao-Xia Chen, who is originally from China, but now lives in Newport, said Welsh was \"difficult\" but a \"very special language\", having previously learned English and Mandarin.\"Because my kids are learning in Welsh in school, and I want to keep up with them, I chose to learn Welsh,\" she said.\"I'm really enjoying it, and the community feeling is very powerful.\" Classmate Tsege, an asylum seeker from Eritrea, said learning Welsh allowed her to help her children, who are six and 13, to also learn the language.She said: \"In school, our children are learning Welsh. If, as their mum, I don't know Welsh, I can't help them. I decided at that time, I have to learn English as well as Welsh.\"Ayda Eileen, from Sudan, moved to Wales in 2013 and said she was also taking Welsh lessons to help her children with their schoolwork, but also to improve her job prospects.\"When I need to apply for a job, if you know Welsh, you'll be first in line for a job,\" she said.The women are learning Welsh as part of a scheme run by the Red Cross, Gwent Welsh Learning and National Centre for Learning Welsh.The students come from across the world, including Eritrea, China, Sudan, Tanzania andKurdistan <https:\/\/www.bbc.co.uk\/news\/world-middle-east-29702440> - a mountainous region straddling the borders of Turkey, Iraq, Syria, Iran and Armenia.Theresa Mgadzah Jones, of the British Red Cross, said the scheme had been very popular, particularly with mothers whose children are learning Welsh in school.She said more than 25 women came to the first taster session, allowing ten weeks' worth of classes to be put on.This video can not be playedSyrian refugee children embrace love of Welsh\"The numbers have stayed quite high although lockdown has affected it, so the women have been learning Welsh online,\" she said.\"Some of them want to learn Welsh so they can help their children with their homework, or they want to learn Welsh because they believe that living in Wales they should learn the language of their new home.\"A lot of the women are bilingual or trilingual, so for a lot of these women learning a new language is not a challenge at all and it's something they are used to.\"Jacqui Spiller, who teaches the group, said many of the women were taking on lessons alongside childcare and other challenges.\"They're very busy being mums but they are really interested in learning. Most of them are learning English as well.\"They enjoy getting to together and learning new skills and giving them tools in order to, in the future when they're looking for work, have more skills to find work in Wales,\" she added.\"It's been very successful. Given the obstacles we've faced with Covid and the women not having iPads and laptops, the Red Cross were able to provide the women with laptops and smartphones to continue learning and it's been such a success despite the obstacles.\"I really hope we'll see the provision expanding in the future.\"Efa Gruffudd Jones, of the National Centre for Learning Welsh, said it was important that \"everyone who wants to learn Welsh is able to do so\".\"The Welsh language belongs to everybody who lives in Wales, wherever they have come from,\" she said."}