{"author":"","title":"Prince Charles 'voiced local views' on Chelsea Barracks","news_category":"general","content":"The Prince of Wales only voiced concerns of \"ordinary people\" about a planned £1bn complex at Chelsea Barracks, his top aide said.Prince Charles's principal private secretary Sir Michael Peat said the letter to developer Qatari Diar had only \"repeated\" the views of residents.Last week the High Court criticised the prince's intervention as \"unwelcome\".Qatari Diar breached the contract with its partner CPC Group by withdrawing the plan, the court ruled.The Qatari group, which is linked to the Qatari Royal family, withdrew Lord Rogers' modernist vision for the 12.8-acre site in June 2009.In a letter to the prime minister of Qatar last March, who heads the firm, Prince Charles said his \"heart sank\" when he saw the design for the site.The court heard the Emir, Sheikh Hamad, met the prince in May and a month later the planning application for 638 homes, a 108-bed hotel, restaurant, community hall, sports centre, shops and a park, was withdrawn.Sir Michael said: \"It is part of the Prince of Wales' official duties to encourage and advise and warn and to make sure the views of ordinary people, that might not otherwise be heard, receive some exposure.\"The Prince of Wales was contacted by local residents who were concerned about the proposed development on the Chelsea Barracks site.Referring to the letter to prime minister Sheik Hamad, Sir Michael said: \"The content of the letter was by no means private because the residents were making all these points loudly and clearly.\"He wrote the letter in the way that he thought would have the most impact.\"The CPC Group, controlled by the Candy brothers, took the case to the High Court claiming £68m. However, the court refused to award the money but said it will consider a claim for damages or loss of earnings.During the case, Mr Justice Vos said the prince's intervention \"was, no doubt, unexpected and unwelcome\".Following the ruling Lord Rogers said the prince's intervention was \"wrong\"."}