{"author":"","title":"Public ownership call for rural bus services in north Wales","news_category":"general","content":"Bus services in rural parts of north Wales should be put into public ownership, an assembly member has said.Sian Gwenllian's comments come as Arriva said it would cease to run a bus service between Llanberis and Caernarfon in Gwynedd later this month.The bus company apologised and said no further local services were under threat.Gwynedd council said it was considering running some bus services as a \"possible option for the future\".Plaid Cymru's Ms Gwenllian has urged the Welsh Government to find a \"new model\" for bus services.Arriva confirmed it was cutting the number 88 service between Llanberis and Caernarfon from 23 September \"due to low passenger figures\", though the service will continue to operate on Sundays.Jan Chipps of Talysarn, near Caernarfon, said villagers who did not own cars felt increasingly \"isolated\" and she feared rural communities would be left to \"die\" if bus services were not protected.\"It's like being a second-class citizen if you don't have a car,\" she said.Ms Chipps added: \"People in rural areas really rely on buses to get to work or school but we've seen the service [for our village] cut quite dramatically.\"That feeds into economic decline of these rural communities.\"The issue is affecting rural areas across Wales, according to Ms Gwenllian.\"We need to lobby to give local authorities rights and responsibilities for deciding on the timetables, when and where buses should run,\" she said.\"But the Welsh Government now should start thinking properly about how to support the setting up of new municipal bus operators, so the emphasis shifts from profits to providing a service for everyone.\"The government said it could not force an operator to run a particular service without subsidy.However, it has already approved a £25m discretionary grant to help authorities subsidise \"socially-necessary\" transport services in 2018-19, a spokesman said.\"This is just one of several funding streams we use to help support a sustainable bus network and is a notable achievement given the challenging budget settlements from the UK Government,\" the spokesman said.Gwynedd council confirmed it was looking into running a potential replacement bus service for the number 88.\"Whilst there is a willingness to consider the matter, it is important to note there are a number of matters and commitments to consider in detail along with considerable financial investment and time before such a considerable change could be introduced across the county,\" a council spokesman said."}