{"author":"By Steffan Powell","title":"Happy birthday Mario! Iconic game character turns 30","news_category":"general","content":"It's 30 years since Italian plumber Mario first appeared in the legendary computer game Super Mario Bros.Consoles have changed a lot since then but the character with the best moustache in gaming is still as popular as ever.Four of the WiiU's top five selling games of 2015 so far have Mario on the front cover.So why is he still so popular? We spoke to the men who know - his creators.Shigeru Miyamoto started working in the art department of Nintendo when it was a playing cards company.He is Mario's creator and has been involved in making every Mario platform game.Speaking to Newsbeat he says the character is still popular because the core of his games have stayed the same.\"The basic game play hasn't really changed much,\" he explains.\"Mario still jumps and he still runs but as time and the hardware has evolved we've tried to tweak and improve the controls.\"He may be familiar to generations of gamers but Mario has been at the forefront of innovation too, like the time he went 3D in Mario 64.\"Whenever there's new hardware we try to make a new Mario game to go with it and we try to reflect that platform in the games,\" says Miyamoto.\"We've had him try sports and karts, we've tried to evolve him so there's lots of variety.\"Charles Martinet has been the voice of Mario since 1995.He spoke to Newsbeat about the character's enduring appeal. \"If you played the first ever Mario game and you play the most recent one you'll recognise the same characteristics... the adventure, the fun.\"The goal [of the game] is joy, the goal is fun and happiness.\" Charles says that he would like to be more like Mario himself because the little plumber is \"full of optimism and joy\".\"All the time facing every challenge with a [in a Mario voice] 'here we go!'\"Takashi Tezuka has produced Mario games since the 1980s as well as other gaming classics like Zelda and Star Fox.Sales of Mario games, from the traditional side-scrolling platformers to sports titles like Mario Golf, have helped Nintendo become one of the most successful gaming companies in the world.\"We weren't really conscious of how important he [Mario] was to the company.\"It was more about the game play and how each character fits each game.\"It just happened that looking at certain types of games Mario fit.\" This meant Mario soon started appearing in lots of games.\"It happened organically, it wasn't really a conscious thing,\" adds Tezuka. So what's next for the world's most famous plumber?Well there is the release of Super Mario Maker, a game that lets you create your own Mario levels to play.Shigueru Miyamoto jokes that this game could be his last Mario title: \"Maybe everyone will be satisfied with Super Mario Maker and maybe this will be the end because everyone's happy with Mario now.\"We should just leave it up to the players to look after him now.\"Yeah, but seriously Mr Miyamoto, what's next?\"We will still absolutely continue to make more side-scrolling games and maybe another version of Super Mario Maker - we'll wait and see.\"Phew.Follow @BBCNewsbeat <https:\/\/twitter.com\/BBCNewsbeat> on Twitter, BBCNewsbeat <http:\/\/instagram.com\/bbcnewsbeat> on Instagram, Radio1Newsbeat <https:\/\/www.youtube.com\/user\/Radio1Newsbeat> on YouTube and you can now follow BBC_Newsbeat on Snapchat"}