{"author":"By Claire Kendall and Jeremy Cooke","title":"Social care: 'Jo's care will cost £1.5k a week - the system is broken'","news_category":"general","content":"It was only a year ago that Boris Johnson stood up in Parliament and said he was going to fix the long-term problems in social care. He announced a new tax - to raise about £12bn a year - would be spent on health and social care costs only. But the UK's new prime minister, Liz Truss, has already scrapped the plan. Families, carers and care providers have been left asking where the funding will now come from to fix a system, which they say is broken.\"It's devastatingly hard to watch the woman that you love starting to disappear from your life, starting to fade away,\" says Bill Wilson. \"After nearly 47 years together, Jo was leaving me and it was like, 'I don't want you to leave me. I need you here with me'.''Dr Jo Wilson was a high-flying international executive before she was diagnosed with dementia two years ago, aged 66. Bill insists he's her husband, not her carer. But he now sees to Jo's every need. Jo now walks around their home, in Newcastle, humming, confused, and talking to her \"mam\", who died years ago.Bill has had to find fight and persistence to navigate the world of dementia care. \"It took me two years to get a care package in place for Jo,\" he explains. \"And I only got that because Jo had a collapse at home and was taken into hospital.\"Even after it was confirmed Jo could have carers come to their home to help, Bill found the variety of staff, unreliable time keeping, and a lack of understanding of dementia, left him questioning whether it was worth it. \"If I was to say to you it was like lighting a cigarette with a £50 note every day, that might give you some kind of idea about how I feel about that care package\". He's now permanently exhausted, and frustrated.Bill is regularly left to get Jo up in the morning, or to put her to bed at night. It involves a huge amount of time, patience and cajoling. Just getting her into her pyjamas can take over half an hour. While Bill takes off her shoes, Jo tries to put them back on. When Bill is looking for the hairbrush, Jo is heading downstairs saying she wants to go home.All the time Bill is desperately looking for a hint of the wife he remembers. \"It's worse than tough,\" he says. \"It's horrendous. You're soul-searching every single day, you're looking for this slightest crumb of positivity that you can hang on to by your fingernails.\"Their home is surrounded by memories of their lives before Jo's dementia diagnosis. Photographs of their wedding, family and holidays. They thought they would have had their retirement to travel, to go to the theatre, and have their niece and nephew over to stay. Now Bill walks around the house with keys round his neck, fearing Jo might wander out of the front door or get into the cupboard with the cleaning products in.A place in a care home is the only alternative. That would be a big move for Bill, both emotionally and financially. \"I've looked into residential care\", he says, \"because I know that it's going to happen, even though I can sit here and say 'I'm not letting it happen', I know that it will.\"He says residential care for Jo would cost £1,500 a week. Because Bill and Jo own their own house, they would have to pay a lot of it themselves. Jo's care would take an eye-watering amount of their savings and pension, although Bill would not be forced to sell their home. Once all savings had been spent on residential care, the council would then fund the place in the care home. If Bill were to move or die, the council could claim the cost of Jo's ongoing care from the value of the couple's house.For those who go into residential care and don't have a dependent or partner at home, care has to be paid for using the person's assets, which can mean selling the house.Bill describes one of his biggest frustrations as \"the huge disparity between being ill, which is treatable by the NHS, and having the illness of dementia, which is local authority care\". \"Why?\" he says. \"I don't understand. Because Jo has dementia, nothing is free, we have to pay for everything\".Even when Bill is prepared to pay, to have a break from the 24\/7 responsibilities, he feels forgotten. \"I phoned 42 care homes to look for a respite bed for Jo and didn't get one that was prepared to to offer respite care.\"\"The social care system - everyone knows it's broken.\"Professor Martin Green, chief executive of Care England, says without a complete restructure of the social care system \"thousands, if not millions, will be left without support, and the NHS will be on its knees\". It is a warning heeded by others.The government says it launched a 10-year plan on adult social care last year and is investing £5.4bn over three years. But there's a lack of confidence that social care services will get help to those who need it.A new poll by Ipsos Mori for BBC News, suggests more than 70% of those over 55 are not confident that social care services will provide care to those in need. More than half of responses cited staff shortages and limited public funding as their main concerns.Care providers say it's these issues that are putting them under extreme pressure. \"We know currently that three in five people with dementia do not get the support that they need once they have that diagnosis. And that leads to crisis in care\", says Fiona Carragher, director of policy at the Alzheimer's Society.The government has promised funding to recruit more care workers from abroad and £500m to help local authorities provide care packages this winter for those leaving hospital.Changes, to help people cover their personal care costs, are due to come into effect next October. They include a more generous means-test and a lifetime cap on care costs of £86,000.But the care sector is calling on the government to explain how it will pay for social care after ministers scrapped plans for the National Insurance levy, which was earmarked to pay for the social care cap. Yesterday, England's county councils urged the government to delay its social care reforms, warning of serious staffing and financial pressures.Until details become clearer, the 900,000 people living with dementia will have to wait. Bill says he is determined to value his days with his \"number one girl.\" \"We all know there's no happy ending,\" he adds. \"There's only one outcome. But we can enjoy the time we have together until that outcome comes.\""}