{"author":"","title":"Homes for Ukraine: What is it like to welcome a refugee?","news_category":"general","content":"As the government launches its Homes for Ukraine site - allowing Britons to take in refugees fleeing the Russian invasion - many will be thinking about signing up. But what are the realities of doing so? Families from Yorkshire who have welcomed dozens of asylum seekers between them have spoken to the BBC about the realities of opening up your home to others.More than 2.8 million people have now fled Ukraine because of the Russian invasion, according to the United Nations (UN). The speed and scale of the UK's response has been criticised in some quarters, butsign-ups to the homes scheme <https:\/\/www.bbc.co.uk\/news\/uk-60741942> have been brisk, with 1,500 reportedly signing up within an hour of it going live.Refugees will be able to live and work in the UK for up to three years and access healthcare, welfare and schools.How to sponsor Ukrainian refugees in UK homes <https:\/\/www.bbc.co.uk\/news\/60735121>Rachel Poulton and her family have taken young refugees from around the world into their home in North Yorkshire for nearly six years.The family was inspired to help after seeing pictures of people fleeing Syria and other war-torn countries in order to stay alive and build a life for their families.\"We were seeing awful images of young people crossing the Mediterranean in the 2015-16 refugee crisis and we had to do something,\" she says.\"The youngsters who have come to our home have all been through traumatic experiences.\"We can't take that away or make it better but we can be a small part of making their lives better from here.\"I love it when people arrive and start to feel safe and welcome, start to settle, take up a sport, play a musical instrument, start to develop their lives as they should. That's lovely to see.\"She says people taking in refugees should \"be prepared for the unknown\" and abandon any preconceptions. while seeking help from organisations such as Sanctuary UK.\"People need the physical space, a spare room, beyond that it comes from the heart,\" she says.Robert and Margaret Spooner, from Sheffield, have hosted hundreds of asylum seekers from countries including Iran, Iraq, the Congo and Afghanistan through the city's Assist project.They say their experience of helping had been overwhelmingly positive, even if communication could sometimes be difficult.Margaret Spooner says having a stranger in your home who had experienced the worst that life could throw at them could be a \"a bit scary at first, but you soon get used to it\".\"You wonder how they'll react. Some are very scared and hide and don't want to come out,\" she says.\"Others try to be terribly helpful, constantly washing up and cleaning floors. People want to cook which is very enjoyable. You get the benefit of their skills.\"Mrs Spooner said communication was vital - but not always easy. \"Basic things like 'do you want a key?' and 'what would you like for breakfast tomorrow?'\"The couple say that if people were considering hosting someone fleeing Ukraine, they should give them space and not force them to speak about their experiences.Instead, Ms Spooner says, focus on finding common bonds, as well as giving them the chance to do small jobs or make food to take their mind off things.Care worker Christopher Marks, 58, says his own experiences of homelessness had inspired him to open his home to a Ukrainian refugee.He said he and his partner, a teaching assistant, moved from Leicester to Bridlington about 16 months ago to be nearer the seaside.\"We're very lucky because we own our house and we're able to give something back and this is what we want to do,\" he says.\"I was homeless a long time ago but I worked my way back into the system. I have my own home and I'm very lucky.\"I would like to make it possible for somebody else to be comfortable and safe. That's the main thing - they need to feel safe.\"Being homeless is nowhere near the catastrophe going on in Ukraine. I was in my hometown. This is just a big thing.\"The world is not such a good place at the moment.\"Dr Rev Inderjit Bhogal helped Sheffield to become the UK's first City of Sanctuary in 2007.That movement now has bases in cities and towns across the nation, including Birmingham, Leeds, Swansea and Aberdeen.The City of Sanctuary project aims to build compassion, hospitality and practical help for those fleeing their homelands.Dr Bhogal said the message was simple: \"Don't be afraid; they're human beings and they offer friendship and love and are very grateful for your welcome and shelter.\"Our best response to war in the world is to be welcoming and hospitable\".Despite the events in Ukraine dominating the news, Dr Bhogal said we should remember that many people continued to leave other countries in fear of their lives.\"There is still conflict and refugees from Sudan, Yemen, Syria, Afghanistan and so on.\"We must not forget about them.\""}