{"author":"","title":"George Floyd death: More large protests in US but violence falls","news_category":"general","content":"This video can not be playedAleem Maqbool reports from peaceful protest in Washington's Lafayette ParkTens of thousands of people have demonstrated, mainly peacefully, across the United States for an eighth night following the death of African-American George Floyd in police custody.One of the biggest protests, joined by Floyd's relatives, took place in his hometown of Houston, Texas.Many defied curfews in several cities, imposed after violence and looting in some districts on Monday night.The Pope has issued a call for racism not to be ignored. \"We cannot tolerate or turn a blind eye to racism,\" he said. But he also condemned the violence: \"Nothing is gained by violence and so much is lost.\"The Floyd case has reignited deep-seated anger over police killings of black Americans and racism.Demonstrators have taken to the streets - not only to express their outrage at the treatment of Mr Floyd - but to condemn police brutality against black Americans more widely.There have been calls, and a proposal from a US lawmaker, to end the qualified immunity of police which prevents civil legal action against them. More generally protesters have called for an end to racism and discrimination.In central Washington DC police fired tear gas after darkness. The military were again on the streets of the capital and helicopters hovered above protesters marching towards the White House.Traffic was blocked in New York's Manhattan district as protesters ignored a night-time curfew, which had been extended for a week. Video footage showed them surrounding a police van.This video can not be played'I'm tired of being afraid': Why Americans are protestingIn Houston, where Floyd is due to be buried, Mayor Sylvester Turner, told the crowds people should know that he \"did not die in vain\".Big rallies were also held in Los Angeles, Philadelphia, Atlanta and Seattle. Minneapolis, where 46-year-old Floyd died, was reported to be relatively calm.But in Seattle, Portland and Atlanta there were reports of tear gas being fired.Sixteen members of George Floyd's family joined the 60,000 protesters for the Houston rally.They included sister La Tonya and brother Philonese. A nephew told the crowd: \"Don't stop until we get justice for my uncle,\" the Houston Chronicle reports.At an emotional news conference in Minneapolis, Roxie Washington, the mother of George Floyd's six-year-old daughter Gianna, said he was a good man.Standing with Gianna, she said: \"I'm here for my baby and I'm here for George because I want justice for him.\"George Floyd's funeral is due to take place on 9 June in Houston. The president on Wednesday again defended his record on race relations while condemning both \"killers, terrorists, arsonists, anarchists, thugs, hoodlums, looters\" and the coverage in much of the media.He posted tweets saying his presidency had done more for black Americans than presidential rival Joe Biden had done \"in 43 years\".An earlier tweet had cited a number of measures, along with the \"lowest black unemployment, poverty, and crime rates in history\". Unemployment levels did hit a low last year but have soared in the coronavirus outbreak.Mr Biden has said Mr Trump's actions are trying to \"serving the passions of his base\" and has pledged not to \"traffic in fear and division\" or \"fan the flames of hate\".President Trump earlier defended his controversial decision to pose with a Bible outside a historic church in Washington, whose basement was set on fire at the weekend.Taking to Twitter, he wrote: \"You got it wrong! If the protesters were so peaceful, why did they light the Church on fire the night before? People liked my walk.\"On Monday, police used rubber bullets and smoke grenades ahead of the curfew to clear a peaceful protest near the White House, before Mr Trump stood for the cameras outside St John's Church.Michael Curry, the presiding bishop of the Episcopal Church diocese in Washington, accused him of using the Church for \"partisan political purposes\".Criticism also came from Washington's Catholic archbishop, who condemned Mr Trump's visit to the Saint John Paul II National Shrine on Tuesday. It \"manipulated\" the shrine, Archbishop Wilton D Gregory said.Monday night saw some of the worst unrest with widespread looting and arson as previously peaceful protests saw a minority resort to violence. In Las Vegas, a police officer was described on Tuesday as being in a grave condition after being shot.Separately, an armed man was shot dead by police in the same city.Four police were also shot in St Louis, though their injuries were not described as life-threatening. But a retired officer was shot and killed outside a looted store.The protests began after a video showed Mr Floyd being arrested on 25 May in Minneapolis and a white police officer continuing to kneel on his neck for several minutes even after he pleaded that he could not breathe.The officer, Derek Chauvin, has been charged with third-degree murder and will appear in court next week. Three other police officers have been fired.This video can not be playedThe peaceful protests honouring George FloydThe Floyd case follows the high-profile cases of Michael Brown in Ferguson, Missouri; Eric Garner in New York; and others that have driven the Black Lives Matter movement in recent years.Garner was placed in a police chokehold in New York in 2014 and could be heard crying out \"I can't breathe\" as officers restrained him. His words, which were also shouted by Mr Floyd in his final moments, have become a rallying cry for Black Lives Matter protesters.African-Americans are more likely to get fatally shot by police than other ethnic groups. They are also arrested for drug abuse at a much higher rate than white Americans, although surveys show drug use is at similar levels.For many, the outrage over Mr Floyd's death also reflects years of frustration over socio-economic inequality and discrimination.But the protests also echo those of the Civil Rights movement more than 50 years ago. This action was led by Martin Luther King Jr and sought to challenge white supremacy and the segregationist policies that were commonplace at the time.The ongoing unrest is the most widespread racial turbulence the US has experienced since Dr King, known to most Americans as MLK, was gunned down by a sniper in 1968.How has the unrest affected you? Share your experiences by emailing haveyoursay@bbc.co.uk <mailto:haveyoursay@bbc.co.uk?subject=USunrest52886736>.Please include a contact number if you are willing to speak to a BBC journalist."}