{"author":"By Jennifer Harby","title":"The woman who found important art in a Leicester basement","news_category":"general","content":"Historical casta paintings, showing mixed-race families in 18th Century Mexico, were destined to be sold off by a Leicester museum. That is, until the intervention of a trainee curator of Caribbean descent. Now, they are to be the subject of a major new exhibition.\"Basically, we were tidying up,\" recalls Tara Munroe.\"I saw some paintings by the back door of the basement and, when I looked at them, I realised they weren't like anything I had ever seen before.\"I asked the curator at the time what was happening to them and he said they were probably going to get rid of them.\"I said 'Don't do that'.\"At the time, in 2010, Tara, 50, was a trainee curator with Leicester's Museum and Art Gallery.\"To my knowledge, I was the first person of colour to be on the curatorial team at Leicester museums,\" she said.\"That's probably why I had seen something in these paintings that nobody else did. They were a bit battered and bruised - they had not been taken care of.\"Luckily, the museum listened to Tara. She spent the next decade researching the works - an investigation that saw her forge contacts with experts all over the world, including California, New York and Nigeria.\"Finally the penny dropped,\" she said.The five works were what is known as casta paintings <https:\/\/www.bbc.com\/culture\/article\/20221229-the-colonial-clothing-that-reveals-hidden-truths-about-race> - a genre of art that originated from Mexico in the 18th Century.They depict interracial mixing resulting from the widespread marriage between Spanish settlers, enslaved and indigenous populations.The paintings Tara had found have been attributed to Juan Rodríguez Juárez, an important artist of the time, or people in his circle.Other works by Juárez have sold at auction for tens of thousands of US dollars.\"I just looked at them from a different perspective to everyone else,\" Tara said.\"When I look at these paintings I see so much more than just the beauty of them.\"I see the beginnings of the myth of racial identity and a way to unpack the elements of social and racial stereotyping in today's current climate.\"And yet, in some ways, Tara said the paintings made for uncomfortable viewing.\"You can see these paintings are families - you have a mother, a father, a child in each of them,\" she said.\"When you can see a lady is black, she tends to be dressed as a maid, but the lighter or the whiter the women are, they are depicted in the garden, or wearing jewellery.\"The works also contain descriptions, written in Spanish, along the top of the paintings, containing terminology that is considered offensive today.Nevertheless, Tara said the paintings offer an insight into a past that has often been overlooked by Western art.To find them in Leicester - one of England's most diverse cities - seemed even more fitting, she said.She added: \"It's showing black, white and Asian people have a history of mixing.\"It also allows us to highlight the beautiful diversity of Leicester, even while you have to have these difficult conversations.\"As a child, Tara said one of her formative memories was being taken to the museum by her grandfather Aldwin.\"I moved to Leicester when I was 12 - my family came from Jamaica and Trinidad originally,\" she said.On one occasion, the museum was displaying Trinidadian carnival costumes.\"My grandad was so proud that part of our culture was being displayed there,\" Tara said.\"I have always remembered walking into the museum and seeing these things in there that were related to me.\"Yet she had never thought of pursuing museum work as a career.\"It wasn't something I ever, ever thought about,\" she said.She did a degree in design management and innovation at De Montfort University and began working with community arts groups, which brought her into contact with the museum's work.After a spell on the curatorial team, during which time she studied for a masters, she set up Opal 22 - a community interest company - in 2016.It aims to help mainstream heritage organisations reach out to communities, with a particular emphasis on black British history.For the past decade, alongside all of Tara's other projects, one of her main passions has been to research and raise awareness of the casta paintings.She obtained grants from the Heritage Lottery Fund and the Arts Council to fund an exhibition of the works at the museum from 17 September.Tara said she is hopeful the exhibition will attract people from Leicester's diverse communities.\"I'm hoping it will attract a new audience,\" she said.\"Seeing yourself in something opens it to a whole different audience.\"I still remember, all those years ago, seeing that costume from Trinidad with my grandad and how much it meant to us both.\"Follow BBC East Midlands on Facebook <https:\/\/www.facebook.com\/bbceastmids\/>, onTwitter <https:\/\/twitter.com\/bbcemt>, or on Instagram <https:\/\/www.instagram.com\/bbceastmidlands\/>. Send your story ideas to eastmidsnews@bbc.co.uk <mailto:eastmidsnews@bbc.co.uk>."}