{"author":"By Owen Amos","title":"Rwanda migrant scheme: No evidence that UK policy deters migrants, say MPs","news_category":"general","content":"There is \"no clear evidence\" that the UK's plan to send asylum seekers to Rwanda will stop risky Channel crossings, a group of MPs has said.In April, the UK said some people arriving on small boats from France would be sent to claim asylum in Rwanda - a policy meant to deter the journeys.But MP Diana Johnson, chair of the home affairs committee, said it \"appears to have gone unnoticed\" by migrants.The government said its \"world-leading\" plan would stop dangerous crossings.The Rwanda policy was announced in April, with Prime Minister Boris Johnson saying action was needed to stop \"vile people smugglers\".However, no migrants have yet been sent to the east African country.Earlier this year, 47 people were told they would be flown to Rwanda, with a flight booked for 14 June. But after a series of legal challenges, and aruling from the European Court of Human Rights <https:\/\/www.bbc.co.uk\/news\/uk-61806383>, the flight was cancelled.More than 14,000 migrants have crossed the Channel on small boats this year - including 442 on Monday 11 July alone - and the home affairs committee said the Rwanda announcement had not been effective.\"There is no clear evidence that the policy will deter migrant crossings - numbers have significantly increased since it was announced in April,\" the report said.However, the committee accepted the increase may be down to traffickers telling migrants to make the journey in case the flights to Rwanda begin.\"One explanation for [the increase in crossings] may be attributed to scaremongering from people traffickers, that because of new regulations coming in across the Channel it will be much harder to access the UK in future, so they had better get on with it,\" the report says.This video can not be playedWatch: Boris Johnson outlines Rwanda immigration plans in AprilThe report said the numbers making the \"hazardous\" journey across the Channel in small boats had \"rocketed\".\"More than 28,500 people came in small boats last year; an estimated 60,000 or more are expected during 2022,\" it said.\"Soberingly, at least 166 have died or gone missing as they sought a new home in our country,27 of them lost at sea on a single terrible day last November.\" <https:\/\/www.bbc.co.uk\/news\/uk-59406355>But the MPs said there was \"no magical single solution to dealing with irregular migration\".Instead they called for \"detailed, evidence-driven, fully costed and fully tested policy initiatives\" that achieve \"sustainable incremental change\".The prime-ministerial race and a fresh legal challenge mean the pause button has been pressed on the Rwanda plan espoused by Boris Johnson and launched by Home Secretary Priti Patel.Aware of its potential popularity with Tory voters, they faced down critics of the controversial deal.As well as charities and human rights groups, opponents included church leaders and - reportedly - the Prince of Wales.In its response to the MPs' conclusions, the Home Office says it was never seen as a \"silver bullet\", employing the committee's own language.The eleventh-hour grounding of the first flight by the European Court of Human Rights (ECHR) renewed the determination of the plan's supporters.But will it deter migrants from boarding the boats? The MPs say there is no evidence so far.A fuller picture will emerge if there are regular Rwanda flights. And that will depend on the new prime minister.The report noted that French authorities intercepted 6,000 journeys in the first half of 2021 - \"nearly three times more than the year before\".But it also noted the \"perceived reluctance of the French government to find a solution and work much more co-operatively with UK authorities\".The MPs said: \"We recommend that the UK government continue to prioritise close, collaborative working with the French authorities...\"An intelligence-led approach remains the best way to identify the activities of such gangs and prevent their continuing exploitation of vulnerable people.\"The report also said:In response to the report, the Home Office said there was \"no silver bullet\" to the \"global migration crisis\", but that the government must do \"everything we can to fix the broken asylum system\".\"Our New Plan for Immigration will bring in the biggest package of reforms in decades, allowing us to support those in genuine need while preventing illegal and dangerous journeys into the UK, and breaking the business model of vile people smugglers,\" a spokeswoman said.The Home Office also said it was recruiting more decision makers, improving digital technology, offering more remote interviews to reduce waiting times, and improving the interview process to \"ensure decisions are right first time\"."}