{"author":"","title":"Energy transition - a complex challenge for Holyrood","news_category":"general","content":"The pace of change is daunting, from technology to ageing demographics. But there's no change more radical and fundamental to the economy and to our lives than the Great Energy Transition.It reaches into our homes, the way we keep warm and cook food, as well as the way we get around and the shape of our neighbourhood.On Wednesday, MSPs vote on a new national planning framework, which indicates how much green energy will reshape the nation.The declining use of oil and gas will, or should, reshape geopolitics, though not necessarily in predictable ways.Charting a course through all that is tricky for us as individuals: whether to buy a hybrid or electric car, how to reduce heating bills, and for many, an attempt to reduce our impact on climate change, perhaps with less flying, driving or eating meat.It is no less difficult for businesses, where energy bills can look impossibly high, and where customer, investor and regulatory pressure is requiring lower emissions, at some cost.For governments, the challenge is more complex still. And the Scottish government has now set out its strategy for getting us from here to net zero in the next 22 years. Yes, 2045 is closer than you probably realised - it's now closer than the last millennium.Much of the new strategy pulls together strands that have been developed over recent years, most notably since the COP26 gathering in Glasgow just over a year ago.The Scottish government has pivoted from seeing the oil and gas sector as a pillar of the economy - without independence and even more so with it.It is now arguing that the industry's inevitable decline, due to half a century of extracting more than 45 billion barrels of hydrocarbons, ought to be accelerated.The UK government was heading in the same direction back at the COP26 summit. But with instability in Downing Street, and with Russia's aggression raising the importance of securing energy sources, Whitehall seems much more positive about further exploration and development.For now, it is the one deciding on licences. That means SNP ministers have less need to explain why jobs are disappearing. They previously told us Scotland could be the Saudi Arabia of renewable energy, with 25% of Europe's wind power potential. They trumpeted 130,000 low-carbon energy jobs.They are not saying that now. The 25% claim has been dismantled by critics. It never looked plausible anyway.Manufacturing of wind turbines has come to nothing much. Kit is imported from lower cost fabrication yards from Spain to China, and installed by Norwegian and Belgian firms.Unlike Saudi Arabia, the huge investment in offshore wind is being financed mainly by foreign investors, who will take the profits when they are made. Scottish Labour would like to see some stake for the state, to share the spoils.Also, with the energy strategy, there is publication of a much more modest set of projected employment figures for the 'just transition' out of oil and gas and into renewables.Economic research commissioned by the Scottish government, which is yet to be published in full, forecasts that the 19,000 Scottish green energy jobs in 2019 are on course to become 77,000 jobs by 2050.Meanwhile, it is calculated that 58,000 Scottish jobs in oil and gas production will fall to only 6,000 by the middle of the century.Making that transition with minimum pain is an important plank of the energy strategy, for individuals and for the politics of north-east Scotland - so much so that it has its own plan alongside the overarching strategy.Ministers need to be able to tell those with well-paid jobs in oil and gas that they can make the transition to greener energies using a 'skills passport'.Some companies are doing so, because they see the pressure to diversify, and they're creating opportunities for staff to be part of that process without changing employers. But there are also indications of a lack of confidence that oil and gas jobs are that easily transformed.And it may turn out to be less difficult - much of the transition may be achieved by retirement of an ageing oil and gas workforce.The energy strategy includes big claims for wind power, both on and offshore, which are backed up by the investment appetite of companies bidding for the right to develop in Scottish waters.Wave power trials have disappointed so far, but there is hope that engineering challenges can be overcome. Tidal power is proven technology and closer to financial viability, with the bonus of being as predictable as the moon.The shiny new technology is hydrogen - green if it uses renewable wind power to derive it from water, and not at all green if it is derived from gas. A strategy for that was set out last month, with big plans to deploy offshore wind and to build an export industry.This video can not be playedWatch: What is hydrogen energy and why is it important?But hopes that it might heat homes are being set aside, in favour of its use for heavy transport and industry.The strategy, which is out to consultation, rules out new nuclear \"with current technologies\", while talking up solar power, but without a suggested target. There's more light in Scotland than you might think during the darkness of January, and commercial solar farms are being developed as far north as Moray.Michael Matheson, the cabinet secretary who carries the strategy, has a lot to say about hydro power, and particularly the pumped storage variety, which uses excess wind power during the night to pump water uphill, for its release into the turbine halls when demand for power surges.The minister wants to see the UK government helping with incentives for more of that. He also urged Whitehall to get behind the Acorn project for carbon capture and storage, based in Aberdeenshire, but so far without the UK government funds that are needed to get it growing.There is less being said by government or opposition about demand for energy. That is where there are more awkward decisions - requiring tougher insulation standards in new and existing homes, with high upfront costs, and in ensuring that the transition to battery vehicles does not leave behind those who can't afford it.Such challenges are acknowledged by the Scottish government, but without much of the tricky detail on how to use its powers and funds. Expect to hear more when Green co-leader Patrick Harvie sets out his ministerial plans for home insulation later this year.While Mr Matheson has advice for Whitehall, there are some stern warnings being directed towards ministers by their own advisers. The Just Transition Commission was set up by ministers to advise them and to hold them accountable.It is doing just that, and in unwelcome terms. Alongside the energy strategy on Wednesday, the Scottish government published two letters from its chair, Prof Jim Skea.One, dated early November, reminded ministers of its recommendations that there should be a 'road map' in the transition, with targets to be met in each year to 2045. There's no sign of that in the strategy.He followed up with a letter in mid-December, with a stiff reprimand to ministers for their failure to consult fully with the commission ahead of the energy strategy consultation.Prof Skea pointed out that much is being made internationally of Scotland's leading role on combating climate change - not just its ambitious targets, but in inviting independent advice and scrutiny from the commission.It exists to build consensus, says the letter. But if it gets ignored, there's a clear threat that the commission's members will desert it in favour of the campaign, community and business groups, the trade unions and universities they were drawn from. And that would be embarrassing on the international stage.The commission letter says there was a \"high-level briefing\" that was not a consultation, and it left members \"deeply concerned about the lack of evidence of adequate policy actions to deliver a just transition for the energy sector, particularly given the urgent need to shift gear in the rest of the 2020s\".It is even more scathing in its support of comments from the UK Committee on Climate Change, which questioned the credibility of the Scottish government's policy.\"Plans and targets must be deliverable and supported by adequate funding,\" wrote Prof Skea. \"As pointed out by the UK's Committee on Climate Change, over-ambitious targets, or plans that dodge tough questions rather than confronting them, risk a disorderly, and hence unjust, transition.\"A reply to Prof Skea from Richard Lochhead, the Scottish government minister responsible for Just Transition, sought to defuse tensions with an emphasis on how highly ministers valued the commission's advice.\"We have made progress, but I am under no illusions about the amount of work that needs to be done to deliver on our collective hopes for Scotland,\" Mr Lochhead wrote.\"The Commission's role in shaping this is absolutely crucial and I would like to establish much closer personal involvement with your work as our approach to planning develops.\"This involves several encounters between government and commission members during the 12-week consultation, and a fast track to a new Memorandum of Understanding between them.Prof Skea's letter promised a further statement in the new year, with further advice on making the energy transition and on its fairness. Ministers will probably be awaiting that with some trepidation."}