{"author":"","title":"York student uses AI chatbot to get parking fine revoked","news_category":"general","content":"A student has successfully appealed against a £60 parking fine by using a letter written by an artificial intelligence chatbot.When Millie Houlton received the notice from York City Council she said she was tempted to pay rather than spend time compiling a response.However, the 22-year-old asked ChatGPT to \"please help me write a letter to the council, they gave me a parking ticket\" and sent it off.The authority withdrew the fine notice.Artificial intelligence chatbots are designed to answer questions by finding information and presenting it in a lifelike way.Despite seeming comprehensive, ChatGPT creator OpenAI has admitted the system could \"sometimes writes plausible-sounding but incorrect or nonsensical answers\".Miss Houlton said the fine was wrongly issued for parking on her street - as she has a permit to do so.The York St John University student said she considered stumping up the cash because she was so busy with academic work in the final year of her events and business management degree.She said: \"I was like, 'oh I don't need this fine, I'm a student' but trying to articulate what I wanted to say was pretty difficult so I thought I'll just see if ChatGPT can do it for me.\"I put in all my details about where and when it happened, why it was wrong and my reference for the fine and it came back with this perfectly formed personalised response within minutes.\"Miss Houlton said the chatbot's response was \"great\" and it explained the situation perfectly.\"It said I was a student and that I had paid for my permit for two years and I wasn't going to deliberately park somewhere I shouldn't.\"ChatGPT has had more than 100 million users since its launch in November last year.The viral AI chatbot can respond to questions in a human-like way, writing speeches, poems, marketing copy, student homework and even computer code.Microsoft, which has invested billions of dollars in it, embedded the latest version into its search engine Bing, and plans to put it into Office apps, saying it wants to take the \"drudgery\" out of office work.The latest version of the tech which powers ChatGPT, GPT-4, is smart enough to pass the bar exam sat by (human) trainee lawyers.Big tech firms, like Google who launched its own Bard chatbot last month, think this could be the future of the way we search the webA recent report reckoned that more than 300 million jobs in Europe will be at least partially automated in the coming years.But not everybody is dazzled by the potential of AI to transform our lives.Italy has just blocked ChatGPT, citing privacy concerns. Yesterday, more than 1,000 AI experts, including Elon Musk, signed an open letter calling on all AI development to be paused for six months.They argued that humans do not have the right safety measures in place to protect us from it as it gets more advanced.AI makes mistakes, shares misinformation, makes stuff up and can create realistic, photo-like images of things that never happened - an AI generated image of the Pope wearing a designer white puffy jacket fooled millions.It could turn out to be a destructive influence on society, and it's currently coming towards us very, very fast.She said she was \"very relieved\" when she received the local authority's letter revoking the fine.Miss Houlton said although she had been using the tech for a while, she had begun to use it for social occasions, including organising an Easter egg hunt for her running club around York.\"I explained it was an Easter theme, put in all the locations in that I wanted to go to and gave me riddles, clues and everything.\"Follow BBC Yorkshire on Facebook <https:\/\/www.facebook.com\/BBCYorkshire\/>, Twitter <https:\/\/twitter.com\/bbclooknorth> and Instagram <https:\/\/www.instagram.com\/bbcyorkshire\/>. Send your story ideas to yorkslincs.news@bbc.co.uk <mailto:yorkslincs.news@bbc.co.uk>."}