{"author":"","title":"Jonathan Edwards: Plea to Plaid to re-admit wife assault caution MP","news_category":"general","content":"The former Plaid Cymru leader of Ceredigion council has said that MP Jonathan Edwards should be re-admitted to the party.He was suspended in May 2020 after receiving a police caution for assaulting his wife <https:\/\/www.bbc.co.uk\/news\/uk-wales-politics-53205748>. He now sits as an independent MP.Ellen ap Gwynn has told Bore Sul on BBC Radio Cymru <https:\/\/www.bbc.co.uk\/programmes\/m001kn01> that the party should give Mr Edwards a \"second chance\".Plaid Cymru said it was focused on the future and delivering radical policies. In January, Mr Edwards said he could run against his former party at the next election as he had a\"groundswell of support\" <https:\/\/www.bbc.co.uk\/news\/uk-wales-politics-64320533> locally to stand again.In 2022 Mr Edwards, the MP for Carmarthen East and Dinefwr, was allowed to re-join the party by a disciplinary panel <https:\/\/www.bbc.co.uk\/news\/uk-wales-politics-62207015> - triggering an argument about whether he should represent the party in the House of Commons.A majority of the party's ruling National Executive Committee recommended that he should not resume his work as a Plaid Cymru Westminster MP.Ellen ap Gwynn said: \"In my opinion, Plaid Cymru has a policy of restorative justice and I think he should have had a second chance.\"I know the disciplinary process has been followed, and followed correctly.\"He had the punishment, he got expelled for a year, then they re-considered and they decided that he could re-join.\"But, for some reason, there was a rather unpleasant feeling in this case that he shouldn't be allowed to be re-admitted into the party.\"In response, Plaid Cymru said it was \"entirely focused on the future, continuing to deliver radical policies that make a real difference to people's lives through theco-operation agreement <https:\/\/www.bbc.co.uk\/news\/uk-wales-politics-64560317> [with Welsh government] and bringing forward progressive ideas that address the cost-of-living crisis\"."}