{"author":"By Frank Gardner","title":"Russian spies more effective than army, say experts","news_category":"general","content":"Russia's security and intelligence services have achieved greater success in Ukraine than its army, says a leading UK defence think tank.Russian spy agencies began preparing for the invasion of Ukraine as far back as June 2021, says a report by the Royal United Services Institute (Rusi).The Federal Security Service (FSB) has quickly dominated populations in occupied areas of Ukraine, Rusi adds.The report was compiled using sources including captured documents <https:\/\/rusi.org\/explore-our-research\/publications\/special-resources\/preliminary-lessons-russias-unconventional-operations-during-russo-ukrainian-war-february-2022>, it says.Ukrainian intelligence officials, intercepted communications and on-the-ground research also contributed.Researchers say the FSB has been able to download government computer hard drives to identify pro-Kyiv individuals that its agents want to arrest and interrogate.Electronic warfare units have been deployed to cut off occupied parts of Ukraine from the outside world to help them enforce control, Rusi says.According to the think tank, the head of Russian foreign intelligence, the SVR, told President Vladimir Putin they needed more time to prepare and asked for the invasion to be delayed. His request was denied.The 39-page report, titled Preliminary Lessons from Russia's Unconventional Operations During the Russo-Ukrainian War, Feb 2022-Feb 2023, is aimed as a warning to Western governments as to the extent of Russian covert operations to subvert a target country.The report's main author, Jack Watling, points to the recent arrest of a senior German intelligence official accused of passing highly classified information to Moscow.\"It is evident,\" says the report, \"that the Russian special services managed to recruit a large agent network in Ukraine prior to the invasion and that much of the support apparatus has remained viable after the invasion, providing a steady stream of human intelligence to Russian forces.\"Russia's domestic spy agency, the FSB, the modern-day successors to the Soviet KGB, was able to do this by forming temporary operational groups that focused on target cities such as Melitopol.As Russian forces advanced, FSB officers would seize Ukrainian government records from local headquarters, download the computer hard drives which then allowed them to build lists of who was working for the state and where they lived.House-to-house searches then resulted in arrests and interrogations in basements. Torture was often used, says Mr Watling, not so much to extract information but more for intimidation purposes, to discourage the population from resisting the occupation. Russia has consistently denied multiple accusations of human rights abuses in Ukraine.At least 800 Ukrainian officials were co-opted into working for the FSB, some willingly, some coerced.At the same time, electronic warfare units worked to cut off access to Ukrainian TV, radio and the internet, further isolating the population in areas under occupation. The FSB, says Mr Watling, assessed that they only needed to control 8% of the population in order to subdue an area.The overall picture is that Russia's intelligence and security agencies have achieved a greater degree of success in Ukraine than its military, which has suffered numerous setbacks.However, the spies too have had their failings. Their original pre-invasion assessment, given to President Putin, was that Russian forces would be welcomed with open arms and that the government in Kyiv would quickly collapse. That proved to be catastrophically wrong for Moscow.\"Russian special services,\" says the report, \"lack the honesty to report accurately about their own efforts. There appears to be a systemic problem of over-reporting one's successes and concealing weaknesses to superiors.\"Jack Watling points out the example of the Russian general in GRU military intelligence who was in overall charge of the 2018 Salisbury poisoning using Novichok nerve agent in a failed attempt to kill a KGB defector, Sergei Skripal.Despite the operation being exposed and the alleged culprits publicly identified, that general was not removed. Instead, he has been promoted."}