{"author":"By Tom Geoghegan","title":"Trump indictment: A simple guide to what it means","news_category":"general","content":"Former US President Donald Trump is being charged with a crime in relation to a payment he made to a porn star.The man who spent four years in the White House is now days away from being fingerprinted, given a mugshot photo and brought before a judge.This is happening as he campaigns to become president again, in the 2024 election.Here is what the case is about.It emerged on Thursday night that a jury in New York has voted to indict Mr Trump, which means they believe there is enough evidence to bring criminal charges against him.We don't yet know what those charges are.But for weeks the jury has been hearing evidence about a payment made to buy the silence of a porn star called Stormy Daniels.It happened before Mr Trump was president, just before the 2016 election which he won against Hillary Clinton.We will find out exactly what the charges are on Tuesday when the 76-year-old is arrested and appears before a judge in Manhattan.Stormy Daniels says she had an affair with Mr Trump in 2006, which he has always denied.In 2016 she tried to sell her account of what happened to the media. Mr Trump's lawyer, Michael Cohen, paid her $130,000 (£105,000) to keep quiet. That kind of payment is called hush money.That is not illegal but what has got Mr Trump into trouble is how Mr Cohen's reimbursement was recorded in his accounts. He is accused of falsifying his business records by saying the payment was for legal fees.As it happened just before Americans were due to vote, it may also violate laws about payments that help an election campaign.There will now be a trial where Mr Trump will make his case. He has denied any wrongdoing and says the charges are politically motivated.The most likely outcome is a fine but there is also a chance he could be sent to prison.If any of the charges are serious - what in the US is called a felony - then Mr Trump would face a maximum of four years in prison.But legal experts tell the BBC that time behind bars is unlikely.Yes, there's nothing in the US constitution to prevent Mr Trump from continuing his election campaign now he is being charged.Even if he was imprisoned, he could theoretically still run for president and win an election.But there are practical considerations.A prolonged legal fight and a trial will be a major diversion from a presidential campaign - in time and energy, and the scheduling of election rallies.Yes. He faced two major inquiries by Congress when he was president, called impeachments, but was acquitted by the US Senate both times.Now he has left office he can no longer be impeached but instead can be indicted and faces a number of criminal investigations.They are continuing and we will hear more about them in the months ahead. "}