{"author":"By Louise Cullen","title":"Translink: First zero-emission buses set to hit the streets","news_category":"general","content":"The first zero-emission buses will hit the streets of Belfast on Monday 28 March.In total, 100 vehicles will be rolled out by Translink over the next few months, with more to come in the following years.The 77 battery-electric and 23 hydrogen buses will form around a third of the Belfast fleet by this summer.It means Translink will have the fourth largest zero-emission fleet in the UK and Ireland.\"The buses are very quiet, the journey is very smooth,\" said Chris Conway, chief executive of Translink.\"Passengers will also notice things like contactless ticketing will be on these new buses. They'll have side doors as well, to make it easier for people to get on and off, and make the journey faster.\"And they're fitted out with all the modern features - USB charging points, wi-fi and good accessibility features as well.\"Translink said the battery-electric vehicles run on sustainable electricity. The hydrogen needed for the other buses currently comes from a number of sources but the company said it will ultimately use green hydrogen.\"At the minute, to get them set up, we've had to use hydrogen from a number of sources,\" said Mr Conway.\"But the plan is for this to be green hydrogen, coming from windfarms.\"We've one of the largest hydrogen refuelling stations in the UK, at our depot in Newtownabbey.\"The buses have been built at Wrightbus in Ballymena, with funding from the Department for Infrastructure of £74m.\"Public transport is the second highest emitter of greenhouse gases, so it's crucial that we decarbonise, so that we can play our part in tackling the climate emergency,\" Infrastructure Minister Nichola Mallon said.\"This will transform our public transport network in terms of our buses, much more comfortable buses for people to travel on, but also much cleaner and greener, which is really important for air quality and our environment too.\"The shift to greener transport has had an impact on the manufacturers as well.\"Last year, we probably built 70% diesels, 30% zero emissions,\" Wrightbus chief, Buta Atwal, said.\"This year, it's completely the opposite way round. It'll be more like 80% zero emissions and 20% diesels, so you can see it really has changed our production and how we look at the bus industry.\""}