{"author":"By George Herd","title":"2 Sisters: 700 jobs go as Anglesey chicken plant shuts","news_category":"general","content":"A chicken processing plant has closed its gates for the last time after more than 50 years, causing 700 job losses.The 2 Sisters poultry giant announced plans to shut down operations at Llangefni, Anglesey, in January.Despite a taskforce setup in a bid to save the factory, its owners confirmed it would shut at the end of March.Some workers said the closure was a \"crying shame\" but others remain optimistic the local economy will grow in other sectors creating new jobs.When the decision was first made in January, Anglesey council's leader, Llinos Medi described the move as a \"devastating blow\".Local Conservative MP Virginia Crosbietold BBC Radio Wales <https:\/\/www.bbc.co.uk\/sounds\/play\/live:bbc_radio_wales_fm>: \"The Island needs hope and I am determined to do everything I can to help. It is a really sad day for the workers of 2Sisters.\"It isn't just the employees that are impacted, it is the families, the communities and the supply chains.\"So many companies really stepping up and trying to employ the staff that have lost their jobs.\"It is a view shared by Des Edwards, who has worked night shifts as a hygiene operative for the past 10 years.He said: \"It's a crying shame - it really is.\"Now 58, he said he was trying for other work, but it was all off Anglesey.\"There's nothing whatsoever on the island. It's really getting worse, as time goes by,\" he said.\"Who's going to employ someone who is 58 years of age that's going to retire at 67. They'd rather employ someone young.\"Mr Edwards fears there will be \"nothing on the island whatsoever\" for his two young grandchildren once they reach working age.Friend and colleague Vince Williams has been a mechanical fitter at the factory for two years.\"In the beginning I was a bit gutted, but at least we know what is happening. You've just got to go on with life,\" said the 55-year-old from the town.\"Life doesn't stop because 2 Sisters has finished. You've just got to get on with it, and go to the next chapter in your life.\"Like others, he has concerns for what the future holds for the island.\"So many big companies have closed over the last 20 years,\" he said, pointing to Anglesey Aluminium at Holyhead and the Eastman Chemical Company at Peboc among others.He said the island needs new investment if the economy is to survive.During the official consultation period, the union Unite accused 2 Sisters of failing to engage with the Welsh government, UK officials and the union to actively save the plant from closure.But the company insisted the Llangefni site remained unviable.\"The facts of the matter are the site is old - it's over 50 years old. It's small, it's inefficient, the transport costs are too high,\" said 2 Sisters chief executive Ronald Kers, when the decision was first taken back in January.\"If there was an easy solution, we would have definitely explored it in more detail.\"The company has offered to relocate some of the workforce to its other sites, including its largest poultry factory at Sandycroft on Deeside in Flintshire.It says 54 people have been redeployed, with the hope more will be taken on in the coming weeks.2 Sisters said a further 113 of those losing their jobs have found other work on Anglesey and other parts of north Wales.The firm added: \"Whilst we acknowledge this can be no substitution for the closing of the site, we remain committed to doing all we can and are offering additional support for a further month after this week's closure.\"An employment and advice hub has been running at the nearby Bryn Cefni Business Centre since the consultation started.Coleg Menai specialises in vocational training, especially in engineering, technology and health and social care. It is part of the taskforce set up to help workers.\"Our hearts go out to the families that have been affected by the sad closure,\" said the college principal, Aled Jones-Griffith.\"We will work with them to see if we can identify new opportunities for them, or if we can identify re-skilling opportunities for them.\"He is convinced there are opportunities on Anglesey, saying it is not \"all doom and gloom\".It is a view shared by some of the younger students on the campus.Cai Pritchard is 18, and studying TV and film production at Coleg Menai. \"Young people tend to choose jobs and careers that are more relevant to their interests - rather than skills that have been pointed out by other people,\" he said.\"Recently, there's a studio opened, Aria (in Llangefni), and that means there will be a bunch of film productions coming up which doesn't normally happen in north Wales.\"It means creative opportunities for young people.\"Carly Hughes, 20, wants a career in health and social care. She said it was a profession that is in great demand.\"The 2 Sisters food group is devastating, especially for Llangefni, because there are a lot of jobs that have gone.\"But I do think there are various job opportunities on the island for people. I do think the future is brighter.\"In just the past week, the decision was taken to name Holyhead as one of Wales' two new Freeports <https:\/\/www.bbc.co.uk\/news\/uk-wales-65044061>, projects that are setting out to create 20,000 jobs and investment worth £5bn.Last year, Stena Line UK acquired the former site of Anglesey Aluminium <https:\/\/www.bbc.co.uk\/news\/uk-wales-62958817> for plans to boost its operations at the Port of Holyhead.Work is also continuing on developing a hydrogen energy hub <https:\/\/www.bbc.co.uk\/news\/uk-wales-64787650> on the island.Off-shore, the Morlais tidal energy project is continuing to progress <https:\/\/www.bbc.co.uk\/news\/uk-wales-60833908> - it received one of the last EU grants worth £31m last year.These are all projects with the potential to provide a new generation of high-skill, well-paid jobs in years to come.But that may come as little comfort to many of those walking out of the gates of 2 Sisters on Friday, without work and wondering what the next few weeks will bring."}