{"author":"","title":"LGBTQ: Eisteddfod event for community considered","news_category":"general","content":"An Eisteddfod for gay, lesbian, bisexual, transgender and queer people would help members of the LGBTQ community to keep their Welsh identity, a trans woman has said.Crash Wigley, who leads the Cardiff Trans Singers choir, said an Eisteddfod for her community would be welcomed.\"It's really exciting,\" she said, \"we're really looking forward to it\".Eisteddfod organisers said a consultation found interest for an event was encouraging.Mas ar y Maes [Welsh for out on the Maes] was founded five years ago to celebrate LGBTQ culture with a series of workshops, panels, and events at the National Eisteddfod.It is now looking to create an official Eisteddfod for LGBTQ competitors, with the first event to be in held Cardiff this summer.The hope is for the event to move around the country in future. Ms Wigley said her choir took part in Mas ar y Maes at the eisteddfod in Cardiff.\"That was a really great experience because most of our choir don't speak Welsh and so for me it was really nice to get to teach some Welsh language songs to people, to introduce this new world of culture,\" she said.\"I think it's really important because the eisteddfod is such an important cultural event about celebrating the Welsh language... so everyone who speaks the Welsh language should be able to see themselves represented and taking part in that celebration.\"Cardiff Trans Singers choir are keen to participate and compete in the eisteddfod, something they have never considered before.The idea of an LGBTQ eisteddfod got a positive response at the Queer Emporium shop in Cardiff.\"I think it's a very good idea because it's important to get the community together,\" said Jack Hayward.Jack Coles, from Bristol, added: \"Having an element where I can mix my community and Welsh speakers is a really great idea for me as a learner and will help me learn better, so I think it's really important.\"Betsan Moses, the chief executive of the National Eisteddfod, said it would be an eisteddfod \"for everyone\".\"It will follow the pattern of small eisteddfods, so you will have a list of competitions and I'm sure they will be looking for something different to offer,\" she said.\"It will also be inclusive... an opportunity for everyone to participate.\"She said some competitors may then want to go on to compete in the National Eisteddfod."}