{"author":"","title":"Ukraine conflict: Relax visas for refugees, Welsh MP says","news_category":"general","content":"This video can not be played\"We're really happy that he's back now, we're really lucky\"Rules need to be relaxed to allow refugees fleeing Ukraine in to the UK following Russia's invasion, a Welsh MP has said.Temporary visa concessions for the family members of British nationals in Ukraine have been introduced.Labour's shadow immigration minister Stephen Kinnock has called on the UK government to relax the visa rules.Meanwhile, Conservative MP Stephen Crabb has signed a letter with fellow Tory MPs urging the PM to\"go further\" <https:\/\/www.bbc.co.uk\/news\/uk-60550238>. The 37-strong group, including the Preseli Pembrokeshire MP, a former Welsh Secretary, is calling on \"the UK government to provide as much support as possible to our European partners who are currently the first safe havens for Ukrainian refugees\".The prime minister said the UK would not \"turn our backs in Ukraine's hour of need\" <https:\/\/www.bbc.co.uk\/news\/uk-60550238>, allowing Ukrainians to come if they have relatives who are British nationals.But Mr Kinnock said it was \"shameful\" that rules remained too restrictive.The UN said more than 500,000 refugees had left Ukraine <https:\/\/www.bbc.co.uk\/news\/world-europe-60551688> since the conflict began last Thursday.The number of refugees is expected to increase as Russian forces attempt to seize control of Ukrainian cities and overthrow the democratically elected government in the capital Kyiv.Wales' First Minister Mark Drakeford said Wales wanted to be a \"nation of sanctuary\", having previously taken in families from Syria and Afghanistan following conflict.Dylan Ellis Jones from Corwen, Denbighshire, is fearful for a family member in Ukraine who may have to fight.His wife is from Ukraine, and while his sister-in-law has been able to gain sanctuary in Romania, his brother-in-law must stay.Mr Jones described the feeling of shock at how quickly things changed.\"We don't know what will happen now,\" Mr Jones told BBC Radio Cymru's Dros Frecwast programme <https:\/\/www.bbc.co.uk\/programmes\/m000rlr1>.\"He's on the border with the west which is a pretty safe place and not too close to a city.\"Who knows, they have arranged for all the guys there to have a gun. There is a conscription in Ukraine and lots of the men have been in the army.\"He added: \"I don't know if he has even shot a gun.\"This video can not be playedWatch: Missile strikes, tanks and buildings destroyed in KyivAberavon MP Mr Kinnock told BBC Radio Wales Breakfast action was needed in Westminster.\"We first of all need [Prime Minister] Boris Johnson and [Home Secretary] Priti Patel to change the policy so that we can have a safe sanctuary scheme, just as we did after the war in the Balkans,\" he said.\"It is the absolute minimum that we should be doing and it's one thing for Boris Johnson to make broad rhetorical speeches about how much he wants to help Ukraine, but then Priti Patel is not actually putting that rhetoric into action and that, I think, is shameful.\"It needs to change.\"Natalia Roberts, from Caernarfon, has family and friends stuck in Ukraine.\"People just can't reach the border,\" she said. \"I know my friends who are spending every night in the basement [and] who have little kids.\"They want to take kids to the safe place but they don't feel safe to leave their their houses their basements because they have no idea how to reach the border. It's so far away.\"I don't know how they're going to travel because everywhere there's explosions, everywhere there's tanks.\"She added: \"My mother is with my grandparents. Because my grandparents are old, she can't leave them and go to a safe place.\"I'm afraid every time the phone goes, I'm afraid to answer it because I don't know what's gonna happen next.\"Rachel Gegeshidze's husband Gio works in Odessa as an engineer and was there when the invasion began. He fled via Moldova and caught a flight to the UK from Romania.Rachel, who has been co-ordinating the effort to send clothing and medicine to Ukraine from her home in Gower, said she was woken by a call early on Thursday.\"It was Gio saying 'It's started, I need to get out... I can't talk. I just need to go. We've got drivers and we're leaving'.\"I think we're still in shock really... It's unbelievable that he's here, and his friends and colleagues are still there. The hardest part is thinking what people are facing.\"Their daughters Elene and Annie said they were \"really worrying, wondering if he could get out\".\"You woke up and the first thing that you saw on your phone was that they had invaded. What we had hoped wasn't going to happen had,\" said Annie.\"The first thing in your head is wondering if he's going to be able to get out.\"He'd been home when it was starting to get dangerous and had then gone back, so it was stressful wondering if he's going to be able to do it again.\"Elene added the most scary part was \"not hearing from him between the bombs going off, him saying he's leaving and then getting to the border\".\"We're really happy that he's back now, we're really lucky.\"Mr Kinnock, who was director of the British Council in St Petersburg from 2005 to 2008, said time spent there taught him there was a huge gap between the Russian public and the country's leadership.\"They want to be a normal country,\" he said. \"They want to live normal lives. They want to be connected to the rest of the world.\"And then we have this paranoid bullying tyrannical leadership that is deeply corrupt, and they behave like thugs and gangsters, frankly, and I just think we're seeing that huge contrast now again, between the people and the leadership with the protesters out on the streets, saying this war is not in our name.\"But unfortunately, we have a leader in Moscow, Vladimir Putin, who seems to be just doubling down on his strategy of trying to bully and intimidate and that cannot be allowed to continue.\"He will be defeated in Ukraine because with an army of 150,000, he simply cannot occupy a country of 44 million that's larger than France.\"And it's absolutely clear that the Ukrainians are going to fight him with everything they've got, so he is going to lose this.\"And it will be a terrible defeat for Russia, for him, for the Russian people because it's not in their name. And it has to be where Europe learns that we cannot just turn a blind eye to the behaviour of these authoritarian regimes.\""}