{"author":"By Cherylann Mollan","title":"Razia Muradi: The Afghan woman who won university gold in India","news_category":"general","content":"As Razia Muradi walked on to the stage to accept an award for outstanding academic performance, she felt happy and sad at the same time.Ms Muradi, 27, who is from Afghanistan, has been studying in India for two years. She recently made headlines when she received a gold medal for topping a master's course in public administration at her university in the western state of Gujarat.But her family couldn't be with her to celebrate her achievement. \"It was a bittersweet moment,\" Ms Muradi says. \"I was happy that my hard work had paid off, but I was missing my family.\"\"I was also thinking about all the girls and women of Afghanistan who have been deprived of their right to study and work.\"Since the Taliban came back to power in Afghanistan <https:\/\/www.bbc.com\/news\/world-south-asia-11451718> in August 2021, they have severely curtailed women's rights and freedoms <https:\/\/www.bbc.com\/news\/62469204>. Female students have been barred from attending secondary schools anduniversities <https:\/\/www.bbc.com\/news\/world-asia-64875969>.But when Ms Muradi travelled to India - in February 2021 - things were quite different back home; the Taliban had not yet come to power and she was still allowed to study.She chose India because it had more options for higher education and shared enough cultural similarities with Afghanistan to make her feel at home.She got a scholarship provided by the government's Indian Council for Cultural Relations and joined a master's course in Public Administration at the Veer Narmad South Gujarat University (VNSGU) in Gujarat.\"I chose VNSGU because a lot of Afghan students have studied here and they had positive things to say about the college,\" Ms Muradi says. She opted for public administration because of her interest in administration and policymaking, and says hopes to bring \"change in [Afghanistan's] government system\" to promote public welfare.\"It would be an honour for me to go back to my country and work towards its development,\" says Ms Muradi, who has worked with many international organisations in Afghanistan in the fields of humanitarian assistance and women empowerment.On Monday, Gujarat's governor gave her a gold medal for scoring a cumulative grade point average of 8.60 in her course, the highest in her university.But preparing for the exams wasn't easy, Ms Muradi says, as she was worried about her family's safety back home. As the Taliban advanced across her country in 2021, she wondered if her loved ones would be casualties of war.\"In a conflict zone, everyone is in danger. I kept hearing about explosions and attacks. I would try to check about my family's safety whenever I could, but weak internet in Afghanistan made this difficult,\" she shares.But whenever she felt demotivated or scared, she would tell herself that she had to soldier on for her family.\"They've made so many sacrifices for me. Excelling at my studies is the least I could do for them,\" she says.Ms Muradi says she hasn't been able to visit her family for the past two years, and won't be travelling back even though she has completed her course as \"things are not good\" in her country at the moment.\"There is no bright future for me in Afghanistan right now,\" she says.\"People have lost jobs and plans related to development and rehabilitation have been stopped. Instead of progressing, the country is regressing,\" she says.Ms Muradi doesn't mince words when talking about the state of affairs in her country, saying that she considers it her \"responsibility to speak the truth\".\"If we just keep silent, there won't be any chance to change this regime. They [the Taliban] want people to be silent. But as an Afghan woman with agency, it is my responsibility to talk about the effect the regime is having on society.\"Ms Muradi is now doing her PhD in public administration from the same college.\"My family and my community have always been supportive of my dreams. It is because of them that I was able to be an active woman in society,\" she says.\"I owe all of my achievements to them.\" BBC News India is now on YouTube. Click here <https:\/\/www.youtube.com\/@bbcnewsindia> to subscribe and watch our documentaries, explainers and features."}