{"author":"By Adrian Warner","title":"Plans to reopen Olympic stadium with athletics meet","news_category":"general","content":"Legacy officials are working on ambitious plans to reopen the 2012 Olympic Stadium to mark the first anniversary of the opening ceremony.The London Legacy Development Corporation (LLDC) wants to use the stadium from the week around 27 July.BBC London has learned talks have taken place about hosting the London Grand Prix athletics meeting which is due to take place that weekend.The event is traditionally staged at Crystal Palace in south London. One source, who is close to the talks, said: \"I think there is an 80% chance the move to the Olympic Stadium is going to happen.\"Although the area around the stadium will not be open to the public until Spring 2014 because of construction work, the LLDC - the body responsible for the Park's redevelopment - is keen to use the stadium again to mark the anniversary.Now that it has the construction timetable to transform the stadium on a permanent basis, the LLDC wants to open it temporarily until work can begin in 2014.The LLDC, which is responsible for the park, was also keen to stage the finale of a new series of Paralympic athletics events but this is not possible because the stadium will not be available during the schedule being planned.The International Paralympic Committee (IPC) confirmed it was involved in \"advanced talks\" about the unprecedented series of seven grand prix events for Paralympic athletes to mirror the Diamond League series for able-bodied competitors.\"The plan is to have six events and then a final in the UK. We hope to have an announcement in the next 10 days,\" an IPC spokesman said.The Paralympic series, launched following record tickets sales at the Paralympics Games last year, is expected to include a second meeting in Britain as well as events in Brazil, Germany and the Netherlands.Birmingham is being considered as the venue of the finale. Other meetings will be staged at venues which have experience in hosting IAAF events.Officials hope to make an announcement about events in the stadium about 27 January, exactly six months since the opening ceremony. The announcement about the new Paralympic series is expected around the same time.Although the area around the stadium will not be open to the public until Spring 2014 because of construction work, the LLDC is keen to make sure sport gets a high-profile place in the stadium.As revealed by BBC London earlier this month, it also wants to host a series of pop concerts, organised by Live Nation,The live music company considering moving concerts which it used to stage at Hyde Park in central London; the stadium impressed concert promoters as a venue when bands played at opening and closing ceremonies of the Olympics and Paralympics.The LLDC is also still talking to West Ham Football Club about becoming a long-term tenant in the stadium, probably from the 2016-17 season, but LLDC officials said no deal had been reached yet.A decision is expected by the end of March."}