{"author":"","title":"West End: First new large-scale theatre in 50 years to open","news_category":"general","content":"The West End's first new large-scale theatre in 50 years is set to open in the autumn.@sohoplace is located on the first newly-named street created in Soho for 72 years, also called Soho Place.The theatre is part of a £300m regeneration project in the area which will see offices, retail space and a new piazza built.Owner Nica Burns called the 12-year project an \"affirmation of faith\" in the industry.The first production expected to be announced soon will be a play, she said.@sohoplace will feature a 602-seat auditorium, rehearsal room, actors' Green Room, bar, restaurant and a terrace.A large digital front-of-house screen will also appear on Charing Cross Road.The auditorium is curved and can be transformed into various other configurations. The theatre also claims to have perfect acoustics and sightlines from every seat.It has been overseen by Ms Burns, who said @sohoplace would add a \"different dimension to our vibrant West End landscape\".She added that she had consulted theatre creatives before helping to design the venue to ensure audience experience was at the forefront.\"I can absolutely say that the cheapest seat in the house has a completely unrestricted view and good leg room,\" said Ms Burns.\"You will see all the stage and hear the actors perfectly.\"Wheelchair accessibility has also been provided for both performers and the audience.@sohoplace is adjacent to the site of the former Astoria theatre, which was demolished to make way for Crossrail, and was built above the Elizabeth line and Northern line at Tottenham Court Road.\"The incredible team of engineers pulled off the greatest of structural feat, building over a major underground transport hub - a challenging place to build a theatre - achieving perfect acoustics and no vibrations,\" she added.The theatre industry struggled during the pandemic with shows cancelled due to lockdown restrictions and staff illness.But Ms Burns believes that @sohoplace is confirmation that the West End's recovery is well under way.\"British theatre, I really believe is the best in the world,\" she said.\"Having something like this is just an affirmation of faith.\"The pandemic years have been terrible, so let's look forward to something and just enjoy it.\"Follow BBC London on Facebook <https:\/\/www.facebook.com\/BBCLondon>, Twitter  <https:\/\/twitter.com\/BBCLondonNews>and Instagram <https:\/\/www.instagram.com\/bbclondon\/?hl=en>. Send your story ideas to hellobbclondon@bbc.co.uk <mailto:hellobbclondon@bbc.co.uk>"}