{"author":"","title":"Critical race theory: the concept dividing the US","news_category":"general","content":"Critical race theory has become a topic of fierce political debate in the US in recent months. The conflict has most prominently played out in public school districts, as parents, teachers and school administrators grapple with how to teach race, discrimination and inequality in the classroom.For supporters, it's an important framework for understanding the way systemic racism can perpetuate discrimination and disadvantage. For opponents, it's a subversive plan to indoctrinate young Americans to reject their country and its history.To start, there is an inability to even agree on what critical race theory is, where it came from and what it seeks to accomplish. Beneath the rhetoric, however, lies an ongoing fundamental dispute about equality and equity - what these concepts mean, and what government's role should be in addressing them.Critical race theory (CRT) originated as a field of legal study in the 1970s spearheaded by Derrick Bell, Harvard University's first permanently-appointed black law professor, to address what he saw as shortcomings in understanding how discrimination and inequity are perpetuated in the law. These inequities shape outcomes in society, the economy, culture and politics, he argued.The term itself first began to gain prominence in the 1990s and early 2000s, as more scholars wrote and researched on the topic.Although the field of study traditionally has been the domain of graduate and legal study, it has served recently as a framework for academics trying to find ways of addressing racial inequities through the education system - particularly in light of last summer's Black Lives Matter protests.\"The George Floyd murder caused this whole nation to take a look at race and racism, and I think there was a broad recognition that something was amiss,\" says Marvin Lynn, a critical race theory scholar and professor of education at Portland State University.How - and even whether - CRT is being taught is the subject of contention that lies at the heart of the current debate.As a curriculum subject, critical race theory is largely the purview of university law schools and graduate programmes.The concepts, however, have influenced historians, journalists and educators in school districts across the US who say they want to do more to teach the public about the US struggles with discrimination rooted in race.One high-profile effort, the New York Times magazine's 1619 Project, was a series of essays and articles that sought to \"reframe the country's history by placing the consequences of slavery and the contributions of black Americans at the very centre of our national narrative\", per the paper's description.It received mixed reviews, including sometimes sharp criticism from historians who disputed its accuracy.How the concepts translate into a public-school curriculum and teacher training have become the flashpoint of the CRT controversy.An elementary school in Cupertino, California, for instance, asked third-graders to label their own power and privilege in an \"identity map\". At least 30 schools recommended that students should read Not My Idea, a children's book that called racism \"a white person's problem and we are all caught up in it\".Its author, Anastasia Higginbotham, has argued that \"any place where there are white people has violent white supremacy embedded into it\" and is not shy about labelling her discussions on race as \"CRT\".Instances like these have led to what has become an increasingly intense criticism.Arguably, a large part of the debate has been inflamed and muddled by the activism of a conservative documentary filmmaker named Christopher Rufo.As detailed in an extensive New Yorker profile <https:\/\/www.newyorker.com\/news\/annals-of-inquiry\/how-a-conservative-activist-invented-the-conflict-over-critical-race-theory>, Rufo built a cottage industry exposing government racial awareness training across the US. While doing so, he discovered the academic writing behind it - and set out to raise awareness about what he saw as an organised effort to \"re-engineer the foundation of human psychology and social institutions through the new politics of race\".He labelled all of the various episodes and instances he was cataloguing as examples of \"critical race theory\" in practice, even though the academic discipline was not always an exact fit for what he was documenting.\"The goal is to have the public read something crazy in the newspaper and immediately think 'critical race theory',\" he wroteon Twitter <https:\/\/twitter.com\/realchrisrufo\/status\/1371541044592996352>. \"We have decodified the term and will recodify it to annex the entire range of cultural constructions that are unpopular with Americans.\"The term, he told the New York Times, made for the \"perfect villain\" because it sounded academic, elitist, racist and divisive.Legislative as well as grassroots rebukes of public-school teaching labelled as CRT have cropped up around the country.A contentious school board meeting on systemic racism and transgender rights in a Virginia county near Washington DC, made national news when a protestor was arrested for disorderly conduct. Nine Republican-controlled states have passed laws or enacted other rules banning the teaching of \"critical race theory\".Because it is a concept, not a stand-alone subject, opponents have assembled lists to help parents identify what they see as harmful terms and topics in the classroom.In a now-deleted tweet, the conservative Texas Public Policy Foundation highlighted words like \"discrimination\", \"social justice\", \"identity\" and \"colonialism\" as indicating CRT in the curriculum.The CRT debate doesn't fall neatly along political lines, however. The town of Cupertino, where parents objected to their school's race education programme, is overwhelmingly liberal. And those expressing concern at town halls and school board hearings aren't all conservative - or white.Andrew Sullivan, a polemicist and public intellectual, summarised the criticism of CRT as \"illiberal\".\"Liberalism assumes that we are all individuals, capable of reasoning with each other as equals,\" he argued in arecent blog post <https:\/\/andrewsullivan.substack.com\/p\/dont-ban-crt-expose-it-2d9>, whereas CRT assumes that \"we are mere representatives of racial constructs which are part of a permanent struggle between the oppressors (white) and oppressed (non-white)\".This video can not be playedOne thing Americans find hard to talk aboutBut if the issue is power - who has it, and who wants it - it's not surprising that schools aren't the only terrain on which this political dispute is being fought.Critics complain that initiatives put forth by social media companies, corporations and the US military are also bending, in their view, to the forces of \"woke\" liberalism.There's a cartoon that circulates among critical race theory supporters showing children, one tall and one short, trying to peer over a fence to watch a baseball game. Equality, the illustration explains, is giving children the same sized box to stand on - with one child still unable to see over the obstacle. Equity, on the other hand, gives the shortest child the most boxes, so that everyone can see the field.The idea of equity is to provide more to those who are perceived to have the greatest disadvantage in order to achieve better equality of outcome and to compensate for the historical wrongs of discrimination and systemic racism.\"A key part of the argument of critical race theory is that racism is endemic to American society because of the way society is structured,\" says Lynn. Teaching with the framework addressed issues that \"people have been trying to do for a long time to correct some of the problems we have in schools\" he says.It's a view that animated affirmative action programmes - race-based preferences in hiring and college admissions - in the past, and currently influences everything from road repair in Oakland, California, to the Biden administration's vaccine outreach efforts.Such race-conscious prioritisation, in the view of critics, is a slippery slope that would lead to out-of-control government favouritism. It integrates racial awareness into classroom teaching and contravenes the idea that America - and American institutions - should be colour-blind.\"Critical race theory, taken to its logical conclusion, is fundamentally incompatible with America as it has traditionally been understood and, I would argue, liberal democracy in any modern understanding of the word,\" says Nate Hochman, a Publius fellow at the conservative Claremont Institution in California.He says the idea of \"equity\" is more than just policy prescriptions, it's about \"abandoning the broad political philosophy that has traditionally held this country together\".Some also believe teaching about \"institutional racism\" will have the opposite effect from what CRT advocates intend.\"As a black college student, I'm certainly not paying to sit in a classroom and be told that I'm a helpless victim — that regardless of how hard I try, or how hard I work, it'll never be enough because racism will always win,\"writes <https:\/\/yellowhammernews.com\/cj-pearson-theres-no-place-for-critical-race-theory-on-our-campuses\/> CJ Pierson, a conservative activist at the University of Alabama.Both sides appear to think the other is winning.Lynn, the CRT scholar, worries that state laws are having a chilling effect on teachers across the US, making them afraid of even touching on the topic of race in the classroom.Hochman sees opponents of CRT as the ones on the ropes, with the Black Lives Matter protests serving as a political catalyst for radical change.\"We underwent a revolution last summer,\" he says. \"The constant pushing of all of our institutions to do more, to be more radical, to be more anti-American, to be more racialist, to be more intolerant of views - there is this fervent energy to cannibalise the country.\"Just a few months removed from undergraduate university, Hochman says he saw friends made more racially aware - and intolerant - by such teaching.\"We're teaching young people to hate the country they're going to inherit,\" he says. \"This is a historically unprecedented experiment, and it can only go ugly places.\"Pitching one's cause as a fight against overwhelming odds is often an effective way of rallying supporters. At the moment,polls show <https:\/\/morningconsult.com\/2021\/06\/23\/critical-race-theory-polling\/> that most Americans haven't heard \"a lot\" about critical race theory, although Republicans (30%) are more likely than Democrats (21%).In other words, there's a lot of room for opinions about race education and equity to shift, potentially decisively.Like most US political controversies in the US, this one will end up spilling into both the voting booths and the courtrooms.Republicans are already planning mid-term campaign efforts to boost their fundraising and tie Democratic incumbents to critical race theory, in hopes the party can win back independent and moderate white suburban voters uneasy with proposed changes to public schooling or the implication that they are to blame for the enduring inequity in American society - and must make sacrifices to rectify past wrongs.Civil liberties groups are sure to file lawsuits challenging the constitutionality of the state restrictions on teaching critical race theory. And conservative legal advocacy organisations are already gearing up with their own filings.In Illinois, a white teacher is suing her school district, alleging that its teacher training and classroom lesson plans violate US civil rights laws by discriminating against her and her students on the basis of their race.Whether this controversy endures, however, is an open question. A few years ago, conservatives warned of Islamic sharia law being taught in American classrooms - a concern that has since dropped off the radar. Every mid-term cycle there seems to be a new hot-button issue - police defunding, Ebola outbreaks, immigrant caravans and Islamic state extremists are just a few recent examples.This fight may be different, however.Controversies come and go, but America's reckoning with its history, and with the role racism has played in it, are not a passing political fad. And with US society becoming increasingly diverse, it's a reckoning that a growing portion of the US population seems interested in accelerating."}