{"author":"","title":"Fire and Fury: More bombshell claims from the Trump book","news_category":"general","content":"Donald Trump called James Comey a rat before firing him, was confused by the Ku Klux Klan (KKK) and trusts women more than men, according to a controversial, new book.Journalist Michael Wolff's Fire and Fury: Inside the Trump White House also claims the president prefers to call his billionaire friends late at night.Mr Trump contends he never spoke to Wolff, dismissing his book as \"full of lies, misrepresentations and sources that don't exist\". But the author has stood by his account, insisting he had access and that he believes the president has no credibility.Here are 10 more explosive revelations from Wolff's purported inside portrait of the Trump White House.After protests in Charlottesville turned deadly in August, Mr Trump controversially condemned \"hatred, bigotry, and violence on many sides\". He quickly came under attack for not explicitly condemning avowed racists and hate groups like the KKK.In a televised statement, he called racism evil and told the country, \"we must rediscover the bonds of love and loyalty that bring us together as Americans\". But Wolff claims he still struggled to understand the incident.Privately, he kept trying to rationalize why someone would be a member of the KKK—that is, they might not actually believe what the KKK believed, and the KKK probably does not believe what it used to believe, and, anyway, who really knows what the KKK believes now? In fact, he said, his own father was accused of being involved with the KKK—not true. (In fact, yes, true.) (pg 294)In the new book, Mr Trump reportedly called Mr Comey a rat while former White House chief strategist Steve Bannon allegedly told Wolff that Ivanka Trump was terrified where the FBI investigation into alleged Russian meddling into the election would lead.\"The kids\" - Jared and Ivanka - exhibited an increasingly panicked sense that the FBI and DOJ were moving beyond Russian election interference and into family finances.Mr Kushner reportedly pushed for Mr Comey's removal, which Mr Trump allegedly handled without his top aides.The president appeared to want people to believe he had, in an act of strength, taken down the FBI director for personal reasons, according to Wolff.The president, in order to avoid embracing conventional process… merely eliminated everybody else from his process. For most of the day almost no one would know that he had decided to take matters into his own hands. In presidential annals, the firing of FBI director James Comey may be the most consequential move ever made by a modern president acting entirely on his own. (pg 214)In Mr Trump's first foreign trip abroad, he visited Saudi Arabia where he secured a $110bn (£81bn) arms deal for the US. The Saudis threw a $75m (£55m) party in his honour and drove the first family around in gold golf carts, according to the book.Despite a long-standing relationship with then Saudi crown prince, Mohammed bin Nayef (referred to as MBN in the book), Mr Kushner developed a relationship with 32-year-old Mohammed bin Salman (MBS), according to Wolff.Mohammed bin Salman was invited to visit the White House in March. MBS was using this Trump embrace as part of his own power play in the kingdom. And the Trump White House, ever denying this was the case, let him.Mohammed bin Salman allegedly promised Mr Trump that deals that would be announced during his scheduled visit to Saudi Arabia, a few weeks later.Within weeks of the trip, MBS, detaining MBN quite in the dead of night, would force him to relinquish tothe Crown Prince title, which MBS would then assume for himself. Trump would tell friends that he and Jared had engineered a Saudi coup:\"we've put our man on top.\" (pg 231)Although Mr Trump demonstrates what Wolff calls \"conventional\" misogyny, he is reportedly much closer to women than men in the workplace.According to the book, Mr Trump confides in women but holds men at an arm's length.Women, according to Trump, were simply more loyal and trustworthy than men. Men might be more forceful and competent, but they were also more likely to have their own agendas. Women, by their nature, or Trump's version of their nature, were more likely to focus their purpose on a man. A man like Trump. (pg 200)While at the White House, Bannon allegedly grew increasingly frustrated by national security adviser HR McMaster's views on the 16-year war in Afghanistan. According to Wolff, Bannon saw the general as too closely aligned with liberals and establishment Republicans, and threatened to send him away.\"McMaster wants to send more troops to Afghanistan, so we're going to send him,\" said a triumphal Bannon. In Bannon's scenario, Trump would give McMaster a fourth star and 'promote' him to top military commander in Afghanistan.(pg 265)It has been speculated Mr Trump was not a fan of John Bolton's facial hair, which could have hindered the former UN ambassador's chance at secretary of state. Wolff appeared to support this account by quoting Bannon during a dinner party conversation with Roger Ailes, as the two discussed who would serve in Mr Trump's cabinet.\"Bolton's mustache is a problem,\" snorted Bannon. \"Trump doesn't think he looks the part. You know Bolton is an acquired taste.\"Wolff also reports that Mr Ailes said Mr Bolton got into trouble for fighting at a hotel and chasing women, to which Bannon allegedly replied:\"If I told Trump that, [Bolton] might have the job.\" (pg 5)According to the book, Mr Trump imposed strict rules on White House staff not to touch any of his personal items, especially his toothbrush. The president allegedly prefers to have his items remain where he leaves them - even dirty clothes on the floor. These rules, according to Wolff, are due to his fears of getting poisoned.He had a long-time fear of being poisoned, one reason why he liked to eat at McDonald's—nobody knew he was coming and the food was safely premade. (pg 85)In addition to asking for two additional television sets for his bedroom, Mr Trump broke with tradition by asking for a lock on his bedroom door. He is also the first president since John F Kennedy to sleep in a separate bedroom from his wife.In the first days he ordered two television screens in addition to the one already there, and a lock on the door, precipitating a brief standoff with the Secret Service, who insisted they have access to the room. (pg 84)The Trump administration was praised for carrying out a missile strike against a Syrian air base in response to a suspected chemical weapons attack in early April.But Wolff alleges it had less to do with Mr McMaster's guidance and more to do with Ivanka Trump's visual presentation, which featured photos of the chemical attacks in the rebel-held town of Khan Sheikhoun.Ivanka had long ago figured out how to make successful pitches to her father. You had to push his enthusiasm buttons.When the two women showed the presentation to the president, he went through it several times. He seemed mesmerized.Watching the president's response, Bannon saw Trumpism melting before his eyes. Trump—despite his visceral resistance to the establishment ass-covering and standard-issue foreign policy expertise that had pulled the country into hopeless wars—was putty. After seeing all the horrifying photos he immediately adopted a completely conventional point of view: it seemed inconceivable to him that we could not do something. (pg 191)The most prolific theme in the book, according to Wolff's reporting, is that even those closest to Mr Trump question his intelligence and ability to lead the country.Everyone, in his or her own way, struggled to express the baldly obvious fact that the president did not know enough, did not know what he didn't know, did not particularly care, and to boot, was confident if not serene in his unquestioned certitudes.For Steve Mnuchin and Reince Priebus, he was an \"idiot.\" For Gary Cohn, he was \"dumb as shit.\" For H.R. McMaster he was a \"dope.\" The list went on.(pg 304)11 explosive claims from new Trump book <https:\/\/www.bbc.co.uk\/news\/world-us-canada-42559436>Russia-Trump: Who's who? <https:\/\/www.bbc.co.uk\/news\/world-us-canada-40709270>Does Donald Trump have a nuclear button? <https:\/\/www.bbc.co.uk\/news\/world-us-canada-42557778>How Trump cooled on Bannon <https:\/\/www.bbc.co.uk\/news\/election-us-2016-37971742>"}