{"author":"By India Pollock","title":"LGBT attitudes in Wales: 'Huge distance' travelled in 30 years","news_category":"general","content":"\"I had a friend whose girlfriend was beaten to death during an exorcism to try and beat the gay out of her. Incredible things would happen.\"Lisa Power, who lives in Cardiff, was the first openly LGBT person to speak on gay rights at the UN and has been a campaigner for decades.\"When I came out in the 1970s, it was perfectly legal to sack people for being gay, it was unheard of for anybody to be out as a teacher or a nurse, we couldn't foster or adopt children, we couldn't get married. We really led very restricted lives.\"It was a time of strong public disapproval with anti-gay campaigns in both the media and in government.But encouraging progress has been made since she co-founded the LGBT rights charity, Stonewall, 30 years ago.\"We're part of the fabric of society now, we have out-politicians right from the top, eventually we'll have Premier League footballers out and we've already got rugby players out. We've come a huge distance in the last 30 years.\"We can get married, we have kids, and we're accepted as part of families.\"As part of the Changing Face of Wales season, 1,000 people in Wales were asked how comfortable they felt about adults in same-sex relationships.The results showed 83% said they were either quite or very comfortable.But 15% said they were not at all or not very comfortable, while 2% were not sure how they felt.Lisa, a trustee of Queer Britain, said the results were positive, but the answers could be \"skin deep\" for quite a lot of people.\"The question is slightly biased as it puts people in the least threatening situation - married adults.\"I'd be very interested to see what response you'd get if you asked about if your kid was gay, or if your kid was trans because you might get a slightly less helpful response.\"Bryan Bale, 75, from Cardiff, always knew he was gay because he had crushes on the boys who lived in his street.Like many, he moved to London as the city had more of an active gay community at the time.\"In the old days it was difficult and there were gangs of 'queer bashers', some places were very dangerous.\"You would hear about people coming away from clubs and gangs would set about them in backstreets, and in the parks there were cruising grounds because there was nowhere to go - and that was terribly dangerous.\"Bryan said he had taken people to hospital following homophobic attacks and people wouldn't take him seriously when he was in gay relationships.\"I was in a relationship where both of my partners died and trying to explain who you are to the undertaker. [I was told] 'Oh, you can't arrange a funeral, you're only a friend'.\"This video can not be playedSarah Jones, a transgender Anglican vicar in Cardiff, shares her storyAbuse still takes place as Laolu, a Nigerian man living in Cardiff, explained.\"I was waiting for my bus and there were three men. One of them said to the other 'if he was still in Africa then he would have been stoned by now'. For a very long time I found it really hard to be outside.\"I grew up in Nigeria, which currently has one of the most pernicious laws against LGBT people in the world. When I was growing up that wasn't as much of a problem, but I did face quite a lot of harassment and bullying as a child.\"That's less frequent now and being in Cardiff there is a gay community and I have friends.\"Sarah Way, 45, from Shotton, Flintshire, was bullied in school.\"People would mock you, using derogatory words because you liked another girl.\"Even in the 1980s being in the LGBT community was extremely difficult for a lot of people - especially in the Aids crisis, I think that legacy has carried on into the 90s, but I think now there are many more people coming out.\"It's made it more accepting and there are so many more pride events going on in every city now.\"According to our poll, young people are more supportive of same sex relationships - 94% of 18 - 34-year-olds said they were quite or very comfortable with them.Lisa said the younger generation were more accepting compared to when she was a child.\"I think kids in schools are amazing. They're so accepting and they start up their own groups, so I think looking forward to the future it's really exciting for the gay community.\"Lisa believes the idea London is more supportive of the LGBT community is a myth.\"When I came here, I thought it seemed much more closeted than London, there were no out gay politicians in the assembly, there was not a lot going on apart from some drag pubs - you know, it wasn't a very visible community to me, but actually it's a really thriving community.\"It's much more family-based and it's incredibly cooperative and supportive.\"The history of allies - or heterosexual people who support gay people - is also strong in Wales.\"There are more LGBT people in Wales who are connected to their families and a lot more allies.\"The Lesbians and Gays who Support the Miners and the miners in the south Wales valleys was a huge thing and led to major changes in every direction.\"But Lisa also warned people should not become blind to stigma.\"Things can progress, but I've spent the last thirty years telling LGBT people that rights can go down as well as up.\"We're seeing that in the US for example, where they're actually taking rights away from people.\"I'd like to think there's a progression going on, but I think it's something we have to fight for every inch of the way and we have to challenge stigma and prejudice everywhere we see it.\"More details on the BBC Cymru Wales' annual St David's Day poll can be found here. <https:\/\/www.icmunlimited.com\/polls\/bbc-wales-st-davids-day-poll-2019-3\/>ICM Unlimited interviewed a representative sample of 1,000 adults aged 18+ by telephone on 7-23 February 2019. Interviews were conducted across Wales and the results have been weighted to the profile of all Welsh adults. ICM is a member of the British Polling Council and abides by its rules"}