{"author":"","title":"Richard Bacon out of hospital after coma scare","news_category":"general","content":"This video can not be playedRichard Bacon, who was diagnosed with ADHD aged 42, was taken ill with suspected pneumonia earlier this monthTV and radio presenter Richard Bacon has left hospital after recovering from an illness which left him in a coma.The former Blue Peter host fell ill with suspected pneumonia on a flight from the US on 5 July and initially did not respond to treatment.Doctors at the hospital in Lewisham put him in a medically-induced coma, from which he woke on 13 July.The 42-year-old tweeted \"cleared for take off\" and again thanked NHS staff who \"saved my life\".This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Earlier he had tweeted pictures of himself with his children - which also showed the dressing on the tracheotomy cut in his throat to help him breathe.Another message showed him holding his wife's hands and saying \"Every facet of my life would be worse without Rebecca in it. How will I ever thank her?\"I was in a coma for nine or ten nights (I just learned). That's a lot of staring at your husband and his pipes. And a lot of worry.\"When first taken ill he had originally joked on social media he was getting in on the celebrations for the 70th birthday of the NHS.\"I hate to miss a party,\" he posted.It was only when his sister, Juliet, posted images from the hospital on Instagram that the seriousness of his condition became known.Bacon, who was born in Mansfield, Nottinghamshire, started his career on BBC Radio Nottingham before going on to present on national television and radio, including The Big Breakfast, Top of the Pops, BBC Radio 5 live and BBC 6 Music.He now works in the US.While the exact cause of his infection has not been confirmed, its symptoms appear to match pneumonia, a swelling of the tissue in one or both lungs caused by a bacterial infection.Follow BBC East Midlands on Facebook <https:\/\/www.facebook.com\/bbceastmids\/>, onTwitter <https:\/\/twitter.com\/bbcemt>, or on Instagram <https:\/\/www.instagram.com\/bbceastmidlands\/>. Send your story ideas to eastmidsnews@bbc.co.uk <mailto:eastmidsnews@bbc.co.uk>."}