{"author":"By Anthony Zurcher","title":"Tucker Carlson, Donald Trump and the in-fighting at Fox News","news_category":"general","content":"A $1.6bn defamation lawsuit against Fox News has pulled back the curtain on the inner workings of the powerful conservative cable network in the days after the 2020 US presidential election.Dominion Voting Systems, a voting-machine manufacturer, alleges that Fox knowingly aired false allegations that their devices helped Joe Biden and the Democrats \"steal\" the election.To make their case, the company has called dozens of Fox executives and journalists to testify in depositions and subpoenaed thousands of pages of their text messages and emails.They show the often heated, and sometimes profane, conversations that took place behind closed doors as Fox News, from chairman Rupert Murdoch on down, grappled with Donald Trump's ultimately futile attempt to overturn the 2020 election results.Fox News has had a complicated relationship with Mr Trump over the years. He clashed with the network regularly during the early days of his 2016 presidential bid, but once he won the White House the network's coverage was largely positive - particularly on its evening opinion shows hosted by Tucker Carlson, Sean Hannity, Laura Ingraham and others.In the days after his 2020 presidential defeat, however, it's emerged that many Fox executives and presenters disparaged him.Mr Murdoch, the Fox News chairman, wrote in an email that the then-US president - and his lawyer, Rudy Giuliani - were going \"increasingly mad\" after election day.Mr Carlson, host of the network's top-rated programme, said he hated Mr Trump \"passionately\" and that his presidency had been a disaster. He predicted that soon his show would be able to ignore the soon-to-be former president.He also mocked the former president's business enterprises. \"All of them fail,\" he said in a text to his show's producer.It's the kind of view echoed by Mr Trump's critics - many of whom have frequently been the target of Mr Carlson's ire on his evening programme.The former president is known to take slights personally and is unlikely to forget. It means the love-hate relationship Mr Trump has with Fox News may be veering back toward hate just as the 2024 presidential campaign heats up.While Fox News presenters were giving Mr Trump and his supporters a platform to question the legitimacy of the 2020 election results, behind the scenes many on the network were dismissing the validity of the allegations and lamenting how the network covered the story.In November, Mr Murdoch told New York Post editor Col Allan that half of what Mr Trump was saying after the election was both untrue and damaging.It was a view echoed by others in the network, including some of the prominent evening opinion hosts who have been publicly outspoken in their support of Mr Trump. Mr Hannity, for instance, said in a deposition he did not believe the election claims by Trump legal adviser Sidney Powell \"for one second\".Mr Carlson, in a text message to fellow Fox evening hosts, wrote that her claim that Dominion voting machines stole the election \"seems insane to me\", adding that Ms Powell was \"making everyone paranoid and crazy, including me\".These parallel opinions - critical in private, tolerant or even supportive in public - has opened Fox News up not only to legal jeopardy, but also to charges of hypocrisy.Two years after Mr Carlson's documented comments, during a programme that presented new footage from the 6 January attack on the US Capitol, he claimed that \"the 2020 election was a grave betrayal of American democracy\" and that \"no honest person can deny it\".His claims about 6 January prompted derision from the White House and outrage from some congressional Republicans.As Mr Trump's attempts to contest his election defeat continued, it became increasingly clear to Fox News executives that disputing his assertions risked a backlash from loyal viewers.\"We can't make people think we've turned against Trump,\" one Carlson producer texted a colleague.In particular, Dominion's filings show, Fox executives worried that sceptical coverage of the president's election claims would drive conservative viewers to other right-wing news outlets, such as Newsmax.Mr Carlson said Fox was \"playing with fire\".\"Do the executives understand how much credibility and trust we've lost with our audience?\" he asked in a text to a producer. \"An alternative like Newsmax could be devastating to us.\"According to Dominion's lawsuit, this was the financial motivation behind the network's decision to continue to air election denialism that it knew to be untrue.\"It's remarkable how weak ratings make good journalists do bad things,\" Fox managing editor Bill Sammon wrote in an email lamenting the network's focus on election fraud claims.This video can not be playedWatch: Grassroots Republicans can't quit Donald TrumpThe Dominion court filings suggest that Fox News was rife with internal divisions.Traditional news journalists were set against the network's opinion-show presenters and vice versa, with evening host Sean Hannity telling morning host Steve Doocy that \"News\" was destroying them.\"They don't care,\" Mr Doocy replied. \"They are JOURNALISTS.\"In a group chat with Mr Hannity and fellow evening host Laura Ingraham, Mr Carlson wrote: \"We are all officially working for an organisation that hates us.\"On the news side of Fox, the feeling was mutual.\"In my 22 years affiliated with Fox, this is the closest thing I've seen to an existential crisis - at least journalistically,\" Mr Sammon, the network's managing editor at the time, wrote in a December email.Mr Murdoch said he hated the network's \"decision desk\", which on election night was first to project that Mr Biden would win the key state of Arizona.Two months later, the day after the US Capitol was attacked by Trump supporters, Mr Murdoch wondered whether some of his opinion hosts \"went too far\" in airing election claims.\"Still getting mud thrown at us,\" he wrote in response to criticism from some Republican senators that his network was responsible for the violence.The bar for proving a defamation case under US law is quite high. Dominion will have to prove that Fox News knew the election claims were false and that it caused meaningful damage to its reputation and business interests.This is why what Fox executives and journalists were saying about the network's coverage in private texts and emails - what they believed to be the truth versus what their aired publicly - is so pivotal.Fox News, in a statement released after the Dominion filings were made public, said Dominion lawyers are painting an inaccurate picture.The voting company, it said, had \"mischaracterised the record, cherry-picked quotes stripped of key context and spilled considerable ink on facts that are irrelevant under black-letter principles of defamation law\".Mr Murdoch, for his part, has expressed some regrets over how Fox covered the post-election disputes, but said his network was doing its job.\"We report the news, and we have dozens of people a day on the channels that are talking about the news,\" Mr Murdoch said during his lawsuit deposition. \"And this was big news. The president of the United States was making wild claims, but that is news.\"Lachlan Murdoch, son of Rupert and chief executive of Fox Corporation, the news broadcaster's parent company, argued on Thursday that the lawsuit was \"really about politics\".\"A news organisation has an obligation, and it is an obligation, to report news fulsomely, wholesomely and without fear or favour,\" Mr Murdoch said at an investor conference in San Francisco, according to news reports. \"And that's what Fox News has always done, and that's what Fox News will always do.\"\"I think a lot of the noise that you hear about this case is actually not about the law, and it's not about journalism,\" he added. \"It's really about politics, right? And that's unfortunately more reflective of just the sort of polarised society that we live in today.\"Whether Dominion is ultimately successful or not, the public-relations damage to Fox News from the lawsuit is already significant - and could contribute to what some of the network's executives seemed to fear most - the loss of trust from their loyal conservative viewers."}