{"author":"","title":"Hemsby cliff-top homeowners 'need government help'","news_category":"general","content":"This video can not be playedHemsby coastal erosion has left some of the cliff-top homes uninhabitableResidents of a coastal village where houses are on the brink of falling into the sea have called on the government to help them.Thirteen cliff-top homes on The Marrams in Hemsby, Norfolk, remain in a \"precarious position\" after they were evacuated at the weekend.Keith Kyriacou, chairman of Hemsby Parish Council, said they needed \"big government people to see our problem\".Great Yarmouth MP Brandon Lewis said a \"solution\" had to be found.Two of the affected bungalows have been left \"pivoting\" on the edge of the sand cliff-top, after residents were told to leave their homes amid fears they could collapse into the sea.BBC Look East reporter Robby West said it was now possible to see through the floorboards of some affected chalets from the beach.He said some residents who had returned to see their homes on Monday morning told him they were \"completely unliveable\".Mr Kyriacou said: \"We want the big government people to come to Hemsby to see what our problem is and help us out with some sea defence - that's what we need.\"How many more houses is it going to take to go into the sea.\"We would have thought the government would have listened to how we badly needed sea defences.\"Local MP Mr Lewis, who is the Conservative Party chairman, said the homes - situated on private land - needed to be protected and he would visit the area on Friday.He added: \"We have got to carry on the work with the parish council and the Save Hemsby action group to get the security of coastal protection.\"It's finding a scheme that will work that can be approved - we haven't quite got there yet.\"Jan Davis, Norfolk County Council's head of resilience, said: \"There is no way these 13 properties are going to be inhabited again.\"Events of this kind highlight just how vulnerable coastal communities can be.\"He added that with further high tides and strong winds forecast for the next 48 hours at least, the risk of \"properties sliding down the cliffs remains very high.\"Ian Brennan, chairman of campaign group Save Hemsby Coastline, said eight of the bungalows were permanent homes.He said while places like Clacton in Essex had received millions of pounds to protect its coastline, a coastal review for the area had only just been agreed by the borough council and other agencies.\"After five years we are not even in a situation where we have somebody above us saying Hemsby is worth saving and we will do something,\" Mr Brennan added.\"Many of these people had 50ft of a garden and over the last few years that garden has disappeared to nothing.\"Mr Brennan said he was also concerned about the threat posed to a row of 100 properties behind the current chalets in immediate peril.Residents, who have been staying in nearby hotels, were not expected to be allowed back home until Tuesday once the bad weather had subsided.The coastguard and police remain at the scene and the access road to the affected properties has been closed off, as well as a stretch of beach underneath.In 2013, three bungalows fell into the sea <http:\/\/www.bbc.co.uk\/news\/uk-england-norfolk-25254808> during a tidal surge.Villagers raised £70,000 - with Norfolk County Council granting £50,000 - to build their own sea defences in 2015 after their£2.3m bid to to the government was rejected <http:\/\/www.bbc.co.uk\/news\/uk-england-norfolk-28462990>.A spokesman for the Environment Agency said it realised the situation was \"distressing\" for those affected.\"We are supporting the council to minimise impacts on the community,\" he said. \"We continue to provide advice and guidance to the local authorities who lead on planning and managing coastal erosion.\"The BBC has contacted the Department for Environment, Food and Rural Affairs (Defra) for comment.Further south along the coast at Corton in Suffolk, Corton Coastal Village, run by Warner Leisure Hotels, suffered storm damage to the roof its entertainment complex overnight on Saturday.A spokesman said 300 guests had been due to arrive this week, but it was now expected to remain closed for the rest of the week."}