{"author":"By Faarea Masud & Noor Nanji","title":"Bargain hunters visiting supermarkets four times a week","news_category":"general","content":"The average household is visiting the supermarket more than four times a week as they seek deals to beat the soaring cost of living, research suggests.Analysts from Kantar said grocers faced tough competition, and that if people do not like prices in one store \"they will go elsewhere\".It comes as grocery prices rose at a record rate in March, climbing 17.5% compared with a year earlier.Prices are rising fastest for eggs, milk and cheese, Kantar said.\"Shoppers are taking action and clearly hunting around for the best value,\" said Fraser McKevitt, head of retail and consumer insight at the research firm.He said the frequency at which people were visiting supermarkets was the highest it had seen since the start of the pandemic, apart from Christmas.He added that supermarkets are \"battling it out\" to show value and lure customers through their doors.\"This is a fiercely competitive sector,\" Mr McKevitt said, adding that the average consumer was visiting three or more of the top 10 retailers in any given month.It comes as separate research by the British Retail Consortium (BRC) found the prices of chocolate, sweets and fizzy drinks have shot up ahead of the Easter holidays.It said fruit and vegetable prices had also climbed due to availability issues, after bad weather hit harvests in Spain and North Africa.Chief executive Helen Dickinson said: \"Food price rises will likely ease in the coming months, particularly as we enter the UK growing season, but wider inflation is expected to remain high.\"Food prices have surged in the last year as soaring energy prices drove up the cost of production and supply chains were disrupted.According to the Office for National Statistics (ONS), food prices in February rose at their fastest rate in 45 years, driven in part by fruit and vegetable shortages. Alcohol prices in restaurants and pubs also rose.Read more tips here <https:\/\/www.bbc.co.uk\/news\/uk-61798003>The ONS said this had led to a surprise jump in overall inflation, which reached 10.4% in the year to February from 10.1% in January.It prompted the Bank of England to raise its interest rates - already at their highest level for 14 years - from 4% to 4.25%, in the hope of cooling price rises.The Office for Budget Responsibility, the government's forecaster, predicts inflation will fall below 3% this year as food and energy prices rise less quickly.However, the Bank of England governor last week warned firms not to put up prices faster than inflation, suggesting it could drive up the cost of living even further.\"I would say to people who are setting prices - please understand, if we get inflation embedded, interest rates will have to go up further and higher inflation really benefits nobody,\" Andrew Bailey told the BBC's Today programme.What steps have you taken to keep your shopping costs low? Share your experiences by emailinghaveyoursay@bbc.co.uk <mailto:haveyoursay@bbc.co.uk?subject=CostofLiving65091499>.Please include a contact number if you are willing to speak to a BBC journalist. You can also get in touch in the following ways:If you are reading this page and can't see the form you will need to visit the mobile version of theBBC website <https:\/\/www.bbc.co.uk\/news> to submit your question or comment or you can email us atHaveYourSay@bbc.co.uk <mailto:Haveyoursay@bbc.co.uk>. Please include your name, age and location with any submission."}