{"author":"By Reality Check team","title":"Hosepipe bans: What are water companies doing to tackle leaks?","news_category":"general","content":"A drought has been declared in large parts of England and millions of households are facing hosepipe bans.Announcing this, the Environment Agency urged people in the affected areas to \"use water wisely\" but added \"government expects water companies to act to reduce leakage and fix leaking pipes as quickly as possible\".So how are these companies performing? Daily demand for water in England and Wales was 14 billion litres (three billion gallons), in 2018.But each day, another three billion litres was lost through leakage, according toa National Audit Office (NAO) report <https:\/\/www.nao.org.uk\/report\/water-supply-and-demand-management\/>.Tackling leaks is a big challenge as some of the 347,000km (216,000 miles) of water pipes date back to the 19th Century, according toWater UK. <https:\/\/www.water.org.uk\/wp-content\/uploads\/2022\/03\/Water-UK-A-leakage-Routemap-to-2050.pdf>In England, leaks fell by 36% between 1994 and 2000, according to the regulator, Ofwat, but since then, have only fallen by another 8%.Scottish Water says it has reduced leaks from 1.1 billion to 463 million litres per day during the past 16 years.By the 2050s, demand for water in England is expected to exceed supply, due to climate change and population growth.And the most important way of bridging that gap will be tackling leaks, the NAO report says.Most water companies in England and Wales plan to cut leakage by at least 15% between 2020 and 2025, working towards halving it by 2050.In 2020-21, 13 out of the main 17 suppliers met their targets for the year, according to thelatest Ofwat report <https:\/\/www.ofwat.gov.uk\/wp-content\/uploads\/2021\/11\/Service-Delivery-Report-2020-2021.pdf>.Looking at some of the bigger suppliers:The companies that missed their targets were Northumbrian Water, South West Water, Southern Water and Affinity Water.Reservoirs are expensive and planning permission takes a long time. The last new reservoir - at Carsington, in Derbyshire - was built in 1992.Since then, the UK population has risen by about 10 million people and the effects of climate change are being felt.\"We really failed to adequately prepare for these conditions,\" Hannah Cloke, professor of hydrology, at Reading University told BBC News.\"It's poor investment - there's no modern infrastructure that's able to cope with these conditions.\"The Havant Thicket reservoir, near Portsmouth, the first new reservoir in the South East since the 1970s, received planning permission last year.But the project has proved controversial because the water companies involved are now planning to build a water recycling plant nearby to treat and purify wastewater. That water will then flow into the reservoir, combining with the water from underground springs that was in the original planning application.Southern Water told BBC News that the new proposals are subject to further consultation and planning approvals.Another potential answer to water shortages is desalination - converting salt water to drinking water.Thames Water opened the UK's first desalination plant in Beckton, in 2010, but it is currently closed.East Ham MP Stephen Timms has claimed this is because desalination is energy-intensive and energy prices are currently high - but the company insists it is closed to undertake essential maintenance.The company said the plant was designed to run for short periods to boost London's water supply and had previously been used in 2016, 2018 and 2021.And when it comes to the sewerage system, about 0.05% of the UK network is being replaced every year, compared with the European average of 0.5%, according tothe Angling Trust <https:\/\/anglingtrust.net\/2021\/09\/27\/time-to-fix-the-broken-water-sector\/>. It was privatised in England and Wales in 1989 and water and sewerage services are now provided by 32 privately owned companies.Their ownership varies. For example, Thames Water <https:\/\/www.thameswater.co.uk\/about-us\/governance\/our-structure>, the largest, is part-owned by a Canadian pension scheme and the Abu Dhabi Investment Authority.Welsh Water <https:\/\/corporate.dwrcymru.com\/en\/about-us>, which serves most of Wales, Herefordshire and parts of Deeside, has been a not-for-profit company since 2001.In Scotland and Northern Ireland, water and sewerage is provided by Scottish Water and Northern Ireland Water, which are state owned.Between 2002 and 2018, Scottish Water had invested nearly 35% more per household than the average for English water companies,researchers at the University of Greenwich found <https:\/\/werugreenwich.files.wordpress.com\/2022\/03\/2022rev-34274-hall_water_and_sewerage_company_finances.pdf>.And they said that English companies had paid their shareholders dividends of £18.9bn, between 2010 and 2021 - about half the amount they invested.Scotland has 90% <https:\/\/www.sepa.org.uk\/media\/37609\/scotland_rbmp_chapter1.pdf> of the UK's freshwater reserves.And the idea of transferring or selling water from Scotland to England - by shipping or via pipelines - has been raised.But in 2020, the Scottish government said <https:\/\/www.gov.scot\/publications\/foi-202000104273\/> this \"would not be economically viable at this time\".The UK Environment Agency says <https:\/\/www.gov.uk\/government\/speeches\/escaping-the-jaws-of-death-ensuring-enough-water-in-2050> only 4% of water supplies are transferred between individual water companies.But a number of new water-transfer projects have been proposed <https:\/\/waterways.org.uk\/about-us\/news\/water-transfer-projects-have-potential>, using rivers, canals and pipelines.The Department for Environment, Food & Rural Affairs (Defra) has committed to setting a target for water companies to reduce consumption, as part of its 25-year environment plan.The current level of consumption in England is 141 litres per person each day, up from 85 in the 1960s.That needs to fall by about 35 litres, the National Infrastructure Commission (NIC) says <https:\/\/nic.org.uk\/news\/armitt-on-drought-resilience-fixing-leaks-reducing-demand-building-supply\/>.It has made cutting consumption its priority action for 2022 <https:\/\/nic.org.uk\/studies-reports\/infrastructure-progress-review-2022\/#tab-water>.Water companies want to raise the proportion of households with meters from 52%, in 2019, to 83%, by 2045.\"The reluctance by government to commit to compulsory water metering — entirely commonplace in many other countries and for other utilities here in the UK — shows the need for a public debate about risks, solutions and costs,\" the NIC said.\"A power shower for 10 minutes uses 130 litres of water, which is the average daily consumption of an individual,\" Sir John Armitt, who chairs the NIC, said.\"If we know that we're paying for it and we know how much we are using, then that can be an incentive to use less\".What claims do you want BBC Reality Check to investigate? Get in touch <http:\/\/www.bbc.co.uk\/news\/uk-41928747>Read more from Reality Check <http:\/\/www.bbc.co.uk\/realitycheck>"}