{"author":"By Sarah Rainsford","title":"Why jailing Navalny may mean more problems for Putin","news_category":"general","content":"When long rows of riot police took up positions in central Moscow on Tuesday evening, the message was clear: all protests in support of opposition leader Alexei Navalny would be crushed.For the next few hours, those who dared to test the authorities' resolve were chased through the streets. Images of arrests - police batons flying - were soon being streamed live online.The scenes came just hours after a judge ruled that Russian President Vladimir Putin's fiercest critic would spend the next couple of years behind bars.Navalny denounced the hearing as a show trial meant to \"scare millions\" and quash dissent.But muzzling him and his message may not be as easy as the Kremlin hopes.\"I think it's only the beginning of problems for the regime, because Navalny became not only a political force but a moral one, which makes him more attractive to those who weren't previously his followers,\" argues Andrei Kolesnikov, of the Moscow Carnegie Centre.\"It's not just the political opposition, but civil society that's irritated by the cruelty - the behaviour of the police and the courts.\"The Kremlin has long painted Navalny as an \"agent\" of the West bent on undermining Russia, whilst insisting that the courts are entirely independent and that angry protesters are \"hooligans\". President Putin's spokesman has praised the security forces for coming down \"hard\" on \"provocateurs\".This video can not be playedHundreds of protesters in Moscow were detained by police But some here warn that the tough tactics could backfire.\"The crackdown on Alexei Navalny, which is shocking in its cruelty… is also shockingly foolish,\" wrote Filipp Styorkin for the independent VTimes website.He argues that Navalny's prison sentence will fuel further protest, not stop it. Not ideal for the Kremlin in uncertain economic times.\"The authorities persistently saw into the legs of the chair they're sitting on, even though the chair looks increasingly flimsy as it is,\" Mr Styorkin said.Many at street rallies do say they are protesting for the first time, and less for Alexei Navalny than against the harsh way he has been treated.On Tuesday evening, after the court hearing, drivers in central Moscow hooted their horns in solidarity with those protesting - still too nervous to stop and join in, but a hint that frustration could be widespread.That includes anger at the high-level corruption that Navalny's investigations have exposed: especially galling as Russians have seen their own lives get tougher.There is some discussion here about how popular the Kremlin's uncompromising stance might be amongst senior officials, as Western governments consider new sanctions: asset freezes and travel bans are an acceptable price for a patriotic project like \"returning\" Crimea, but targeting an opposition politician may be a less popular cause.It's not yet clear how long this wave of protests might last.They may well subside until the next likely flash point - parliamentary elections in autumn, when Mr Navalny had plans to \"decimate\" the pro-Kremlin United Russia party at the polls.His team will now attempt to execute that plan without him.\"It will be tough,\" Lyubov Sobol admitted last week, when asked how Mr Navalny's team would cope if their leader was sent to prison. \"Alexei is our inspiration. But we'll work with even more passion if it happens, fuelled by our anger.\"That commitment was immediately challenged, as Ms Sobol and several others were placed under house arrest. They are facing criminal charges - and possibly prison sentences - for calling people to a protest in a pandemic.Mr Navalny will clearly struggle to rally his supporters and command his team from behind bars, especially if the authorities pursue further, pending charges against him, as many suspect.But the man who survived a poison attack, then returned to confront those he blames, is unlikely to be fully silenced.This video can not be playedAlexei Navalny: what you need to knowMobile phones are banned in Russian prison camps, but are commonly available, and Navalny will be able to make occasional authorised calls and have visitors.Just last week, while on remand, he managed to post a message from prison on Instagram calling on Russians to overcome their fear and protest.\"No-one wants to live in a country where lawlessness and corruption rule,\" he wrote, a country whose leaders imprison \"everyone who speaks out\". His words were \"liked\" by close to a million people.\"Navalny became the persecuted victim, courageous,\" Andrei Kolesnikov argues, likening the opposition figure in that sense to Soviet-era dissidents such as Andrei Sakharov, who was awarded the Nobel Peace Prize.\"Now the situation became black and white,\" he says, adding: \"You can support Putin or Navalny.\""}