{"author":"By Will Fyfe","title":"Ukraine: Private militias recruiting former soldiers","news_category":"general","content":"Some military veterans have received cold call approaches about fighting in Ukraine, the BBC understands.Private militias have reportedly been scouring social media to recruit ex-soldiers.Ukraine has previously asked for volunteers to join its International Legion.But the Foreign Office has said anyone who travels unlawfully to Ukraine for combat will be investigated on their return to the UK.Afghanistan veteran Steve, not his real name, told the BBC Wales Live programme he had received at least 10 approaches, including one which offered him money.\"Whenever there's conflict the chatter starts up, but there was a different tone to this, a more deliberate tone,\" he said.\"There are private militias who've been scouring social media for veterans, so these private militias have been trying to recruit.\"Steve said he believed the offer of money wasn't genuine, but many of the other contacts he'd received were from other veterans looking to organise groups in the UK before travelling to Ukraine.\"I did very well on my second tour of Afghanistan and obviously when you're over there you make a lot of contacts,\" he said.\"The more serious guys are trying to organise it here and go as a group of people that are people you've deployed with, served with, people who know each other's skill set.\"However, Steve said he was increasingly concerned for the welfare of both veterans and civilian volunteers.\"A lot of guys want to go out and help, but some are jumping on the bandwagon and have no military experience. Some are veterans, but they've never deployed, so they've never been in combat,\" he said.\"Veterans with mental health issues, physical issues, and people that go over there that can't fight, that's not actually a help that's more of a hindrance.\"Who are you meeting at the border? Will you get good weapons systems? Will you get medical care? There are too many moving parts.\"Despite doing his best to warn others of the dangers, Steve said many veterans would be vulnerable to offers, and the constant talk about going to fight had left his own mind racing.\"I did take myself off down to the beach early hours one morning,\" he said.\"I needed to get some de-sensitisation away from radio, away from social media, and to just think it through.\"If I think with my brain and not emotion then that tells me I've fought - I've been somewhere and done something - and my priority now is my family.\"BBC Wales Live has heard from veteran support staff concerned that more vulnerable members of the community could be tempted by approaches.Mark, not his real name, is an agricultural worker with no military experience. But he feels he can contribute to Ukraine's war effort.\"I've spoken to a few people, but not many,\" the 26-year-old said.\"They've all been telling me not to go, that I'm a bit crazy for wanting to go and there are different ways to help, but it feels like the best way to help is by being on the ground.\"I'm ready to book a flight, I've just got bits and bobs to get now and then I'll be over there.\"Kirsty, who works in an Army surplus store, said it had almost sold out of its entire stock of combat helmets and vests.\"We've had people ringing up with lists, asking can we donate items. Things like helmets, plate carriers, any proper military protective gear,\" she said.\"We're a very small business, the things people want, we can't just give them away.\"Robert McCartney, from charity Beyond the Battlefield, said he'd heard of veterans approaching each other about going out to Ukraine.\"Social media is full of it,\" he said. \"A lot of these guys are saying 'right, I'm on my way - does anybody want to be there?'\"They see themselves as being able to go out there and recreate themselves as soldiers.\"They are approaching the guys who are in responsible positions, who are in relationships.\"Mr McCartney raised concerns for some vulnerable veterans.\"One of them came in here last week telling me that he was going on Sunday,\" he said.\"I was able to talk him out of it. He's got an eight-week-old baby and that was his biggest worry, so I was able to play on those worries.\"A spokesperson for the Foreign, Commonwealth and Development Office said: \"We advise against travel to Ukraine and anyone who travels to conflict zones to engage in unlawful activity, should expect to be investigated upon their return to the UK.\""}