{"author":"","title":"More than 500 artists help Essex boy's lockdown project","news_category":"general","content":"More than 500 artists from across the world have helped a 13-year-old boy with a project he began in lockdown.Noah, who lives in Dedham, Essex, started painting on pieces of cardboard to pass the time last year.Artists came forward to finish the pictures when his father Nathan Jones posted on Instagram <https:\/\/www.instagram.com\/background_bob\/?hl=en>.The first project <https:\/\/www.bbc.co.uk\/news\/uk-england-essex-56254272> involving more than 250 artists was such a success that the family decided to repeat it.Noah, who has hydrocephalus <https:\/\/www.nhs.uk\/conditions\/hydrocephalus\/>, epilepsy <https:\/\/www.nhs.uk\/conditions\/epilepsy\/#:~:text=Epilepsy%20is%20a%20common%20condition,or%20in%20people%20over%2060.> andcerebral palsy <https:\/\/www.nhs.uk\/conditions\/cerebral-palsy\/>, raised £100,000 when the original art was auctioned off for the Colchester and Ipswich Hospitals Charity.The new work, which features contributions from another 250 artists and local key workers, will beexhibited at Firstsite in Colchester <https:\/\/firstsite.uk\/event\/background_bob-and-his-amazing-friends-guess-whos-back\/> until 9 January.Mr Jones said he had to turn away hundreds of artists who offered to help and it was a difficult task to select 250.The first exhibition was cut short due to Covid restrictions, so Mr Jones said he was really grateful for a second chance to share Noah's art with the public.\"We had so much fun with the first project, we had to do it all again,\" he said.\"We were over the moon when Firstsite offered to work with us again and put on our exhibition. They did an incredible job last time, and presented it beautifully.\"It's very exciting that the exhibition will stay local once more, and hopefully will run without any restrictions, allowing more people to see this beautiful project.\"Money from the first project will be used to kit out a sensory room at Colchester Hospital and redesign the garden area.As well as the auction, it was partly raised through sales of a book featuring the work, with a second book due to be published later this year.Mr Jones said it was his family's way of saying thank you to the doctors who have played a huge part in Noah's life.Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}