{"author":"","title":"President Trump to pull US from Russia missile treaty","news_category":"general","content":"The US will withdraw from a landmark nuclear weapons treaty with Russia, President Donald Trump has confirmed.Speaking to reporters, Mr Trump said Russia had \"violated\" the 1987 Intermediate-Range Nuclear Forces (INF) treaty.The deal banned ground-launched medium-range missiles, with a range of between 500 and 5,500km (310-3,400 miles).The US would not let Russia \"go out and do weapons [while] we're not allowed to\", Mr Trump said.\"I don't know why President [Barack] Obama didn't negotiate or pull out,\" the president said after a campaign rally in Nevada. \"They've been violating it for many years.\"In 2014, President Obama accused Russia of breaching the INF <https:\/\/www.bbc.co.uk\/news\/world-us-canada-28538387> after it allegedly tested a ground-launched cruise missile. He reportedly chose not to withdraw from the treaty under pressure from European leaders, who said such a move could restart an arms race.A Russian foreign ministry source said the US move was motivated by a \"dream of a unipolar world\" where it is the only global superpower, state news agency RIA Novosti reported.Analysis by BBC defence and diplomatic correspondent Jonathan MarcusConcern about Russia's development and deployment of a missile system that breaches the INF treaty predates the Trump administration. But the president's decision to walk away from the agreement marks a significant setback for arms control.Many experts believe that negotiations should have continued to try to bring the Russians back into compliance. It is, they fear, part of the wider unravelling of the whole system of arms control treaties that helped to curb strategic competition during the Cold War.Other factors too may have played into President Trump's decision. This was a bilateral treaty between Washington and Moscow. China was free to develop and deploy intermediate range nuclear missiles. Some in the Trump administration feel that the INF treaty places them at a growing disadvantage in their developing strategic rivalry with Beijing .The US insists the Russians have, in breach of the deal, developed a new medium-range missile called the Novator 9M729 - known to Nato as the SSC-8.It would enable Russia to launch a nuclear strike at Nato countries at very short notice.Russia has said little about its new missile other than to deny that it is in breach of the agreement.Analysts say Russia sees such weapons as a cheaper alternative to conventional forces.The New York Times reported on Friday the US was considering withdrawing from the treaty in a bid to counter China's expanding military presence <https:\/\/www.nytimes.com\/2018\/10\/19\/us\/politics\/russia-nuclear-arms-treaty-trump-administration.html> in the western Pacific.The country was not a signatory of the deal, allowing it to develop medium-range missiles without restraint.National Security Adviser John Bolton is expected to tell the Russians of the withdrawal during talks in Moscow later this week.The last time the US withdrew from a major arms treaty was in 2002, when President George W Bush pulled the US out of the Anti-Ballistic Missile Treaty, which banned weapons designed to counter ballistic nuclear missiles.His administration's move to set up a missile shield in Europe alarmed the Kremlin, and was scrapped by the Obama administration in 2009. It was replaced by a modified defence system in 2016."}