{"author":"","title":"Plaid Cymru response to Jonathan Edwards' assault caution 'too slow'","news_category":"general","content":"Plaid Cymru \"failed to act\" with \"speed and severity\" after an MP was cautioned for assault, a Welsh Tory MP has said.Carmarthen East and Dinefwr MP Jonathan Edwards was suspended from Plaid's Parliamentary party after being arrested at his home in May.Mr Edwards accepted a police caution <https:\/\/www.bbc.co.uk\/news\/uk-wales-politics-53205748> nearly two weeks ago and Conservative MP Fay Jones said Plaid Cymru had been too slow to respond.Plaid Cymru said it had responded with \"unprecedented speed\".Ms Jones, who represents Brecon and Radnorshire, said: \"Mr Edwards has accepted responsibility for the incident. However the party has failed to act which I find deeply disappointing.\"Plaid Cymru should complete its internal investigation with the speed and severity this issue deserves - rather than turn a blind eye.\"Accepting a caution is an admission of guilt and details will be retained in police records.Mr Edwards has apologised and referred himself to Plaid Cymru's internal disciplinary committee.Joyce Watson, Labour Senedd member for Mid and West Wales, said she wanted Plaid's leader Adam Price to take action.\"I am calling on Adam Price to make clear how he intends to proceed with this matter,\" she said.\"Apology or not, accepting a caution is an admission of guilt, and assault is a serious crime.\"Many will be looking to see how his party leader tackles this, and what sort of message he chooses to send.\"Plaid Cymru said: \"As other news outlets have already reported, the matter will be concluded in the coming days.\"Plaid Cymru has responded with unprecedented speed and has already taken swift and robust action whilst preserving the impartiality of the process.\"In a statement issued at the time of the caution Jonathan Edwards said: \"I am deeply sorry. It is by far the biggest regret of my life.\"A statement on behalf of his wife, Emma Edwards, said: \"I have accepted my husband's apology.\"Throughout the decade we have been together he has been a loving and caring husband and father.\""}