{"author":"By Kathryn Armstrong","title":"Ukraine war: UN accuses Russia of breaking child protection rules over refugees","news_category":"general","content":"The head of the United Nations' refugee agency has accused Moscow of violating \"fundamental\" child protection principles by giving Russian passports to unaccompanied child refugees.Filippo Grandi added that Russia had then been putting these children up for adoption by Russian families.He said the UNHCR would try to get access to those affected and try to find solutions in their best interest.However, Mr Grandi admitted he did not know how many children were affected. \"In the situation of war, you cannot determine if children have families or guardianship. And therefore, until that is clarified, you cannot give them another nationality or having them adopted by another family,\" Mr Grandi said.According to the most recent UNHCR data, nearly three million refugees from Ukraine have been recorded in Russia <https:\/\/data.unhcr.org\/en\/situations\/ukraine> - more than in any other European country. It is unclear how many of these are children.A Ukrainian presidential adviser said earlier this month almost 14,000 children had been \"deported\" to Russia from occupied parts of Ukraine, and accused it of kidnapping them. The Kremlin has denied the allegations.Mr Grandi has said the UNHCR is seeking access to Russia \"all the time\" but that so far this has been \"rare, sporadic and not unfettered\".His comments come after the United Nations' top rights official expressed concern in July that Ukrainian children had been taken from orphanages in the eastern Donbas region and \"forcibly deported\" to Russia. There was also concern Moscow was \"modifying existing legislation\" to fast-track this process.Michelle Bachelet said at the time that she could not confirm the allegations or the number of children potentially affected.Then in September, the assistant UN secretary-general for human rights said there were \"credible allegations\" of \"forced transfers of unaccompanied children to Russian occupied territory, or to the Russian Federation itself\".Mr Grandi was speaking at the end of a six-day visit to Ukraine and told local residents that \"the whole world admires you because you are strong people.\"He said it was possible more refugees could return to Ukraine in the summer, as happened last year, but warned that more fighting could lead to greater displacement, especially internally.Mr Grandi also painted a bleak global outlook when it came to refugees - predicting the number of displaced people would \"almost inevitably\" grow from the current figure of around 103 million in the coming years."}