{"author":"","title":"Oldham Coliseum: Maxine Peake leads battle for theatre","news_category":"general","content":"Actress Maxine Peake said a historic theatre under threat of closure was a \"vital institution\" as campaigners battled to save it.Oldham Coliseum is set to close next month after losing its entire Arts Council England (ACE) funding <https:\/\/www.bbc.co.uk\/news\/entertainment-arts-63512050>.The star said ahead of a public meeting at the venue: \"If we can keep it alive it will have an amazing future.\"Oldham Council said the building was not fit for purpose and has unveiled plans for a new £24m theatre.The Coliseum, which has a 135-year history, has been a training ground for a host of TV soap stars, including Coronation Street's Jean Alexander (Hilda Ogden), Barbara Knox (Rita Sullivan), William Roache (Ken Barlow) and Anne Kirkbride (Deirdre Barlow).It became the biggest theatre outside London to lose its £600,000 ACE subsidy in ashake-up announced in November <https:\/\/www.bbc.co.uk\/news\/entertainment-arts-63512050>.Ahead of a public meeting organised by performing arts and entertainment trade union Equity, the Bafta-nominated actress told BBC North West Tonight the theatre was the \"heart\" of the town and the community.Peake, who has starred in TV shows including dinnerladies, Silk and Shameless, said: \"Places like Oldham Coliseum bring people together. It is not just about entertainment, it is the outreach work they do.\"It is such a vital, vibrant, institution that has an amazing history but I think if we can keep it alive it will have an amazing future.\"The venue said it had entered a consultation period with all staff and would close its doors on 31 March as the current financial situation was \"not sustainable for the running of a full-time theatre\".Chris Lawson, chief executive of the Coliseum, said the packed meeting had shown the support for the venue but \"time is running out\".\"The council and the Arts Council England need to listen to what has been said in this auditorium tonight and really now is the time for action and for us to come together to move forward properly,\" he said.Amanda Chadderton, Labour leader of Oldham Council, said the Coliseum building was not fit for purpose.\"It is riddled with asbestos, the walls are falling down and we have done another survey recently and there is a litany of problems,\" she said.The council has just released the first images of plans for a new theatre on Union Street and is due to formally accept £1.845m from ACE on Monday for cultural activities in the borough for the next three years while it is built.The authority said a planning application would be submitted by summer with the building expected to be completed by 2026.Plans include an auditorium seating between 300 and 350 and a smaller 120-seat studio.Ms Chadderton said: \"After the really sad news from the Coliseum in recent weeks, it's great to see such a positive step forward for the future of arts and culture here in Oldham.\"She said it would \"offer performers, staff and audiences a great experience as well as revitalising our cultural offer, creating jobs and adding to the buzz of a vibrant town centre\".Why not follow BBC North West on Facebook <https:\/\/en-gb.facebook.com\/BBCNW\/>, Twitter <https:\/\/twitter.com\/BBCNWT> and Instagram <https:\/\/www.instagram.com\/bbcnorthwest\/>? You can also send story ideas to northwest.newsonline@bbc.co.uk"}