{"author":"","title":"Alan Turing: Bust unveiled at Sherborne School","news_category":"general","content":"A bronze bust of Alan Turing has been unveiled at his former school. The sculpture of the computer pioneer and wartime codebreaker now stands on a plinth in the grounds of Sherborne School in Sherborne, Dorset.It comes after local resident Kathryn Ballisat, inspired by Turing's story and connection to the town, commissioned the work.The bust also coincides with the new £50 note bearing his image <https:\/\/www.bbc.co.uk\/news\/business-56503741> which entered circulation this week.Sculptor David Williams-Ellis and Turing's nephew Sir John Dermot Turing unveiled the bust.Sir John described the work as the \"best\" statue or sculpture he had ever seen of his uncle and \"inspiring\".Mr Williams-Ellis, who is also behind the sculpture commemorating the D-Day Landings at Ver-sur-Mer <https:\/\/www.bbc.co.uk\/news\/uk-57373932>, said he wanted to capture a \"wistful feeling that just doesn't quite tell you the whole story\".The work of Turing helped accelerate Allied efforts to read German Naval messages enciphered with the Enigma machine. His work is said to have been key to shortening World War Two and saving lives.Less celebrated is the pivotal role he played in the development of early computers, first at the National Physical Laboratory and later at the University of Manchester.In 2013, he was given a posthumous royal pardon for his 1952 conviction for gross indecency. He had been arrested after having an affair with a 19-year-old Manchester man, and was forced to take female hormones as an alternative to prison. He died at the age of 41. An inquest recorded his death as suicide.Last year a settlement in the US confirmed items belonging to Turing, including school reports, his OBE and photographs,would be returned to the school's archive <https:\/\/www.bbc.co.uk\/news\/uk-england-dorset-54784018>after they were stolen in 1985.Follow BBC South on Facebook <https:\/\/www.facebook.com\/bbcsouthnews\/>, Twitter <https:\/\/twitter.com\/bbcsouthnews>, or Instagram <https:\/\/www.instagram.com\/bbcsouthnews>. Send your story ideas to south.newsonline@bbc.co.uk <mailto:south.newsonline@bbc.co.uk>."}