{"author":"","title":"West Oxfordshire bin lorry named after young cancer survivor","news_category":"general","content":"A bin lorry has been named after a five-year-old cancer survivor who is \"obsessed\" with them.Josiah Woods, from Woodstock, Oxfordshire, now has a namesake at West Oxfordshire District Council Waste Depot.He was diagnosed with a rare form of cancer, Lymphocyte Predominant Non-Hodgkins Lymphoma (LPNHL), in February.His mum Emma, 34, said the surprise had helped his family \"find the joy in the darkness\".According to the charity Lymphoma Action, 200 people are diagnosed with LPNHL in the UK every year.Josiah, who has gone through intense chemotherapy at the John Radcliffe Hospital, was invited to choose a wish by the Make-A-Wish Foundation UK.As a result he had a freight train named after him, with a G&W Freightliner being called Josiah's Wish.But as a further surprise, a month later, the rebranded bin lorry was unveiled in front of Josiah and his family.Ms Woods told the BBC: \"He's been obsessed with bin lorries since he was very little, probably about two, when he started watching them on YouTube.\"I didn't quite get it but according to his Dad it's probably because they're big and noisy and loud, and they've got flashing lights and they do cool stuff.\"She added: \"This bin lorry comes to Woodstock, which is amazing, so not only does he get to see it but he's a bit of a cool dude among his mates. He's like 'there's my bin lorry'.\"Josiah, who has several bin lorry toys, said: \"I went to the depot where it is and I went for a ride in it around the depot. I got a chance to sit in the front with Mummy and Daddy.\"He said the lorry in particular was chosen because it was the \"hardest working one and it was the fastest one\".\"Most people never have anything named after them but my precious boy has two, and boy does he deserve it,\" Ms Woods said.\"It's actually quite moving, it makes me cry a bit. \"In many ways I wish we didn't have this because I'd rather he had not had this disease... but to see an actual real bin lorry... it's emotional.\"Follow BBC South on Facebook <https:\/\/www.facebook.com\/bbcsouthnews\/>, Twitter <https:\/\/twitter.com\/bbcsouthnews>, or Instagram <https:\/\/www.instagram.com\/bbcsouthnews>. Send your story ideas to south.newsonline@bbc.co.uk <mailto:south.newsonline@bbc.co.uk>."}