{"author":"By Eleanor Gruffydd-Jones","title":"LGBT asylum process criticised by applicants and MP","news_category":"general","content":"A man attacked for his sexuality has said the traumatic process of claiming asylum triggered flashbacks.Lawrence, not his real name, is seeking sanctuary in Wales after he fled his home country in Africa.Cardiff Central MP Jo Stevens said the asylum process for LGBT claimants was \"demeaning\" and had to change.The Home Office said each case was treated on an individual basis, and case workers had extensive training.Over 1,500 people seek asylum in the UK on sexuality grounds every year.Under current rules, anyone claiming asylum on the basis of sexual orientation has to convince the Home Office they are in danger if they return home.The process has multiple stages including interviews, submitting documents and written evidence, before a case worker decides if there is a \"reasonable degree of likelihood\" they will be at risk if they do not get asylum.Labour MP Ms Stevens said she has helped a number of people seeking sanctuary in Wales who had gone through the \"intrusive\" process.\"If you think about someone who has fled that country, frightened, where there is a death penalty in place if you are homosexual for example,\" she said.\"They fled that persecution, they arrived in the UK hoping to be treated by a progressive, open diverse country.\"And then they have to go through a process which is demeaning and intrusive. And it could be done in a much better way.\"Lawrence, not his real name, said he had been tortured in his home African country.He is trying to appeal against the refusal of his asylum claim to live in the UK, and said the asylum process had triggered flashbacks.\"As someone who has been through trauma and a lot of difficulties before getting to this country, there are certain things if you ask the person, it triggers flashbacks,\" he said.\"In the course of the interview, you are also nervous, you don't know what you're going to be asked.\"It is a matter of life and death. I feel my answers from that affected the decision,\" he said, adding the questions had been difficult to understand.Alice, not her real name, fled persecution in Africa because of her sexual identity - and is trying to claim asylum in Wales.She said her interview had asked a lot of \"very repetitive\", \"personal questions\" and she felt like they were trying to catch her out.\"When you're asked, 'When did you first realise you were a lesbian?' It's not like I'm keeping track is it? You know, I can't exactly remember,\" she said.\"And I guess you know, the moment the person realises you're not too sure about a certain thing, they'll try and keep asking more questions about that.\"So that's why I felt like sometimes I was being asked questions so I could be discredited, instead of the interviewer listening to my story and making a fair assessment.\"Richard, not his real name, who now has refugee status after his appeal was successful, said asylum seekers were treated like \"numbers, not human beings\".Over three years, the refusal rate for sexuality-based asylum claims increased from 61% to 71%, according to Home Office figures.The rate of successful appeals also went up - with 38% of refusals overturned in 2018, compared to 32% in 2015.In recent years, the focus for the Home Office in understanding sexuality shifted towards identity, after a numberof high profile European Court of Justice <https:\/\/www.bbc.co.uk\/news\/30290532> cases.This was reflected with updated training for Home Office asylum caseworkers and guidance on considering cases for sexual orientation.The guidance states that the substantive interview must be a \"sensitive enquiry into the development and exploration of the claimant's sexual orientation\", and \"must never be an enquiry into explicit sexual activity\".Under the 1951 Geneva Convention, asylum seekers must show that:Jo Stevens, who is a former lawyer, said policy and training needed to change to stop an \"inherently suspicious\" attitude towards every asylum application.\"We need people to be able to conduct these interviews in an empathetic and sympathetic and objective way\", she said.The Home Office said: \"The UK has a proud record of providing protection for asylum seekers fleeing persecution because of their sexual orientation.\"Each asylum case is carefully considered on its individual merits by caseworkers who receive extensive training on considering asylum claims and must follow published Home Office policy guidance.\"Politics Wales <https:\/\/www.bbc.co.uk\/programmes\/m000dk1n> is on BBC One Wales at 10:00 GMT on Sunday, 1 March"}