{"author":"By Catrin Nye ","title":"Naturalising Newham - radical plan to boost integration","news_category":"general","content":"This video can not be playedCatrin Nye investigates high immigration in NewhamThe mayor of Newham in London is on a mission to make the people of his borough, which has the lowest white population in the UK, more integrated. Sir Robin Wales has brought in a range of measures to this end, but by pushing integration is he uniting people or alienating them?\"I am very strongly of the view that if you try to segregate people into different groups and keep them separate, that is not only bad for everybody in the community, it's very bad for the particular community that you do it to,\" Sir Robin says when I meet him in East Ham in the heart of Newham.\"Apartheid was wrong in South Africa, it would be wrong here, so keeping people separate is a bad thing.\"Newham in east London, which played host to the London Olympics last year, has a population of about 300,000 people. It is one of the UK's most ethnically diverse places and the white British population stands at 16.7%, the lowest in the UK.Sir Robin has been the directly elected mayor of Newham since 2002 and in that time has brought in a series of bold measures aimed at making people speak English and adopt British values.At Newham's libraries he has removed all foreign language newspapers, though he emphasises that free internet access at those libraries allows people to access information in their native languages, and he has stopped funding single community events such as a Bangladeshi or a Turkish street party.\"We won't support single ethnic or religious groups to do things themselves within those groups, it's not our job to support that,\" he says. \"Our job is to support when people come together. So our grants, our government grants, will be £250 if you want to throw a street party but it must be inclusive.\"More controversially the council has cut most of the translation services it provides.Large documents such as public reports are no longer translated, although the council says that if a resident needs help understanding part of a large document, telephone interpreters are on hand to assist.And overall translation services have been cut by 72% in Newham since 2010. \"We have said we will only translate in those cases where it suits us - so child protection cases, paying your council tax, those sorts of things. We won't translate otherwise, you have to bring somebody in with you if you want to access anything else,\" Sir Robin says.The reduction in translation services is a change that has been criticised by some. Andrew Boff, leader of Greater London Authority (GLA) Conservatives, says he finds the measures very draconian:\"I can understand if you are not using your translation services at a time when local authorities have to save money, but if you're actually removing them from vulnerable people who need them for ideological reasons then that starts to make you question what the values are of the people who are doing that,\" he says.\"This is about real multicultural London, it's about respecting the differences between people, not just trying to impose sameness, in Newham they're imposing sameness, in other boroughs they value what each community brings to London and accommodates them and there is nothing wrong with that... What's happening in Newham is a big backwards step,\" he adds.Attending one of the citizenship ceremonies that take place every Tuesday in East Ham town hall I meet Mini and Shibu Abraham from Kerala in India.Mrs Abraham was recruited from Mumbai to work in East London hospitals. They live in Upton Park, a part of Newham, and they say the diversity of the area was clear as soon they arrived:\"It was like we are in India or somewhere - the shops, people talking their national language,\" Mrs Abraham says.The couple say that in some ways this has made it easy to adapt however, Mr Abraham says, they have concerns that this does actually make integration with other communities harder:\"There are people from different parts of the world coming and they are forming their own little groups, it would be much better if we could all interact.\"The couple admit that despite their desires it is largely Indians they spend their time with and it is this instinct that Newham's mayor wants to counter.Sir Robin insists that his measures are not about forcing people to integrate, but encouraging them to do so, and he believes that ensuring people acquire English is the absolute foundation of this:\"The government slashed English language funding, which is ridiculous because that's the one thing that helps people get into work and also, lets people access the culture and all the opportunities that are here in our country...\"So we support that. We're currently experimenting with a range of different ways of providing cheap or free English language, but what we do is provide free English language teaching to anybody that wants to work.\"Whether you agree or disagree with the tactics, officials from other ethnically diverse parts of the UK are watching what happens in Newham with great interest.Max Wind-Cowie is head of the integration programme at the think-tank Demos and says because Newham is so unique Sir Robin has been able to bring in more controversial measures than other politicians may dare:\"Newham benefits from being incredibly genuinely diverse. There's no single population that dominates the political landscape or the resource landscape. Instead what they have are people from almost every ethnic group that exists in the UK.\"What that means is politically Sir Robin and Newham council are able to take quite brave steps in terms of promoting integration without risking alienating huge voting-blocks who may object to what he is doing.\"Listen to Catrin Nye's radio documentary Naturalising Newham on Thursday 19 September 2013 at 1700 BST on BBC Asian Network and see her film on BBC Newsnight at 2230 on BBC Two."}