{"author":"By Sophie Long","title":"How #OscarsSoWhite changed the Academy Awards","news_category":"general","content":"The Academy of Motion Pictures remains overwhelmingly male and white - but there has been some change since #OscarsSoWhite started trending eight years ago. The BBC speaks to some Hollywood insiders and this year's Oscar nominees about the steps that have been taken - and the road still ahead.With nominees like Everything Everywhere All at Once and Black Panther: Wakanda Forever, this year's Academy Awards will highlight the stellar work of diverse casts, directors and crews. But in 2015, the picture looked bleak.That is when the hashtag #OscarsSoWhite - started by activist and writer April Reign - began to trend, highlighting the fact that out of 20 actors nominated that year, none were people of colour.Recent research published by the Annenberg Inclusion Initiative, a think tank run out of the University of Southern California (USC), shows that in the eight years leading up to the #OscarsSoWhite protests, just 8% of Oscar nominees were people of colour.But since then, there has been some change, says Dr Stacy L Smith, who led the research efforts at USC. In the eight years since the hashtag kicked off a firestorm, the number of nominees of colour has grown to 17%.\"I think that there's cause for optimism, and some good news, which we don't often have when it comes to the entertainment industry,\" she told the BBC.Annenberg's data is published in what they call the \"Inclusion List\", a look at the diversity - or lack of it - across Academy Awards' 95 year history. Since 1929, only 16% of all winners were women and fewer than 2% were women of colour, the list shows. It also reveals that just 6% of all winners have been from underrepresented ethnic groups.This year, six of 20 nominees in the main acting categories are people of colour.For Angela Bassett, who's been nominated for Best Supporting Actress for her work in Black Panther: Wakanda Forever, recognition from the Academy has been a long-time coming.\"It's wonderful, it just means the world to me, the little girl who came from Florida, looking for representation in the industry, looking toward others that looked like me, that gave me the idea that, you know, that I could have a place in it,\" she told the BBC.This is Ms Bassett's second nomination - her first was in 1993 for playing Tina Turner in the biopic What's Love Got To Do With It. She says she feels honoured to be \"any sort of inspiration\" to young actors \"because I certainly had those that I looked toward when I was starting out.\"But there is still a long way to go, many have pointed out.The omission of Black actors like Viola Davis for her role in The Woman King and Danielle Deadwyler in Till in the Best Actress category has caused some to criticise the Academy for failing to acknowledge Black talent.Others have pointed to the fact that this year, no women were nominated for Best Director, despite strong contenders such as Sarah Polley, who directed Women Talking, and Chinonye Chukwu, director of Till.While the Inclusion List shows that over the years the nominees have grown more diverse, the proportion of nominees who are part of an ethnic minority is still \"nowhere near what it needs to be,\" Ms Smith said.About 40% of the US is an ethnic minority, according to the US Census. \"That's where that number should be in 2023,\" Ms Smith added. Since #OscarsSoWhite, the Academy of Motion Pictures Arts and Sciences has made an effort to diversify its pool of about 10,000 members who get to vote on who should win the Oscars.Academy President Janet Yang says the Oscars reflect the industry, and that the Academy has worked to expand its ranks in recent years, inviting a younger, more diverse and more global group of artists to the exclusive club.\"We're doing everything we can to try to level the playing field,\" she said, referring to mentoring programmes for women and attempts to expand and diversify their membership.Women now outnumber men on the Academy's Board of Governors. Academy member and 2023 Oscar nominee Brian Tyree Henry, who joined the organisation in 2020, said being able to vote for who should win the prestigious award is an honour, but that there is still a way to go before the Oscars are reflective of the country as a whole.Mr Henry has been nominated this year for Best Supporting Actor for his role opposite Jennifer Lawrence in Causeway this year.\"I'm really, really humbled by being here, but I know there's work to be done,\" he said."}