{"author":"By Ella Hambly","title":"Wildlife photographer of the year: Is this ape really cuddling a pet mongoose?","news_category":"general","content":"A tender moment or something more sinister? The image appears to show a bonobo cuddling a little mongoose like a treasured pet. But instead, maybe the ape took the mongoose pup for dinner after killing its mother.But that would be unusual - bonobos mainly eat fruit and only occasionally hunt.The intriguing behaviour was photographed by Christian Ziegler in Democratic Republic of Congo.His fascinating picture has been selected as a Highly Commended image in the Natural History Museum's Wildlife Photographer of the Year (WPY) 58th competition.The shortlist was revealed on Thursday, and the overall winners will be announced at London's Natural History Museum (NHM) in October.Christian had been tracking the group of bonobos \"chest-deep through flooded forest\" in the Salonga National Park for days when he spotted the young male holding a juvenile mongoose in his hand.\"I was so surprised to see how he carried the mongoose with such care. I immediately started to follow him and document it,\" he told BBC News.The ape held and stroked the small mongoose for over an hour, he said.But he may have been planning to eat him. When bonobos catch prey, they do not immediately kill it, but instead start eating when it is still alive, according to Dr Barbara Fruth, director of the LuiKotale Bonobo Project which has been observing these animals for over 20 years.But occasionally, if dinner is too big and the ape gets full, it will treat the leftover living prey as pets. Usually, these animals are later eaten.Dr Fruth believes that this is probably what was happening in the picture.She does highlight that bonobos are known for their gentle, empathetic and peaceful nature.\"We know from captivity that bonobos care for individuals other than their own species,\" she says. In the wild, it's unlikely that a bonobo would take care of another species as a long-term pet, she adds.But she does not exclude the idea that the apes keep other animals as accessories to attract interest from other group members and thereby increase their status.In the end, this mongoose had a happy ending - the bonobo eventually released his \"pet\", who then got away unharmed.The mystery behind the photo is part of its attraction to the judges of the Natural History Museum's contest.Senior researcher at the Natural History Museum Dr Natalie Cooper whittled down nearly 40,000 entries across 20 categories with her fellow judges. \"We're looking for technically, really brilliant images - the ones that you see once and wake up in the morning still thinking about,\" she says.WPY has become one of the most prestigious competitions of its kind. Entries from 93 countries were received for this year's event.The category and Grand Prize winners will be announced at a Natural History Museum ceremony on 11 October. The museum will then open its annual exhibition of the best photos on 14 October.In Richard Robinson's image, he and his camera became the object of fascination for this young southern right whale. The encounter lasted 30 minutes, with the whale circling him, swimming off, then returning for another look.Whales were hunted to near-extinction in the 19th and 20th centuries, but the southern right whale population, known as 'tohorā' in Māori, is now recovering after hunting was banned.Category - Animal PortraitsVideo: Southern right whales: Tracking unexpected Southern Ocean migrations <https:\/\/www.bbc.co.uk\/news\/av\/world-australia-59646562>A school of inquisitive perch met photographer Tiina Törmänen on her lake snorkel in Posio, Lapland.The cloud-like excessive algal growth, a result of climate change and warming waters, can cause a problem for aquatic life when it uses up oxygen and blocks out sunlight.Category - Under WaterDutch photographer Jasper Doest captured Lubinda Lubinda, station manager for the Zambezi River Authority, in front of his new house (right) which he did not need to built as high as his last one due to lower water levels. Climate change and deforestation have resulted in the Zambezi flood plain experiencing more droughts.Discussing the image, Dr Natalie Cooper said: \"We can talk about climate change until we're blue in the face but until you see the reality of the issue on the screen in front of you, it's hard to connect with that subject.\"More than 20 polar bears took over Kolyuchin Island, Russia which has been abandoned since 1992, in search of food. With climate change reducing sea ice, polar bears are finding hunting more difficult, pushing them closer to human settlements to scavenge. A low-noise drone was used to capture the striking image.Category - Animal PortraitsHere the photographer waded through chest-height water to capture a breeding frenzy at dawn. You can almost hear the mating calls of the scrambling male gliding treefrogs as the females lay their eggs in palm fronds - around 200 at a time - which later drop into the water below as tadpoles.Category - Behaviour: Amphibians and ReptilesJoshua is now eight years old but was just six when he snapped this majestic stag during intense snowfall in Richmond Park, London. He started using a toy camera when he was just a toddler and progressed to a compact camera not long before this photo was taken. \"He almost looked like he was having a snow shower,\" said Joshua.Category - 10 Years and Under You can see Highly Commended photographs from all of the categories at the Natural History Museum website. <https:\/\/www.nhm.ac.uk\/visit\/exhibitions\/wildlife-photographer-of-the-year.html>"}