{"author":"","title":"Chelsea Barracks plan approved by Westminster Council","news_category":"general","content":"New plans to redevelop the Chelsea Barracks site in central London have been approved by Westminster Council.The outline plan proposes to build 448 houses and flats, including 123 affordable homes, a sports centre and retail outlets at the 13-acre site.A Grade II-listed chapel is to remain at the site as part of the proposals.But the plans are opposed by Chelsea Barracks Action Group which said three 100ft (30.4m) buildings will \"loom over this very classical part of London\".The approval comes two years after developer Qatari Diar withdrew its earlier plan following Prince Charles' criticism of Lord Rogers' design.The new plan by architects Dixon Jones, Squire and Partners and Kim Wilkie was approved by the council on Monday night.The masterplan will now be referred to London Mayor Boris Johnson for approval before more detailed designs for the buildings are put before the council.The barracks housed the Queen's Guard and was built in 1860. It was sold by the Ministry of Defence to Qatari Diar in 2007 for £959m.The site has remained undeveloped since the last troops vacated the premises in 2008.Councillor Alastair Moss, chairman of Westminster Council's planning and city development committee, said: \"Chelsea Barracks is the most significant residential development we have seen in Westminster in recent years.\"It is a world-class site, in a historic part of the capital and it is vital that its redevelopment helps improve the area.\"The council and developer Qatari Diar said the plan has the support of the \"majority of local residents\".But Georgine Thorburn, chairwoman of the Chelsea Barracks Action Group, said: \"There are going to be three enormous 100ft (30.4m) buildings in the centre of the site that are going to loom over this very classical part of London next to this Grade II-listed church.\"A statement from Qatari Diar said that with a scheme of this size and complexity it was inevitable there would always be a small number of people who had specific concerns.Mohammed bin Ali Al-Hedfa, group chief executive officer of Qatari Diar, said: \"We are delighted that, after an exhaustive 21-month public consultation process that showed a high level of support for the masterplan, Westminster Council has decided to approve this application.\"He said the company had a \"long-term commitment\" to London and, in particular, to the redevelopment and management of this site.After Qatari Diar withdrew its modern design by Lord Rogers in June 2009, the developer's then-partner the CPC group launched a High Court action to get an early payment of £68.5m after the scheme's collapse, but the legal bid failed.In July, Qatari Diar reached a settlement with CPC.Prince Charles was criticised by architects over his criticism of Lord Rogers' design."}