{"author":"","title":"April Fools' Day: 10 stories that look like pranks but aren't","news_category":"general","content":"It's April Fools' Day again, and once again the hunt is on to identify the news stories planted by imaginative editors with the sole purpose of bamboozling their readers.It's a task that becomes more difficult every year, thanks to the tumultuous times we live in, and the increasingly blurred boundary between real and fake news.What once we may have dismissed as an April Fools' prank, now turns out to be real.So here is our round-up of 10 bizarre stories that are - apparently - true:1. Billionaire entrepreneur Elon Musk has released a rap song. Briefly stepping away from his work in space exploration and pioneering transport systems, the American released a track called \"RIP Harambe\" - a reference to the Cincinnati Zoo gorilla which was shot after a small boy fell into its enclosure in 2016.More details (USA Today)  <https:\/\/eu.usatoday.com\/story\/money\/2019\/03\/31\/elon-musk-rap-song\/3325846002\/>andElon Musk's Twitter <https:\/\/twitter.com\/elonmusk\/status\/1112427303013736448>2. A comedian with no political experience has won the most votes in the first round of Ukraine's presidential elections, according to exit polls. They say Volodymyr Zelenskiy - who played the president on TV - received 30.4% of the vote, with current leader Petro Poroshenko second on 17.8%.More details <https:\/\/www.bbc.co.uk\/news\/world-europe-47767440>3. Mosquito bites can be avoided by listening to electronic music - specifically dubstep, even more specifically by US artist Skrillex, according to a new study. Sound is \"crucial for reproduction, survival, and population maintenance of many animals,\" says a team of international scientists, who subjected adult mosquitoes to the music to see if it would repel them.More details <https:\/\/www.bbc.co.uk\/news\/newsbeat-47770982>4. Nigerian agriculture minister Audu Ogbeh has claimed that Nigerians are \"using their mobiles to import pizza from London\" on British Airways flights. Mr Ogbeh, who said Nigeria relies too much on foreign imports, sparked ridicule on Twitter, where one user joked: \"Dear @British_Airways, how come you didn't tell us you run a pizza delivery service to Nigeria? Is there an app for this?\" However, the BBC has been unable to find any evidence to back up the minister's claim.More details (Daily Mail) <https:\/\/www.dailymail.co.uk\/news\/article-6871399\/Nigerians-flying-UK-pizzas-4-000-miles-BA-flights.html> andBBC Pidgin <https:\/\/www.bbc.com\/pidgin\/tori-47727247>5. Fish slime could help the development of new antibiotics, researchers say. Seventeen species of fish caught off the southern Californian coast were swabbed by researchers at Oregon State University who believe that new antibiotics might be found in the layer of mucus that coats their scales.More details (The Guardian) <https:\/\/www.theguardian.com\/society\/2019\/mar\/31\/new-antibiotics-could-be-developed-using-fish-slime-scientists-say>6. A towering, gold-dusted Wagyu burger measuring 15cm tall, 25cm wide and weighing around 3kg is to be served at a hotel restaurant in Tokyo. The Grand Hyatt Tokyo will add the 'Golden Giant Burger' to the menu in honour of Japan's new emperor, charging customers ¥100,000 (£670) for the feast.More details (i) <https:\/\/inews.co.uk\/news\/world\/tokyo-hotel-serves-908-burger-to-welcome-new-emperor\/>7. Armed police stepped in to help arrest a man on suspicion of being drunk while driving a horse and trap in Cardiff. South Wales Police tweeted: \"Having to rein ourselves in now, don't want to saddle you with unnecessary puns!!\" The 29-year-old was not charged with an offence.More details (Wales Online) <https:\/\/www.walesonline.co.uk\/news\/wales-news\/man-suspected-being-drunk-charge-16054531>8. Snoop Dogg once left a large rucksack containing up to £400,000 cash in a nightclub in Exeter, its owner said. George Sloan said the US rapper had done a \"mini tour\" of the area in 2014 and had left the takings from all his gigs in a bag behind the DJ box by accident.More details (Devon Live) <https:\/\/www.devonlive.com\/whats-on\/whats-on-news\/exeters-timepiece-boss-collecting-glasses-2694399>9. The US military is recruiting sea creatures to help track enemy activity. Scientists want to employ their sensory abilities to pick up signals that might be missed by conventional technology. For example, it is thought the \"booms\" made by territorial fish known as goliath groupers could provide information about approaching drones or submarines.More details (The Independent) <https:\/\/www.independent.co.uk\/news\/science\/us-military-fish-underwater-spies-marine-life-darpa-a8847706.html>10. A singing nun is to compete in the Italian version of the television show Strictly Come Dancing. Sister Cristina Scuccia, who lives in a convent in Milan, shot to fame after she won Italy's 'The Voice' in 2014. She has since released two albums and a video of Madonna's 1984 hit 'Like a Virgin'.More details (Church Militant) <https:\/\/www.churchmilitant.com\/news\/article\/singing-nun-to-compete-for-1-million-in-dancing-with-the-stars>Compiled by Emma Thelwell and Matthew Cannon"}