{"author":"","title":"Devon and Cornwall reservoir levels half 'what they should be'","news_category":"general","content":"The water in Devon and Cornwall's reservoirs is at half the level it should be at this time of year.South West Water (SWW) said it was unable to say how long the current hose pipe ban in Cornwall and parts of Devon would need to remain in place.It said it was monitoring the situation daily and doing everything it could to improve supplies.In August a drought was declared for the whole of the South West <https:\/\/www.bbc.co.uk\/news\/uk-england-bristol-62723419>.Following the declaration, a hosepipe ban was introduced in Cornwall <https:\/\/www.bbc.co.uk\/news\/uk-england-cornwall-62546790> and parts of North Devon.SWW drought director Jo Ecroyd said the region had experienced \"some of the driest weather for 130 years\".Currently, the water levels at Colliford Lake in Cornwall are at about 20%, according to theSouth West Lakes Trust <https:\/\/www.swlakestrust.org.uk\/current-reservoir-levels>.Roadford Lake, which can store up to 34,500 megalitres, is currently at 38% capacity.Overall the company's water storage is at 31.5% capacity.Ms Ecroyd said: \"We've experienced some of the driest weather for 130 years, with Cornwall reaching record temperatures in the summer.\"So, what we're all about today is asking our customers to conserve water so we can replenish the reservoir.\"Drinking water supplies are safe, but we want to make sure they're resilient through the winter period, and we're still waiting for that rain to come.\"Ms Ecroyd said as soon as the reservoirs had replenished themselves, SWW would lift the hosepipe ban.Aside from rainfall levels, one of the issues the firm faces is leakage.SWW said in the last two years, it had doubled the number of leak detection staff and was currently fixing about 2,000 leaks a month.The water provider also said it had been granted a drought permit for the Upper Tamar Lake by the Environment Agency, which will allow it to move water from Lower Tamar Lake to Upper Tamar Lake.Follow BBC News South West on Twitter <https:\/\/twitter.com\/BBCSpotlight>, Facebook <https:\/\/www.facebook.com\/bbcspotlight> and Instagram <https:\/\/instagram.com\/bbcspotlight>. Send your story ideas to spotlight@bbc.co.uk <mailto:spotlight@bbc.co.uk>."}