{"author":"","title":"Ukraine accuses Orthodox Church leader Pavel of pro-Russian stance","news_category":"general","content":"Ukrainian investigators have searched the home of an Orthodox Church leader in Kyiv accused of justifying Russia's armed aggression against Ukraine.Metropolitan Pavel Lebed runs the Kyiv-Pechersk Lavra, Ukraine's most important monastery. His branch of the Ukrainian Orthodox Church (UOC) was previously loyal to Moscow clergy.Kyiv prosecutors say he is suspected of inciting national and religious hatred.Kyiv has been trying to evict him and his followers from the monastery.Metropolitan Pavel has denied the allegations and argues that the Kyiv authorities have no legal grounds for evicting the monks and staff from the monastery.In a court appearance on Saturday he called it \"a political case\" and said \"I've never been on the side of aggression\" - though he did not mention Russia.\"I'm against aggression. And now I'm in Ukraine - this is my land,\" he said. He described his current status as \"house arrest\".On Friday hundreds of worshippers gathered at the Kyiv-Pechersk Lavra monastery - famous for its historic caves - in support of the monks there, protesting against the eviction order.A statement from the Security Service of Ukraine (SBU), on the Telegram messaging service, says Metropolitan Pavel is suspected of \"violating citizens' equality\" based on their racial, national and religious ties.It says he \"repeatedly insulted the religious feelings of Ukrainians\", \"humiliated\" other faith groups and \"tried to create hostile attitudes towards them\".\"He also made statements that justified or denied the actions of the aggressor state,\" the SBU says. It has posted recordings on YouTube which it alleges are phone intercepts of Metropolitan Pavel.In one, a male voice believed to be his, describes Russia's invasion of Ukraine as a \"war between the Russian Federation and America until the last Ukrainian is killed\", claiming it was Ukraine that provoked Russian aggression.Speaking about the Russian occupation of Kherson last year - before Ukrainian forces retook the city - he says \"there are already Russian flags everywhere and people are happy\".Commenting on Saturday's move against the abbot, SBU head Vasyl Malyuk said \"today the enemy is trying to use the church environment to promote its propaganda and divide Ukrainian society\".\"But we will not give him a single chance!\" he stressed.Last year, the SBU raided the Lavra and other buildings belonging to the UOC, and it says 61 Orthodox clerics have been prosecuted for pro-Russian activities. Courts convicted seven, including two clerics who were exchanged in prisoner swaps with Russia. The UOC says there is no evidence to support the charges of collaboration.In recent years many worshippers have joined the independent Orthodox Church of Ukraine. But millions still follow the UOC, which split from Moscow last May after centuries under its control.The Russian Orthodox Church has allied itself with President Vladimir Putin, echoing Kremlin rhetoric in defending the invasion of Ukraine."}