{"author":"By Clodagh Rice","title":"Cost of living: How gas and electricity price changes may affect you","news_category":"general","content":"A cut in government support towards energy bills is going to push up prices for many households in Northern Ireland.As the cost of wholesale energy is falling, so too is the level of government support.The Energy Price Guarantee started in Great Britain in October and one month later in Northern Ireland.This support, which was backdated in Northern Ireland, is now coming to an end on Saturday.From January to March 2023, energy bills in Northern Ireland were being discounted by up to 13.6p per unit for electricity and 3.9p per unit for gas.That support is being reduced, which means from April to June 2023 bills will be discounted by up to 3.8p\/kWh for electricity and 2.6p\/kWh for gas.This will offset price decreases from a number of suppliers and mean higher household bills for tens of thousands of customers.Director of Infrastructure and Sustainability at the Consumer Council, Peter McClenaghan, said: \"Some consumers' bills will not reduce as much as initially advertised and some bills will increase when the updated Energy Price Guarantee rate is applied.\"The same change is not happening in the rest of the UK. This is because we have been receiving a higher level of government support to make up for the fact that we began receiving assistance a month later.\"From 1 April, Northern Ireland consumers will receive the same level of support as is being provided in GB,\" he added.From April, the Energy Price Guarantee will bring a typical household energy bill for gas and electricity to around £2,500 per year in Great Britain versus around £2,109 per year in Northern Ireland.The Utility Regulator for Northern Ireland, which regulates the largest electricity supplier Power NI, said the typical Power NI annual bill will be 29% lower than Great Britain and 42% less than the Republic of Ireland.The majority of homes in Northern Ireland use home heating oil to heat their homes.The Consumer Council which tracks prices locally said they are now almost back to levels seen prior to the war in Ukraine.The average cost for 300 litres of oil this week was £206.98 and the pre-Ukraine war average was £206.14 in February 2022.The vast majority of people who have received their energy vouchers have already redeemed them, but for those who have not, the deadline is 31 March.Earlier this month, the Post Office said about 20,000 households <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-64991600> - about 4% of the total that were issued - had yet to redeem their voucher.Some customers who had their vouchers reissued will have three months from their new issue date to redeem them, so are not impacted by the end of March deadline.The vouchers can be redeemed at any Post Office branch. <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-64041730>The initial roll-out of the scheme was from 16 January to 7 February.The last batch of vouchers was sent out by 11 February."}