{"author":"","title":"Holt Budgens supermarket destroyed by fire","news_category":"general","content":"A town's only supermarket has been destroyed by fire, leaving the family-run company \"utterly heartbroken\".Budgens in Holt, Norfolk, was engulfed in flames at 21:15 BST on Saturday, with smoke visible from 10 miles away.The supermarket has been a key employer in the town for 35 years, with customers describing it as a \"lifeline\" during the coronavirus pandemic.Jane Gurney-Read, of CT Baker Group, said: \"We are all absolutely devastated.\"It has been an enormous shock for our team who have always given so much to the local community and have worked tirelessly during the lockdown.\"The shop, which contained a post office and laundrette, was vacant at the time and no one was hurt.The cause of the fire is not yet known.Eight fire crews and 14 appliances were called to the fire at its height and brought it under control.Police urged people to keep away from the Kerridge Way store as crowds gathered in the car park and neighbouring streets.North Norfolk MP Duncan Baker said: \"I am horrified and struggling to come to terms with what we are all witnessing.\"For us to experience this loss so soon after the coronavirus crisis is truly devastating.\"But Holt is a strong, close-knit community and, working together, I am sure we can come through this, rebuild, and emerge even stronger.\"Eight fire crews and 14 appliances were called to the fire at its height and brought it under control.Police urged people to keep away from the Kerridge Way store as crowds gathered in the car park and neighbouring streets.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Social media manager Jono Read, who lives in Holt, said: \"The sound of the parts of the building collapsing as the fire spread will stay with me for some time.\"Luckily the fire crews were able to get it under control to avoid the spread, but it's absolutely devastated the store, and left the community in shock.\"Mr Read has set up a crowdfunding page to to thank staff for their help during lockdown \"and over the many years the store has been around\".This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.\"The staff at both the shop and the Post Office have worked so hard to provide a lifeline to our town,\" he added.\"They've kept shelves stocked, provided local deliveries to the elderly and most vulnerable, and worked around the clock to see this north Norfolk town through the good times and the bad.\"Mr Baker, who grew up in Holt, said he would work with North Norfolk District Council \"as a matter of urgency\" to establish what support was needed.\"Over the pandemic the staff have been phenomenal supporting the community,\" he added.\"Your dedication has been amazing and my heart is with you all. \"CT Baker said it was working with councils and the chamber of trade, known as Love Holt, to ensure vulnerable customers were supported.Emergency services are still at the scene and North Norfolk Council is checking the stability of nearby buildings."}