{"author":"","title":"EU funds: Community workers at risk of redundancy","news_category":"general","content":"Community organisations in Northern Ireland have put 400 workers on notice of redundancy due to a lack of funding.One-thousand workers in total are predicted to lose their jobs, according to the Community Sector Peer Group.The peer group represents 22 organisations across Northern Ireland that provide services to vulnerable people.The European Social Fund (ESF) had previously provided about £40m a year <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-63219860>. It is to end at the end of March.Rev Andrew Irvine, the chair of the Community Sector Peer Group, said it was facing at a 60% funding cut due to funding not being replaced.\"That will be disastrous for the 18,000 vulnerable people we help every year and our 1,700 staff who deliver that support,\" he said.\"At a time when public finances are at breaking point it's incredibly short-sighted to be even contemplating cutting, let alone slashing, employability services.\"The ESF funding ended as a result of Brexit <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-55339227> and the UK government has yet to replace it.The government has previously said that funding will \"ramp up\" over time so that total domestic UK-wide funding will at least match receipts from EU structural funds.Rosie McCusker, from the Upper Springfield Development Trust in west Belfast, is among the community workers facing redundancy.She manages a team of 40 staff, some of whom have now left because of the looming notice.\"The community sector are losing skilled staff who are moving to other sectors for more security,\" she told BBC News NI's Evening Extra programme.\"These are extremely uncertain and anxious times. I have a mortgage and bills, and we are also experiencing the everyday challenges of the rising cost of living.\"I love my work. I don't want to leave, I want to try and hold out, but this just makes it more and more challenging.\"Ann-Marie Mervyn, the assistant CEO of the Upper Springfield Development Trust, said it was very unfair, but the community sector faced uncertainty regularly.\"Our sector, every year or two years, has to go through this process,\" she added.\"We provide highly sought after services. You just had to look during covid. \"We were the front line. People came to us.\"Unfortunately we're just not compensated or acknowledged for the work we do.\""}