{"author":"","title":"Hemsby lifeboat crew appeals for materials after storm damages ramp","news_category":"general","content":"A lifeboat service has appealed for building materials after storms washed away its access ramp to the beach.Sand has been stripped away outside the Hemsby Lifeboat station in Norfolk, leaving a sheer drop of 5ft (1.5m).The service said it could not wait for the local council to shore up the cliff and was appealing for donations so it could carry out the work.Great Yarmouth Borough Council said its sea defences plans were awaiting approval.In 2018 erosion from storms <https:\/\/www.bbc.co.uk\/news\/uk-england-norfolk-55995662> saw homes on the cliff edge to fall into the sea.Dan Hurd, coxswain of the independent lifeboat service, said five weeks ago they had to shore up access to the lifeboat access ramp and were \"back to square one again\".He said: \"This will probably happen again tonight; we'll move back even more.\"We can keep on doing what we're doing but it's not good enough. We really need to get the sea defences in as soon as possible.\"The lifeboat service put an appeal out on Facebook <https:\/\/www.facebook.com\/permalink.php?story_fbid=4925161314237091&id=161913407228596> asking for sleepers, iron-work and concrete.\"Our intention is to make safe, as far as we can, the dunes to the immediate left of the [Hemsby] Gap by the board walk and the concrete pad area,\" said the post.\"We will use railway sleepers to help retain the dunes on the left side of the gap and make a safe boundary for the pad on the right.\"\"As much as they assist us, we have accepted that the [local] authorities cannot provide us with the support we need in a timely manner,\" the post said.Conservative borough councillor James Bensly said its planning application for sea defence works was going through the normal process, but agreed that \"time is against us at the moment\".\"The problem is the legislation, we have to jump through so many hoops to try and deliver this scheme and it has to be a fully signed-off scheme to help coastal communities like this,\" he said.The council is considering building a rock defence <https:\/\/www.great-yarmouth.gov.uk\/article\/7517\/Community-in-Hemsby-invited-to-join-consultation-to-consider-rock-berm-options-for-coastline> at Hemsby to help protect the village.Some £265 has been pledged to the lifeboat service so far. Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}