{"author":"","title":"Southend hospital nurses quitting due to 'toxic' conditions","news_category":"general","content":"A whistleblower is warning that staff are leaving Southend University Hospital's emergency department due to \"toxic\" working conditions.The experienced A&E nurse claimed staff felt \"completely broken\" and \"helpless and unsupported\".She claimed about 15 nurses had recently left to work in different departments or even quit the NHS.The hospital's management said staff recruitment was being \"addressed with clear plans in place\".Mid and South Essex NHS Foundation Trust - which runs Basildon, Southend and Broomfield hospitals - has been rated as \"requires improvement\".The Care Quality Commission (CQC) turned up for an unannounced inspection last year <https:\/\/www.bbc.co.uk\/news\/uk-england-essex-59479022> after concerns about standards were raised.The whistleblower told the BBC, on condition of anonymity, that colleagues still felt \"completely broken\" by their working environment.The experienced A&E nurse claimed \"every single shift\" was short-staffed by up to as many as five to eight nurses.\"My colleagues are suffering and are walking away from the profession as it is toxic here,\" she said.\"I am sure patients' long-term health is already suffering too. If somebody is critically ill, the longer you leave it to start their treatment, the less chance of recovery.\"It is awful. It is worse than I have ever known it. We have got so many people leaving.\"Conditions are terrible. The workload is unmanageable. The culture is appalling and staff do not feel supported.\"A different senior nurse told the Local Democracy Reporting Service <https:\/\/ldrs.org.uk\/> she had quit.\"I feel so guilty that I can't do what I want to do for patients - I had to resign,\" she said.\"I can't do my job any more.\"Tony Durcan, of the Royal College of Nursing, said: \"Staffing shortages pile extra pressure on the nursing staff who remain.\"The NHS Staff Survey for 2021 found that only 15.5% of registered nurses and midwives at Mid and South Essex NHS Foundation Trust believed there were enough staff for them to do their job properly, down from 31% the previous year.\"The Save Southend Hospital campaign group has claimed doctors' training sessions were \"usually cancelled\" due to staff shortages.By Nikki Fox, BBC East health correspondentStaffing shortages at A&E departments have led to long waits and ambulance handover delays across the country, but in Essex they have been particularly acute.A few weeks ago a nurse was filmed at the Princess Alexandra Hospital in Harlowtelling patients it would be up to 13 hours before they saw a doctor <https:\/\/www.bbc.co.uk\/news\/uk-england-essex-61730717>. Health Secretary Sajid Javid told the BBC \"it is not what anyone would want to see\". But still the A&E departments are stretched through the usually quiet summer.Attendances are up significantly. People are sicker because they haven't been treated quickly enough.The number of staff leaving Southend is worrying. When staffing roles remain unfilled, shortages put pressure on the system and there's only so much the remaining staff can take before they too burn out.In May, Southend West's Conservative MP Anna Firth called the situation \"totally unacceptable\" after counting 15 ambulances outside the hospital waiting to deliver patients - something which campaigners say is a regular occurrence.This can only be solved by finding ways to attract and retain good staff. That's difficult when there's a national shortage. New wards or clinics won't cut it if there's no-one to work in them.A spokesman for Mid and South Essex NHS Foundation Trust said: \"Staffing levels in A&E are reviewed regularly throughout the day to ensure that patients are receiving the best possible care.\"There have been many improvements made throughout the department since the CQC visit last year. Whilst there are still some challenges, such as staff recruitment, these are being addressed with clear plans in place.\"Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk"}