{"author":"By John Campbell","title":"Brexit: Jobs 'at risk' over failure to replace EU funds","news_category":"general","content":"Up to 1,700 jobs are at risk over the failure to replace EU funds that were lost after Brexit, a consortium of community groups have said.The ESF Peer Group provides employment support programmes in Northern Ireland.It was previously funded by the European Social Fund (ESF) but that money has not been fully replaced by the UK's Levelling Up fund.The group said it has been seeking a solution from Stormont and Westminster departments for more than a year.It is understood that part of the issue is how much \"match funding\" Stormont departments should provide.A government spokesperson said it has \"engaged widely with partners\" over the summer to develop an investment plan and will soon move into the implementation phase.The ESF had previously provided about £40m a year, which was 35% match-funded from Stormont, giving £54m in total.Next year sector experts are anticipating about £30m from the UK Shared Prosperity Fund, but no match funding has been confirmed from Stormont yet.Rev Andrew Irvine, the chairman of the ESF Peer Group and chief executive of East Belfast Mission, said the EU funding had been used to help vulnerable and disadvantaged people find work.\"Everyone accepts that the work of our members is invaluable to the most disadvantaged and marginalised in society who find it difficult to access employment,\" he added.\"If, however, we can't secure continuity in funding, the 1,700 people who provide this support will face a very uncertain future.\"Much good work has already taken place to secure funding, but a final agreement is still outstanding.\"There is a small window of opportunity to address these issues this week. If no solution can be reached, jobs and our support programmes will be lost.\"The consortium is due to meet with representatives from the UK government's Department for Levelling Up, Housing & Communities (DLUHC) on Friday.A government spokesperson said: \"Northern Ireland is benefiting from £49m through our Levelling Up Fund, which is empowering communities to drive change.\"This is on top of £127m allocation from the UK Shared Prosperity Fund to help those most vulnerable and furthest away from the labour market to secure sustainable employment, alongside other priorities.\"The Department for Levelling Up said they are also engaging with Stormont departments.This is not the first time that concerns have been raised about the impact of lost EU funds.The economic development agency Invest NI previously received substantial grants from an EU fund, the ERDF.That funding will no longer be available as a result of Brexit <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-55339227> and has not yet been fully replaced by the UK government.Earlier this year, a senior official at the Department for the Economy said that over the next three years more than £100m in core funding which would have come from the EU will no longer be available.The UK government has previously said that funding will \"ramp up\" over time so that total domestic UK-wide funding will at least match receipts from EU structural funds."}