{"author":"","title":"River sewage: Ilkley beauty spot 'blighted' by waste","news_category":"general","content":"Raw sewage has been released into a river at a Yorkshire beauty spot popular with swimmers, it has emerged.The sewage, including solid waste and sanitary products, spilled into the River Wharfe in Ilkley from an overflow outlet at a nearby treatment plant.Yorkshire Water said the amount released from its site on Ashlands Road was within the conditions permitted by the Environment Agency (EA).Resident Karen Shackleton said it was \"pollution on an industrial scale\".Yorkshire breaking news: Man's body found in ditch; Yorkshire band's pub gig after Bestival cancelled <https:\/\/www.bbc.co.uk\/news\/live\/uk-england-leeds-44980443>The 47-year-old, who lives in Ilkley, said sewage was being released regularly near the town's swing bridge and the storm tanks which should be used to catch the overflow were not being utilised.She photographed the waste on 16 July and alerted Yorkshire Water, which then cleared the debris.\"You can see a plume of sewage going down the river,\" she said. \"There are the stepping stones, children playing, it's unacceptable and Yorkshire Water is denying there's a problem.\"Yorkshire Water catchment manager Chris Page said: \"Our treatment works on Ashlands Road in Ilkley has an overflow which is essentially used as a relief valve, that allows heavily-diluted sewage to spill into the River Wharfe during storm conditions.\"If this relief valve did not exist to relieve pressure on our sewer network, the storm water could back up and flood customers' homes or gardens.\"He added: \"This overflow only activates when there's been heavy rainfall, and our technicians visit the site to check and clean up if necessary.\"Steve Fairburn from Ilkley Anglers Association has been monitoring the sewage issue for three years and said it is released almost every time it rains.He said anglers have pulled items from the river such as tampons and towels on their fishing lines.\"Yorkshire Water aren't doing anything that is illegal, the permit is 14 years old and it needs to be looked at again,\" he said.\"Perhaps if it was [reviewed] the conditions might be a lot more rigorous.\"In a statement, the EA said it \"frequently assesses operations at Yorkshire Water's Ilkley sewage treatment works against the conditions of its environmental permit, which is designed to protect people and the environment\".It urged anyone who sees untreated sewage in any part of the river to report it to their incident hotline."}