{"author":"By Theo Leggett","title":"Decision looms on future of Britishvolt gigafactory","news_category":"general","content":"Shareholders were due to vote on competing bids for the planned Britishvolt battery factory in Northumberland on Friday.The result will decide the future of the troubled site, intended to produce battery packs for electric cars.It was once touted by former Prime Minister Boris Johnson as a key part of his green industrial revolution.There are two competing bids for the project, which came close to going into administration in 2022.Britishvolt's ambitious plans for the site at Cambois, near Blyth, include high-power batteries produced for a lucrative and growing electric car market.But the £4bn project came close to collapse last year. Construction work was delayed as rising costs took a heavy toll on its finances.Now, investors in the scheme are looking at two takeover bids.The first comes from a consortium led by DeaLab group, a company owned by a little-known Indonesian banker.The second has been put forward by a group of existing shareholders.Both bids would value the business at a little over £30m, with commitments to make a further investment of nearly £130m later in the year.The government has promised funding too, but this will only become available once the project has made further progress.The construction of gigafactories is vital to the future of the British car industry.However, DeaLab Group is far from a household name. It describes itself as an \"alternative asset management and financial advisory firm\" that invests \"in a broad range of strategic projects and assets\".It says it has \"successfully acquired commitments for over $15bn of acquisitions , disposals and investments… in three geographical regions globally\". But it offers no details.The business is registered in the UK. Its latest accounts - which had been overdue before being filed on Tuesday - show assets of £5m, and three employees.Its founder, Rezo Eko Hendranto, is a former banker at JP Morgan in their energy and natural resources division, according to his Linkedin profile.He is also registered as the sole director of Barracuda Group - a company that says it wants to become a \"critical metals, new energy generation and storage producing platform\".Some of the advisers listed on DeaLab Group's website are known.One, Dwessi Natelagawa, is the brother of the former Indonesian foreign minister."}