{"author":"By Justin Harper","title":"Pokémon at 25: Rare cards trade for big money","news_category":"general","content":"Rare Pokémon cards are fetching six figures at auctions as the Japanese cartoon and video game series celebrates its 25th anniversary this weekend.The Pokémon franchise is more valuable than those of Star Wars and Harry Potter combined.A card game based on the Pokémon series was created in 1996 with millions playing and trading the cards globally.A rare first edition card set recently sold for more than $400,000 (£282,000).The Pokémon series, created by Japanese tech giant Nintendo along with games developers Game Freak and Creatures, turns 25 on Saturday.As part of these celebrations popular YouTube blogger, actor and boxer Logan Paul will open a box of rare cards. He told his fans he paid $2m for six sets after spending three months looking for unopened first edition Pokémon boxes.There are also a number of auctions dedicated to Pokémon cards taking place around the world.UK-based Richard Winterton Auctioneers is currently hosting an online auction of around 40 cards and sets.Among the highlights is an unopened boxset dating back to 1999\/2000 which is expected to fetch between£14,000 and £18,000.\"Values for Pokémon has absolutely skyrocketed in recent years. It's an absolute global phenomenon and there are many factors at play here - nostalgia perhaps, some people now with more resources than when they were children using that ability to acquire,\" Alex Keller, a spokesman for Richard Winterton Auctioneers, told the BBC.The boom has been helped by coronavirus pandemic lockdowns as people seek out games and activities from their childhoods.\"It's been growing more and more as more people sell their cards, open up more boxes on their channels making it rarer and driving further interest in it,\" said Joe Merrick, webmaster of Pokémon fan site Serebii.net.This video can not be played'I lost seven stone playing Pokemon'\"It's a big continual cycle which has had an unfortunate side effect of having people buy up the current products hoping for a long-term investment.\"A fire-flying character called Charizard is extremely popular. A single Charizard card in mint condition sold for $300,000 in January.But sealed box sets dating back two decades along with promotional cards from Japan often fetch the highest price.\"Obviously as they are still sealed no-one can say for sure what's in the container - and that just adds to the air of mystery,\" added Mr Keller.Among the most sought-after items is the Illustrator card. This was given away in a contest in Japan in 1997 and there's only around 40 copies of the card around.\"This is often the one you'll see as the highest selling card,\" said Mr Keller.When it comes to the condition and authenticity of cards, the industry standard is called the PSA grading, with a PSA GEM Mint 10 grade the highest level.\"Pokémon has made millions of cards so it really is all about doing the research and discovering where the real gems are,\" added Mr Keller.A new set was released last week called Shining Fates, featuring a collection of differently coloured Pokémon. These are already highly sought after."}