{"author":"","title":"What is climate change? A really simple guide","news_category":"general","content":"World temperatures are rising because of human activity, and climate change now threatens every aspect of human life.Left unchecked, humans and nature will experience catastrophic warming, with worsening droughts, rising sea levels and mass extinction of species.The world faces a huge challenge, but there are potential solutions.Climate is the average weather in a place over many years. Climate change is a shift in those average conditions.The rapid climate change we are now seeing is caused by humans using oil, gas and coal for their homes, factories and transport.When these fossil fuels burn, they release greenhouse gases - mostly carbon dioxide (CO2). These gases trap the Sun's heat and cause the planet's temperature to rise.The world is now about 1.1C warmer than it was in the 19th Century - and the amount of CO2 in the atmosphere has risen by 50% <https:\/\/www.noaa.gov\/news-release\/carbon-dioxide-now-more-than-50-higher-than-pre-industrial-levels#:~:text=Carbon%20dioxide%20measured%20at%20NOAA%27s,of%20California%20San%20Diego%20announced>.Temperature rises must slow down if we want to avoid the worst consequences of climate change, according to climate scientists. They say global warming needs to bekept to 1.5C by 2100 <https:\/\/www.bbc.co.uk\/news\/science-environment-45678338>. However, unless further action is taken, the planet could still warm by more than 2C <https:\/\/www.metoffice.gov.uk\/weather\/climate-change\/effects-of-climate-change> by then. A 2021 report by the independent Climate Action Tracker group calculated that the world was heading for2.4C of warming by the end of the century. <https:\/\/www.bbc.co.uk\/news\/science-environment-59220687>If nothing is done, scientists think global warming could exceed 4C <https:\/\/www.carbonbrief.org\/what-is-a-4c-world> in the future, leading to devastating heatwaves, millions losing their homes to rising sea levels, and the irreversible loss of plant and animal species.Extreme weather events are already more intense <https:\/\/www.bbc.co.uk\/news\/science-environment-58073295> across the globe, threatening lives and livelihoods.With further warming, some regions could become uninhabitable, as farmland turns into desert <https:\/\/www.bbc.co.uk\/bitesize\/guides\/zpnq6fr\/revision\/4>. East Africa just saw its fifth season of failed rains, which theUN's World Food Programme says <https:\/\/www.wfp.org\/news\/horn-africa-cannot-wait-wfp-scales-assistance-historic-drought-raises-famine-threat> has put up to 22 million people at risk of severe hunger.Extreme temperatures can also increase the risk of wildfires - as seen in Europe last summer.France and Germany recorded <https:\/\/www.bbc.co.uk\/news\/58159451> about seven times more land burnt between January and the middle of July 2022, compared with the average.Hotter temperatures also mean that previously frozen ground will melt in places like Siberia, releasing greenhouse gases trapped for centuries into the atmosphere, further worsening climate change.In other regions, extreme rainfall caused historic flooding last year - as seen in China, Pakistan and Nigeria.People living in developing countries are expected to suffer the most as they have fewer resources to adapt to climate change. But there isfrustration from these nations as they have produced <https:\/\/blogs.worldbank.org\/climatechange\/getting-it-right-development-we-do-not-have-choose-between-people-and-climate> the least greenhouse gas emissions.The planet's oceans and its habitats are also under threat. Research published in April 2022 <https:\/\/www.science.org\/doi\/10.1126\/science.abe9039>, funded by the US National Oceanic and Atmospheric Administration, suggests that between 10% and 15% of marine species are already at risk of extinction.In a warmer world, land animals will also find it harder to find the food and water they need to live. For example, polar bears could die out as the ice they rely on melts away, and elephants will struggle to find the 150-300 litres of water a day they need.Scientists believe at least 550 species could be lost this century <https:\/\/www.bbc.co.uk\/news\/science-environment-54034134> if action is not taken.Climate change will have different effects across the world. According to the UN climate body, the IPCC <https:\/\/www.ipcc.ch\/report\/ar6\/wg2\/about\/factsheets\/>, if global temperature rise cannot be kept within 1.5C:Countries agree climate change can only be tackled by working together, and in a landmark agreement in Paris in 2015 <https:\/\/www.bbc.co.uk\/news\/science-environment-35073297>, they pledged to try to keep global warming to 1.5C.In November 2022, Egypt hosted a summit for world leaders, called COP27, where countries came together to make new commitments to tackling climate change.Many countries have pledged to get to \"net zero\" by 2050. This means reducing greenhouse gas emissions as much as possible, and balancing out remaining emissions by absorbing an equivalent amount from the atmosphere.Experts agree that this is still achievable <https:\/\/www.iea.org\/reports\/net-zero-by-2050>, but requires governments, businesses and individuals to make substantial changes now.Major changes need to come from governments and businesses, but scientists say some small changes in our livescan limit our impact on the climate <https:\/\/www.bbc.co.uk\/news\/science-environment-52719662>:Top image from Getty Images. Climate stripes visualisation courtesy of Prof Ed Hawkins and University of Reading."}