{"author":"By Jonathan Amos","title":"The 'painted wolves' of Zimbabwe","news_category":"general","content":"They are stunning; there's no question. And the name, \"painted wolves\", seems so apt.Their dappled tan and black fur, shot through with flashes of white, dazzles in the sunlight.You're going to become very familiar with these creatures; you may even fall in love with them, because they will feature inDavid Attenborough's new blockbuster TV series, Dynasties <https:\/\/www.bbc.co.uk\/programmes\/p06mvmmr>. The BBC spent months filming the endangered African wild dogs of Mana Pools National Park in Zimbabwe, and wildlifephotographer Nick Dyer <https:\/\/www.nicholasdyer.com\/index> says viewers will be enthralled by the result.The former London fund manager and marketing executive now dedicates his time and his camera to promoting the animals' conservation, walking with three packs as they roam the floodplain of the Zambezi River.\"During the day, they're mostly asleep but when they wake up, they leap and dance with absolute joy,\" he tells me. \"They have this great social bonding thing we call a greeting ceremony. They're so full of play, especially with their pups, so they're always chasing and pulling each other's tails, which is really great fun to watch.\"The first thing you need to know about painted wolves is that they're not wolves, nor, as their more boring name suggests, are they dogs.Some readers may find the next image distressingThey're in a separate evolutionary group from these more familiar canids. Lycaon pictus is their scientific name, which means something like \"painted wolf-like\".But they certainly behave much like wolves and dogs. Lots of movement and lots of noise.\"They have several calls, but perhaps the most endearing sound they make is the hoo call,\" explains Nick.\"If they get separated from the pack, they put their head low and make this 'hoo, hoo' noise, which is an incredibly haunting sound, but that sound can travel up to 2km and with their big ears they can pick it up, and that reunites the pack.\"Whisper it quietly, they're also just a bit smelly. Nick recalls watching one animal regurgitate a meal of impala antelope and roll in it.A second animal then ate the vomit, before bringing it back up and also rolling in it. A scent to camouflage a hunting expedition, perhaps.\"They have a reputation for being Africa's most effective hunters, with, they say, up to 80% of their hunts ending in a kill. Personally, I think that's a bit high, but it's definitely well above that of a lion or a cheetah or a leopard.\"One reputation the wild dogs have long tried to shrug off is that of being \"vermin\".European settlers in Africa systematically persecuted the animals, accusing them of taking down livestock.A hundred years ago, there were half a million painted wolves across the continent. Today, they number perhaps just over six thousand.This video can not be playedNick Dyer: \"You would get a reward of 20 shillings if you brought some magistrate a tail\"In the big parks, they're protected, but where they range close to humans they still suffer the consequences - caught in bushmeat snares or becoming roadkill.Catching diseases off domestic dogs also takes a toll. Nick has recently been back in London to celebrate the annual Wildlife Photographer of the Year (WPY) competition <http:\/\/www.nhm.ac.uk\/visit\/exhibitions\/wildlife-photographer-of-the-year> run by the Natural History Museum.His entry, Ahead Of The Game, was highly commended. And quite shocking. At first glance, it's just a couple of pups bouncing along together. On second glance, you realise the leading youngster has the face of a baboon in its mouth.The monkeys are not the natural prey of wild dogs but a population boom in Mana Pools means the baboons are suddenly now on the opportunistic menu.Nick, who does a lot of his work through the Painted Wolf Foundation <https:\/\/paintedwolf.org\/>, wasn't directly involved in the new Attenborough series but photographed the dogs alongside the BBC team.He's really hopeful the footage that's been captured will stir the public's interest in conservation.\"The BBC (programme) will probably be seen by a billion people and this myth of them being just savage hunters will be dispelled. I want them to see the beauty of this incredible animal and that it's really worth saving.\"Dynasties begins on Sunday 11 November on BBC One at 20:30 GMT. The painted wolves feature in the fifth programme in the series. Nick'sWPY image is currently on display <http:\/\/www.nhm.ac.uk\/visit\/exhibitions\/wildlife-photographer-of-the-year> at the Natural History Museum. He has also put a book together of his best pictures to support thePainted Wolf Foundation <https:\/\/paintedwolf.org\/>.Jonathan.Amos-INTERNET@bbc.co.uk <mailto:Jonathan.Amos-INTERNET@bbc.co.uk> and follow me on Twitter:@BBCAmos <https:\/\/twitter.com\/#!\/BBCAmos>"}