{"author":"","title":"Menopause: HRT prescription cost cut welcomed by campaigners","news_category":"general","content":"This video can not be playedWomen celebrate the government's decision to cut the cost of HRT prescriptions in EnglandA cut to the cost of Hormone Replacement Therapy (HRT) prescriptions has been welcomed by campaigners.HRT is used to treat the symptoms of menopause, such as such as anxiety, hot flushes and insomnia.Labour MP Carolyn Harris was pushing for a law to make the menopause treatment free in England.The government would not go that far, but said women would only have to pay for the prescription once a year - saving up to £200 annually.Ms Harris welcomed the move and thanked \"menopause warriors\" for their support.In a tearful statement, the Swansea East MP added: \"What has happened today is only the beginning, I know, but we can do such great things together because that's what it is all about - looking after wonderful women.\"The menopause revolution is making a big difference.\"HRT can treat menopause symptoms by replacing hormones that are at a lower level for those approaching and experiencing it.While the NHS says the symptoms last around four years after someone's last period, one in 10 women experience them for up to 12 years.A prescription for HRT in England currently costs £9.35 - or £18.70 if a woman needs two types of hormones - and is often provided on a short-term basis, meaning the cost has to be paid every month or every three months.There is an option in England to pay for 12 months of prescriptions known as a pre-payment certificate, costing just over £108 a year, but in both Scotland and Wales, prescriptions are free.Under the government's proposal for England, HRT prescriptions will be made available on an annual basis, meaning someone only needs to pay the prescription charge once a year, reducing the cost by between £90 and £200.The government is holding discussions with NHS England to put the measures into practice, as well as looking into combining two hormone treatments into one prescription, which it says affects approximately 10% of women using HRT.Fifty-one year-old Adelle Martin's menopausal symptoms started when she was just 39, and working in finance. She went through the menopause itself three years later and says the experience affected everything about her life.\"It was like I was disappearing inside myself - I could be really, really tearful or really, really grumpy and that was really difficult for the people around me.\"When I was at work and with my team, I had to try hard not to cry and not to scream.\"She lost her confidence, suffered from mood swings and \"brain fog\". She also had the classic symptom associated with menopause - the hot flush.\"The hardest thing was looking in the mirror and not recognising yourself and that's what took me out of the boardroom,\" she said.\"The confidence had gone, I felt hot all the time, my skin, my hair... everything lacked. I felt like I just completely lost myself. At the time I didn't know what it was. It was the menopause.\"Relief came when Adelle asked to be put on hormone replacement therapy (HRT) which, she says, stopped her hot flushes and helped her think more clearly.Read more from Adelle here <https:\/\/www.bbc.co.uk\/news\/uk-politics-59081483>.Health Minister Maria Caulfield confirmed the government's proposals during a debate on the issue in the Commons and revealed the government would be starting a \"menopause taskforce\" to look into the issue further, inviting Ms Harris to be the co-chair.She also promised to make menopause a priority in the government's upcoming women's health strategy - due to be published by the end of the year.\"As a woman and a nurse, I am acutely aware of how challenging the symptoms of the menopause can be to live with,\" she said.\"Cutting the cost of HRT - which can be a lifeline to women severely impacted by menopause - is a great stride forward, but there is more to do.\"Women MPs from across the political spectrum spoke about their own experiences of the menopause during Friday's debate, including shadow health minister Liz Kendall.She described a \"terrifying sense of anxiety and panic\" after the symptoms started, but admitted she did not know what was happening to her.This video can not be playedLiz Kendall describes being exhausted and aching overnight as she has \"no idea what was going on\" with the onset of menopause.Ms Kendall's personal story saw Health Secretary Sajid Javid intervene to offer his support, adding: \"I think it's powerful to hear from her about her personal experiences and I do hope, especially after this debate but going forward, that the whole House can co-operate and do much more to help with this.\"Conservative MP Flick Drummond also welcomed the debate in the Commons, saying she had no idea about many of the other symptoms until she listened to an item about it onBBC Radio 4's Woman's Hour. <https:\/\/www.bbc.co.uk\/programmes\/p05tpw79>\"Suddenly everything became clear,\" she said. \"That brain fog, the insomnia, which I'm afraid hasn't gone away… and the anxiety as well, which was weepiness and feeling you couldn't cope with what was happening to you.\"Fellow Tory MP Jackie Doyle-Price said: \"If we had applied as much attention to vaginal [dryness] as we had to erectile dysfunction, we'd be much better off.\"We cant help but reach the conclusion that if this was happening to men we might be in a better place.\""}