{"author":"","title":"Refugees from Ukraine and Afghanistan treated differently, charity warns","news_category":"general","content":"A charity that helps refugees has said there is a big variation in how the UK helps people from different countries.The Harbour Project charity said many Ukrainians received immediate refugee status and lived in people's homes but Afghans were left in hotels for months.MP Robert Buckland countered: \"There's a lot of willingness out there to take in refugees, wherever they're from.\"The Home Office said it was helping both and it was \"wrong to set these vulnerable groups against each other\".However, The South Swindon Conservative MP highlighted the importance of integrating refugees into society as he acknowledged that some Afghans were still living in hotels nine months after their arrival.Ms Garrett said there should be no \"hierarchy of worthiness\" but the differences in refugees' integration into British society had \"come into stark focus in the last couple of months\".Some Ukrainian refugees were able to enter the country through schemes created by the government, whereas others had no safe route, she said.Some Afghans, who had been put up in hotels, were given an allowance of just £8 per week, she added.\"We want people to lead safe lives where they're not drawn into criminality or at risk of being exploited in other ways, but when we keep people in such poverty on such limited means, I fear that there's a high risk that that can happen\", she said.The charity, based in Swindon, said it was currently supporting 1,200 asylum seekers aged between new born and 76 years old, from 55 countries including Russia and Ukraine.Refugees from Afghanistan can seek support through the government's Afghan Relocations and Assistance Policy (ARAP) <https:\/\/www.gov.uk\/government\/publications\/afghan-relocations-and-assistance-policy\/afghan-relocations-and-assistance-policy-information-and-guidance> andAfghan Citizens Resettlement Scheme (ACRS) <https:\/\/www.gov.uk\/guidance\/afghan-citizens-resettlement-scheme>.Ukrainian refugees can seek help through the Homes for Ukraine scheme <https:\/\/www.gov.uk\/register-interest-homes-ukraine>.The Home Office said: \"Putin's brutal and barbaric invasion has meant we needed to move quickly to set up both the Ukraine Family scheme and the Homes for Ukraine scheme, so that people can find safety in the UK.\"At the same time, support for those under the ARAP and ACRS schemes continues, including processing cases.\"Up to 20,000 Afghan women, children and other at-risk groups will be provided with a safe and legal route to resettle in the UK and we are working as fast as possible to house everyone.\"Follow BBC West on Facebook <https:\/\/www.facebook.com\/pointswest>, Twitter <https:\/\/twitter.com\/bbcbristol> and Instagram <https:\/\/www.instagram.com\/bbcwest>. Send your story ideas to: bristol@bbc.co.uk <mailto:bristol@bbc.co.uk>"}