{"author":"By Vanessa Pearce & Steve Hermon","title":"Autism diagnosis like a moment of clarity, says Birmingham dad","news_category":"general","content":"A former paratrooper who was diagnosed with autism at 26 said it felt like a moment of clarity.Dan Barnes, from Birmingham, went through the assessment process after his young son was diagnosed with Autistic Spectrum Disorder.Mr Barnes is also one of seven brothers with \"varying degrees\" of autism.\"It's really tough, I've also got a one-year-old and she's just been referred by her health visitor to go through the process as well,\" he said.He is now receiving help and volunteering as part of the PURE project, a city scheme helping people with learning difficulties and disabilities into employment.\"I'm 26, I've gone through life without any support, and finding out about charities like Mencap and PURE has really opened my eyes to what help is out there,\" he added.\"Quite a few of my brothers are on the spectrum with varying degrees of autism, ADHD, Asperger's, so I've got a lot of experience with that growing up as a kid.\"Things haven't always been easy,\" Mr Barnes said, describing the difficulties in his family and dealing with school pressures before starting employment.After joining the British Army aged 18, he was medically discharged after an injury \"and then going into the world of work I had some difficulties,\" he added.Now working as a personal trainer, he said he was grateful for the help and support from the project.Raj Singh, a co-coordinator from Midland Mencap, which runs the scheme, said its aim was to support people \"furthest from the job market back into employment\".\"Making sure that when they get up in the morning there's something they're passionate about.\"Mr Barnes said he was going to carry on \"moving forwards\" and continue to help raise awareness about autism.\"The more people that are aware of the charities, as well as the conditions and how they affect people, the more people will have that acceptance because they'll understand,\" he said.Follow BBC West Midlands on Facebook <https:\/\/www.facebook.com\/MidlandsBBC\/>, Twitter <https:\/\/twitter.com\/bbcmtd> and Instagram <https:\/\/www.instagram.com\/bbc_midlands\/?hl=en>. Send your story ideas to: newsonline.westmidlands@bbc.co.uk <mailto:newsonline.westmidlands@bbc.co.uk>"}