{"author":"By Charlie Jones","title":"Coronavirus: Young boy's lockdown art project goes global","news_category":"general","content":" Artists across the world have come forward to help a young boy with his lockdown painting project.Noah, who has hydrocephalus, epilepsy and cerebral palsy, was painting on pieces of cardboard, when his father had an idea.He posted on social media, asking artists to finish the pictures Noah had started at their home in Dedham, Essex.More than 100 artists have got involved so far and the work will be auctioned off for the NHS.His father Nathan Jones said he was very proud of his son and the \"beautiful\" pieces of art that had come out of the collaborations.\"It was just something to keep us busy because Noah can't go to school due to coronavirus, but it has escalated from there,\" he said.\"It is a big family effort. Noah paints the background, then our other son Reuben helps cut out labels and we send it to the artist to finish and they post it back.\"He gets so excited when he opens the post.\"We are amazed so many people want to be involved with our little boy, it gives me a lump in my throat when I think about it.\"The family hope to exhibit the work at Colchester General Hospital, where Noah is treated, and plan to hold an auction to raise money for the children's ward.\"The prognosis was not good when he was born but he is now a strong, happy little boy, who has defeated all the odds and is a joy to be around.\"This is our way of saying thank you to the doctors who have played a huge part in his life,\" he said.Mr Jones and his wife Laura, who is an art teacher, regularly take their children to street art exhibitions.Mainly street artists have taken part so far but other types of artists have also come forward, from countries including the UK, Colombia, Italy, Spain, France, Sweden, Germany, the US and Australia.The artist My Dog Sighs said he loved the idea of working with Noah to create a collaborative piece of artwork.\"Art can be a powerful tool for good. Not only do Noah and I both get a kick out of creating the work, it has the opportunity to raise a few smiles by being displayed at the hospital and ultimately raise a few quid for the ward.\"I just hope Noah thinks my work holds up to his high standards,\" he said.Mr Jones said anyone interested in the project could follow Noah on his Instagram account,background_bob <https:\/\/www.instagram.com\/background_bob\/?hl=en>.Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}