{"author":"","title":"Vladimir Putin: Russia's action man president","news_category":"general","content":"Russian President Vladimir Putin, a judo black belt, appears to symbolise two of the martial art's key qualities - guile and aggression.His swift military interventions in both Ukraine, annexing Crimea in March 2014, and Syria, bombing anti-government rebels in a move that bolstered Syrian government forces, stunned many observers.Mr Putin, 68, has made no secret of his determination to reassert Russian power after years of perceived humiliation by the US and its Nato allies.He has been in power since 2000 - the longest-serving Kremlin leader since Soviet dictator Joseph Stalin, who died in 1953. Mr Putin was re-elected for six years in 2018.A controversial national vote on constitutional reforms has given him the opportunity to stay in power beyond his current fourth term, which ends in 2024. He could remain in the Kremlin until 2036.Independent monitoring group Golos called it \"a PR exercise\" with many violations. <https:\/\/www.bbc.co.uk\/news\/world-europe-53255964>Critics see in Mr Putin traits from the Soviet era that shaped his world view. He was a KGB spy before his meteoric rise in the chaos of the USSR's collapse. Many of his close aides and friends have, or had, secret service connections.He has restored Soviet-style pageantry for military parades, and Stalin portraits, once banned, have reappeared.Russia's widely exported Covid vaccine is called Sputnik V, after the Soviet Sputnik satellite that stunned the West back in 1957.Mr Putin famously described the USSR's collapse as \"the biggest geopolitical catastrophe of the [20th] Century\". He bitterly resents Nato's expansion up to Russia's borders.This video can not be playedWill Putin rule Russia forever? A look at his 20 years in power (video from 2020)The new build-up of Russian troops around Ukraine - described by Nato as the biggest since 2014 - has rekindled Western suspicion of Mr Putin. Relations are now as frosty as they were in the Cold War.US President Joe Biden described Mr Putin as a \"killer\" - shortly before imposing a new round of sanctions on Russia, for alleged meddling in last year's US presidential election, large-scale cyber hacking and bullying of Ukraine.The US sanctions in April 2021 <https:\/\/www.bbc.co.uk\/news\/technology-56755484> targeted 32 Russian entities and officials, adding to an already long list under Western sanctions. And the US expelled 10 Russian diplomats.The Kremlin has repeatedly denied the Western charges of election interference and hacking. After the 2016 US presidential election, US prosecutors accused a longstanding Putin ally -oligarch Yevgeny Prigozhin <https:\/\/www.bbc.co.uk\/news\/world-europe-50264747> - of orchestrating Russian interference, mainly on social media, to favour Donald Trump.Mr Trump expressed admiration for Mr Putin, but it is all change now under President Biden.The West also accuses Mr Putin of helping pro-Russian rebels in eastern Ukraine with heavy weapons and troops. He admits only that Russian \"volunteers\" have gone there to help.Mr Putin fumed over what he called the \"coup\" that forced Ukraine's then-President Viktor Yanukovych to flee to Russia in February 2014.Since March 2014 the EU and US have expanded sanctions on key Russian officials and firms over Russia's military role in Ukraine. <http:\/\/www.bbc.co.uk\/news\/world-europe-26672800>The sanctions blocked Western travel and financial services for many of Mr Putin's aides.Mr Putin appears to relish his macho image, helped by election stunts like flying into Chechnya in a fighter jet in 2000 and appearing at a Russian bikers' festival by the Black Sea in 2011.The Night Wolves bikers' gang played a prominent role in whipping up patriotic fervour during Russia's takeover of Crimea in 2014.But Mr Putin has also shown a gentler side on Russian state media, cuddling his dogs and helping to care for endangered Amur tigers.A survey by the respected Russian Levada Center in February 2021 <https:\/\/www.levada.ru\/en\/2021\/03\/01\/attitude-to-the-new-term-of-vladimir-putin\/> suggested that 48% of Russians would like Mr Putin to remain as president beyond 2024.That figure would be envied by many Western politicians, though it could suggest that many simply see Mr Putin as a safe bet. He scored political points for keeping Russia relatively stable after the post-communist chaos of the 1990s.Besides restoring widespread national pride, Mr Putin has allowed a middle class to emerge and prosper, though Moscow still dominates the economy and there is much rural poverty.His popularity among older Russians is markedly stronger than among the young. The latter have grown up under Mr Putin and many of them appear to thirst for change.Thousands of young Russians demonstrated nationwide in January 2021 in support of Alexei Navalny, Mr Putin's arch-critic, who was arrested immediately after returning from Berlin.They were Russia's biggest street protests in recent years, and the police cracked down hard, detaining several thousand.Navalny made a name for himself by exposing rampant corruption, labelling Mr Putin's United Russia as \"the party of crooks and thieves\".Millions watched a Navalny video about \"Putin's palace\", a luxury Black Sea estate allegedly gifted to Mr Putin by wealthy friends. Arkady Rotenberg, a billionaire close to Mr Putin,later claimed to be the owner.  <https:\/\/www.bbc.co.uk\/news\/world-europe-55872249>Navalny is now in poor health in jail, convicted controversially over an old embezzlement case. His Anti-Corruption Foundation (FBK) and Western governments called the trial politically motivated and the European Court of Human Rights ruled he should be released from jail because of the risk to his life.Navalny is another key reason why Mr Putin's relations with the West are so bad now.Last August he narrowly survived a Novichok nerve agent attack, which Western governments later blamed squarely on Mr Putin's Federal Security Service (FSB). Mr Putin headed the FSB before becoming president.Novichok - a Russian weapons-grade toxin - was also used to poison Russian ex-spy Sergei Skripal and his daughter Yulia in England in 2018. Russian state agents were blamed for that too. The Skripals survived, but a local woman died.Mr Putin denied any links to those and other attacks on prominent political opponents.Vladimir Putin grew up in a tough, communal housing block in Leningrad - now St Petersburg - and got into fights <https:\/\/www.opendemocracy.net\/article\/yes\/putin-mentality-of-a-street-fighter> with local boys who were often bigger and stronger. That drove him to take up judo.According to the Kremlin website, Mr Putin wanted to work in Soviet intelligence <http:\/\/eng.putin.kremlin.ru\/bio> \"even before he finished school\".\"Fifty years ago the Leningrad street taught me a rule: if a fight is inevitable you have to throw the first punch <http:\/\/echo.msk.ru\/blog\/day_video\/1645224-echo\/>,\" Mr Putin said in October 2015.It was better to fight \"terrorists\" in Syria, he explained, than to wait for them to strike in Russia.He also used the crude language of a street fighter when defending his military onslaught against separatist rebels in Chechnya, vowing to wipe them out \"even in the toilet\".The mainly Muslim North Caucasus republic was left devastated by heavy fighting in 1999-2000, in which thousands of civilians died.Georgia was another Caucasus flashpoint for Mr Putin. In 2008 his forces routed the Georgian army and took over two breakaway regions - Abkhazia and South Ossetia.It was a very personal clash with Georgia's then pro-Nato President, Mikheil Saakashvili. And it showed Mr Putin's readiness to undermine pro-Western leaders in former Soviet states.Putin still in fashion 15 years on <https:\/\/www.bbc.co.uk\/news\/world-europe-32076836>Vladimir Putin's formative German years <https:\/\/www.bbc.co.uk\/news\/magazine-32066222>Church lends weight to Putin patriotism <https:\/\/www.bbc.co.uk\/news\/world-europe-33982267>Putin, power and poison: Russia’s elite FSB spy club <https:\/\/www.bbc.co.uk\/news\/world-europe-42636245>Mr Putin's entourage is a fabulously wealthy elite and he himself is believed to have a huge fortune. He keeps his family and financial affairs well shielded from publicity.The Panama Papers leaks in 2016 exposed a murky network of offshore companies owned by a longstanding friend of Mr Putin - concert cellist Sergei Roldugin. <http:\/\/www.bbc.co.uk\/news\/world-europe-35918845>Mr Putin and his wife of Lyudmila got divorced in 2013 after nearly 30 years of marriage. She described him as a workaholic.According to a Reuters news agency investigation, Mr Putin's younger daughter, Katerina, is thriving in academia <http:\/\/www.reuters.com\/investigates\/special-report\/russia-capitalism-daughters\/>, has a top administrative job at Moscow State University and performs in acrobatic rock 'n' roll competitions.The elder Putin daughter, Maria, is also an academic, specialising in endocrinology.Reuters found that several other powerful figures close to Mr Putin - often ex-KGB - also have successful children in lucrative management jobs.The 2014 Winter Olympics in Sochi was a lavish showcase for the Putin era: it cost Russia an estimated $51bn (£34bn) - the highest price tag for any Olympics.He is passionate about ice hockey, like judo - and state TV has shown his skills on the ice.Mr Putin's brand of patriotism dominates Russia's media, skewing coverage in his favour, so the full extent of opposition is hard to gauge.Even in 2008-2012, as prime minister under President Dmitry Medvedev, he was clearly holding the levers of power.In his first two terms as president, Mr Putin was buoyed by healthy income from oil and gas - Russia's main exports.Living standards for most Russians improved. But the price, in the opinion of many, was the erosion of Russia's fledgling democracy.Since the 2008 global financial crisis Mr Putin has struggled with an anaemic economy, hit by recession and more recently a plunge in the price of oil. Russia lost many foreign investors and billions of dollars in capital flight.Mr Putin's rule has been marked by conservative Russian nationalism. It has strong echoes of tsarist absolutism, encouraged by the Orthodox Church.The Church supported a ban on groups spreading gay \"propaganda\" among teenagers.Soon after becoming president Mr Putin set about marginalising liberals, often replacing them with more hardline allies or neutrals seen as little more than yes-men.Yeltsin favourites such as the oligarchs Boris Berezovsky and Vladimir Gusinsky ended up as fugitives living in exile abroad.International concern about human rights in Russia grew with the jailing of oligarch Mikhail Khodorkovsky, once one of the world's richest billionaires, and of anti-Putin activists from the punk group Pussy Riot.Mr Putin's relations with the UK soured over the 2006 radioactive poisoning of anti-Putin campaigner Alexander Litvinenko in London <http:\/\/www.bbc.co.uk\/news\/uk-35371344>. Agents of the Russian state were accused of murdering him."}