{"author":"By Ben Schofield & Pete Cooper","title":"Ukrainian refugees: The Cambridgeshire village rallying to help","news_category":"general","content":"Thousands of Ukrainian refugees have arrived in the UK since the start of the Russian invasion.Many have joined friends and family, but others are staying in the houses of people they met through the Homes for Ukraine scheme.In Buckden in Cambridgeshire, a weekly event have been set up for 50 refugees who are now living in and around the village where families can meet, share a meal and get support.What are the residents and businesses doing to help refugees feel part of the community, and what do Ukrainians make of it?Jason Negus has owned the butchers in Buckden, which has about 3,000 residents, for 11 years.He says last week he donated \"pork-based products, like pork chops and pork belly slices\" for the weekly meal, while this week it will be chicken.\"It's a collaboration between lots of different businesses who are donating to make this meal happen,\" he says.The butcher says he wanted to help because \"you're seeing all of those people, they're out of their homes and they've lost their loved ones\".\"Let's pull together and make it work for them,\" he says.\"I hope it takes the pressure off them and I hope it brings people together in this country as one.\"Marcin Laskowski runs an artisan bakery in nearby Huntingdon which specialises in east European and German products.He says he wants to help \"because it's a very difficult time; [the invasion] was a shock; we've got plenty of Ukrainian friends so we want to try and help a little bit\".The bakery had previously sent 90 pallets of products to Poland for Ukrainian refugees and now they are providing doughnuts and pastries for the weekly meal.Mr Laskowski says that includes traditional Ukrainian poppy seed pastries and dumplings.The baker, who is originally from Poland, says: \"Nobody thinks about war in 2022; it's very difficult for everyone.\"He hopes the pastries allow the refugees to \"remember some tastes from their country and just for a few minutes forget about the situation\" there.Alex Hucklesby has been hosting a family of three in his home in Godmanchester for three weeks now.\"It has been hectic since they arrived, in terms of integrating more people into our already busy household, but also all the paperwork and bureaucracy that we've had to go through to get them what they need in the UK,\" he says.He adds that getting the visa was \"quite a challenge\" and they have also had to apply for universal credit, doctors, dentists, a midwife and make school applications for the refugees.\"As soon as we heard about the conflict in Ukraine we decided we want to do something, and as soon as the government launched the Homes for Ukraine scheme my wife and I decided we wanted to welcome a family into our home,\" he says.\"We discussed it with our children and they agreed to share rooms to free up space in the house and we took it from there.\"He says the weekly meal is \"fantastic for [the refugee family] to meet other Ukrainians in Huntingdonshire\".\"People have been so welcoming and so helpful with donations of food and assistance, it's been incredible how the community has pulled together,\" he says.Nataliya Rudyk is staying with the Hucklesbys, along with her 12-year-old daughter and 7-year-old son.The 37-year-old was a human rights lawyer in Ukraine and also taught students with special needs.She says after Russian rocket strikes near her home in the south-west of the country, it was \"very dangerous for me and my family, I understood I needed to go to another country\".\"I am pregnant and my husband said go to the UK,\" she says.The mother-of-two says: \"Now I have two very good friends, my sponsors Alex and [his wife] Maria, I am happy I live in his house, his family is very friendly, he helps me every day.\"She says the weekly meal is \"amazing for Ukrainian people\".\"It's very important for us because we can speak in Ukrainian and talk about our problems, talk about our decisions, like schools,\" she says.Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}