{"author":"By Manish Pandey","title":"Esports: The female Call of Duty gamer making history","news_category":"general","content":"\"I think people need to realise that gaming is not just sitting at your desk all day.\"Kelsie Grieg, or Kels as she's known in the gaming world, made history when she became the first woman to qualify for the Call of Duty Challengers Elite tournament.But her journey to being a history maker has been far from smooth and simple.The 22-year-old from Scotland only got into gaming \"by accident\", after an injury put an end to her aspiring football career.\"I ended up meeting people who are currently in esports, professional gamers. And then I was introduced to the big world of esports,\" she tells BBC Newsbeat.\"I didn't realise how easy it was to meet people. And I wasn't too bad at it, so it made a difference.\"But being in a male-dominated environment meant Kels wasn't accepted straightaway, with doubts from other men over how good a female player could be.\"People do tend to see gender as an issue, or at least did back then,\" she says.\"So that was quite a struggle. I had to prove myself and it took me a long time to prove myself.\"\"There's a lot of discrimination and you do have to be thick skinned.\"This video can not be playedEsports: Why are there so few professional women gamers?According to esportsearnings.com, there are no female players in the top 400 earners and only a tiny fraction of the millions being won in competitions around the world is going to women.And it took a while for Kels to realise the significance of her qualification for the Challengers Elite.\"I didn't see it as making history, until I woke up [the next day],\" she says.\"And I was like wait a minute a female just qualified for the Elite and that female was me.\"It was incredible. But the main thing I've taken from it is if I can do it, hopefully other females can.\"I might be the first female to do it but hopefully I'm not the last. And it just means the world.\"The esports market is estimated to grow to be worth $1.9bn (£1.4bn) by 2025.Hundreds of millions of people play and watch worldwide, with plenty of big brands involved in partnerships, and it was also showcased at the Commonwealth Games.\"Going to events, travelling, playing for money. Just even getting this from gaming is incredible,\" Kels says.\"If you're not into gaming, I don't think you realise how big it is and how much you could do with it.\"When it comes to making a career out of esports, Kels says there was a big split between receiving support and being told to \"get a real job\".\"My family are supportive with what I do but it's just like don't put all your eggs in one basket, which I can understand,\" she says.\"Especially back then, gaming was [seen as] just a hobby. Whereas now it's growing.\"And Kels says video games have had a positive impact on her.\"I used to struggle with confidence, but esports has helped with that. Meeting people, getting these opportunities, it's helped me.\"Follow Newsbeat on Twitter <https:\/\/twitter.com\/BBCNewsbeat> and YouTube <https:\/\/www.youtube.com\/channel\/UCe1Ef-K5jpnRsmVY5hCBhOw>.Listen to Newsbeat live <https:\/\/www.bbc.co.uk\/sounds\/play\/live:bbc_radio_one> at 12:45 and 17:45 weekdays - or listen backhere <http:\/\/www.bbc.co.uk\/programmes\/b006wkry\/episodes\/player>."}