{"author":"","title":"London Olympics: Legacy flame to mark 10 years since 2012 Olympic Games","news_category":"general","content":"The mayor of London will light a \"legacy flame\" on 22 July to mark the 10th anniversary of the Olympic Games.Organisers said they hoped it would reawaken the \"feel good\" spirit felt by many across the country at the time.Lyn Garner, chief executive of the London Legacy Development Corporation (LLDC), said anniversary events would also be an opportunity to reflect on the long-term regeneration of the area.Activities are being planned across the Olympic sites in east London. The details were announced as new research suggested most people believed it was right to invest in the London Olympics.Ms Garner said: \"All of the venues will be working to bring the summer to life this year and remind us of the great year we had in 2012.\"The lighting of the flame on 22 July will be followed by a day of public activities at the site, such as live performances and workshops from the V&A, the BBC and Sadler's Wells - organisations which are to have new facilities at the Stratford site.A week later, Lee Valley Velo Park, home of the Olympic cycling events, will host some 2022 Commonwealth Games events.The venue will also host a free exhibition this spring telling the story of the Olympic legacy so far, organisers said.Ms Garner said a key pledge in the run-up to the games was the long-term regeneration of the area, which would be reflected in the celebrations.\"The legacy was always part of London's original the bid, a really important part of it,\" she said.\"We'll be thinking about what have we done, what have we achieved and what is still to come.\"Since 2012, two business districts have set up at the site, 25,000 jobs have been created there, and 11,000 home have been built.Another 20,000 homes are planned and a \"creative district\" including several university campuses will start opening this year.Several sporting venues have become popular facilities, such as the Copper Box, the London Stadium, which is now home to West Ham Football Club, and the Aquatics Centre.In addition, the 560 acre \"urban park\" is a popular local space for exercising and leisure activities and attracts six million visitors a year.Mr Garner said she hoped people from across the country would join the celebrations but that locals would be at the heart of them.\"First and foremost, this is an urban park. It's for east Londoners and we want to see them come and enjoy it locally\", she saidThe announcement of the events on Tuesday came as new research revealed commissioned by LLDC revealed that 95% of local people believe the park is an asset for the whole area, and 79% of people believe the games have benefitted people in east London."}