{"author":"","title":"Ukrainian family are reunited after businessman offers them a home","news_category":"general","content":"A four-generation family of 10 have been reunited after fleeing Ukraine and moving to a home in the UK offered by a businessman.Mick Swinhoe, 52, said he bought the property in a village near Cambourne, Cambridgeshire, as a \"project\".He offered it to provide refuge to a Ukrainian family after a social media appeal, saying it was \"better use\".Valeriia, whose family moved in, said it was \"such a relief\" to arrive in the UK after fleeing war-torn Kharkiv.\"Maybe I can feel like I've got a home again,\" said the 37-year-old.\"I did so much, my family, for us to live there, to earn money, nice place to live, work for kids. We lost in one day everything.\"Valeriia said it was early in the morning when Kharkiv was attacked.She said they packed suitcases and went to her mum's house where they \"stayed five days in the basement without going anywhere\".\"Then we decided that we had to leave as we couldn't sleep, it was so scary. We just put our bags in the cars and went,\" she said.\"It was so scary but we managed to go through the borders and when we passed several cities, we felt relieved as we couldn't hear those bombs and those scary noises.\"The family, ranging in age from 10 to 90, have come to the UK under the Ukraine Family Scheme <https:\/\/www.gov.uk\/guidance\/apply-for-a-ukraine-family-scheme-visa> and were helped by a relative who is a British citizen.Eight family members took a flight from Albania to London Luton Airport, while Valeriia and her father came by car and ferry, arriving four days later with their belongings and two dogs.She said her journey took 20 days and they were \"exhausted\".However, she said she was \"so grateful\" to everyone supporting them. \"I feel that they're saving our lives,\" she said.Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk"}