{"author":"","title":"Powering Up Britain policy lands with a thump","news_category":"general","content":"Are you feeling any more secure about energy after the publication of the UK's energy security strategy? Does it feel like ministers have 'powered up Britain', as their document claims to do?If you're not, then you're not alone. Thousands of pages of 'Powering Up Britain' <https:\/\/www.gov.uk\/government\/publications\/powering-up-britain> policy have landed with a thump, and landed badly.Having ploughed through the felled forest of paperwork, there is some welcome for acknowledgement of the breadth of the challenge, including the capacity of the grid and delays in connecting to it - one of the main pinch points. There is some more money for insulating homes.But the industries which are required to make this transition a reality are underwhelmed by the vision, looking for the clarity and support they need to invest, and exasperated by the lack of urgency.You may recall the vast Acorn project <https:\/\/www.bbc.co.uk\/news\/uk-scotland-north-east-orkney-shetland-65122059> planned for Aberdeenshire carbon capture, utilisation and storage (CCUS), along with hydrogen production. Putting it in the fast track for development was seen as a no-brainer.But two projects in north-west and north-east England were put into phase one, and Acorn was put on hold.There were high expectations that would change, though less so from those who see CCUS as something of a diversion from the true path towards net zero greenhouse gases.This technology allows the extraction of oil and gas to continue with partial mitigation, so it remains contentious, an expensive way of reducing emissions, and a gamble for the UK to go big on it.As you can see from the careful wording from Scotland Office minister John Lamont, alongside the Powering Up Britain publication, the expectations of CCUS enthusiasts are looking premature, again:\"I am delighted that the UK government has launched Track-2 of the CCUS cluster sequencing process, and the Acorn Transport and Storage System in Aberdeenshire has been confirmed as one of the two best-placed to deliver this.\"The hopes for this project, over several years, have seen a lot of these hurdles, and they keep being moved.One problem, says business, is a government which has not given itself sufficient financial headroom to meet the scale of the challenge.It is now alert to the threat of the United States and the European Union finding a lot of fiscal headroom to make bold strides towards the green energy transition.The way industry sees it, Britain has instead taken a bold stride towards publishing a timeline for when it might make bolder strides than the ones so far.The finance sector is content to be part of the story being laid out. Scottish Financial Enterprise, which represents the sector north of the Cheviots, responded that \"a focus on delivery and maintaining momentum is now vital\".It added: \"Over the coming year, we are very keen to work with Scottish and UK governments to develop the clear role that Scotland's world class financial and related professional services industry can play.\"There are a lot of financial assets to be managed in the direction of the green transition. But these are assets with global ambitions, and they will go where the prospects are most promising.America's Inflation Reduction Act, with more than £300 billion-worth of government loans, subsidies and grants for the energy transition, makes for a compelling investment case. As with Europe, a market of that scale can provide the confidence for those in the supply chain to invest.In the UK, that remains a blockage. Without orders, companies are unwilling to invest in capacity. Without the capacity for very large-scale manufacturing, green industry developers are unwilling to place their orders here.It's the puzzle of whether the capacity chicken or the procurement egg comes first. And it remains the case that the scale of the UK government's vision falls some way short of getting the capacity in place, while the US and perhaps the EU do so.Scottish Renewables, the trade body, has contrasted the £4bn estimate for getting Britain's ports ready for the marine energy boom that's already under way with the £160m available to help with port facilities and floating turbine manufacturing.\"It falls woefully short of what we need,\" says its head of energy transition and supply chain, Emma Harrick. \"We need meaningful investment and we need it now.\"Her boss, chief executive Claire Mack, takes on the bigger picture, commenting: \"Scotland has the most seabed dedicated to develop commercial floating wind anywhere in the world.\"However, more than three Scottish ports urgently need to be transformed into new industrial hubs to ensure we have the necessary supply chain and manufacturing bases required for mass floating wind deployment by the end of this decade.\"Today's announcements should have been a defining moment for the UK - a chance to encourage the necessary investment to deploy the renewable energy projects required to safeguard our energy security, cut bills for consumers and meet our net-zero targets.\"It is unacceptable that they have fallen so far short.\"Nothing announced today comes close to repairing the damage caused by recent policy decisions from the UK government which have discouraged that investment in clean power projects at the very time the UK needs it most.\"Ms Mack is referring to the windfall tax imposed on electricity generators for the large profits they have been making for the operation of older wind and nuclear assets.It's hard to find much sympathy for energy giants. The new first minister Humza Yousaf says he'll squeeze more tax out of them, as does Labour, if it wins power at Westminster.High tax can be tolerated. It is in Norway. But unpredictable tax grabs infuriate the industry. That's the same message from the oil and gas sector, where tax on profits from UK production last year went up from 40% to 75%, and show no signs of coming down before 2028, even if the profits do.Offshore Energies UK (OEUK) says there's a need to rebuild investor confidence, but no signal in the Powering Up documents that the UK government is responsive to that.These taxes are \"a major deterrent for investors and OEUK continues to make the case that delivering energy security and net zero today and in future is made much harder by the lack of clarity on when the windfall taxes will go,\" says chief executive David Whitehouse.\"The same issue applies to offshore wind operators who face a similar windfall tax. Together these taxes risk turning the North Sea, which should be the bedrock of the UK's energy security, into an unattractive place to invest.\"The energy industry has been very canny at encouraging politicians to set ever more ambitious targets for the transition to net zero greenhouse gases. They can then hold the politicians to account for the regulation and subsidy to make those targets achievable.As the dates get nearer, reality dawns that the ambitions require difficult decisions for government and for industry. That's why the German government has pushed the EU into a change of tack, allowing its car makers to continue building cars for eco-fuels.The UK government seems to be throttling back on the green energy boosterism of the Boris Johnson era.But it is not just the energy industry doing the special pleading. The Institute of Directors speaks for many, notably in the small and medium-scale enterprise (SME) arena, who don't see this adding up yet.\"Despite the volume and detail of today's announcements, there is nothing obvious within these plans which matches the ambition of the US's Inflation Reduction Act,\" said the IoD's Alexandra Hall-Chen.\"It remains an open question as to whether the UK can offer the incentives for green investment that can sustain it as a leader in the global green economy.\"The Scottish government has a lot less flexibility on how much it commits to helping industry grab some of the opportunity. But there are important pinch points where it could make a difference.These include the speed of granting marine and other planning consents. There are severe skill shortages, which can be addressed with devolved powers.And at the other end of the energy industry, Scottish customers, like those elsewhere, need help with reducing their demand through improved energy efficiency, insulation of their homes and the switch away from gas heating."}