{"author":"","title":"South West Water website to update on sewage spills","news_category":"general","content":"South West Water is launching a new interactive map to update people on water quality at beaches.It follows criticism over how often the water company discharges sewage into the sea via storm overflow pipes.Member of parliament for East Devon Simon Jupp said South West Water still needed to \"clean up their act\".SWW said WaterFit Live would be a \"one-stop shop\" for all information about its network and the company wanted to be \"really open\" with its customers.Laura Flowerdew, chief customer officer for South West Water, said: \"We're really excited to be launching the website to give better information to customers and to be really open and transparent about how our waste water network operates.\"The site will give information on how our network is impacting bathing water across our designated bathing waters in the region and, importantly, it also shows what we're doing to improve the performance of our network by investing across all out bathing waters over the coming years.\"Ms Flowerdew added that the company's performance was \"really improving\". She said SWW had reduced its use of storm overflows by 50% over the bathing season in 2022, adding there was \"still more to do\".She said: \"We know customers really care about bathing waters across the region and we also really care about the environment so it's absolutely critical that we tell our side of the story and we show what we're doing to reduce the use of storm overflows.\"Daniel Green, from Bude, is a regular user of the town's tidal sea pool.He said: \"We love spending time down here all year round and having a nice clean environment on the coastline and in the sea pool is really important.\"Discharging waste into the local area just isn't acceptable really.\"Mr Jupp said real improvement would only come when SWW was able to share its real-time data from storm overflows, expected later this year.He said: \"What's being launched now is a good step forward because it clarifies all the data and also looks back at historical data from the last three years as well but it's not enough.\"I want to see South West Water launching their real-time information which will really help the public decide what they want to do, as quickly as possible.\"Mr Jupp said people in the South West paid the \"highest water bills in the country\".He added: \"We have a one-star rated water company which was fined £13m as a result of the government's new laws.\"South West Water need to clean up their act and our water.\"Izzy Ross, campaigns manager for Surfers Against Sewage, said the charity wanted to applaud water companies being more transparent about sewage discharge but she said it did not solve the problem.Ms Ross said: \"We need to actually see a reduction and eventually an end to sewage discharges from these sewage overflow pipes.\"Follow BBC News South West on Twitter <https:\/\/twitter.com\/BBCSpotlight>, Facebook <https:\/\/www.facebook.com\/bbcspotlight> and Instagram <https:\/\/instagram.com\/bbcspotlight>. Send your story ideas to spotlight@bbc.co.uk <mailto:spotlight@bbc.co.uk>."}