{"author":"By Sanchia Berg","title":"Postcode lottery for baby care orders - judge","news_category":"general","content":"\"I felt like the scum of the earth,\" said Jade, after her third child was taken into care. \"Everybody's looking down on you, you've just had a baby and they're taking it away from you.\"Jade - not her real name - had her first two children taken into care. She knew she might lose the third - but didn't expect to be summoned to a family court hearing just a couple of days after the baby was born.She is one of many mums who feel they did not have time to prepare for court.Her comments come as a new report obtained exclusively by the BBC has recommended a \"wholesale review\" of how care proceedings in England and Wales are conducted at birth, and warns that current practice might compromise parents' human rights.It also found that a mother's chances of having a care application made for her baby very shortly after it is born were far greater in the north-east of England and Yorkshire, than in London.Care order applications are usually made when social workers decide a mother is unable to look after her child on her own. The baby will probably go into foster care and it may be adopted.The former head of the Family Court, Sir James Munby, told BBC Radio 4's World at One that the report's findings revealed a \"deeply troubling postcode lottery\" .Sir James is now chair of the Nuffield Family Justice Observatory, which released the report.The research is based on eight years of court data involving more than 21,000 babies in England and Wales.It found there were more of these applications to take newborn babies into care than eight years ago.And it found these applications were increasingly issued at very short notice. The report says most care applications for newborns - babies under two weeks - offer seven days' notice or less, with the majority of these with one or two days' notice. This means that the mother has very little time to prepare for a hearing.The researchers also found significant variation between local authorities. In the north-east of England, the data indicated many more newborn babies were being taken in to care - rising from 34 per 10,000 live births in 2012\/13 to 83.1 per 10,000 in 2019\/20.And more of these applications were being made at the shortest possible notice - 41% were \"same day\" applications.In London, by contrast, there were far fewer applications to take newborns into care: 24.9 newborn babies per 10,000 live births in 2019\/20. And less than 10% of these were same day applications.Sir James added that more research was needed, saying: \"We now know what is happening but we know far too little about why.\"He said he believed the current approach was leading to miscarriages of justice over the removal of newborns, based on \"what I have seen, what I have heard from others what I have read about and a substantial amount of anecdotal material\".In the case of Jade, who is from the north-west of England but wished to remain anonymous, she said she was still bleeding and dressed in jogging bottoms and a T-shirt when she went to court.She said she could not bring herself to go into the courtroom, but sat outside, feeling \"like the scum of the earth\".Jade said she had only spoken briefly to her allocated solicitor, and did not know how to argue against the local authority's care application.She returned, dazed, to the hospital, only to discover her daughter had already been taken away.\"I went into the ward, into the room and she was gone. And I was told to stay there, until someone came to get me. I looked out of the window and in the car park I could see the social worker taking her in her babyseat to the car. \"For Jade, as for so many mothers in a similar position, it was as though her daughter had died. \"I think about her every day,\" she said. \"I grieve.\"Another mother, Tasia - not her real name, from London, was devastated when, six months pregnant, she learned the local authority were going to take her baby into care. \"It was the last thing I was expecting,\" she said.She was called to court eight days after her son's birth - but the hospital reported she'd taken excellent care of her son.The judge decided they should go to a specialist mother and baby centre. \"It was frankly a miracle that the judge decided on very little evidence to give me a chance. I am incredibly incredibly grateful for the opportunity to have gone there. \"She stayed for six months, kept her son, her life is now back on track: she hopes for a career in social care.Prof Karen Broadhurst, one of the lead authors of the report, said: \"The statistics require us to look much more deeply into this issue.\"Prof Broadhurst said this wasn't an argument against safeguarding or protecting babies - but about enabling parents to fairly participate in the process.\"It's a request for greater humanity. It's harsh enough to remove a baby at birth. So all the more reason why we need to strive for the fairest possible process.\"Family Court judges have been worried about increasing numbers of these short notice cases.A working group set up by the most senior family court judge recently expressed concern that some were being issued because of insufficient planning and preparation on the part of local authorities.In a statement, a spokesman for the judiciary welcomed the report, saying it would \"be the basis of further in-depth analysis, qualitative research and review\".\"We look forward to working with others across family justice in order to investigate more fully the overall context, experiences and issues which are raised by the data in the report,\" they added.Charlotte Ramsden, current president of the Association of Directors of Children's Services said: \"I think its rightly very challenging for us all, in terms of the current experience of families.\"The challenge is for us to do everything we can to avoid, reduce the need to remove babies at birth at all, but absolutely where we do that we do it in the best way, and we do it with parents properly represented.\"You can hear Sanchia Berg's full report on BBC Radio 4's World At One <https:\/\/www.bbc.co.uk\/programmes\/b006qptc>."}