{"author":"By David Deans","title":"Ukraine: 'My guilt at leaving' - Mick Antoniw","news_category":"general","content":"This video can not be playedMick Antoniw has family in the west and the east of UkraineFor many in Wales the news from Ukraine is frightening but distant from their day-to-day lives.For one of Wales' most senior politicians, it is deeply personal.Labour Senedd member Mick Antoniw is Wales' counsel general - the Welsh government's most senior legal adviser.But he has significant roots in Ukraine, having been brought up in a community which brought the country's culture to the UK.Last weekend he was so concerned by the threat to the country, he travelled there with others, including Plaid Cymru leader Adam Price, to hear from people on the ground.The group, which included former BBC journalist Paul Mason, had gone despite advice against all travel. They left Ukraine just over a day before military action began.The 67-year-old said he had been in tears at the news of the invasion: \"It's difficult to stay emotionally solid at the moment.\"Modern technology has revolutionised how people stay in touch with relatives abroad. The Pontypridd MS speaks to around half a dozen of his family there.Some tell him they are getting ready to fight, joining civil defence units.The politician last spoke to his cousins on Thursday morning. One, who he's very close to, was \"basically preparing vehicles to make sure they have got petrol so they can evacuate family members\".The cousin told him he would \"stay until the end\".\"They've got their weapons, he's 74 years old, and he will be fighting. \"I'm staying in contact but I don't know if I will see some of these people again.\"One, a doctor, asked for his help in getting family out of the country. His skills will be needed in the conflict.\"What he is concerned about is getting his partner, and his younger brother and his mother out, trying to get ready to potentially evacuate perhaps to the Polish border, and then to try make arrangements to get into a place of safety\".The MS said he wants his family to be safe and said they can come to live with him.Mr Antoniw's father settled in the UK after World War Two as a refugee from Zolochiv, in western Ukraine.During World War Two he was taken by the Germans to France and eventually arrived at a displaced persons camp in Scotland.The rest of his family was deported by the Soviet Union to Siberia.The MS, who speaks Ukrainian, was brought up in a Ukrainian community in Reading where he was born, and did not re-establish contact with family in the country until after the Soviet Union collapsed.Mr Antoniw's group, which included a delegation of trade unionists from the UK, left on Tuesday evening once it became clear an attack was imminent.\"To some extent you almost have this feeling of guilt that you are actually leaving these people,\" he said.\"You have this feeling we can get out - almost as though we are abandoning you\".He said it was \"absolutely right\" to visit \"because it was an opportunity to have those contacts, to meet those people, to now be putting what they were telling us to the rest of the UK and to the people of Wales\".Among those he met were lesbian and gay groups concerned at Russian repression, members of the Ukrainian government, and families of people in prison in the rebel-held east.\"We needed to actually stand up and be counted,\" he said, if we \"regard our international role with the rest of the world as being important\".He accused Conservatives who criticised his trip of trying to provide \"a sort of distraction\" from \"what I think is their own weakness and failure to properly impose real, genuine sanctions against Russian assets and the oligarchs\".Mr Antoniw said he has a \"deep personal contact\" with Ukrainian culture. \"I regard myself as a Welsh Ukrainian,\" he said.\"But it is also vitally important to democracy\" that Ukraine succeeds, he added.\"When you see that progress being made bit by bit, you realise what Putin's biggest fear is, and what the fear is of the Russian oligarchs, the gangster capitalism in Russia is.\"You have an emerging democracy on its border, with different values that looked to western Europe rather than looking towards Moscow and the Russian Federation.\"All the young people I know said there's no way we want to live within the sort of environment that exists within the Russian Federation.\"They have their cases ready to go.\""}