{"author":"","title":"China divided as WeChat deletes LGBT accounts from platform","news_category":"general","content":"A recent crackdown on LGBT accounts on Tencent's popular WeChat platform has divided Chinese social media.Dozens of such accounts, mostly run by university students, had been deleted on Tuesday night - sparking fears of a tightening control over gay content.The closures have garnered a wave of online support for the LGBT community, with many asking the student groups to \"hang in there\" and \"do not give up\".But others welcomed the move, saying \"it was about time\" they were silenced. China decriminalised homosexuality in 1997, but the LGBT community continues to face discrimination in the country.On Wednesday, at least two student LGBT groups have issued statements in response to their WeChat accounts being removed, which included the erasure of all their previous posts.The groups are known for advocating LGBT and gender equality, and providing support to students on campus.\"Our activities will not stop due to the closure. On the contrary, we hope to use this opportunity to start again with a continued focus on gender and society, and to embrace courage and love,\" Fudan University's Zhihe SocietyFudan University's Zhihe Society said <https:\/\/weibo.com\/3312666064\/KnyvjgxbK?filter=hot&root_comment_id=0&ssl_rnd=1625714481.6288&type=comment#_rnd1625714445002>.Meanwhile, Tsinghua University's Wudaokou Purple said that <https:\/\/weibo.com\/5732225167\/Knyfcglo2?filter=hot&root_comment_id=0&ssl_rnd=1625714871.4695&type=comment#_rnd1625714834982> although it was \"frustrated\" that its \"years of hard work\" had been \"burned\" at one go, it has only made them closer.The schools are two of China's top institutions.The US State Department told reporters on Wednesday it was \"concerned\" that the accounts were deleted when they \"were merely expressing their views, exercising their right to freedom of expression and freedom of speech\".But other Chinese social media users celebrated the move.\"I don't mind it if the LGBT community quietly does their own thing, but why do they have to keep shoving their ideals in my face through these groups? It's right to shut them down,\" one person said on Weibo.Many of the closed WeChat accounts display messages saying that they had \"violated\" Internet regulations, without giving further details.The account names have also been deleted and just read \"unnamed\". \"After receiving relevant complaints, all content has been blocked and the account has been suspended,\" the notice said.The crackdown is the latest example of what some call growing intolerance toward the LGBT community.Last year, Shanghai Pride week, modelled on Pride events in the West, was cancelled without explanation after 11 years of it going ahead.In 2019, the Oscar-winning Freddie Mercury biopic Bohemian Rhapsody was released in Chinese cinemas, but references to theQueen singer's sexuality and AIDS diagnosis were censored <https:\/\/www.bbc.com\/news\/blogs-trending-47693115>.In 2018, Weibo said all posts related to homosexuality would be taken down, althoughit backtracked after massive outrage <https:\/\/www.bbc.com\/news\/world-asia-china-43779650>.This video can not be playedBeing gay in China: \"My mum said she'd kill herself if I were gay\""}