{"author":"","title":"Dover ferry delays: Welsh school ski groups in hotels overnight","news_category":"general","content":"Welsh school ski groups spent the night in hotels due to ferry hold-ups at Dover affecting their onward journeys on the other side of the Channel.It meant coach drivers reached their driver limits and some school parties had to await replacement drivers.Extra ferries were laid on overnight to clear the backlog.One school said they were still waiting in Dover, having arrived there at 02:00 BST on Sunday.Ysgol Gymraeg Gwynllyw, based in Pontypool, Torfaen, said the situation at the port was \"quite bad\".\"There is no indication when we can go through to process our passports, and after that we then need to get on the boat,\" teacher Gwyn Rosser said.\"It's a worrying situation, and we are concerned now that we'll be here again tonight. There isn't much information from the authorities.\"Officials blamed slower border processing and a higher-than-expected number of coaches as causes of the delays which began on Friday.It led to Cardiff's Radyr Comprehensive having an unscheduled overnight stay at Reims, France, and a group from Ysgol Gyfun Rhydywaun, in Hirwaun, Rhondda Cynon Taf, were put up in a hotel in Aachen, Germany.Staff and children from Ysgol Gyfun Rhydywaun had expected to reach their ski resort in Austria in 24 hours but they spent that long reaching the French coast.\"The most frustrating thing was that when we were on the boat, it wasn't busy at all,\" said teacher Bethan Cambourne.\"We travel to Austria and have made the trip several times in 24 hours from Aberdare to Saalbach in Austria.\"But it has taken 24 hours to reach Calais this time.\"The party was due to reach their resort on Sunday morning having \"missed a ski day\".\"We hope to book an extra day at the hotel and come back on Saturday instead of Friday,\" said Ms Cambourne.Year 13 student Owen said: \"We're all just fed up.\"Meanwhile, a group from Ysgol Glan Clwyd in St Asaph, Denbighshire, arrived at Dover at about 20:30 GMT on Saturday and had to wait at the Cruise Terminal until 02:00 on Sunday. They were then warned of a further five or six hours queuing before reaching the port, which has turned out to be much longer.Mared Vaughan, a teacher at the school, said: \"We've been there for 13 and a half hours without food. All we got were bottles of water.\"The children haven't eaten since last night and it's now 3:30pm. We hope to arrive at the hotel by tomorrow morning but we have a long journey ahead of us to reach the south of France.\"The school party from Radyr Comprehensive resumed their journey at 05:00 local time on Sunday and were expected to reach their destination by 10:00.The hold-up was extended as the delay at Dover meant by the time they reached France their driver had reached his driving hours' limit and they had to wait for a replacement.Parent Claire Bryant described it as \"a journey from hell for 12-year-olds and those poor teachers\".Kaeti Breward, a teacher from St Joseph's Catholic and Anglican High School in Wrexham, said their ski group could face further delays in France as a replacement driver was needed.It means their ski trip would begin \"a day late\", she told BBC News from the ferry.Meanwhile, St Joseph's Roman Catholic High School, Newport, said students had been \"absolutely amazing\" waiting to cross the Channel and that they arrived at their chateau at 23:15 on Saturday, instead of 16:00 as planned.The port said it expected a smaller number of coaches on Sunday. It said more than 300 coaches departed on Saturday and that all tourist cars and freight were processed successfully."}