{"author":"By Charlie Jones","title":"Ed Sheeran and Grayson Perry help with Essex teen's art project","news_category":"general","content":"This video can not be playedEd Sheeran recorded a video message in support of the projectA 14-year-old boy has collaborated with Ed Sheeran, Grayson Perry and other artists for a project that has raised more than £160,000 for charity.Noah, who has hydrocephalus, epilepsy and cerebral palsy, enjoys painting on cardboard at home in Dedham, Essex.Artists across the world have helped finish the pieces, which are being exhibited at Firstsite gallery <https:\/\/firstsite.uk\/event\/background-bob-back-again\/> in Colchester.Noah's father Nathan Jones said: \"This project has brought him so much joy.\"During the coronavirus lockdown in 2020, Noah, who goes by the nickname Background Bob, was painting on cardboard to pass the time while he could not attend school.Mr Jones posted on Instagram asking artists to collaborate with his son and hundreds of artists came forward.The project was so popular that it was turned into an exhibition and a book. The art was later auctioned off to raise money for theColchester and Ipswich Hospitals Charity <https:\/\/www.colchesteripswichcharity.org.uk\/>, which has looked after Noah since he was born.The new exhibition, which is Noah's third one, features over 270 collaborative artworks with international street and graffiti artists including Mr Doodle, Shepard Fairey and Wrdsmith, plus comedians Phill Jupitus and Joe Lycett.A mutual friend alerted Suffolk singer-songwriter Sheeran to the project, who said he was happy to take part and sent a video message, saying: \"Good luck with everything and I love what you're doing.\"Mr Jones said his family had been \"absolutely blown away\" by the response from artists to their third project.\"The love and interest to collaborate with Background Bob has been spectacular. Noah has loved every minute of being Background Bob. It's been so much fun, and we've made so many creative connections,\" he added.The exhibition runs at Firstsite from 1 April until 8 October, with an auction due to take place afterwards.Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}