{"author":"By Steffan Powell","title":"Jesse Lingard takes control of a Rainbow Six Siege esports team","news_category":"general","content":"Years of practice, sacrifice and dedication to be crowned the best.Will it be the glory of victory or the crushing disappointment of defeat? As a professional footballer Jesse Lingard has experienced it all.Now he wants to do it some more - not in the real world but rather the digital one.The Manchester United and England footballer has bought a Rainbow Six Siege team - to get involved in competitive gaming and has rebranded it JLINGZ esports.\"I've been following esports for a long time and now it's a perfect chance to dive in,\" he tells Radio 1 Newsbeat.The team will compete next season in the UK and Ireland Nationals Second Division with the hope of starting a legacy in the tactical first-person shooter game.\"I've always liked to keep my mind busy outside of football,\" explains Jesse. \"I've got my clothing line because I'm into fashion but I've always been into gaming as well.\"The esports industry is massive now and lots of people are dying to get involved and I just can't wait to help progress my team.\"Whilst not as popular as the big three esports titles League of Legends <https:\/\/www.bbc.co.uk\/news\/newsbeat-56732659>, DOTA  <https:\/\/www.bbc.co.uk\/news\/world-49206676>and CS:GO, Rainbow Six Siege has an enthusiastic community of players with more than 70 million registered across the world.Jesse admits that he's relatively new to the game, growing up more on FIFA and Call of Duty, but he doesn't think that's going to hold him back from being able to help.\"Rainbow Six Siege is very tactical, but I think it's very similar to football in a way.\"You've got to stick together as a team and work hard to get results.\"Jesse will be in charge of who plays and coaches the team.Laughing when asked if he's going to be a difficult boss to work for, Jesse says: \"I'll always support my team through the ups and downs and I'm always here for advice!He says sharing his experiences as a professional sportsman with his staff will help.\"The crossover and similarities with football is crazy.\"Any team has to practice hard, believe in themselves and on game day, make sure everyone understands what they've been preparing for - because esports, like football, can be mentally tough.\"Jesse is setting his sights on promotion from the second division.\"The team I've got, I'm happy with,\" he says.\"At the moment we're in the Second Division but we've got our sights set on qualifying for the Premiership soon and I've got full confidence that we can do that!\"Recently there's been a lot of press coverage about Jesse's contract negotiations with Manchester United <https:\/\/www.bbc.co.uk\/sport\/football\/58480332>and this interview took place before that became public knowledge.Jesse says he's \"first and foremost\" a footballer and that's his main love but taking on this esports challenge is something to keep him active when he's not playing or training.And he's not the only one doing it. More and more footballers <https:\/\/www.bbc.co.uk\/news\/newsbeat-54995615> and football clubs  <https:\/\/www.wolves.co.uk\/news\/esports\/20210728-wolves-partner-with-north-american-esports-giant-evil-geniuses\/>are getting involved with esports.Worldwide last year revenues from competitive gaming reached £684m and with interest growing that could rise in years to come.It's a natural fit for clubs who want to look at different ways of making money and are also used to the structural organisation it takes to run a sports team.But Jesse says it's not just about the money. \"Obviously it's an exciting space to get involved with.\"Esports is just continuing to grow every year and lots of footballers like myself are itching to get involved.\"Yes it comes with a lot of responsibilities, you've got to take the wins and the losses, but for people who play football and love gaming like me this is perfect.\"Follow Newsbeat on Instagram <https:\/\/www.instagram.com\/bbcnewsbeat\/>, Facebook <https:\/\/www.facebook.com\/bbcnewsbeat\/>, Twitter <https:\/\/twitter.com\/BBCNewsbeat> and YouTube <https:\/\/www.youtube.com\/channel\/UCe1Ef-K5jpnRsmVY5hCBhOw>.Listen to Newsbeat live <https:\/\/www.bbc.co.uk\/sounds\/play\/live:bbc_radio_one> at 12:45 and 17:45 weekdays - or listen backhere <http:\/\/www.bbc.co.uk\/programmes\/b006wkry\/episodes\/player>. "}