{"author":"","title":"Ukraine war: How can I offer a UK home to Ukrainian refugees?","news_category":"general","content":"Some unaccompanied child refugees from Ukraine will be given visas, the government has announced.The Home Office changed its initial guidance to say that under-18s must travel with a parent or guardian, which left hundreds of lone teenagers in limbo.Almost 100,000 Ukrainians have arrived in the UK after fleeing the Russian invasion.As of 19 July, <https:\/\/www.gov.uk\/government\/publications\/ukraine-family-scheme-application-data\/ukraine-family-scheme-and-ukraine-sponsorship-scheme-homes-for-ukraine-visa-data--2> 162,000 Ukrainian visas have been issued, from 194,700 applications:As of 18 July, 95,400 visa holders have arrived in the UK:In addition, 15,500 Ukrainians who were already in the UK at the time of the invasion have had their permission to stay extended.As of 14 July, 14,200 Ukrainian children have places in English schools. <https:\/\/explore-education-statistics.service.gov.uk\/find-statistics\/school-placements-for-children-from-outside-of-the-uk\/2022-may> There are no equivalent figures for Scotland, Wales or Northern Ireland.Family members and potential hosts have consistently complained about the time taken for visas to be approved. <https:\/\/www.bbc.co.uk\/news\/uk-60840808>Home Secretary Priti Patel apologised for the \"frustrating\" delays. <https:\/\/www.bbc.co.uk\/news\/uk-61028712>EU countries allow Ukrainian refugees to stay for up to three years without a visa.More than 5.9 million Ukrainians have been recorded in neighbouring European countries <https:\/\/data.unhcr.org\/en\/situations\/ukraine\/location?secret=unhcrrestricted> since the war began, although many have since returned.The Ukraine Sponsorship Scheme <https:\/\/www.gov.uk\/guidance\/apply-for-a-visa-under-the-ukraine-sponsorship-scheme> - \"Homes for Ukraine\" - lets those without relatives in the UK come for at least six months.Any Ukrainian national - or immediate family member - who lived in Ukraine before 1 January 2022 qualifies.People with Ukrainian passports can apply online, <https:\/\/www.gov.uk\/guidance\/apply-for-a-visa-under-the-ukraine-sponsorship-scheme> but those without have to go to avisa application centre (VAC) <https:\/\/www.gov.uk\/find-a-visa-application-centre> in a neighbouring country, including child applicants.Those granted visas can live and work in the UK for up to three years, and access healthcare, welfare and schools.They can also bring their pets. <https:\/\/www.gov.uk\/government\/news\/emergency-support-put-in-place-for-ukrainian-nationals-entering-the-uk-with-their-pets>On 22 June, the government announced that some unaccompanied child refugees will be able to come to the UK. <https:\/\/www.gov.uk\/government\/news\/homes-for-ukraine-scheme-to-begin-processing-applications-from-unaccompanied-children>Weeks after the scheme began, the Home Office updated its guidance to say under-18s must travel with a parent or guardian, or be reuniting with them in the UK.But about 1,000 young people travelling on their own had already applied to come to the UK. The government said that initially only those already in the system will be granted a visa.For safeguarding reasons, those offering to sponsor children must generally either be a relative or known to their parents.Anyone in the UK - of any nationality, providing they have at least six months' leave to remain - canvolunteer to host <https:\/\/www.gov.uk\/guidance\/homes-for-ukraine-scheme-frequently-asked-questions> the refugees in their own home, or another property.Charities, businesses and community groups can also apply.Hosts are offered a tax-free payment of £350 a month for up to 12 months. Local authorities receive £10,500 in extra funding per refugee for support services, with additional money available for schoolchildren.At the moment people can only apply to sponsor a specific Ukrainian individual or family.Those without a personal connection can register their interest, <https:\/\/www.gov.uk\/register-interest-homes-ukraine> and contact refugees through charities, faith groups or local community organisations, including:The government gave Reset an initial grant of £300,000 <https:\/\/resetuk.org\/news-and-campaigns\/news\/reset-launches-homes-for-ukraine-matching-and-training-service> to run a matching and training service.Many unofficial Facebook groups have also been set up to connect refugees and potential sponsors.The government says everyone who applies to host is vetted, <https:\/\/www.gov.uk\/guidance\/homes-for-ukraine-scheme-frequently-asked-questions> and Ukrainian applicants also undergo security checks.Local councils should approve each property and complete basic Disclosure and Barring Service checks on all potential hosts. However, \"enhanced checks\" are only requested if children are involved.The BBC found evidence <https:\/\/www.bbc.co.uk\/news\/uk-61311046> that some predatory men were using the sponsorship scheme to prey on young women.In April, the UN's refugee agency, the UNHCR, raised concerns about the UK system, <https:\/\/www.unhcr.org\/uk\/news\/press\/2022\/4\/6256b5144\/unhcr-statement-on-the-uks-homes-for-ukraine-scheme.html> calling for \"adequate safeguards and vetting measures to be in place against exploitation\".In EU countries, matching is mainly organised by national authorities and charities, with fewer private arrangements.Some refugees have had to be rehoused after being placed in unsuitable accommodation.The family visa scheme <https:\/\/www.gov.uk\/guidance\/apply-for-a-ukraine-family-scheme-visa> was initially limited to those hoping to join immediate family in the UK, but now includes extended family members.It is open to Ukrainian nationals - or immediate family members - who lived in Ukraine before 1 January 2022.Applications from people without passports must be made at a VAC, <https:\/\/www.gov.uk\/find-a-visa-application-centre> and applicants must provide biometric information, such as fingerprints.Those with a Ukrainian passport can apply online, <https:\/\/apply.visas-immigration.service.gov.uk\/has-international-ukrainian-passport> with biometric information provided after arrival.People granted family visas can live, work and study in the UK, and access public funds for up to three years.Separately, Ukrainian nationals granted permission to stay in the UK on or before 18 March 2022 can apply to stay in the UK under theUkraine Extension Scheme. <https:\/\/www.gov.uk\/guidance\/apply-to-stay-in-the-uk-under-the-ukraine-extension-scheme>Their partner and children can also apply if they're already in the UK as \"dependants\"."}