{"author":"By Steffan Messenger","title":"Fears over future of fostering and adoption in Wales","news_category":"general","content":"Fears have been expressed over the future of fostering and adoption in Wales.The largest professional association of social workers has written to the Welsh government to voice its concerns.It stems from the collapse of one of the leading charities <http:\/\/www.bbc.co.uk\/news\/education-33807124> in the field, the British Association of Adoption and Fostering (BAAF), in July.The Welsh government said the new arrangements would \"strengthen the adoption and fostering infrastructure\".A spokesman added steps had been taken to ensure BAAF could operate its services into early September and future plans would build on the \"transformation of social services in Wales.\"An announcement on work being done with partner organisations is expected in the coming weeks, the spokesman said.BAAF services in England and Scotland have been transferred to other providers, but it is not clear what lies ahead for BAAF Cymru.The group runs Wales' adoption register and the independent review mechanism, which considers applications for potential adopters who have been turned down.It also runs a support line, organises training and promotional campaigns about adoption and fostering across Wales.It has been operating on a limited basis since the UK-wide charity went into administration, citing financial difficulties.In a letter, sent to Health and Social Services Minister Mark Drakeford and seen by BBC Wales, the British Association of Social Workers (BASW) said members are \"very concerned that these services will be lost, at great cost to the children in need of fostering and adoption in Wales\".Gaye Sheridan from BASW Cymru said: \"In England the services have been fragmented and agreed with a number of smaller voluntary organisations and in Wales we are concerned that that isn't done and as much of the integrity of the whole service can be held together.\"Delyth Lloyd Griffiths, a social work lecturer at Swansea University and BASW committee member, said: \"Things seem to have happened very quickly in England and Scotland but though we've heard from BAAF Cymru that they're in talks with the Welsh government, several weeks down the line we still don't know what's happening.\"Ann Bell, from charity Adoption UK in Wales, added: \"I think it's really important that we find a way in Wales to hold on to that expertise and centre of knowledge and excellence that BAAF Cymru provides."}