{"author":"","title":"Lowestoft nesting hotels open to protect kittiwakes","news_category":"general","content":"Buildings designed to recreate the best nesting conditions have been opened to offer homes for up to 430 pairs of endangered kittiwakes.The bird hotels have been built in Lowestoft, Suffolk, by the energy firms Vattenfall and Scottish Power.Global kittiwake population is thought to have dropped about 40% since the 1970s.The structures were created with advice from environmental groups including theRSPB. <https:\/\/www.rspb.org.uk\/>The aim of the nesting structures is to protect the birds from predators and keep them away from the town and harbour.Kittiwakes are on the conservation \"red list\" <https:\/\/www.rspb.org.uk\/birds-and-wildlife\/wildlife-guides\/uk-conservation-status-explained\/> and global numbers have fallen by 40% since the 1970s.Last year Lowestoft Town Council agreed to part-fund the salary of a dedicated officer to help the town's businesses see the seabird as an \"asset not a pest\". <https:\/\/www.bbc.co.uk\/news\/uk-england-suffolk-61008854>The Lowestoft Kittiwake Partnership is being awarded £50,000 by Vattenfall to support cleaning and help local businesses.Rob Anderson, project director of Vattenfall's Norfolk Offshore Wind Zone, said: \"The east of England is famous for its seabirds so it's great we've been able to look after them for generations to come.\"The funding for the Kittiwake Partnership will really help Lowestoft residents and businesses, who will be able to access support and advice on how to safely manage the impact of kittiwakes in the town.\"The Lowestoft Kittiwake Partnership, created by Suffolk Wildlife Trust and the RSPB, has welcomed the new nesting site.A partnership spokesperson said: \"Kittiwakes need our help to prevent them slipping further towards extinction,\"But in towns like Lowestoft, which are home to urban nesting colonies in the summer, we also need to think about how we manage the mess they make around their nesting sites.\"Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}