{"author":"","title":"Firefighters run 200 miles for boy, 8, with cancer","news_category":"general","content":"A team of firefighters has run 200 miles in full kit to raise money for an eight-year-old boy with cancer.The team of 13 from Tyne and Wear Fire and Rescue Service (TWFRS) set off on Friday from Newcastle for their finishing line in Leicester.The route equated to nearly six million combined steps and was completed in aid of Oliver Maw, who has neuroblastoma.More than £160,000 has so far been raised for the youngster who is due to have treatment in the US.Triplet Oliver, from Millfield, Sunderland, joined the firefighters for part of the run with his brothers Oscar and Owen, meeting them in Leicester on Saturday afternoon.His uncle Peter Wilson, a crew manager at TWFRS, helped raise the money with his colleagues but said a further £100,000 needed to be raised.Oliver was diagnosed with a stage four, high risk neuroblastoma in February 2021.The team ran to Leicester after being handed the baton by Leicestershire Fire and Rescue Service in October.The Leicester firefighters had heard about Oliver's fundraiser and ran from their base up to Newcastle in 30 hours raising £14,000.They then challenged their Newcastle colleagues to match the feat in reverse.Graeme Taylor, watch manager at TWFRS said the run, which set off from the Great North Children's Hospital at the Royal Victoria Infirmary, had raised £14,000.\"Oliver has fought a really brave battle so far and we're not done yet,\" he said.\"We need to raise £260,000 to get him to America for his treatment.\"We are all sore and tired but happy that the baton never stopped moving from when we left the Royal Victoria Infirmary on Friday.\"Follow BBC North East & Cumbria on Twitter <https:\/\/twitter.com\/BBCNEandCumbria>, Facebook <https:\/\/www.facebook.com\/bbcneandcumbria> and Instagram <https:\/\/www.instagram.com\/bbcneandcumbria\/>. Send your story ideas to northeastandcumbria@bbc.co.uk <mailto:northeastandcumbria@bbc.co.uk>."}