{"author":"","title":"BBC TV licence fee: What is it and why is it under threat?","news_category":"general","content":"The BBC licence fee is to be frozen for two years at its present levels, the culture secretary has told MPs.Nadine Dorries also said the government would be looking at whether the licence fee was the best way to fund the BBC in future.The TV licence is a flat fee of £159 a year <https:\/\/www.tvlicensing.co.uk\/check-if-you-need-one\/topics\/tv-licence-types-and-costs-top2> (£53.50 for black and white TV sets).Announcing the two-year freeze, Ms Dorries said the government could \"not justify extra pressure on the wallets of hardworking households\". She said the fee will rise in line with inflation for the following four years.BBC director-general, Tim Davie, said the freeze was \"disappointing\".By law, each household in the UK has to pay the licence fee (with some exemptions <https:\/\/www.gov.uk\/free-discount-tv-licence>) if they:The rules apply to any device on which a programme is viewed, including a TV, desktop or laptop computer, mobile phone, tablet or set-top box.So, for example, someone watching a live football match on a non-BBC channel via a laptop, would still need to pay.If you do not pay the licence fee, you can be taken to court. In 2019, there were 122,603 prosecutions and 114,531 convictions for TV licence evasion.Money raised from the licence fee pays for BBC shows and services - including TV, radio, the BBC website, podcasts, iPlayer and apps.Almost £3.7bn was raised by the licence fee in 2019, accounting for about 76% of the BBC's total income of £4.9bn. <https:\/\/researchbriefings.parliament.uk\/ResearchBriefing\/Summary\/CBP-8101>The remaining 25% came from commercial and other activities (such as grants, royalties and rental income), according to the House of Commons Library.In exchange for licence fee money, the BBC is committed to provide public service broadcasting <https:\/\/www.ofcom.org.uk\/tv-radio-and-on-demand\/information-for-industry\/public-service-broadcasting>.According to its Royal Charter <https:\/\/www.bbc.com\/aboutthebbc\/governance\/charter> this means its mission is \"to act in the public interest\" by providing \"impartial, high-quality and distinctive\" content, which will \"inform, educate and entertain <https:\/\/www.bbc.com\/aboutthebbc\/governance\/mission>\" everyone who pays the licence fee.The licence fee's existence is guaranteed until 31 December 2027.Speaking to MPs, Ms Dorries said the government had made no decision on the future of the licence fee.However, it has come under criticism for several years now - for several reasons.It is a flat-rate payment, which means that the poorest households are paying as much as the richest.Questions have also been raised about whether non-payment is a serious enough issueto justify someone being threatened with imprisonment or a criminal record <https:\/\/www.bbc.co.uk\/news\/entertainment-arts-51373372>.The licence fee was introduced in 1946, when the BBC was the sole provider of broadcasting in the UK.However, it now competes not only with advertising-funded TV channels, but also online content such as YouTube and subscription services such as Netflix and Now TV. Many people question whether they should still be forced to pay for the BBC, when it is a service they may not necessarily use.A tax on broadband connections of around £138 a year, which could be paid for by consumers or by internet service providers, could replace the BBC's current level of funding, according to Ampere, a media analytics firm. But if internet service providers passed the cost on to consumers, it could be harder for deprived households to access the internet.A government grant - in Sweden, Croatia and Finland, public service broadcasters are paid for by a tax on income. This could cost taxpayers around £116 each a year. However, being funded directly by the government could give politicians more influence over the corporation's coverage and undermine the BBC's impartiality.Advertising - The UK is one of only a handful of countries where licence fees are not also supported by advertising (others include Denmark and Norway). However, TV advertising revenues have been in decline for several years now.A subscription service - It's been suggested that the BBC follow the example of Netflix and change to a subscription service. However, it's estimated that to provide its current services, the BBC would have to sign up approximately 24 million users, each paying £13 per month. Also, it's not clear how BBC One and BBC Two could be put behind a pay wall, or how the BBC would limit access its radio stations to paying subscribers.A licence fee is not needed to view BBC programmes on other streaming services, like Netflix.So, streaming a BBC programme on Netflix would not require a TV licence, whereas streaming the same episode on iPlayer would.It is also fine to watch non-BBC programmes on online catch-up services without a TV licence, as well as viewing clips on sites like YouTube,according to the government website <https:\/\/www.gov.uk\/tv-licence>.In 2020, the BBC dropped an arrangement where it paid the licence fee of anyone aged 75 or over. Since then, it has only funded a free licence for any householdwhere someone aged over 75 receives pension credit. <https:\/\/www.gov.uk\/pension-credit>"}