{"author":"By Tom Edwards <https:\/\/www.bbc.co.uk\/news\/correspondents\/tomedwards>","title":"True London Olympic Games legacy is in our attitude","news_category":"general","content":"We've all heard about the post-Olympic legacy promises: regeneration, affordable housing and sport engagement. But what about transport?The good news is that there ARE transport legacies. Some we can already see, but others very much depend on a change of attitude.Stratford is now one of the best-connected sporting venues on the planet with 10 lines in and out of its station.This meant even when the Central Line went down during the Games, spectators were able to change routes fairly easily.We can also see physical infrastructure legacies. On the Docklands Light Railway <http:\/\/www.tfl.gov.uk\/corporate\/media\/newscentre\/archive\/17547.aspx> (DLR) three-carriage trains were introduced in 2010 and, no matter what Transport for London (TfL) says, theThames Cable Car was built with the Games in mind <http:\/\/www.bbc.co.uk\/news\/uk-england-london-18619936> to ferry people from the O2 to the ExCel centre.Will the cable car, though, pay its way when the Olympic crowds subside? The wi-fi internet programme on the Tube <http:\/\/www.bbc.co.uk\/news\/uk-england-london-18354009>, again finished due to an Olympic deadline, has proved very popular. But it stops being free now the Games are over. Many think that is an opportunity missed.There has, though, been impressive interworking between train companies and TfL. For example trains were held when events finished late. You would hope some of that could be continued.It would also seem to make sense to continue the relaxing of rules restricting night-time deliveries as long as there are strict noise controls. This would help reduce daytime traffic on the roads.The main legacy the government and TfL want is to end the rush-hour culture of London where millions swarm into town between 8am and 9am.London's commuters were very flexible and receptive to listening to complex messages about certain busy hot spots during the Games.They came into town earlier or later or worked from home and spread the load on the transport system.Some will say the doomsday warnings were over-egged but TfL says it could not have coped on the Tube if commuters had not stayed away or changed theirworking patterns <http:\/\/www.bbc.co.uk\/news\/uk-england-london-19055216>.If that trend continued, there would be much more free capacity, but it depends on whether companies will continue to allow more flexibility for their workers.TfL claims it carried a record 4.5m Tube passengers last Tuesday.The success of transport during the Olympics raises the obvious question; if it can be run well over a two-week period while the capital holds the biggest show on Earth, why can't it happen all the time?Will the success change anything politically? It will be interesting to see how much prominence the mayor gives his \"driverless trains\" plan after such a result.The system and TfL have always been very good at delivering big events, but that is mainly due to the good will of transport workers. In my experience, they were magnificent.Can they do it all again for the Paralympics which will have similar challenges?"}