{"author":"","title":"Strike dates: Who is striking when and what pay do they want?","news_category":"general","content":"Hundreds of thousands of workers have been taking part in strikes or are planning to.The disputes are mostly over pay, with unions calling for wage rises to keep up with rising prices.But some unions have suspended strike action while talks with the government are held.Industrial action by workers in many different sectors has been organised by trade unions. Certain rules - like giving enough notice - must be met.Read more: Passport delay warning as five-week strike called <https:\/\/www.bbc.co.uk\/news\/uk-64981979>Read more: NHS 5% pay offer may end bitter dispute in England <https:\/\/www.bbc.co.uk\/news\/health-64977269>Read more: Calls for talks to end junior doctors' strikes <https:\/\/www.bbc.co.uk\/news\/health-64983764>Read more: Will my lectures be cancelled? <https:\/\/www.bbc.co.uk\/news\/education-59415694>Read more: Teachers' strikes in England paused for talks <https:\/\/www.bbc.co.uk\/news\/education-64987854>Read more: Civil servants set to strike on Budget day <https:\/\/www.bbc.co.uk\/news\/business-64561834>Read more: When are the next train strikes? <https:\/\/www.bbc.co.uk\/news\/business-61634959>Watch Make Sense of Strikes <https:\/\/www.bbc.co.uk\/iplayer\/episode\/p0dnlhyj\/make-sense-of-your-world-why-are-there-so-many-people-on-strike#xtor=CS8-1000-%5BEditorialPromo_Box%5D-%5BNewsEditorial_Promo%5D-%5BNewsEditorial_Promo%5D-%5BPS_IPLAYER~N~p0dnlhyj~P_MakeSenseOfStrikes%5D> on iPlayer and find out more about why people are striking and whether industrial action works.Some workers have settled disputes:Public support for strike action varies widely between different industries, a poll carried out by YouGov in January suggests.For example, the poll found nearly two in three people (65%) supported the nurses' strike - with ambulance workers backed by a similar number. However, only about one in three people (36%) backed university staff strikes."}