{"author":"","title":"St Ives: Open water swimmers quitting over river sewage risk","news_category":"general","content":"The risks posed by sewage discharge are causing people to quit river swimming as well as being bad for wildlife, an open water swimmer has said.Joyce Harper, of the Cambridgeshire and Peterborough Bluetits, swims in the River Great Ouse in St Ives.Last year, there were nearly 100 discharges of untreated water into the river, according to the Rivers Trust <https:\/\/www.theriverstrust.org\/>. Anglian Water said it was investing <https:\/\/www.anglianwater.co.uk\/> in fixing sewage overflow systems and installing sustainable drainage.Ms Harper took up open water swimming during the pandemic to improve her mental health.The professor of reproductive science said: \"I'm a member of many national groups and many people have stopped swimming and they've stopped exercising because of the risk of the sewage in the water.\"[But] it's not just about the people who are swimming, it's also about the wildlife that's in the water and around the water.\"Becky Wilburn, another open water swimmer, said: \"I can't tell you how wonderful it is to get into the water.\"It just refreshes you, makes you feel so much better. It washes off the stresses of the whole day and a lot of people come wild swimming for their wellbeing and mental health.\"Sewage overflows are designed to protect homes and businesses from flooding, according to Regan Harris of Anglian Water.She said: \"Our climate is changing really quickly and we are seeing more heavy rainfall in short amounts of time\"That means these systems are more active than they used to be... and they are not fit for purpose.\"She added councils and developers had a role to play by creating \"sustainable drainage, pouring less concrete and creating more green permeable spaces\".The government has said it will force water companies to make a \"progressive reduction\" in the sewage it dumps in rivers <https:\/\/www.bbc.co.uk\/news\/uk-politics-59052995>.It follows a backlash after MPs <https:\/\/www.bbc.co.uk\/news\/uk-politics-59040175> defeated an attempt by peers to change the Environment Bill in attempt to cut pollution.Ms Harris said the cost of replumbing entire networks across the country is believed to be about £600bn.\"We can't do that all in one go which is why we need to target investment to where it has the most environmental benefit,\" she said.Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}