{"author":"","title":"South Korea's Moon optimistic about end to Korean War","news_category":"general","content":"South Korean President Moon Jae-in has told the BBC that it is only a matter of time before the US and North Korea declare an end to their state of war on the Korean peninsula.The war ended in 1953 with an armistice but a peace treaty was never signed.Mr Moon, the son of North Korean refugees, also said there could be more diplomatic \"bumps and bruises\" as he tries to persuade Kim Jong-un to give up his nuclear weapons.But he described Mr Kim as \"candid\".In an interview with the BBC's Laura Bicker in Seoul, he also said he hoped European leaders would help him to mediate between Mr Kim and US President Donald Trump if negotiations stalled.Mr Moon has met Mr Kim three times this year and has acted as a mediator between him and Mr Trump.Mr Moon said that he had had \"ample discussions\" with President Trump and other US officials about an end-of-war declaration.This video can not be playedSouth Korea's President Moon Jae-in: \"The dogs are designated as national treasures in North Korea\"\"If North Korea takes certain measures, the end-of-war declaration would be a political statement that would announce that the longstanding hostile relations between Pyongyang and Washington had ended,\" he said.Mr Moon said he wanted this to happen at the \"earliest possible date\" and he believed there was a \"shared understanding between Washington and Seoul regarding this view\".Last month, he became the first South Korean leader to give a speech to the North Korean public during a trip to Pyongyang. He spoke at the Arirang Games - a major propaganda event - and received a standing ovation from 150,000 people.\"I was actually quite nervous to give the speech,\" he said. \"I had to address the problem of denuclearisation and had to receive positive vibes from the North Korean people. And also I had to satisfy the Korean public as well as the global public. So it was not an easy task for me.\"By Laura Bicker, BBC News, SeoulPresident Moon gives little away. He is careful with his words and answers all the questions thoughtfully. When I asked who was easier to deal with - Kim Jong-un or Donald Trump, he suppressed a wry smile.What is very clear to me is that his extensive diplomatic efforts, which also involve praising these two unpredictable leaders, are part of a personal mission. President Moon is driven by his desire to see peace on the peninsula. That's why he's in politics.Away from the formal interview setting, as we walked through the beautiful grounds of the presidential office known as the Blue House, Mr Moon was more relaxed. Smiling and keen to tell me more about his visit to Pyongyang, he even admitted to being nervous as he addressed 150,000 North Koreans at the Mass Games.He was obviously more comfortable sitting on the ground in the shade of a tree playing with the two rare dogs gifted by Kim Jong-un than he was in the interview chair. He also took real delight as I tried out my level 1 Korean. President Moon is an optimist when it comes to his dream of ending the Korean War. But some fear that he may not be a realist.He said that Mr Kim had not set any restrictions on the speech.\"He didn't even want to know what I was going to say before the speech. I believe this demonstrates the changes that are happening in North Korea right now.\"This video can not be playedHow North Korea welcomed the South Korean leaderPresident Moon told the BBC that he became president of South Korea to help prevent war returning to the peninsula and said that he acutely felt the pain of war and separation.Mr Moon's parents fled North Korea in 1953 and they never saw their family again.This video can not be playedThe war that never officially endedBegan with an incursion across the 38th parallel, the boundary between North and South Korea, by 75,000 troops from the Communist North in June 1950.American troops entered the war on the side of the South in the following months and the North Koreans, supported by China and the USSR, were pushed back.After some back and forth across the boundary, a bloody stalemate ensued.An armistice was signed in July 1953 by the US and North Korea. South Korea was not a signatory.Five million troops and civilians lost their lives in the conflict.There have been ups and down since a landmark June meeting between Mr Kim and Mr Trump in Singapore saw an agreement to work toward denuclearisation of the Korean peninsula, but with few specifics in terms of actions that would be taken.President Moon went to Pyongyang in September to reinvigorate the stalled negotiations.He returned with concessions that analysts said exceeded expectations. Mr Kim agreed to shut one of the country's main missile testing and launch sites - the Tongchang-ri facility. Significantly, North Korea said international experts would be able to observe and verify the dismantlement.The South's defence minister and the head of the North Korean army also signed an agreement to reduce military tensions, with a buffer zone to be established along the border to prevent accidental clashes.The US has called for further actions - including a full disclosure of North Korea's weapons and nuclear facilities.Secretary of State Mike Pompeo visited North Korea for the fourth time on Sunday, and held talks with Mr Kim.\"While there's still a long way to go and much work to do, we can now see a path where we will achieve [our] ultimate goal, which is the full and final verified denuclearisation of North Korea,\" he said on Tuesday at the White House.He added that international inspectors could soon be arriving at two North Korean nuclear sites.A second meeting between Mr Trump and Mr Kim will be held after the US mid-term elections, President Trump also said earlier this week.He has praised Mr Kim on several occasions and again asserted that they had a \"very good relationship\"."}