{"author":"By Meryl Sebastian","title":"Richest 1% own 40.5% of India's wealth, says new Oxfam report","news_category":"general","content":"India's top 1% owned more than 40.5% of its total wealth in 2021, according to a new report by Oxfam.In 2022, the number of billionaires in the country increased to 166 from from 102 in 2020, thereport <https:\/\/d1ns4ht6ytuzzo.cloudfront.net\/oxfamdata\/oxfamdatapublic\/2023-01\/India%20Supplement%202023_digital.pdf?kz3wav0jbhJdvkJ.fK1rj1k1_5ap9FhQ> said.Meanwhile, it added that the poor in India \"are unable to afford even basic necessities to survive\".The charity called on India's finance minister to levy a wealth tax on the ultra rich to tackle this \"obscene\" inequality.The report - Survival of The Richest - was released as the World Economic Forum began in Davos, Switzerland.The report highlighted the large disparity in wealth distribution in India, saying that more than 40% of the wealth created in the country from 2012 to 2021 had gone to just 1% of the population while only 3% had trickled down to the bottom 50%.In 2022, the wealth of India's richest man Gautam Adani increased by 46% <https:\/\/www.bbc.com\/news\/world-asia-india-63817883>, while the combined wealth of India's 100 richest had touched $660bn.In 2022, Mr Adani was ranked the second richest person in the world on the Bloomberg's wealth index. He also topped the list of people whose wealth witnessed the maximum rise globally during the year.Meanwhile, the country's poor and middle class were taxed more than the rich, Oxfam said.Approximately 64% of the total goods and services tax (GST) in the country came from the bottom 50% of the population, while only 4% came from the top 10%, the report said.\"India is unfortunately on a fast track to becoming a country only for the rich,\" Oxfam India CEO Amitabh Behar said. \"The country's marginalised - Dalits, Adivasis, Muslims, women and informal sector workers are continuing to suffer in a system which ensures the survival of the richest.\"The rich, currently, benefited from reduced corporate taxes, tax exemptions and other incentives, the report added.To correct this disparity, the charity asked the finance minister to implement progressive tax measures such as wealth tax in the upcoming budget.A 2% tax on the entire wealth of India's billionaires would support the nutrition of the country's malnourished population for the next three years, the report said.A 1% wealth tax could fund the National Health Mission, India's largest healthcare scheme for more than1.5 years, it added.Taxing the top 100 Indian billionaires at 2.5% or taxing the top 10 Indian billionaires at 5% would nearly cover the entire amount required to bring an estimated 150 million children back into school, Oxfam said.\"It's time we demolish the convenient myth that tax cuts for the richest result in their wealth somehow 'trickling down' to everyone else,\" said Gabriela Bucher, the executive director of Oxfam International.Taxing the super-rich was necessary for \"reducing inequality and resuscitating democracy\", she added."}