{"author":"By Jasmine DuFraisse & PA Media","title":"Sheffield film fan creates hundreds of miniature movie sets","news_category":"general","content":"A cinema fanatic has recreated more than 1,600 miniature film-set snapshots using household items and figurines.Steve Berry, 43, from Sheffield, has been staging scenes from movies including Scream, Jurassic Park and Star Wars, since 2020.His creations have earned him thousands of followers through social media where he regularly posts.He said the support of his followers had \"spurred on\" a passion he hopes will become \"an art form\".Mr Berry said he blends miniature figurines and props before playing with perspective and lighting to create the final image.\"Seeing the film you've seen a million times from a different angle - that's the type of thing I'm trying to go for,\" said Mr Berry, who dreams of working at Pinewood Studios.\"I don't consider it a hobby because I'm really wanting to get out there and do something with it. I want to change it into an art form.\"He said each shot takes between three and four hours to create.His work includes iconic scenes such as serial slasher Ghostface, from horror franchise Scream, on a busy subway train, a roaring Jurassic Park dinosaur in the rain, and the Lord Of The Rings' Gates of Argonath.Mr Berry first began experimenting with Lego during the first Covid-19 lockdown of 2020 and soon elevated his work to sculptures and hyper-realistic film scenes.He began posting to Instagram, where he has more than 4,400 followers, and now also shares his work with some 2,000 users on Twitter and more than 12,000 on Tumblr.\"It ended up skyrocketing a bit,\" he said.\"I got loads of really nice messages from people saying 'You've really cheered me up. I know it sounds a bit weird but my Grandad's died and I look forward to your next post because they always cheer me up and it's a bit of silliness'.\"He said while he enjoys the reaction to his work he has considered stopping\"There's been moments when I've just wanted to quit, and I just get people going 'Please don't give up. Just keep going.'\"I'm really pushing - I'm so passionate about this, so I just want to be the best that I can possibly be, [make] the best work that I can possible create.\"Follow BBC Yorkshire on Facebook <https:\/\/www.facebook.com\/BBCYorkshire\/>, Twitter <https:\/\/twitter.com\/bbclooknorth> and Instagram <https:\/\/www.instagram.com\/bbcyorkshire\/>. Send your story ideas to yorkslincs.news@bbc.co.uk <mailto:yorkslincs.news@bbc.co.uk>."}