{"author":"By Kevin Keane","title":"Virgin Atlantic linked to Aberdeenshire carbon capture plant","news_category":"general","content":"Virgin Atlantic could pay a Scottish facility to offset its emissions by sucking carbon out of the atmosphere.Storegga plans to build a \"direct air capture\" plant in north east Scotland as part of a wider carbon capture and storage (CCS) facility.The Scottish cluster still needs government backing after missing out on the first phase of support.Critics say the technology is unproven and efforts should instead be focused on reducing emissions at source.The developer says it could capture a million tonnes of carbon dioxide (CO2) a year and store it in depleted oil wells under the North Sea.The project suffered a setback when ministers announced in October that Scotland had not been chosen to be one of the first CCS sites <https:\/\/www.bbc.co.uk\/news\/uk-scotland-scotland-business-58960740> despite having well-developed plans.After objections were raised, the Scottish cluster was placed on a reserve list.Storegga has now signed a deal with the Japanese firm Mitsui to help build Europe's first direct air capture site.In a statement, Storegga said early customers of the facility would include Virgin Atlantic.Sanjay Parekh, head of direct air capture at Storegga, said: \"The early adopter companies who want to talk to us about buying direct air capture carbon credits are leading businesses around the world with ambitious environmental, social and governance strategies.\"Businesses with a genuine desire to reduce emissions, avoid flaky offsetting, and have tangible plans to permanently remove CO2.\"The direct air capture plan was announced almost two years ago.The proposal is to build it somewhere close to the St Fergus gas terminal where the CO2 can be pushed offshore under the seabed using redundant gas pipelines.It would remove the same amount of carbon dioxide as about 40 million trees.Before the setback, the company had hoped to have it operational by 2026 with around 300 jobs created in the construction phase.Some environmentalists are concerned that this sort of technology will distract governments from pushing polluters to tackle their emissions.But supporters say it is critical for industries like aviation where finding alternatives to fossil fuels is challenging.Toru Matsui from Mitsui said: \"Being a negative emissions technology, DAC projects can generate carbon credits which will be critical in offsetting emissions from hard-to-abate sectors globally and achieving net-carbon zero targets.\"However Alex Lee, a Friends of the Earth Scotland climate campaigner, criticised the move. They said: \"This unproven technology is a corporate fantasy that big polluters think means they don't have to make any changes to climate-wrecking business as usual.\"These projects are dangerous distractions from the critical work of actually cutting emissions at source and reducing use of fossil fuels. \""}