{"author":"","title":"'We felt abandoned as adoptive parents'","news_category":"general","content":"An adoptive mother said lack of support from the first day - and no detailed knowledge of her daughter's traumatic early childhood - had a big impact on the family and her life as she grew up. This is her story.We tried to have children naturally and it hadn't worked. We had two or three days of training courses and they want to know background details, family history and basically anything that's happened in your life that could be relevant. That process took about six months. We went to adoption panel and we were approved. About six weeks later, we were told there were children suitable for us.We met social workers, including the children's social worker and then went to the adoption panel - a bit like a job interview I guess - and it was approved then that was the first time we saw their photos.When they came to live with us they were five and four, a girl and a boy. We had basic information and brief family history - to do with drug abuse, alcoholism, domestic violence but nothing in depth. We were chuffed to bits, we'd been trying for children for two to three years and obviously the process to adopt had taken nearly a year. We had a family and that's what we wanted all along.Scared, afraid, nervous, you feel like you're thrown in at the deep end and all of a sudden you've got two - so you've got to cope with that but we were excited and also worried about the future and how you're going to cope and things like that. Just like any parent.It was horrific the day they moved in. Their social worker didn't turn up like they were supposed to for the handover, so it was just us and the foster carers - who didn't want them to come to us as they'd become attached to them over the past nine months. The kids were screaming, crying, hanging on to the foster carers. They had to be dragged off their foster carers' legs to be at our house and there was no support. It wasn't until later on when I talked to people who had adopted, that they were horrified that the children's social worker wasn't there on the day.I knew it would be hard. On the training courses they made us aware of the situations. They didn't want to be with us, they wanted to go back to their birth parents, they didn't understand why they couldn't go home.Their social worker described them as feral and that's what they were. They couldn't hold a knife and fork, their food habits - they wouldn't eat what we considered healthy meals; there was no set bedtime from when they'd been with foster carers.Basically their social worker disappeared off the face of the earth. You'd phone her and she'd be out, you'd raise your concerns and she'd say she'd come round on and then she'd phone in the morning and say she wasn't coming in or just wouldn't turn up. I think within a year we saw a social worker five or six times. No one was there to advise us, it was just get on with it: you've got two children, goodbye. It just felt like we were being abandoned.More support for adoptive parents 'vital' <https:\/\/www.bbc.co.uk\/news\/uk-wales-45425452>About four years into the adoption, things became difficult with our eldest child. There were behavioural issues. We were at breaking point basically - five or six hours a night of screaming and violence, shouting and smashing things up. I phoned social services in tears asking for help, only to be told I had to phone Adoption UK. They told me to phone my local social services because that's what we came under. We just couldn't cope. And not only was it affecting us, it was affecting our daughter and also affecting our youngest as well because he was witnessing everything that was going on. We were basically at the end of our tether when I phoned, I was in tears. We couldn't cope anymore. It wasn't until I threw a massive hissy fit and burst into tears and said the adoption was breaking down, they finally sent someone out.Then, we finally got information about the family background of the children that we weren't actually supplied with when we adopted them: The domestic violence - the girl had witnessed a violent attack - the drug abuse, the alcoholism and that the girl had actually been diagnosed with a behavioural disorder. Then, things all came into place - that love of a fight, the love of not doing what you're told, beyond what normal children do. The defiance was extreme. In the notes, it said the children and parents would need ongoing help and support. That was the first time in four years that anything had been mentioned to us about it. We should have known earlier. Not that it would have changed our minds about adopting the children, but we certainly could've parented our eldest child differently. We learnt that she gets off on the confrontation. We did a lot of reading on the subject and we learnt that it's one of the thing she enjoys so it was basically picking your battles.Even when social services did come out to us, we were told there was no funding available. They gave us a couple of weeks of anger management with a trainee social worker and that was it. They disappeared again. We tried to get help from the Child and Adolescent Mental Health Service (CAMHS) but every time we went there, they said it's because she's adopted, it's her age, she'll grow out of it.It settled down for two to three years but then as she got older, she started to struggle again. She was probably trying to identify where she came from and she found school and making friends hard. It took the adoption to nearly break down again and for her to be put herself in quite a serious situation with her lifestyle for help to finally come in.She was mixing with the wrong children, she was involved with drugs, alcohol and basically she would be friends with anybody who was nice to her so there was always a concern that she was going off with the wrong people.They were quick this time. But if they'd supported us more then we wouldn't be in this position. We paid for private counselling and that helped for a while, but then she said it wasn't for her.The 'highs and lows' of adopting children <https:\/\/www.bbc.co.uk\/news\/uk-wales-41693478>The adopted children confused by love <https:\/\/www.bbc.co.uk\/news\/education-44054794>'Powerful first moment' with adopted child <https:\/\/www.bbc.co.uk\/news\/av\/uk-wales-41693481\/adoption-father-on-powerful-first-moment-with-child>'We're scared of our adopted son' <https:\/\/www.bbc.co.uk\/news\/magazine-41332662>She tends to think she's older than what she is but she really is quite naive. So there's always the concern about who she's with - you've seen thestories of Rotherham and places like that <https:\/\/www.bbc.co.uk\/news\/uk-england-south-yorkshire-28934963>- and you're concerned because she's a pretty girl and there's always the risk that if the wrong person befriends her. I think if work had been done, perhaps when she was younger, she might have made good friends and been able to identify good friends and bad friends.She's left school, she's working, it's too late for her now but if she had help and support from social services earlier on, then things might have been different.We feel we've tried everything - you can only go banging on doors so many times before you're seen as a nuisance. You speak to social services, there's no funding or they tell you she's not bad enough. And yet, all the time, here's a child who has struggled with her adoption since she moved in.Our marriage is sometimes very strained. My relationship with some family members is strained to say the least. Until you've actually been in our shoes and had to put up with it day-in, day-out, then you don't know how you're going to react. It's affected our youngest child as well. He's had sleepless nights listening to his sister scream, seen his parents worried because she doesn't come home. He's had to deal with the aftermath and fallout from that and they don't get on, whereas before they were very close.To other parents who are thinking about adopting, I would say, go in with open eyes, make sure you research and are aware of what you're entitled to because nobody will tell you. Make sure that the match is your match and you're happy with everything because it's the children's lives as much as your lives and if the adoption breaks down it's going to have a massive impact.We used to contact our social worker and say, look, can you just come and check that everything is OK and that the children are happy? She used to say, that's not really my job. Check we're coping, check everything is how it's supposed to be. It makes a difference. It does feel like once you're adopted, that's it - you're done, you're dusted, the door is closed, thank you very much. You've taken two children off our hands and they're all yours.Support the parents more. Support the children more. Make people aware of exactly what is out there. Give more funding, make schools more aware - it would make a vast amount of difference to everybody.She was speaking to BBC Wales social affairs correspondent India Pollock. You can get help and find out more about issues around adoption from theNational Adoption Service Cymru <https:\/\/www.adoptcymru.com\/> and Adoption UK. <https:\/\/www.adoptionuk.org\/wales>"}