{"author":"By Katherine Sellgren","title":"Child gambling a 'growing problem' - study","news_category":"general","content":"Two-fifths of 11- to 16-year-olds have gambled in the past year, research suggests.Playing fruit machines was the most popular form of gambling, followed by playing cards for money with friends and scratch cards.Placing a private bet among friends and buying Lotto tickets were also among the top gambling activities.The Cardiff University research says gambling is an growing problem and more must be done to highlight the risks.The researchers analysed data from 37,363 11- to 16-year-olds at 193 secondary schools in Wales.These children had answered questions about gambling as part of the 2017 School Health Research Network Student Health and Wellbeing Survey.Respondents were asked a range of questions about gambling, including if they had gambled in the past 12 months, how often they had felt bad about gambling and what sorts of gambling they had participated in.The research found 41% had undertaken some form of gambling in the past 12 months.\"This is particularly concerning given that across the UK most forms of commercial gambling are only legal for those aged 18 and over,\" the study says.Noting fruit machines were the most popular form of gambling activity, the researchers add: \"This may be particularly problematic given their availability and potential to become habitual due to high operant conditioning processes, high event frequencies, near-miss opportunities and short intervals to pay out.\"Of those youngsters who said they had gambled in the past 12 months, 84% reported never feeling bad as a result.Boys were found to be more frequent gamblers than girls. Young people from minority ethnic groups, and pupils who felt they did not belong in their school, were also more likely to engage in gambling and to feel bad about the experience, the study found.Dr Graham Moore, at the Centre for the Development and Evaluation of Complex Interventions for Public Health Improvement, where the research was conducted, said: \"While over the past 20 years or so, lots of adolescent risk behaviours like smoking and drinking alcohol have become less common, we are seeing the emergence of new risk behaviours in today's society.\"Our research suggests that gambling might be emerging as a new public health issue.\"The evidence shows that people who gamble earlier in life are more likely to become problem gamblers in adulthood.\"The fact that there is widespread opportunity to gamble and limited education regarding its risks means that adolescents are particularly vulnerable to its harms.\"More work needs to be done, with policymakers, schools, families and young people, to understand how young people's exposure to gambling can be reduced.\"Lead author Prof GJ Melendez-Torres said: \"Problem gambling is associated with lower self-esteem, poorer school performance and an increased risk for other addictions, as well as feelings of guilt, shame and self-hatred.\"Our findings demonstrate the importance of educating young people and parents about the potential harms of gambling and support policy recommendations for schools and the education sector to raise awareness of these issues.\"In the UK, commercial gambling is legal for adults only, with two exceptions:"}