{"author":"","title":"Covid: Jobs threat at Cardiff Bus after passenger slump","news_category":"general","content":"More than 20% of jobs could be axed from Cardiff's council-owned bus operator due to a drop in passengers because of the coronavirus crisis.Cardiff Bus has told staff it \"will need to dismiss as redundant at least 130 members of staff across the entire workforce\" in a letter to the 700-strong workforce seen by the BBC.The firm said it would ensure it \"can be viable at 80% pre-Covid income\".Cardiff Bus said it was having \"discussions with staff and unions\".In its letter to staff, the company said it started a consultation process on Wednesday to \"resize the workforce\".\"The impact of Covid-19 is still with us and the pandemic is likely to impact our business for some time to come,\" the letter said.\"Now the time has come to propose some challenging changes that if implemented will go along way to safeguarding the future of Cardiff Bus.\"The company said the end of the UK government's furlough scheme <https:\/\/www.bbc.co.uk\/news\/explainers-52135342> in October and the fact its passenger base was \"anticipated to grow the maximum of 45% of pre-Covid levels\" as the reason for the proposed cuts.The planned cutbacks come nine months after Cardiff council announced a £2bn, 10-year transport plan <https:\/\/www.bbc.co.uk\/news\/uk-wales-51108586> which focused on enhancing the city's public transport network due to Cardiff's congestion and pollution issues.But as public transport was reserved for people with essential jobs <https:\/\/www.bbc.co.uk\/news\/uk-wales-53798693> during most of the Covid-19 crisis, customer numbers plummeted - and the firm predicts demand will now be less than half of pre-pandemic levels.\"Like all responsible businesses, we're constantly assessing how we can remain fit for the future,\" a spokesperson said.\"We are currently entering into a period of discussions with staff and their unions about possible options for reshaping and modernising our Company for the future.\""}