{"author":"","title":"Kim Jong-un calls for 'positive and offensive' security policy","news_category":"general","content":"North Korea's leader has called for \"positive and offensive measures\" to ensure the country's \"sovereignty and security\", state media said.Kim Jong-un was speaking at a multi-day gathering of party leaders in Pyongyang - unusual for this time of the year.The comments come amid concerns that the North could end negotiations on denuclearisation with the US, and restart major weapons testing.The US has said it would be \"extraordinarily disappointed\" by that.While the phrase \"positive and offensive measures\" is vague, it seems to imply further bolstering of North Korea's weapons programme - tactical or strategic, or both - says Minyoung Lee from specialist site NK News.\"State media's coverage of the plenum [meeting] tomorrow, or Kim Jong-un's New Year's speech, will likely lend further insight into Kim's next course of action,\" she added.Pyongyang threatened earlier this year to take a \"new way\", if Washington failed to offer concessions in the nuclear talks by the end of the year.According to North Korean state media KCNA, Mr Kim opened the party meeting on Saturday and presided over the session on Sunday. Reports also indicated the meeting would continue on Monday.The plenary party meeting is one of the communist state's highest decision-making bodies, though it is thought largely to rubber-stamp policies put forward by Mr Kim, who holds absolute power.It comes days ahead of the much-anticipated New Year's Day address, where Mr Kim has previously made big announcements related to denuclearisation.At the party meeting Mr Kim emphasised \"the need to take positive and offensive measures\" to \"fully ensure the sovereignty and security of the country, as required by the present situation\".Mr Kim did not elaborate on what \"offensive measures\" could mean.On Sunday - before Mr Kim's remarks were publicised - the White House national security adviser Robert O'Brien said the US had \"many tools in its tool kit\" to respond to any North Korean tests.\"We'll reserve judgment but the United States will take action as we do in these situations,\" he told ABC.\"If Kim Jong-un takes that approach we'll be extraordinarily disappointed and we'll demonstrate that disappointment.\"UN Security Council members are set to meet on Monday to discuss a proposal by Russia and China to lift some sanctions on North Korea to try to break the deadlock.Washington has previously refused to soften its own sanctions against Pyongyang.Two weeks ago, the US special representative for North Korea urged Mr Kim to restart negotiations.\"We are here, let's get this done,\" said Stephen Biegun.This video can not be played'Let me speak directly to our counterparts in North Korea...let's get this done'Mr Kim and Donald Trump held face-to-face talks in Singapore in June 2018, and in Vietnam in February this year, aimed at denuclearisation.The two leaders also held an \"impromptu\" meeting at the demilitarised zone (DMZ) that separates North and South Korea in June.But relations between the US and North Korea have deteriorated in recent months.North Korea has again started testing short-range missiles - though the long-range missiles are more controversial - and hostile language has also resumed.Pyongyang had set Washington an end-of-year deadline to offer sanctions relief, and had alsosuggested Mr Trump was a \"dotard\". <https:\/\/www.bbc.co.uk\/news\/world-asia-50682235>That came after Mr Trump again referred to Mr Kim as \"rocket man\"."}