{"author":"By Noor Nanji","title":"Electric car drivers must pay tax from 2025","news_category":"general","content":"Electric cars will no longer be exempt from vehicle excise duty from April 2025, the chancellor has said.Announcing the change as part of his Autumn Statement <https:\/\/www.bbc.co.uk\/news\/business-63555313>, Jeremy Hunt said the move was designed to make the motoring tax system \"fairer\".The RAC motoring group said it did not expect the change to dampen demand for electric vehicles (EVs).But others, including the AA, warned the move would reduce the incentive to switch to EVs.Mr Hunt said: \"Because the OBR (Office for Budget Responsibility) forecasts half of all new vehicles will be electric by 2025, to make our motoring tax system fairer I've decided that from then, electric vehicles will no longer be exempt from vehicle excise duty.\"Vehicle Excise Duty (VED) is a tax levied on vehicles on UK roads. At present, EVs are exempt.There are different rates depending on the vehicle.Under the plans laid out today, electric cars registered from April 2025 will pay the lowest rate of £10 in the first year, then move to the standard rate which is currently £165.The standard rate will also apply to electric vehicles first registered after April 2017.The chancellor said company car tax rates for electric vehicles will remain lower than for traditionally fuelled vehicles.RAC head of policy Nicholas Lyes said: \"After many years of paying no car tax at all, it's probably fair the government gets owners of electric vehicles to start contributing to the upkeep of major roads from 2025.\"Vehicle excise duty rates are unlikely to be a defining reason for vehicle choice, so we don't expect this tax change to have much of an effect on dampening the demand for electric vehicles given the many other cost benefits of running one.\"The Local Government Association also welcomed the move, saying that although electric cars are much less harmful for the environment than petrol and diesel cars, they still contribute to carbon emissions, congestion, and wear and tear on roads.\"It's only fair then that drivers contribute towards these additional costs and help support investment in even lower carbon alternatives such as public transport, buses, cycling and walking,\" said its transport spokesperson, David Renard.However, the AA said the introduction of the tax on electric cars would \"slow the road to electrification\".\"This may delay the environmental benefits and stall the introduction of EVs onto the second-hand car market. Unfortunately the chancellor's EV taxation actions will dim the incentive to switch to electric vehicles,\" said Edmund King, AA president.Nissan, which makes the Leaf electric vehicle, also said it was concerned about the impact on the market, but said it would continue to work with the government \"to tackle the main barriers to the electric vehicle transition, including public charging and measures to continue to support the purchase of EVs\".Kia, which sells hybrid and fully electric cars, said introducing the tax on EVs was \"at odds with the country's net-zero ambitions\".In another change unveiled in the Autumn Statement, the exemption for electric cars from the expensive car supplement has also been removed.It means anyone buying a new car - electric or otherwise - priced at more than £40,000 will face having to pay £165 in tax plus a £355 expensive car supplement every year from the second to sixth year of registration.Mike Hawes, chief executive of the Society of Motor Manufacturers and Traders, said the change to the expensive car supplement was \"the sting in the tail\" of the announcement, adding it \"will unduly penalise these new, more expensive vehicle technologies\".The sale of new petrol and diesel cars is due to be banned in the UK from 2030.This has prompted the question of how the tax revenue raised from car tax (VED) and fuel duty can be replaced. Between them, they raise some £35bn a year.In February, a committee of MPs suggested the government consider a form of \"road pricing\", where drivers pay according to the distance they've driven, the type of vehicle, and congestion.This has been suggested in the past but proved unpopular. However, the RAC thinks drivers now support the principle of \"the more you drive, the more tax you should pay\".Today, the chancellor did not commit to that.But his announcement means that in just a few years' time, electric car owners will go from paying no car tax, to paying the same as owners of petrol or diesel cars.Plus, owners of more expensive models will face the extra cost of an annual supplement for five years.Ian Plummer, director of automotive company Auto Trader, said the move would \"drive more would-be buyers away from EVs\" at a time when other incentives are also being removed, and high energy bills are reducing the merits of going electric.Meanwhile there was no mention in Thursday's Statement about what will happen to fuel duty next year. This makes up a substantial amount of the price paid for petrol and diesel on forecourts.It is scheduled to rise each year, but has been frozen since 2011. At the Spring Statement in March, it was cut by 5p to 53p, for 12 months.Today the OBR said it expects a 12p rise in fuel duty from April - if that 5p cut does end and there isn't another freeze.However, the Treasury said a final decision on fuel duty would be made at the Spring Budget."}