{"author":"","title":"Energy prospects blow hot and cold","news_category":"general","content":"As the year turns, and the economy turns downwards, the revolution in energy picks up pace.This time last year, oil and gas prices were rising on the back of economic recovery and rising tensions on Russia's border with Ukraine.The subsequent invasion, in February, turned energy markets upside down. The surge in fossil fuel prices, with subsequent declines but far greater volatility, changed the financial calculations on alternative sources of energy.One of the biggest accelerations we've seen has been towards hydrogen energy. What seemed some way over the horizon just a year ago is now getting much closer.Whether blue hydrogen, derived from gas, or the green variety, from using renewable power to split hydrogen from oxygen in water, it could be a big part of the energy mix in the north-east of Scotland. Where wind generation is far from conventional markets, on the Hebridean and northern islands for instance, hydrogen can be shipped out, to markets around the world.The market for receiving hydrogen and using it in heavy transport and in industry is being fast prepared on continental Europe. The Scottish government talks up the prospects of exporting to Germany, which fits with the political agenda of integrating into European energy markets.Meantime, on the Moray Firth horizon, I'm watching shipping busy with supply of equipment to the massive windfarms being constructed off the east coast. Far bigger ones were included in plans that won competitive bidding for ScotWind - the next and much bigger wave of offshore wind.Paying Crown Estate Scotland, and therefore its shareholder the Scottish government, £755m upfront for the right to develop designated sea areas was only the start. That kind of money shows developers are serious.With a requirement that they install within a decade, they are busy planning. Next comes assessment of impact and securing of finance.Following criticism that much of the current build-out of projects has been done by distant manufacturers, with too little benefit to Scottish industry, the ScotWind auction secured enormous commitments to local content.That now requires Scottish industry to step up to the challenge and opportunity, requiring investment at scale. The challenge is with sequencing that investment with a flow of orders, and then managing a flow of orders to avoid boom and bust.The order books could be even larger when you consider a parallel track of offshore wind developments to provide green energy to offshore oil and gas installations. They are very heavy users of fossil fuels in the process of extracting oil and gas, and decarbonising that process is a high priority for an industry keen to show willing in the great energy transition.INTOG - Innovation and Targeted Oil and Gas - is a big part of the answer. It is the innovation and bidding process for leasing rights through which offshore wind developers can power those platforms.Earlier this month, Crown Estates Scotland announced a healthy level of interest: 19 bidders at the first stage, 10 of those for the smaller innovation part of the process. Expect to hear more in April, as this bidding round is being run at quite a pace.This is likely to be even more about floating wind turbines than ScotWind. That is a technology at which Scotland - with Norwegian investment - has a lead. The first floating offshore wind farm, near Peterhead, has just passed its fifth anniversary. With 54% of capacity achieved, the five Hywind Scotland turbines have achieved the most efficient windfarm rating anywhere.Using that lead to generate jobs in manufacturing, even with a new technology, is continuing to prove difficult. To compete at scale with established fabrication yards requires big investment and, again, that is hard to justify until it's clear that the orders will follow.Putting further pressure on developers and the supply chain is the expectation of cost. Securing an area of seabed to develop is only the start. The finances stack up only when companies also secure Contracts for Difference from the UK government.These are a form of subsidy, at which UK energy customers, represented by the UK government, guarantee to pay a minimum price per unit of energy. That reassures investors. And if operators make profits above that price, they give it back to the customer.An important stage was reached earlier this month, when the UK government set out its \"administrative strike prices\". These are the maximum levels of payment per unit that the industry can expect to receive for each technology - much more for tidal, biogas, energy from waste and hydro than for offshore wind. They are designed to drive down prices, when they are followed by industry bidding to offer energy at the lowest price. So far, they've been very successful at doing that. The price of offshore wind has plummeted.Now, the government expects it to fall further - so much further that they think offshore windfarms can produce energy at lower prices than onshore windfarms. That may reflect the cost of trying to develop an onshore windfarm when the UK government has put so many obstacles in the way of placing them in the English countryside.The industry is alarmed that prices are being driven down so hard. The response to these administrative strike prices from Scottish Renewables was a warning that driving down costs is increasingly hard to achieve while also delivering on local content.And if there is so little headroom, added to rising interest rates on corporate debt, some of the hoped-for projects may not stack up financially. There is, says chief executive Claire Mack, a \"very real risk of stalling developments\".Investments are already being stalled by the long delay in announcing where Scotland's green free ports will be. After an impasse, the Scottish and UK governments agreed to work together on this last February. Bids had to be submitted by June.A decision was taken in early September on which two bidders will get these low-tax, tariff-free carve-outs. There's a high expectation that the Cromarty Firth and several sites in the Firth of Forth bid have won.But mainly because of turmoil in Downing Street, there has been no point at which a ministerial statement could be co-ordinated. There have also been talks about the consolation prizes for those that didn't win: Aberdeen, the Clyde and Orkney. Four months on, due to political delays, developers are ready to invest, but having to wait."}