{"author":"By Allan Preston","title":"Ash lead singer Tim Wheeler on dealing with loss through music","news_category":"general","content":"Losing a loved one to dementia is an experience that all too many families in Northern Ireland have to struggle through no matter what walk of life they come from.After the death of his father George in 2011, it is something that Downpatrick-born Tim Wheeler, frontman of rock band Ash, has decided to talk about through music with his first solo album 'Lost Domain'.Looking back to his childhood in Downpatrick, Tim said his musical life began with his father who would play the family piano for him and his siblings.\"My dad was very musical without really having any training, it was just part of him,\" he said.\"He would come home from work and the way he would unwind would be getting at the piano and playing, so music was always in the house. He was also very encouraging with me by getting me my first guitar.\"Ash got their first taste of success as a band while still at high school in Downpatrick - their headmaster famously gave them time off from their studies to tour - and Tim remembers how his dad reacted to his early success.\"My parents at first were slightly concerned that I wasn't getting enough school work done, but at the same time people were coming over from London, labels and lawyers who were very interested in us, so they recognised it was a great opportunity,\" he said.\"They were just keen for me to finish my A-levels, so as long as I did that I could really do what I wanted.\"Ash's career soon skyrocketed, with a number one album by the age of 21, as well as a headlining slot at the Glastonbury festival.Tim said that George continued to be \"embarrassingly proud\".\"He'd go to a music shop on his lunch break and he'd move all the Ash CDs to the front, he would always drive round with an Ash sticker on his car and even though I'd be cringing at it, he wouldn't let me take it off.\"It was in the middle of busy Ash rehearsals that Tim first got the news of his father's illness.\"The first time I ever saw him ill was when he had a heart bypass operation so I guess that was a big shock; he was getting older,\" he recalled.\"After that he was diagnosed with Alzheimer's and I remember I was in London rehearsing for a tour and my parents called me up so that was a big shock.\"He was really quite well for a couple of years after his diagnoses and all of a sudden he got an infection which really sent the dementia into full effect and from then he had quite a steep decline for six months. It was a very hard time.\"To deal with the experience Tim turned to music as an outlet, writing songs for what would become Lost Domain.\"I started writing the songs when my dad was in the dementia ward and I'd never experienced anything like that or seen someone behave that way, he was really struggling with it,\" he said.\"He was always trying to figure a way out of the situation so I was trying to understand it and process it a bit so I started writing songs and I think it was my way of helping myself deal with it.\"Although a difficult topic, one of the songs 'Vigil,' which dealt with George's final moments, celebrated the closeness of the family.\"I got to the end of the record and Vigil was one of the last songs I wrote, I knew there was part of the story I hadn't told.\"I was going through the whole experience of losing a loved one and being part of a close family, there was something very powerful about being there for his last few days and being together with my family.\"That's what I needed to write the song about. Also just seeing the way people treated him, the hospital staff in Downpatrick; although it was a very hard time, it was also something to be celebrated.\"With part of the profits of Lost Domain going to the Alzheimer's society, Tim Wheeler will be returning to Belfast to play songs from the album at the Oh Yeah centre on 7 November."}