{"author":"","title":"Newham mayor Sir Robin Wales deselected after 23 years","news_category":"general","content":"The UK's longest serving mayor has been deselected by his party after 23 years in power.Sir Robin Wales, the Labour mayor of Newham in east London, has been replaced in May's local elections by Rokhsana Fiaz.Sir Robin had faced opposition from some within his party who wanted to see change.Ms Fiaz, who has been a councillor for four years, called on Labour to \"unite\" and \"be truly radical again\".The former charity chief said if she is elected, her priority will be housing, promising an \"ambitious programme of genuinely affordable housing, with an initial target of 1,000 over four years\".She said the council owns \"enough land to build 35,000 homes\".In her campaign, Ms Fiaz, who is backed by pro-Jeremy Corbyn pressure group Momentum, also promised a referendum on the directly elected mayoral system at the council.Sir Robin Wales has ruled Newham for 23 years - first as Labour council leader and then as directly elected mayor when that role was created in 2002.Under his leadership Newham was transformed, not least because of the regeneration that came with the 2012 Olympics - which saw what's now known as the London Stadium built in the borough.But he made enemies in his own party along the way - with some unhappy at his forthright leadership style.A trigger ballot in which Sir Robin was automatically reselected as Labour candidate two years ago was challenged by his opponents - who claimed there were irregularities.Last month, the Labour Party decided to rerun the contest as an open selection. Sir Robin lost by 861 votes to 503.Rokshana Fiaz described herself as the \"unity candidate\" insisting other groups within the local Labour Party have also supported her.Sir Robin congratulated Ms Fiaz but described her promises as \"ambitious\" and said he was \"looking forward to seeing\" her implementing them.He also said the local party had \"fallen into internal sniping and disputes often based on untruths\" over the last few months.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Labour currently holds 59 of 60 seats on Newham Council with one seat held by an independent who was thrown out of the party."}