{"author":"","title":"Data from Thames sewage spills in Oxford to be shared","news_category":"general","content":"The UK's largest water company is developing a system to share real-time alerts when sewage is discharged into rivers and streams.Thames Water said it hoped to have the system from six of its sites in Oxfordshire \"up and running\" in April.The move comes after the company was recently fined £2.3m for polluting a stream in Henley-on-Thames with sewage. <https:\/\/www.bbc.co.uk\/news\/uk-england-oxfordshire-56251889>The company said residents and river users would be able to receive live data through email alerts.Thames Water said its view was \"discharges of untreated sewage are simply unacceptable, even when they are legally permitted\" and said it would \"accelerate work to stop them being necessary\".It is currently legal for raw, untreated sewage to be dumped into rivers and streams at times of heavy rainfall when treatment works are overwhelmed.But local authorities in Oxfordshire have called for more data on sewage spills, so that they can create \"designated bathing\" areas in the River Thames. <https:\/\/www.bbc.co.uk\/news\/uk-england-oxfordshire-56265880>The company said it had worked with the End Sewage Pollution group to create the data-collection systems, which are understood to be placed by waterways around Oxford, Cassington and Witney.Thames Water said it also planned to take samples of the Thames in Oxfordshire to analyse water quality.\"Our aim will always be to try and do the right thing for our rivers and the communities who love and value them. We're fully aware of our responsibilities,\" a spokeswoman said.Claire Robertson, founder of End Sewage Pollution, said testing the water quality was \"ground breaking\", and the first of its kind in the area for \"decades\".\"It will tell us a lot about the levels of bacteria in the water over the summer months, and where this is coming from.\"It is hoped more data on the water quality will aid an application for bathing water status in Oxford, which will be submitted in October.Follow BBC South on Facebook <https:\/\/www.facebook.com\/bbcsouthnews\/>, Twitter <https:\/\/twitter.com\/bbcsouthnews>, or Instagram <https:\/\/www.instagram.com\/bbcsouthnews>. Send your story ideas to south.newsonline@bbc.co.uk <mailto:south.newsonline@bbc.co.uk>."}