{"author":"","title":"Whittlesey: CPR 'mix-up death' care home concerns council","news_category":"general","content":"A council has raised concerns about a care home where no attempt was made to resuscitate a woman after she was confused for another resident.Joyce Parrott, 81, died at The Elms in Whittlesey, Cambridgeshire in April 2020 and operator HC-One hasapologised to her family for the error. <https:\/\/www.bbc.co.uk\/news\/uk-england-cambridgeshire-62650708>Cambridgeshire County Council confirmed it stopped placing new residents at The Elms on 8 July.HC-One said it was working to improve the performance of the home.Mrs Parrott's inquest earlier this month heard a paramedic was wrongly advised she had a \"do not resuscitate (DNR)\" order in place.Her daughter Caroline Porter said a nurse \"mixed my mum up with another Joyce\" and HC-One said it was \"deeply sorry that, on this occasion, a mistake was made which led to this individual not being supported in line with their care plan when they fell critically ill\".According to Ms Porter's lawyers, Ashtons Legal, an expert said it was \"highly unlikely that the outcome would have been different\" had CPR commenced when Mrs Parrott went into cardiac arrest.But Ms Porter said: \"I understand what the experts mean, but even the small chance is a chance. And she was denied that chance.\"Relatives of three other families had previously raised concerns with the BBC about The Elmsafter their loved ones died in 2019. <https:\/\/www.bbc.co.uk\/news\/uk-england-cambridgeshire-61597345>The Elms accommodates up to 37 people and is currently rated by the Care Quality Commission <https:\/\/www.cqc.org.uk\/location\/1-3015428856> as requiring improvement.The findings of a CQC inspection in June and July this year are expected to be published in the near future.Following a BBC report on Tuesday about Mrs Parrott's death, a county council spokesman said: \"Officers from our adult services team alongside our health partners have worked over a sustained period of time with The Elms and HC-One, seeking to address issues we have identified during our monitoring activities and as a result of concerns raised by families.\"This includes regular contact with the residents, to understand their experience of life there, and ensure their safety and wellbeing.\"We have directly escalated concerns to directors of HC-One... to request that the home is resourced to implement the required changes and where progress has not been as we would expect, we have alerted the home's regulator, the CQC, who are able to take further enforcement action.\"People whose care we arrange and their families everywhere in Cambridgeshire should be assured that we will always take action to address any shortcomings we find.\"HC-One said it had been trying to implement improvements \"against the backdrop of extreme recruitment challenges\" and they were reliant on using agency staff.A spokesperson said it had allocated additional senior colleagues to the home and was working with the council and CQC to \"improve the performance of the home\".\"Despite investing significantly in colleague pay and wellbeing this year... we have sadly struggled for some time with the recruitment and retention challenges which affect the whole social care sector.\"The latest workforce data shows that more than 10% of all roles in the sector are currently vacant, and that vacancies have increased by 52% in the past 12 months.\"At The Elms, we are far in excess of this average, with vacancy rates among our care colleagues reaching 20%.\"Agency nurses and carers are intended to cover short-term staffing gaps, such as a colleague being off sick; they are not a long-term solution to the systemic recruitment challenges.\"Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}