{"author":"","title":"Alexei Navalny: Russia's jailed vociferous Putin critic","news_category":"general","content":"This video can not be playedAlexei Navalny: what you need to knowAnti-corruption campaigner Alexei Navalny has long been the most prominent face of Russian opposition to President Vladimir Putin.The 45-year-old blogger has survived poisoning with a nerve agent and is now behind bars. Even though he has been unable to challenge the president at the ballot box, his voice retains its power for many Russians and he remains a threat to the Kremlin.He has millions of Russian followers on social media - many in their early 20s or younger - and his campaign group's anti-corruption videos have reached millions.Navalny, whose organisations have been banned as \"extremist\" in Russia, nearly died in August 2020 when he was attacked with a Novichok nerve agent in Siberia.But his team had him flown to Berlin and he recovered over a period of months, returning to Moscow on 17 January and immediate detention.His supporters staged mass protests across Russia and police responded with force, detaining thousands for attending the unauthorised rallies.Although he and his anti-corruption team were banned from standing in parliamentary elections, they still managed to anger the Kremlin with a \"smart voting\" app that encouraged voters to back candidates who had a chance of defeating Mr Putin's United Russia party.Navalny's consistent message is that Mr Putin's party is full of \"crooks and thieves\". He has accused the president of \"sucking the blood out of Russia\" through a \"feudal state\" concentrating power in the Kremlin. That patronage system, he claims, is like tsarist Russia.He speaks the street language of younger Russians and uses it to powerful effect on social media. His Anti-Corruption Foundation (FBK) has made detailed claims about official corruption.After Navalny's arrest in January, his team published the \"Putin's palace\" video on YouTube <https:\/\/www.youtube.com\/watch?v=ipAnwilMncI> which focused on a vast luxury Black Sea palace, allegedly gifted to Mr Putin by rich associates.The video has been viewed well over 100 million times. The Kremlin dismissed it as a \"pseudo-investigation\" and Mr Putin called it \"boring\", denying the claims. Later billionaire businessman Arkady Rotenberg, one of Mr Putin's closest friends, said it was his own palace.After Navalny was given a jail term in February 2021, the European Court of Human Rights ruled he should be freed immediately because of the risk to his life, but Russia rejected the decision.He went on hunger strike, protesting that authorities at the penal colony in Vladimir, 100km (60 miles) east of Moscow, were refusing to give him proper treatment for leg and back problems.Controversially, Amnesty International revoked his status as a \"prisoner of conscience\" in February, before conceding it had been subjected to an \"orchestrated campaign\" to \"delist\" him and then reversing its decision.At issue were xenophobic comments he had made years before but had not disavowed. In videos dating back to 2007 he appeared to compare ethnic conflict to tooth decay and likened immigrants to cockroaches. He has also said the Crimea peninsula \"de facto belongs to Russia\", despite international condemnation of Russia's 2014 annexation of the Ukrainian territory.Meanwhile, the Russian government has continued to punish Navalny. In June 2022, his allies raised the alarm after they discovered he was no longer in the prison where he had been serving his sentence. Federal prison authorities later admitted he had been moved to a maximum security penal colony, the IK-6 prison, over 155 miles (249km) east of Moscow, where he says he has been repeatedly placed in solitary confinement.On 2 February a Moscow court jailed Navalny for violating the terms of a 2014 suspended sentence for fraud.The case against him was based on his failure to report regularly to police during 2020. His legal team said that was absurd, as the authorities knew full well he was getting emergency treatment in Berlin for the Novichok nerve agent attack in Siberia. He reminded the court he had been in a coma during part of that time.Navalny argued that between January and August 2020, before the poisoning, he had reported to police twice a month. He dismissed the fraud case as fabricated in order to silence him.The case concerns alleged embezzlement from a Russian subsidiary of French cosmetics firm Yves Rocher and from a timber firm, Kirovles. His brother Oleg was jailed for three-and-a-half years and Alexei got the same term, but suspended.That 2014 fraud conviction itself was condemned in 2016 by the European Court of Human Rights, which found that Navalny's rights had been violated, and it ordered Russia to pay him and Oleg compensation. But later the Russian Supreme Court upheld the conviction.Navalny's battle against President Putin, 69, is now intensely personal: he accuses the president of ordering state agents to poison him - and he repeated that allegation in court.\"His main gripe with me is that he'll go down in history as a poisoner,\" Navalny told the court scornfully. \"We had Alexander the Liberator, Yaroslav the Wise, and we will have Vladimir the Underpants Poisoner.\"Underpants became a social media meme in Russia after Navalny carried out a telephone sting in December on a Russian FSB state security agent, who revealed that Novichok, a highly toxic Russian chemical weapon, had been smeared on Navalny's underwear.In August 2020 Navalny collapsed on a flight over Siberia and was rushed to hospital in Omsk. That emergency landing saved his life. A German-based charity persuaded Russian officials to allow him to be airlifted to Berlin for treatment.In September the German government revealed that tests carried out by the military found \"unequivocal proof of a chemical nerve warfare agent of the Novichok group <https:\/\/www.bundesregierung.de\/breg-de\/aktuelles\/erklaerung-der-bundesregierung-im-fall-nawalny-1781790>\". The Kremlin denied any involvement and rejected the Novichok finding.The EU then imposed sanctions on six top Russian officials and a Russian chemical weapons research centre, accusing them of direct involvement in the poisoning. Russiaretaliated with tit-for-tat sanctions. <https:\/\/www.bbc.co.uk\/news\/world-europe-55409892>Novichok was the chemical weapon which nearly killed former Russian spy Sergei Skripal and his daughter Yulia in Salisbury, England, in March 2018. A local woman died later from contact with Novichok.Mr Putin admitted that the state was keeping Navalny under surveillance - it was justified, he alleged, because US spies were helping the blogger.Detective work by the investigative group Bellingcat pointed to long-running Federal Security Service (FSB) shadowing of Navalny - despite the official denials. And Bellingcat named agents it suspected of poisoning him.Despite his confinement, Navalny has become one of the leading domestic voices against the war in Ukraine. During a court appearance in May 2022, he accused Mr Putin of starting a \"stupid war\" with \"no purpose or meaning\". And in September, he accused Russian elites of having a \"bloodthirsty obsession with Ukraine\" in an article for the Washington Post.His foundation have also continued to oppose the government, speaking out against the mobilisation of some 300,000 civilians to fight in Ukraine and pledging to be a \"partisan underground\" movement inside Russia.But the next big test is whether Navalny can still organise - from jail - big, unauthorised street protests against official corruption. The police have cracked down hard, detaining his wife Yulia and his top FBK assistants.This video can not be playedHundreds of protesters in Moscow were detained by police For years he has led nationwide protests, but in 2018 he was barred from challenging Mr Putin at the ballot box, because of his fraud conviction.Navalny is familiar with the physical risks in Russia, having been attacked before the Novichok poisoning. And he has been arrested repeatedly.In 2019, he was diagnosed with contact dermatitis whilst in jail, with his doctor suggesting he might have been exposed to \"some toxic agent\".He has also twice been targeted with antiseptic green dye known as zelyonka and suffered chemical burns to an eye.His rise as a force in Russian politics began in 2008, when he started blogging about alleged malpractice and corruption at some of Russia's big state-controlled corporations.One of his tactics was to become a minority shareholder in major oil companies, banks and ministries, and to ask awkward questions about holes in state finances.When he was briefly jailed in July 2013 for embezzlement in the city of Kirov, the five-year sentence was widely seen as political.He was unexpectedly allowed out of prison to campaign for the 2013 Moscow mayoral elections, in which he was runner-up with 27% of the vote, behind Putin ally Sergei Sobyanin.That was considered a dramatic success as he had no access to state TV, relying only on the internet and word of mouth.Navalny told the BBC the best thing Western states could do for justice in Russia was to crack down on \"dirty money\".\"I want people involved in corruption and persecution of activists to be barred from entering these countries, to be denied visas.\""}