{"author":"By Robbie Meredith","title":"Paleo Pines: NI Screen makes biggest video game investment","news_category":"general","content":"Northern Ireland Screen has made its biggest investment in a single video game to date.The industry body has provided £218,000 in production funding towards the game Paleo Pines.It is being developed by the County Down game development studio, Italic Pig, and the UK publisher, the Irregular Corporation.The total cost of the production has not been disclosed but is more than £1m.Paleo Pines is a simulation game where players become dinosaur ranchers.They befriend dinosaurs and accompany them to discover new worlds.The game was originally conceived by Jordan Bradley, a game artist at Italic Pig, and has already attracted interest on social media.It is expected to be ready in 2021, following an 18-month production period.Northern Ireland Screen chief executive Richard Williams said: \"As the first seven-figure game to be produced locally, Paleo Pines is hugely important to the development of the video games industry in Northern Ireland.\"It's a real step up for significant finance and distribution to be attracted to a game and company almost from the start of development.\"We're very excited to see what this game can do for both Italic Pig and for the video games industry here generally.\"Northern Ireland Screen plans to spend about £300,000 per year on video game production funding until 2022, according to its Opening Doors strategy for 2018-2022.It also plans to commit a further £2.8m over those four years in development funding for Northern Ireland's video game industry.That includes running costs for the Pixel Mill game development co-working space in Belfast.From 2014-2017, NI Screen spent about £1m supporting 30 Northern Ireland video game companies with game development costs.A further £236,000 was spent on game production funding during that period.Although Northern Ireland Screen provided £625,000 in funding to a scripted content project called Sepia from Xbox entertainment, \"the value of this disappeared when Microsoft shut down Xbox Entertainment\", according to Opening Doors.However, Northern Ireland Screen said that there was still a return of about £2.5m on the Sepia funding, even though the project was ultimately unsuccessful."}