{"author":"By Robbie Meredith","title":"Krypton: Belfast-filmed Superman prequel cancelled","news_category":"general","content":"Belfast Harbour Studios has said it seeking a new tenant after the TV series Krypton was cancelled.Two series of the Superman prequel had been filmed in the studios over the past two years <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-40175179>.According to reports in the USA, Krypton was dropped by the Syfy channel due to falling ratings.It was produced by Warner Horizon Scripted Television, an arm of the Warner Bros group.The £20m Belfast Harbour Studios were opened in June 2017 by the Belfast Harbour Commission.In a statement to BBC News NI, a spokesperson for the studios said that it had been \"fantastic\" to have Krypton as its first tenant.\"It is testament to the growth of the film industry in Northern Ireland that we are now able to accommodate productions of this scale,\" they said.\"However, we are aware that it is the nature of the film and television business that decisions are taken every year to commission, review or cancel different productions.\"\"Belfast Harbour Studios is working closely with NI Screen to bring in a new tenant and there has been significant interest from a number of parties.\"\"Studio space is in high demand around the world and Belfast harbour continues to plan further investment in the facility.\"The harbour is currently awaiting planning permission to build more studio space at the site on the north foreshore of Belfast Lough.According to the Sunday Times newspaper, only 350,000 in the USA had watched the final episode of the second season of the series.Northern Ireland Screen had invested an initial £2.4m in production funding in Krypton, according to the industry body's 'Opening Doors' strategy report.However, they said that had brought an estimated return of almost £20m on expenditure on goods and services into the Northern Ireland economy.The Northern Ireland film and television industry has grown substantially in recent years, anchored by the success of Game of Thrones which was filmed at a number of locations including the Titanic Studios.While NI Screen said in 'Opening Doors' that it is \"unlikely that the extraordinary longevity of Game of Thrones will be repeated,\" it said in plans to invest £14.4m until 2022 to attract large-scale productions like Game of Thrones and Krypton.Meanwhile, a number of significant productions continue to be filmed in Northern Ireland.The comedy thriller 'Pixie', starring Olivia Cooke, Alec Baldwin, Dylan Moran and Colm Meaney, is currently in production in Belfast.'Ordinary Love', starring Liam Neeson and Lesley Manville, and 'A Bump Along the Way', starring Bronagh Gallagher, will also go on general release in the coming months.The hit BBC TV series Line of Duty is also filmed in locations in Belfast."}