{"author":"By Jenny Coleman","title":"Oldham Coliseum Theatre closes for redevelopment","news_category":"general","content":"Its boards have been trodden by some of the biggest names in theatre.Charlie Chaplin and Stan Laurel performed there, London's Sadler's Wells used it during World War II and the first cast of Coronation Street cut their teeth there in the 1950s.Now, after 125 years at their current site, Oldham Coliseum Theatre in Greater Manchester is closing its doors for a major redevelopment.The theatre in Fairbottom Street is having a £1.5m facelift, with better seating, heating and front of house facilities being added to the venue.Established in 1885, the Coliseum began its life as a circus on Henshaw Street.However, when the council demanded that site for use as a market, its owner and builder Thomas Whittaker was forced to relocate.Oldham Coliseum Executive Director David Martin said: \"The wooden theatre was dismantled and moved plank by plank to its current site at Fairbottom Street.\"It opened in 1887 as The Grand Circus and the area which is the bar now was actually a stable yard where the animals lived.\"The circus ring was in the middle where the stall seats are now and it seated 3,000 people.\"After being bought by Peter Yates, of Yates's Wine Lodges, in 1903, the theatre became a popular music hall visited by popular stars of the time.Mr Martin said: \"Over the next 28 years, the theatre saw performances from Charlie Chaplin and Stan Laurel who were touring with Fred Karno Troupe - all the big names performed here.\"After a brief spell as a cinema in the early 1930s, the theatre closed and its furniture and fittings were sold off.In 1938, the building was reopened as the Oldham Repertory Theatre under the direction of Douglas Emery.Mr Martin said: \"At this point, because the theatre had been stripped of its interior including the floorboards, the auditorium actually had an earth floor.\"Because of the issues in getting a licence they could only open as a private club. It was made of wood, there were no fire escapes so you had to be a member to come and see a play.\"Word got around about the quality of actors at the venue and towards the end of the 1950s the resident repertory actors began to move on.\"Oldham Rep performers began to be picked off for telly,\" Mr Martin said.\"William Roache, Jean Alexander, Pat Phoenix - because of their authentic Manchester voice, the Oldham Rep actors became the original cast of Coronation Street.\"The Oldham Repertory lasted until 1978 when it was reconstituted as the Oldham Coliseum Theatre and ownership was transferred to Oldham Council.Now the Victorian building needs a new heating system, asbestos to be removed and complete decoration.Mr Martin said: \"The Coliseum is an outstanding jewel in Oldham and the Victorian auditorium is the jewel of the Coliseum. It is going to be removed modernised and put back and we will are being careful to keep the lovely period charm.\"We see it as an opportunity to add value for our customers and we are planning a big show for our return later in the year.\"The theatre is moving to Grange Arts Centre, Rochdale Road, until September and is touring shows throughout the summer."}