{"author":"By Hannah Miller","title":"Why inflation is falling but prices are still rising","news_category":"general","content":"Every month we report the UK's inflation figures, but what does this percentage going up or down actually mean for your money?The inflation figure gives us an idea of how fast the cost of living is rising in the UK but here are a few things you might not know.Inflation came down to 10.1% in January <https:\/\/www.bbc.co.uk\/news\/business-64637705> from 10.5% in December and 10.7% in November. So does this mean prices are on their way down too?Unfortunately not. Prices are still rising quite sharply compared to a year ago, just at a slower rate than they have been.Prices are still likely to keep going up over the next few months, but not at the rate that has caused such a shock to households and businesses across the country over the last year.The inflation figure is an average - so your own cost of living could be rising at a very different rate to what's reported in the news, depending on what you spend your money on.The Office for National Statistics (ONS) which calculates inflation, bases its numbers on a basket of goods that reflects what most people across the UK are buying. But it doesn't include everything. So if you are buying a lot of unusual or niche items, or you have atypical tastes, you might find the cost of your own bag of shopping is going up more quickly - or more slowly - than the headlines suggest.Food inflation is currently at 16.7%, much higher than the average rate, so people who spend a greater proportion of their outgoings on food will find their personal inflation rate is higher than the 10.1% headline figure.The ONS says energy, food, and drink accounts for around 15% of lower-income households' spending, compared to 10% for high-income groups.The Bank of England tries to control inflation by putting up interest rates which makes it more expensive to borrow money. This encourages people to borrow and spend less, and save more.The Bank is expected to stick with that strategy - of putting up interest rates - throughout this year. So if you have a tracker mortgage or a credit card or loan you could find yourself paying more interest. That's another way your own personal inflation rate could be affected.Try our personal inflation rate calculator <https:\/\/www.bbc.co.uk\/news\/business-62558817>Occasionally prices will fall very slightly compared to the previous month, but they are much less likely to fall year-on-year.And while this might be difficult to believe right now, falling prices aren't always a good thing - here's why.If people expect that prices are likely to fall, they delay spending with the aim of getting a cheaper deal later on.That means businesses have less money coming in, so they try to find ways to cut costs - most likely by cutting wages or laying off staff.So prices falling can mean people lose their jobs, which in turn makes prices fall further. This is called \"deflation\", a different kind of economic crisis that brings its own set of problems.That's why the Bank of England aims to have prices consistently rising by 2% - it's better to aim for a bit of inflation than to risk the negative effects of prices falling.It's important to remember that the price rises we've seen recently have been primarily driven by global energy prices. These are expected to come down, but not to as low as they were before, and any fall in energy prices will take time to feed through into the wider economy."}