{"author":"By Oli Constable & Simon Thake","title":"Circus Cortex: Warrior theme for Ukrainian show starting in Sheffield","news_category":"general","content":"A Ukrainian circus troupe will perform warrior-themed shows in tribute to their families back home.Yorkshire-based Circus Cortex is mainly comprised of performers from the war-torn country.Boss Irina Archer said the show's theme was decided before the Russian invasion but was now a nod to family and friends fighting for their country.\"Somehow by fate it fits so much because they are warriors, you can't say anything different,\" she said.Last year, shows were delayed as performers were conscripted into the military or had their visas frozen.However, the circus was in a \"better position this year\", with more people being able to come to the UK, Ms Archer said.\"We have some of the old ones which came back from last year and we have got 50% of the new ones, but we still have 50 Ukrainians here.\"A recent injury to a BMX stunt rider led to the circus looking for sponsors for new visas, which Ms Archer said had been difficult.\"Not many people have been coming forward to sponsor Ukrainians [now]. I'm already sponsoring six, so I've had to look for people who can help us again, but by the skin of our teeth we've got everyone here,\" she said.Choreographer Svitlana Dvoyashkina said she had not seen her mother, who lives in northern Ukraine, for a year.\"The war is very dangerous. One day I told her I [would] come, and she said don't come because she is worried.\"We decided I go in the summer. I miss her, and all my friends.\"Trapeze artist Sergey Malinovskiy said his Ukrainian colleagues would keep a close eye on what was happening back home.\"It's a little bit hard but every day we check news, every attack. We always keep phone calls with my family and they feel good when we talk.\"When the music start, I try to 100% be on the stage so I cannot think about nothing but the work.\"The Circus Cortex UK tour opens in Sheffield on 31 March.Follow BBC Yorkshire on Facebook <https:\/\/www.facebook.com\/BBCYorkshire\/>, Twitter <https:\/\/twitter.com\/bbclooknorth> and Instagram <https:\/\/www.instagram.com\/bbcyorkshire\/>. Send your story ideas to yorkslincs.news@bbc.co.uk <mailto:yorkslincs.news@bbc.co.uk>."}