{"author":"By Laura Cress & Tom Richardson","title":"Vampire Survivors team in shock at Bafta Game Awards win","news_category":"general","content":"God of War: Ragnarök may have been the big winner at the Bafta Game Awards, but it didn't take home the night's biggest prize.Instead, the series known for its hero's battles against giant monsters lost out on best game to a much smaller opponent - Vampire Survivors.The survival game, with its retro 2D graphics and addictive gameplay, has become a big hit since its release.But its award win surprised many, including the people who made it.If you were watching the awards - either in person or via livestream on Twitch - you'll have heard a huge gasp when gaming journalist Aoife Wilson announced Vampire Survivors had won.\"I just thought - you know it'd be really cool if they said our name, but it's not gonna happen,\" says Mathew Gurunlian, from development company Poncle.\"And then they said our name.\"Unlike the Triple-A titles it was nominated against, which are worked on by hundreds of people, Vampire Survivors was worked on by a much smaller development team.Small enough, in fact, for all of them to fit on the stage when it was time to collect their award.That includes Mathew, Poncle's lead QA engineer.\"I was the first one on stage,\" he says. \"She just handed me the award and I was like: 'Where's everyone else?'\"And then everyone came up behind me and I just shuffled back.\"It was weird. It was a state of disbelief.\"Once the whole team had caught up, technical director Sam McGarry stepped forwardto make the acceptance speech <https:\/\/twitter.com\/BAFTAGames\/status\/1641550211624361986>.Overall, the gaming Baftas were a good night for independent titles, with Rollerdrome, Tunic and Immortality among the other award winners.Mathew says it feels \"amazing\" to be recognised on such a big stage, but that all the nominees - big and small - \"deserved to be there\".\"It makes for a nice balance,\" he says.Mathew believes the success of Vampire Survivors owes a lot to its thriving online community, whose feedback helps to shape updates and new content.A second expansion pack - Tides of the Foscari - is due for release on 13 April.And the other secret to its success? \"It's just a lot of fun,\" says Mathew.\"You can lose a lot of hours playing it, it's that 'one more time' kind of game.\"Follow Newsbeat on Twitter <https:\/\/twitter.com\/BBCNewsbeat> and YouTube <https:\/\/www.youtube.com\/channel\/UCe1Ef-K5jpnRsmVY5hCBhOw>.Listen to Newsbeat live <https:\/\/www.bbc.co.uk\/sounds\/play\/live:bbc_radio_one> at 12:45 and 17:45 weekdays - or listen backhere <http:\/\/www.bbc.co.uk\/programmes\/b006wkry\/episodes\/player>."}