{"author":"","title":"North Wales seaside photos resurface after 40 years","news_category":"general","content":"Michael Bennett looks back on his seaside photographs, buried away and forgotten for nearly 40 years, that caused a stir before their first exhibition.In 1979, a newly reopened Llandudno gallery commissioned him for an exhibition depicting north Wales' coastal towns.\"I was asked to capture the melancholy of seaside resorts out of season,\" he says.\"North Wales in the harsh winter of 1979 was particularly bleak.\"But when he delivered the project, Bennett was surprised to find the gallery responded negatively to the images.\"The gallery commissioner almost certainly expected a romanticised impression of the coast,\" he says.\"To me, this wouldn't have been honest - I felt I needed to show exactly how it was.\"I guess I gave them too much reality, grit and detail - they didn't like it at all.\"It affected my confidence for quite a while.\"Following a change in the gallery's directorship, however, Bennett was asked to re-photograph the same locations during summer.Leaving behind the bulkier equipment he used in winter, he opted for a small camera that - despite having a fixed wide-angle lens and limited focus control - would allow him to discreetly capture more candid images.\"I worked very close to subjects with a tiny, cigarette-packet-sized camera,\" he says.\"I wanted to be in close contact, not shoot from a distance.\"However, I found it was pretty much the same [as winter] - just warmer, with more people.\"Still unsatisfied, the gallery reworked the 1980 exhibition to include other photographers' work alongside Bennett's.After that, Bennett's photos lay forgotten, until 2019, when he saw a call for submissions to the Turner Contemporary's Seaside Photographed exhibition.\"I thought submitting was pointless - I had no confidence in these seaside pictures,\" he says.\"Not only were the prints not rejected, they asked to see more - then, more. \"Ultimately, a wall in the gallery was set aside to show them.\"I hadn't realised at the time I was capturing a piece of social history.\"It's a bitter-sweet sensation for the project to be shown again - after four decades, I feel for the first time that I did something worthwhile.\"Michael Bennett's book Pier Closing Time is published by Cow On The Roof Press.Seaside Photographed <https:\/\/jhg.art\/video\/seaside-photographed-virtual-tour\/> is on tour at the John Hansard Gallery, Southampton, until 23 January 2021."}