{"author":"","title":"Stormy Daniels: Trump invited to testify before grand jury","news_category":"general","content":"New York prosecutors have invited ex-US president Donald Trump to testify to a grand jury over the Stormy Daniels case, his lawyer has confirmed.The Manhattan district attorney has investigated Mr Trump for five years over alleged hush money payments made on his behalf to the ex-porn star.Inviting him to a grand jury indicates he could face charges, experts say. Ms Daniels says she got $130,000 before the 2016 election in exchange for silence about an alleged affair.Mr Trump denies they had sexual relations.A grand jury is set up by a prosecutor to determine whether there is enough evidence to pursue charges in a case. It is held in secret, and several former aides of Mr Trump have reportedly testified in this case.If prosecutors proceed, it could be the first criminal case ever brought against a former US president.The New York Times was the first to report <https:\/\/www.nytimes.com\/2023\/03\/09\/nyregion\/trump-potential-criminal-charges-bragg.html> Mr Trump had been invited to testify to the grand jury.If the Manhattan district attorney's office has asked Mr Trump to appear, that indicates the office may be considering indicting the former president, Catherine Christian, a former financial prosecutor in District Attorney Alvin Bragg's office, told the BBC.Mr Trump, she said, is unlikely to accept the opportunity to testify.\"Most people decline for a host of reasons. You waive immunity, you open yourself up, if you lie, to perjury charges,\" she said. \"You're also letting the district attorney know what your defence is.\"The Stormy Daniels case is one of several cases in which Mr Trump is currently being investigated, although he has not yet been charged in any and denies wrongdoing in each.They come as the 76-year-old Republican embarks on another campaign for the White House.Prosecutors have not commented on news of the invitation, reported in US media and confirmed by Mr Trump's legal team.The case stems from an allegation that Mr Trump directed his former lawyer to pay Stormy Daniels, an adult film actress, to stop her speaking out about an alleged affair.The lawyer, Michael Cohen, was later jailed on multiple charges. Cohen testified under oath that Mr Trump had directed him to make the payment of $130,000 (£110,000) just days before the 2016 election.Mr Trump has acknowledged reimbursing the payment but denied the affair and any wrongdoing regarding campaign laws.The former president could face two charges for his actions, Ms Christian said.The first, she said, could be a straight-forward misdemeanour charge for falsifying business records, as prosecutors allege he listed reimbursements he made to Cohen as legal fees.The district attorney's office may also seek to charge Mr Trump with a low-level felony, but that presents a much more complicated legal case, she said.The felony charge would be brought against Mr Trump for falsifying business records with the intent to commit or conceal a second crime.Prosecutors could argue Mr Trump's efforts to hide his payments to Ms Daniels were election campaign related, as he allegedly did so to keep voters from knowing he had engaged in an \"illicit relationship\" with Ms Daniels, Ms Christian said - something she called \"a novel theory\".\"That doesn't mean they can't prove it and get a conviction, but it's going to be tough.\"If convicted, Ms Christian said Mr Trump could face probation or a fine. \"But it would still be a felony, and who wants to be charged with a felony, and who wants to convicted of a felony? Certainly not a former president,\" she said.On his social media network Truth Social, Mr Trump himself called the investigation a political witch-hunt by what he described as a \"corrupt, depraved, and weaponised justice system\".Prior to a meeting with the Manhattan DA on Friday, Cohen told media he \"applauded\" Mr Bragg for \"giving Donald the opportunity to come in to tell his story\".\"Now, knowing Donald as well as I do understand that he doesn't tell the truth,\" Cohen told the BBC's US partner CBS News. \"It's one thing to turn around and to lie on your untruth social. It's another thing to turn around and lie before a grand jury.\"Legal wrangling over the allegations about Ms Daniels were ongoing throughout the Trump presidency.A federal inquiry into the Stormy Daniels case was dropped in 2021 after he left office but Manhattan District Attorney's Office has been running a separate investigation since 2018.This video can not be playedWatch: Grassroots Republicans can't quit Donald TrumpWith additional reporting by Madeline Halpert."}