{"author":"By Katie Silver","title":"Girl's lung collapsed after screaming at One Direction","news_category":"general","content":"A 16-year-old fan's 'lung collapsed' after she screamed too much at a One Direction concert, an emergency doctor told the BBC.The girl became short of breath during the concert but continued cheering \"because she was a super fan\".When she attended the hospital straight afterwards, they found air had leaked into three different anatomical spaces.Published in the Journal of Emergency Medicine <http:\/\/www.jem-journal.com\/article\/S0736-4679(17)30711-4\/fulltext>, it's the first time a case of this kind has been documented.Dr J Mack Slaughter treated the girl, (who remains anonymous) at the Children's Medical Centre in Dallas: \"Her oxygen levels were fine. She didn't look like she was seriously ill,\" he said.\"But instead of breathing a normal 12-16 times a minute, she was breathing 22 times a minute. So we knew something was a little off by that.\"In a physical exam, Dr Slaughter also noted she had crepitus, \"a crunchy sound - like the sound Rice Krispies make - when you press on certain parts of the body.\"This showed him that a \"small amount of air had made its way out of the respiratory track into soft tissue.\"He found a tear in the lung had caused air to escape in three places: between the lung and the chest wall, into the chest cavity and behind the pharynx.The combination of these three diagnoses hadn't been seen before, Dr Slaughter said.He said this leakage of air is \"typically caused by an inciting event\", such as during an asthma attack, heavy weightlifting, diving or military flying, due to the sudden changes in air pressure.Screaming or singing causing it is so rare, that Dr Slaughter could only find two other case reports. One was a drill sergeant while the other was an opera singer.While it's possible the condition was pre-existing, he said this is very unlikely.The team performed a CT scan to make sure it wasn't something specific to her anatomy: \"The scan gave us more detail as to where the air was and how much. But it didn't help us determine why this happened to her and not the other 19,000 girls in the audience!\"With a history of type 1 diabetes, the team also tested her to ensure this wasn't causing her fast breathing rate.When this was ruled out, she was kept overnight. X-rays were taken again to make sure the air wasn't advancing: \"It was stable and safe to send her home,\" Dr Slaughter said.The body typically reabsorbs the air and the tear can repair itself, he said. Dr Slaughter treated the patient three years ago and said: \"I never saw her again. I told her she'd be famous and get to go on the Jimmy Fallon show and meet One Direction but she was too embarrassed,\" he said."}