{"author":"","title":"Radio station's shock at presenter O'Grady's sudden death","news_category":"general","content":"A radio station due to host Paul O'Grady over Easter said the news of his death was \"absolutely shocking\".The presenter had been due to host a show on Warwickshire-based Boom Radio on Easter Sunday after a successful programme on Christmas Day.The station's co-founder Phil Riley said O'Grady had \"rocketed our audience\" and garnered them a record number of listeners.\"The bond between him and radio listeners was fantastic,\" he said.\"We definitely benefitted even in just a small way from that. It's tragic he won't be able to carry on that bond with listeners because they absolutely loved him.\"O'Grady rose to fame in the 1990s, hosting entertainment programmes as his drag persona Lily Savage before going on to host a number of chat shows out of drag.His husband Andre Portasio announced on Tuesday evening he had died \"unexpectedly but peacefully\" at the age of 67.Mr Riley, from Leamington Spa, said he had been speaking with management \"only yesterday\" about finalising details for a long term contract with the TV star.\"It's absolutely shocking,\" Mr Riley said, extending his sympathise to O'Grady's family and friends. \"I don't think anybody's come to terms with it yet.\"He believes that while O'Grady, who he described as \"larger than life\", dazzled on TV, \"his personality was probably best suited for radio\".\"He was like the cheeky neighbour that had come round for a gossip and to tell you what was going on with the other neighbours, that you're having a laugh over a cup of tea,\" Mr Riley said.\"That was the relationship he had with the audience and that's why they loved him.\"O'Grady's long-time radio producer Malcolm Prince, from Solihull, said he had visited the star at his home on Tuesday afternoon, describing him as \"laughing, smiling, and full of life\".Mr Prince posted on Twitter: \"He was so proud of Annie, so happy to be back on Boom Radio, and he was looking forward to so many new projects.\"And now he's gone. I can't believe it. We have lost a unique talent - and I've lost a dear friend.\"Follow BBC West Midlands on Facebook <https:\/\/www.facebook.com\/MidlandsBBC\/>, Twitter <https:\/\/twitter.com\/bbcmtd> and Instagram <https:\/\/www.instagram.com\/bbc_midlands\/?hl=en>. Send your story ideas to: newsonline.westmidlands@bbc.co.uk <mailto:newsonline.westmidlands@bbc.co.uk>"}