{"author":"","title":"'Eerie' caterpillar-infested tree spotted in North Yorkshire","news_category":"general","content":"The \"eerie\" sight of the work of thousands of caterpillars after they shrouded a tree in yards of webbing has been captured by a police officer while on duty.PC Rich Sutcliffe spotted the tree on the banks of the River Wharfe, near Kilnsey, in North Yorkshire.Posting on Twitter, he wrote: \"I've seen some mysterious sights at work but this took me by surprise today.\"\"The entire tree 'moving' with caterpillars,\" he said.More from Yorkshire <https:\/\/www.bbc.co.uk\/news\/live\/uk-england-leeds-44396001>Mr Sutcliffe said he had never seen anything quite like it in his 45 years living in Wharfedale.\"The caterpillars were literally covering every branch and the trunk of the tree,\" he said.The phenomenon is caused by small ermine moth caterpillars, which form a protective web over the tree on which they are feeding to protect themselves from birds and wasps as they prepare to transform into moths.Dr David Chesmore, from the entomological department of the Yorkshire Naturalist Union, said the caterpillars lived in nests made of silk, and sometimes grew to such large numbers they could cover trees.He said they have even been known to cover cars.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.According to the Butterfly Conservation charity's website, the webs can hide hundreds and sometimes tens of thousands of caterpillars.Occasionally, whole trees can be covered and the leaves stripped bare, giving the tree \"an eerie appearance\".The webs have even been known to take over nearby objects, including benches, bicycles and gravestones.The webs and caterpillars are harmless and usually last from May to June."}