{"author":"","title":"Obama backs India on permanent UN Security Council seat","news_category":"general","content":"US President Barack Obama has backed India's ambition for permanent membership of the UN Security Council.In an address to India's parliament at the end of a three-day visit, Mr Obama lavishly praised India's development.His remarks will delight India, which has been lobbying for a seat at the UN's top table for years.Analysts say it does not mean India will get a permanent seat immediately; the unspecified UN reforms Mr Obama mentioned could take years.India's long-term rival Pakistan issued a quick response opposing the move, saying the US should not be swayed by \"power politics\".Mr Obama said the Washington-Delhi relationship would be one of this century's defining partnerships.The loudest applause came when Mr Obama told dignitaries: \"As two global leaders, the United States and India can partner for global security - especially as India serves on the Security Council over the next two years.\"Indeed the just and sustainable international order that America seeks includes a United Nations that is efficient, effective, credible and legitimate.\"And that is why I can say today, in the years ahead, I look forward to a reformed United Nations Security Council that includes India as a permanent member.\"There are currently five permanent members of the Security Council: the US, China, France, the UK and Russia, which have the power to veto resolutions. Some nations have criticised the format as not reflecting the 21st century world.Pakistan's foreign ministry spokesman, Abdul Basit, said Mr Obama's move \"adds to the complexity of the process of reforms of the council\".\"Pakistan hopes that the US will take a moral view and not base itself on any temporary expediency or exigencies of power politics,\" he said.In his speech, Mr Obama had spoken about the threat of militancy from Pakistan.He said: \"We will continue to insist to Pakistan's leaders that terrorist safe havens within their borders are unacceptable, and that the terrorists behind the Mumbai attacks be brought to justice.\"At the weekend, Mr Obama visited a memorial to victims of the 2008 militant attacks in Mumbai (Bombay). The attacks, which began on 26 November that year and lasted nearly three days, left 174 people dead, including nine gunmen.White House officials revealed he had also briefed Indian Prime Minister Manmohan Singh about an American who has pleaded guilty in the US to laying the foundations of the attacks.Mr Singh was told that while the US intelligence community had information about David Headley's activity, it was not specifically connected to Mumbai.In his speech, Mr Obama also paid tribute to independence leader Mahatma Gandhi, saying: \"I am mindful that I might not be standing before you today, as president of the United States, had it not been for Gandhi.\"Mr Obama's trip ended with a lavish state dinner at the residence of Indian President Pratibha Patil in Delhi.Earlier, Mr Obama paid tribute to India as a world power, saying both countries would work together to promote stability and prosperity.\"As the world's two largest democracies, as large and growing free market economies, as diverse, multi-ethnic societies with strong traditions of pluralism and tolerance, we have not only an opportunity, but also a responsibility to lead.\"Mr Singh said Washington and Delhi had decided to \"accelerate the deepening of ties to work as equal partners in a strategic relationship\".Mr Obama has announced $10bn (£6.2bn) in new trade deals with India during his trip.However, he has also faced some protests. On Monday, about 250 survivors of the Bhopal gas leak in 1984 gathered close to India's parliament.They want Mr Obama to do more to extradite the former boss of the US company involved in the industrial disaster - the world's worst - and to increase compensation. About 4,000 people died at the time, and more than 10,000 more in the years that followed.The US president is next due to visit Indonesia, South Korea and Japan on a 10-day Asian tour designed to boost US exports."}