{"author":"By Daniele Palumbo & Clara Guibourg","title":"Gender pay gap: Four things we've learnt","news_category":"general","content":"Gender pay gap figures disclosed by the UK's biggest companies have shown that the vast majority of them pay men more than women.However, about 13% pay women more on average than men. Some 7% said they have no pay gap at all.All firms with more than 250 employees in the UK are required to report their gender pay gap.The median is the midpoint. If you line up all the men and women working at a company in two separate lines in order of salary, the median pay gap will be the difference in salary between the woman in the middle of her line and the man in the middle of his.It's calculated on an hourly basis and includes both full-time and part-time workers. It's the key measurement used by the Office for National Statistics (ONS).Just three sectors pay women more than men: the water and waste management sector, household services, and, perhaps surprisingly, mining.The finance sector has the highest pay gap of all sectors <https:\/\/www.ons.gov.uk\/employmentandlabourmarket\/peopleinwork\/earningsandworkinghours#datasets>, based on the ONS's latest Annual Survey of Hours and Earnings (Ashe).The average woman working in the finance sector earns 35.6% less than the average man. Another way of expressing this is that she takes home just 64p for every £1 that her male colleagues earn.Just eight of the 279 finance companies that have released their data so far have a gender pay gap in favour of women.Virgin Money reported a pay gap of 38.4% in favour of men, the highest gap among the top players that have reported in the finance sector.Royal Bank of Scotland has a 36.5% pay gap in favour of men.This is the first year that British firms have been asked to report their gender pay gap figures, but the UK is not the only country currently shining a light on the issue.Around the world companies are increasingly being asked to provide the same set of information.In France, companies failing to deal with pay discrimination could be fined under a new employment law <http:\/\/www.bbc.co.uk\/news\/world-europe-43320041>. In the UK, the gender gap is higher than the OECD average <http:\/\/www.oecd.org\/els\/family\/database.htm>.South Korea has the biggest gap among OECD countries, and Belgium the lowest. Want to find out the gender pay gap at your company? Try the calculator below.If you can't see the calculator, click here <http:\/\/bbc.in\/2u856m8>.Data as of 10:00 on 29 March. Individual company data has been reported by companies to the Government Equalities Office. All gender pay gap figures in this article reflect the hourly median pay gap for all employees. The national and sector gender pay gap figures come from the 2017 ONS ASHE survey.Data journalism: Will Dahlgreen, Ransome Mpini, Daniele Palumbo and Clara Guibourg"}