{"author":"By Jon Donnison","title":"Invasion provokes fear and anger for Ukrainians in UK","news_category":"general","content":"\"Hands off Ukraine,\" and \"Stop Putin. Stop the war,\" were the rhythmic chants that rang out down Whitehall as hundreds of pro-Ukraine supporters gathered opposite Downing Street.Waving Ukraine's blue and yellow national flag, many were carrying placards with depictions of Russian President Vladimir Putin alongside the words \"terrorist\" and \"murderer.\" One even compared Mr Putin to Adolf Hitler.At one point the crowd went silent as Ukraine's national anthem was played before erupting into applause.From time to time passing taxi drivers and binmen honked their horns in support.Most of those gathered were from the Ukrainian expat community living in the UK - but there were also several Russians voicing solidarity with their neighbours and opposition to their own country's leadership.The mood was good natured but almost everyone on Whitehall said they were angry and worried.\"I had a gut feeling that it was going to start last night,\" Mariia, from London, told the BBC.Mariia received a call in the middle of the night to break the news of the invasion.\"I thought I was prepared for it but the reality is you're never really prepared for something like this.\"The 26-year-old who runs a start-up business in the arts field has been in the UK for the past eight years but her mum and dad are living in Ukraine.Mariia said her parents' house is close to one of the main military airports near the capital Kyiv which she had been told was taken over by Russian forces a few hours earlier.\"Thank God my parents are trying to stay safe as much as they can.\"She manages a smile, but it is clear she is anxious.\"Even in my wildest nightmares have I ever felt as horrible as this,' she said.\"Your parents, they're the ones that are supposed to protect you but now you want to protect them as much as you can and you can't do anything from here.\"\"I've been living here for six years but my heart is in Ukraine,\" 38-year-old software developer Mykhailo Vorontsov said, his shoulders draped in his country's flag.\"Putin is gangster. But not a big mafia boss. More of a petty criminal. He's like the school bully.\"He is clearly no fan of the Russian president but he accepts not everybody in Ukraine feels like he does.\"It's complicated. A lot of people are brainwashed by Russian propaganda,\" he says.\"My own father is watching a lot of Russian TV and probably is hoping the occupation forces will come.\"But Mykhailo says his dad is always fighting with his mother because she fully supports the Ukrainian government in this conflict.A lot of people at Thursday's demonstration were urging the British government and other Western nations to step up sanctions against Russia saying current measures were too weak.But Mykhailo said he was grateful towards UK Prime Minister Boris Johnson.\"I really welcome what he is saying, rallying all the other Western nations and providing military support to Ukraine.\"Of course more sanctions would be better but I believe they are preparing to announce them soon.\"Sure enough, Mr Johnson announced sweeping further sanctions <https:\/\/www.bbc.co.uk\/news\/uk-60515626> against 100 entities and individuals, as well as a ban on the Russian airline Aeroflot.Mykhailo said sanctions need to target Putin's allies not in Russia close to his Mykhailo's new home.\"It's not like the Cold War now. It's not the Soviet Union versus the West,\" he said.\"Most of the powerful Russian families and their children, they live in the West. They live in London among us.\"They don't care about Russian citizens. They just want money.\"\"He's a psycho,\" Olga Smith, a musician, artist and teacher said, holding a poster bearing Vladimir Putin's name.Olga moved to London from Ukraine five years ago but her daughter is still there along with her four grandchildren, the youngest of whom, she told me, is just six months old.\"Very bad\" is how Olga said she felt when her daughter called her in the early hours to say the invasion had begun and that their region was being bombed.But she says this didn't all start today. \"It's been going on for eight years,\" she said.\"The West needs to do more to stop Putin now. Because if they don't he won't stop here. He will want to expand into more and more territory.\""}