{"author":"","title":"Hosepipe ban: Restrictions come into force in Cornwall","news_category":"general","content":"A hosepipe ban has come into force in Cornwall and some parts of Devon. It is the first time South West Water has introduced such a restriction in 26 years.The company said it had been left with \"no other choice\" amid the current drought <https:\/\/www.bbc.co.uk\/news\/science-environment-62298430>.Using hosepipes to water gardens, fill pools and ponds, or clean cars is banned; but businesses, farmers, blue badge holders or those on the company's priority register are unaffected.The ban is in force for all of Cornwall, plus parts of north and west Devon <https:\/\/www.southwestwater.co.uk\/advice-and-services\/save-water\/hosepipeban\/>, around the area of the upper River Tamar.South West Water recently said it had run out of water butts <https:\/\/www.bbc.co.uk\/news\/uk-england-devon-62619728> after it gave out 16,000 of the rainwater-catching devices in 24 hours following the announcement of the temporary ban.It comes after Devon and Cornwall Police urged people not to dial 999 to report any alleged breaches of the ban <https:\/\/www.bbc.co.uk\/news\/uk-england-devon-62606955> as officers said it was a civil matter rather than criminal.Assistant Chief Constable Nikki Leaper said that \"if there was a risk to the public, then absolutely we would assist\", but this was \"not a policing matter\".Lisa Gahan, the director responsible for water resources at South West Water, said the company wanted to thank customers for \"playing an important role\" in reducing water usage.\"Due to the prolonged dry weather, we believe the right thing to do is to introduce a temporary use ban, acting now in areas of the region where we are forecasting pressures on reservoirs, to protect water resources and to safeguard the environment, allowing rivers and reservoirs to recharge over the winter months,\" she said.Follow BBC News South West on Twitter <https:\/\/twitter.com\/BBCSpotlight>, Facebook <https:\/\/www.facebook.com\/bbcspotlight> and Instagram <https:\/\/instagram.com\/bbcspotlight>. Send your story ideas to spotlight@bbc.co.uk."}