{"author":"","title":"Men buy old ambulances for £17k to help Ukraine","news_category":"general","content":"Two men who spent £17,000 between them on two old ambulances are driving them to Poland for distribution to Ukraine.Alf Rajkowski, a retired property developer from Hampton Lucy, Warwickshire, and friend Mark Pritchard-Jeffs are also delivering donations of medical supplies.The vehicles will be transferred to an ambulance service in Poland, which will make arrangements to cross the border.Mr Rajkowski said he had got \"time to donate\" and it was \"a great cause\".He stated he had spent £8,000 on a decommissioned ambulance and his friend had paid £9,000.Their journey is being made under the Ambulance Aid project, which said its mission was to deliver medical supplies \"where they are most urgently needed in Ukraine\" using ex-NHS ambulances driven by volunteers.It is now crowdfunding to buy more decommissioned ambulances and within a week, a JustGiving page raised more than £15,000.Medical Aid Ukraine in the West Midlands has stocked the ambulances for the men's trip, with supplies received from across the region.Donations include an ECG machine from Balance Street medical practice in Uttoxeter, Staffordshire, and patient beds from Spring Hill Medical Centre in Arley, Coventry.The two men plus co-drivers Bogdan Letkowski and Richard Timmis are driving 2,100km across six countries to arrive at their destination by Thursday evening. The quartet are due to fly home on Friday.Mr Rajkowski, who was waved off earlier on Wednesday with Ukrainian flags, said the two ambulances would not return to the UK after their mission.He said his late parents were Polish and his mother was a refugee when Poland was invaded.He stated: \"It's a great group of volunteers. Hopefully we'll get more donations and carry on the good work.\"It's been a real challenge putting everything together. I've enjoyed the task.\"Follow BBC West Midlands on Facebook <https:\/\/www.facebook.com\/MidlandsBBC\/>, Twitter <https:\/\/twitter.com\/bbcmtd> and Instagram <https:\/\/www.instagram.com\/bbc_midlands\/?hl=en>. Send your story ideas to: newsonline.westmidlands@bbc.co.uk <mailto:newsonline.westmidlands@bbc.co.uk>"}