{"author":"","title":"Coastal erosion: North Norfolk District Council could spend £100k on land","news_category":"general","content":"Land and buildings worth more than £100,000 could be bought by a council as part of plans to tackle coastal erosion.North Norfolk District Council (NNDC) is due to receive part of a £36m government fund to help coastal communities at risk.The plans for the Coastal Transition Accelerator Programme <https:\/\/www.north-norfolk.gov.uk\/news\/2022\/december\/cabinet-approve-programme-to-work-with-communities-at-risk-of-coastal-erosion\/> (CTAP) were agreed by the cabinet on Tuesday.NNDC said it would help communities \"that cannot sustainably defended\".The funding will be managed by the Environment Agency (EA).It is part of a series of measures intended to help communities adapt to the changing coastline.East Riding of Yorkshire Council will also receive money. The two areas have been identified as having the highest numbers of at-risk shoreline properties in England.The CTAP project is expected to run until March 2027, the Local Democracy Reporting Service <https:\/\/www.bbc.com\/lnp\/ldrs> said. NNDC's cabinet agreed on Tuesday that there would be \"exceptional circumstances\" where it would have to spend more than £100,000 on buying land and buildings.Any purchases will have to be agreed by two senior councillors and two top-level council officials.Angie Fitch-Tillet , the cabinet member for coastal management, said: \"What we need to do is to have the funding in place to either purchase properties or rent properties for people at risk, for example we've got infrastructure, the coast road which in time eventually will succumb to erosion - we have to have plans in place.\"Up to £100,000, the director and may actually within their budget say yes, go ahead, you may spend this on purchasing a plot of land, so you can move - when a house is vulnerable, we can rebuild on that plot of land in the future.\"Once you get to £100,000 it has to seek cabinet approval.\"The cabinet also agreed to submit a business case to finalise the funding with the EA by the end of March.Campaigner Malcolm Kerby, who has been involved for two decades with Happisburgh's Coastal Concern Action Group, said he was delighted the CTAP was moving forward.However, he argued the 2027 end date for the project was too far off.\"I think it is a small step in the right direction,\" he added.\"We cannot have defences in these areas because they are in a site of special scientific interest.\"I'm just delighted that [central government] is beginning to join with us in the real world.\"Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}