{"author":"Annabelle Liang","title":"Elon Musk: Twitter boss announces blue tick shake-up","news_category":"general","content":"Twitter boss Elon Musk has announced a shake-up of the social media platform's paid Twitter Blue feature.From 15 April only verified subscribers will have posts recommended to other users and be allowed to vote in polls.Under the policy, posts from non-paying accounts will not be included in the \"For you\" stream of recommended tweets.Last week, the firm said it would remove the verified status of some \"legacy\" accounts, which date from before Mr Musk bought the firm.Users currently pay $7 (£5.70) a month for blue-tick verification, which also allows access to additional features.Mr Musk said the changes were \"the only realistic way to address advanced AI bot swarms taking over. It is otherwise a hopeless losing battle.\"\"Voting in polls will require verification for same reason,\" he added.In an earlier post <https:\/\/twitter.com\/elonmusk\/status\/1640199090112806912?s=20>, Mr Musk said paid verification significantly increases the cost of using bots and makes it easier to identify them.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.However, the move has been criticised by some social media users.A former worker on Twitter's verification team who asked to remain anonymous told the BBC: \"Our number one goal for my team was to protect users from real world harm and this screams the complete opposite to me.\"\"Verified users will use their power and their presence on the platform to influence anything from misinformation to actual harm for users all around the world. It's a silent threat that no one is seeing,\" they added.When Elon Musk took over Twitter, he was full of lofty ambitions about bringing back \"free speech\" .He wanted the platform to be \"maximally trusted\" and said this \"isn't a way to make money\".Yet Twitter policy now feels very different to those ideals.Realising that it was difficult to increase advertising revenue, Musk turned to a subscription based model.The sell initially was to give users a \"blue tick\" verification, if they paid a monthly fee.But the paying users didn't come in their droves. Stuck with flagging advertising revenue, and a stuttering subscription model - Musk has decided to take the nuclear option.There are two algorithms on Twitter - the \"For you\" stream of recommended tweets and stream of tweets from people you follow.Elon Musk's new policy will now essentially preclude non-paying users from taking part in one of those streams.It means unverified Twitter users will be far less likely to have their tweets liked or retweeted.Combined with Elon Musk's winding down of misinformation checks - this could be an extremely dangerous moment for Twitter.I've spoken to former employees who think this could be manna from heaven for trolls and people pushing misinformation.It also raises an existential question for Twitter. It was supposed to be fairly meritocratic place - with tweets rising by the quality of their content.It was a big part of Twitter's success. But now, that appears to have been swept away.Twitter Blue had a chaotic initial launch in November, as people started impersonating big brands and celebrities and paying for the blue tick badge in order to make them look authentic. Many pretended to be Mr Musk himself.This forced Twitter to pause the feature after less than a week <https:\/\/www.bbc.com\/news\/technology-63597087>, before it was relaunched the following month.Twitter Blue has since been used by controversial groups, including Taliban officials and their prominent supporters in Afghanistan <https:\/\/www.bbc.com\/news\/world-asia-64294613>.Verified users have their tweets amplified above other accounts. Subscribers also have access to additional features including an edit button, among other perks.Previously, the blue tick was used to indicate that high-profile accounts were authentic. It was given out by Twitter without a subscription fee - but only the firm itself decided who got one.Last week, Twitter said it would also start phasing out its \"legacy verified programme\" and remove some \"legacy verified checkmarks\" from 1 April.The firm added that users needed to pay to \"keep your blue checkmark on Twitter\".Bots on social media platforms can hurt their ability to grow advertising revenue or paid-for subscriptions.Mr Musk has often expressed concerns about how many fake or spam accounts are on Twitter. At one point he put his $44bn plan to buy the social media platform on hold as he queried the number of bots disclosed by the firm's previous management team."}