{"author":"By Tom Edwards <https:\/\/www.bbc.co.uk\/news\/correspondents\/tomedwards>","title":"Will TfL's statistics exorcise the 'ghost town'?","news_category":"general","content":"Has the London 'ghost town' disappeared?Certainly Transport for London's (TfL) latest figures suggest footfall in the West End is up.Compared to a year ago, TfL's figures show there was a 27% increase in passengers using stations in the West End on Saturday night.There will be surprise at that from some businesses, particularly those that don't cater to the particular peccadilloes of Olympic tourists.But you can almost feel the relief from TfL.It was under considerable pressure (and still is from some - particularly the black cab trade) after accusations it had over-cooked the transport warning messages.In the middle of last week it changed the message to one promoting central London.TfL says: \"The sorts of patterns we are seeing are all consistent with previous Games.\"Sydney, Athens and Vancouver all experienced similar patterns.\"The figures show that on 3 August, London Underground carried an all-time record of 4.4m people <http:\/\/www.bbc.co.uk\/news\/uk-england-london-19137030>, compared with 3.7m on an average day in the same week last year.I used the Tube on Friday. It was busy - but not that busy. The difference at the moment seems to be the rush hour has spread out <http:\/\/www.bbc.co.uk\/news\/uk-england-london-19055216> over the day and commuters have staggered their journeys.Bosses at TfL told me they do not think the Tube could have coped on Friday if they had all those passengers as well as commuters.The transport plan - to ask (or scare?) Londoners to change their habits - to make room for spectators seems to have worked, in that we have not had too many big transport problems compounded by large crowds.The debate over whether the plan was the correct one is another matter. The fact is the system worked pretty well. Even the independent passenger watchdog London TravelWatch <http:\/\/www.londontravelwatch.org.uk\/news\/2012\/08\/one_week_in_and_transport_is_staying_the_distance_in_games_marathon> agrees with that.The economic debate is also very interesting if, in my view, only partly linked to transport.A number of politicians have claimed the Olympics would bring an economic benefit to London - contrary to previous evidence that shows most cities suffer a net loss in tourism short-term when they hold the Games.While I'm sure local transport is part of that debate - putting the blame solely onto it for scaring people away is simplistic.Other factors come into play including the recession, high room costs at some hotels, high flight prices and the preferences of Olympic tourists.Also don't forget the 'main' attraction is a brand new Olympic Park miles away from the centre of London.If you come to London to watch the Olympics that's where you'll be heading.Let me know your thoughts…"}