{"author":"By Douglas Fraser","title":"Bidders 'frustrated' by wind farms auction delay","news_category":"general","content":"An auction for the next generation of wind farms off the Scottish coast has been delayed after a parallel English and Welsh auction resulted in far higher prices than expected.Crown Estate Scotland, which leases the seabed, was at risk of losing out on hundreds of millions of pounds if it stuck to its auction price guidelines.It told bidders on Thursday the process was being paused while it was reviewed.It was opened on 15 January and was due to close on 31 March.Scottish Renewables, which represents the industry, said firms would be \"disappointed and intensely frustrated\" at a further delay.There is also industry concern that the high value placed on having a right to develop an offshore site will lead to higher customer prices.Crown Estate Scotland is a public corporation, which has been split from the Crown Estate and follows Scottish government policy.It has run a process known as Scotwind Leasing for 15 seabed areas that could be developed for offshore wind.These include large sites off the Aberdeenshire and Angus coast, smaller sites in the Moray Firth, one to the east of Shetland, three to the west of Orkney, one off the west coast of Lewis and one north-west of Islay.The Scottish process has put a priority on ensuring that bidders are committed to make developments go ahead, and has set price points at which it anticipates bids.By contrast, the Crown Estate has had an open, price-driven auction for sites off the coast of England and Wales.The results were announced on Monday, and astonished the industry by how much large corporations, including oil and gas firms such as BP, were willing to pay to have an option to develop a site.The Crown Estate will receive nearly £900m per year for the next 10 years, simply for the right to develop six large sites in the North Sea, the Irish Sea and to the south of Kent. That money goes to the Treasury, and a share goes to fund the Royal Family.It would be less if developments actually took place during the 10-year option. Once wind farms are operating, the Crown Estate receives 2% of revenue.Concerned that it was under-pricing the Scottish sites and with Scottish government approval, Crown Estate Scotland halted its process.In a statement, it said it would complete a review of Scotwind Leasing by 24 March. The end date for bidding has not been made clear, except that it will be after 31 March.Crown Estate Scotland chairwoman Amanda Bryan said: \"The unprecedented outcome of The Crown Estate Round 4 process has, overnight, changed the market dynamics around offshore wind leasing, and could have significant implications for offshore wind development in Scotland.\"It is only right that we consider the implications of this new situation in relation to ScotWind Leasing.\"Our team will now work on the details of how these latest developments can be properly reflected in the ScotWind Leasing option structure, and we'll ensure our registered applicants, and the wider sector, continue to be kept engaged and informed.\"Scottish Renewables chief executive Claire Mack said the process was already 14 months behind the original schedule, and that the review must conclude quickly.\"Companies will be disappointed and intensely frustrated at this further delay, as well as at the possibility that the goalposts will be moved at such a late stage,\" she said.\"Scotland is already disadvantaged by its tougher seabed conditions and the higher electricity transmission charges projects here face.\"If offshore wind is to deliver on its potential for job creation and economic development in Scotland it is imperative that the processes through which this low-cost, reliable technology is deployed are as straightforward, and progress as rapidly as possible, and we would urge Crown Estate Scotland and the Scottish government to proceed quickly with that in mind.\""}