{"author":"By Robbie Meredith","title":"Game of Thrones 'will live on in Northern Ireland for a decade'","news_category":"general","content":"Game of Thrones will \"live on in Northern Ireland for at least another 10 years\" despite filming on the series coming to an end.That is according to the head of NI Screen, Richard Williams.He was speaking as it announced its strategy for the next four years.The finale of the HBO series, which is partly filmed at Titanic Studios in Belfast and on locations across NI, is due to be screened on TV worldwide in 2019. <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-36943597>NI Screen has invested about £16m of public money over the eight seasons of the programme.Mr Williams said that investment had produced an estimated return of £210m to the Northern Ireland economy, in associated services and tourism.He also said that he was hopeful some elements of any spin-off series from the drama may be filmed in Northern Ireland.\"Game of Thrones is still occupying Titanic Studios and I can't really think about what might replace them in Titanic Studios until they leave,\" he told BBC News NI.\"I don't want them to leave and who knows they may not.\"I can't say too much, but it is in the public domain that they have ambitions to have spin-off content likely to be a prequel in terms of the storytelling, so who knows?\"They are still there for now.\"Mr Williams added that \"in many ways Game of Thrones is irreplaceable\".\"It was the single cultural juggernaut of its time - it entirely redefined the making of high-end TV,\" he said.\"That can't be replaced, but the market for that high-end content is huge and it's only going to get bigger as Amazon ramps up, as Facebook ramps up.\"Mr Williams was speaking at the launch of Opening Doors Two, NI Screen's strategy to grow the industry in Northern Ireland until 2022.He said that a second series of the SyFy TV channel series Krypton - about Superman's ancestors - was already in production at the Belfast Harbour Studios. <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-40175179>\"So we already have that growing and quite frankly if we can't sell Titanic Studios - the place that was the home of Game of Thrones, the greatest show of its generation - to future buyers, we may give up and go home,\" he saidOpening Doors Two also includes plans to grow the television drama, independent film and animation industries in Northern Ireland and to increase the number of video game companies.NI Screen's funding comes from a variety of sources including Invest NI, the Department for the Economy (DfE), the British Film Institute (BFI) and the Arts Council of Northern Ireland (ACNI).Its budget was about £17.8m in 2017\/18.Like other public bodies, its budget is only confirmed on a yearly basis, but the 2018-2022 strategy includes a target to deliver a minimum of £300m return to the Northern Ireland economy from the screen industries over that period.Mr Williams said that NI Screen was taking a \"business as usual\" approach in the absence of an executive at Stormont.\"The department and the permanent secretary group have done everything that they can to avoid it causing us problems, but there is still a considerable limitation,\" he said.\"There is a loss, but I would say that loss is in the scale of the ambition, the marketing, the celebrating.\"It isn't in the day-to-day business.\""}