{"author":"","title":"Hemsby storm surge couple vow never to return","news_category":"general","content":"A couple whose home was swept away by the biggest tidal surge to hit the Norfolk coast in 60 years say they will never return to the village.Steve and Jackie Connelly moved to Yorkshire after their house at Hemsby fell into the sea in December.The couple re-visited the battered site of their former home for a BBC documentary.Mrs Connelly, said: \"It's not easy coming back.\" She said she will not return again in the future.Three properties were washed away by the sea at Hemsby and four more were badly damaged during the winter storms.\"It was just the shock of seeing it go like it did,\" said Mrs Connelly.\"We just didn't expect it. The back had gone and the water was just rushing around.\"It was something I would never want to see again. \"The only reason we're back is because of [filming] otherwise we'd never come back here. I don't ever intend to come back here again.\"Some of the couple's possessions were saved by people who formed a human chain to pass them out of the house as it started to tilt, before it slid into the sea.Mrs Connelly said: \"We had kept ourselves to ourselves, we just said hello to people. That night we couldn't believe where all the people came from.\"The couple now live in Rotherham where Mr Connelly found a job.Many in Hemsby remain worried about the future of their homes. One resident, Angela Lewis, said: \"It's frightening to come home. Every night before I go to bed I get my torch out and shine it into the dunes to see if they are still there.\"One house yards from the sea is on the market for £35,000.The storm last December ravaged the village's sea defences.Undeterred, people in Hemsby have started repairing them by putting down another line of rocks and concrete.\"This is what Hemsby is all about: Community, doing it for ourselves,\" said resident Lorna Bevan-Thompson. \"There's no way we're going to sit back and wait for somebody to take action.The Village That's Falling into the Sea will be aired on Friday on BBC1 at 19:30 BST."}