{"author":"","title":"Peaky Blinders finale is 'the end of the beginning'","news_category":"general","content":"Hundreds of Peaky Blinders fans have attended a special preview screening in Birmingham to watch the first episode of the final series.After a two-year hiatus, Thomas Shelby and friends return in series six on Sunday on BBC One.Three hundred lucky fans were picked from 50,000 applicants to go to a red carpet screening <https:\/\/www.bbc.co.uk\/news\/uk-england-birmingham-60353503> at Cineworld on Broad Street in Birmingham on Thursday.Members of the cast were joined by the show's creator Steven Knight.He said approaching the sixth and final series was \"the end of the beginning\" as a film was now planned as well as a stage show.\"It's a world that has a life around the world... it's so popular, but you stop when people want it to stop, not when we want it to stop,\" Mr Knight said.He said the loss of actress Helen McCrory, 52, who played Aunt Polly in all five series, was a tragedy.McCrory died of cancer last April, her husband, the actor Damian Lewis, revealed at the time. <https:\/\/www.bbc.co.uk\/news\/entertainment-arts-56770593>\"The loss of the character and the role is totally secondary to that,\" he said.\"However, after she's gone we knew she wanted this thing to continue and we hope we have continued in a respectful and appropriate way and moving forward she will always be part of Peaky.\"Finn Cole, who plays Michael Gray, said he was excited to see the first episode but was \"nervous for everyone to see it\".Sophie Rundle, whose character Ada Thorne is pregnant in the drama, said the end of the television series was \"emotional\".\"It's been 10 years and no-one expected it to be so loved as it is, so this is a really lovely thing today to stand and take stock of what the show is and what it has been and sort of share with everyone and be here in Birmingham,\" she said.Comedian Jaspar Carrott, TV chef Glynn Purnell who has a restaurant in the city and Robin Campbell from Birmingham's own UB4O were among guests on the red carpet.Follow BBC West Midlands on Facebook <https:\/\/www.facebook.com\/MidlandsBBC\/>, Twitter <https:\/\/twitter.com\/bbcmtd> and Instagram <https:\/\/www.instagram.com\/bbc_midlands\/?hl=en>. Send your story ideas to: newsonline.westmidlands@bbc.co.uk <mailto:newsonline.westmidlands@bbc.co.uk>"}