{"author":"","title":"2 Sisters chicken supplier 'sent MPs Christmas biscuits'","news_category":"general","content":"MPs investigating food safety breaches at chicken supplier 2 Sisters Food Group have revealed they rejected Christmas gifts sent from its boss.The Environment, Food and Rural Affairs Committee said festive packages of biscuits were sent to several members.Its chairman said the unsolicited gifts were \"inappropriate\" and they had been returned or given to local food banks.2 Sisters disputed the amount and said it was a \"goodwill gesture\", which they send to many external stakeholders.The committee held a month-long inquiry into the food group's actions after an undercover report from the Guardian and ITV Newsclaimed workers at its West Bromwich site <http:\/\/www.bbc.co.uk\/news\/uk-41440020> were changing the slaughter dates to extend the shelf life of meat.In September, the Food Standards Agency and supermarkets Aldi, Lidl, Sainsbury's and Marks & Spencer alsoannounced they would investigate the allegations. <http:\/\/www.bbc.co.uk\/news\/uk-41440020>2 Sisters is one of the UK's largest chicken suppliers but also provides biscuits, ready meals and frozen pizzas.Over the Christmas period, several committee members received care packages with a mixture of Fox's and other tins of biscuits.Labour's Paul Flynn, who sits on the committee, said the package contained \"around £100 worth\".But 2 Sisters says the total cost of the gift was nearer £20.MPs are required to declare any gifts, benefits and hospitality over a value of £300.Chairman Neil Parish, a Conservative MP. said members had found the actions of Ranjit Singh Boparan, 2 Sisters' chief executive, \"very disappointing\".\"Sending gifts to committee members at a time when we are trying to rebuild trust in the poultry industry is most unhelpful.\"Mr Boparan should instead concentrate on restoring confidence in our poultry supply chains, and we are keen to work with him to do so.\"He wrote to the 2 Sisters chief executive asking him to \"avoid similar gestures <http:\/\/www.parliament.uk\/documents\/commons-committees\/environment-food-rural-affairs\/correspondence\/180117-Chair-to-Ranjit-Boparan-Gifts.pdf> in future\".A 2 Sisters Food Group spokesman said: \"Each gift was around eight packets of Fox's and Own Brand Biscuits, in addition to two tins or boxes of Fox's biscuits.\"The business sends these out every year as a goodwill gesture at Christmas to hundreds of external stakeholders.\"We have responded formally to Neil Parish on the above.\""}