{"author":"By Andre Rhoden-Paul","title":"Prep: The battle to access 'game-changing' HIV drug","news_category":"general","content":"A \"game-changing\" drug in the fight against HIV reduces the risk of acquiring the condition. But those at high risk of contracting the virus have struggled to get hold of the medication, despite the NHS trialling it across England.Ron, who is from London and in his 20s, asked about pre-exposure prophylaxis - known more commonly as Prep - at a sexual health clinic in autumn 2017, but was turned away partly because there were no spaces left on the trial.\"They said it had filled up and that I most likely don't qualify,\" he said about his visit to Burrell Street Sexual Health Clinic in London.\"They mentioned I could buy it online but they didn't really say where to go or what to do.\"They didn't really imply I needed it.\" Ron admits his lifestyle heightened the risk of contracting HIV, as he had frequently been having unprotected sex with men and women while \"going through a lot of personal issues\".A few months later, he noticed a voicemail left on his phone.\"I had contracted other sexual transmitted infections in the past, but this was the first time I got a voicemail from a sexual health clinic.\"They asked me to come in and they did not explain why. \"I thought, this is the day I find out I'm HIV positive.\"His intuition proved correct.\"In a way I felt like I was probably going to end up being one of those people [who contracted HIV].\"And that was because I saw that my sexual activity was of a risky type and if I don't play safer, this will happen.\"He started retroviral treatment a week later and is now living a normal life but Ron is angry others could be at risk if they haven't been able to access Prep.\"At [that] point I still was thinking I might as well get ready to say goodbye to my family and friends and I was going to die, because I was not well informed.\"There's probably so many individuals who are going to get that phone call just like I did.\"Prep is a preventative medicine which fights the virus if an HIV-negative person comes into contact with it through unprotected sex.An Impact trial was launched in England in October 2017 <https:\/\/www.bbc.co.uk\/news\/health-40814242> with an initial 10,000 places at sexual health clinics for people at high risk of contracting HIV.But there has been great demand for the drug, with sexual health charities inundated with stories of people being turned away due to a lack of places.Critics say allowing it to be freely available on the NHS promotes promiscuity and leaves people more vulnerable to other sexually transmitted infections.Julia, a sex worker from London, had not heard of Prep until a nurse at a sexual health clinic recommended she enrol on the trial.\"When some of my clients asked me if I was scared of HIV when I did unprotected sex, I would say 'no',\" she said.\"[But] to tell you the truth, whenever I got flu I was panicking.\" The 34-year-old, originally from Poland, added: \"I was surprised and shocked when the nurse told me something like that [the drug] existed.\"I feel more protected now.\"Julia, who turned to sex work to survive after separating from her husband, said other escorts thought the drug was only for gay men.She said she had only met one heterosexual man who was taking the drug.\"To be honest my other escort friends, when they found out I was on Prep, they were thinking that I was HIV positive.\"There was also a strange reaction even among my clients. Sometimes when I am saying 'I'm on Prep' they don't want to listen.\"Julia said she had since become \"very picky\" about her clients and asks them about their status.\"I am trying to educate them a bit about Prep and that it exists.\"The man who saved thousands of people from HIV <https:\/\/www.bbc.co.uk\/news\/stories-44606711>'Having sex five times a day wasn't enough' <https:\/\/www.bbc.co.uk\/news\/uk-england-43921760>'The first time I had sex I contracted HIV' <https:\/\/www.bbc.co.uk\/news\/uk-england-manchester-46233684>Women's HIV charity the Sophia Forum said the trial was not being promoted enough to women and other groups at risk.\"For women vulnerable to acquiring HIV, it is not in their magazines or conversations they are having with their friends,\" said trustee Jackie Stevenson, whose charity which has created the campaign Women and Prep.\"Public Health England figures show we are still doing badly at even offering women a HIV test - if we can't offer them a test, who is going to talk to them about Prep?\"Pre-exposure prophylaxis is a pill taken daily or on demand prior to having sex, to prevent HIV infection.If taken consistently, when a condom is not worn and someone comes into contact with HIV, it will protect cells in the body and disable the virus to stop it multiplying.The UK Medical Research Council-run Proud study, comparing gay men on Prep against non-users, found an 86% fall in new HIV infections in Prep users. Many in the sexual health sector say Prep, when taken correctly, is almost 100% effective.The drug is aimed at men who have sex with men without a condom as well as others at high risk, including HIV-negative partners of individuals with HIV that is not virally suppressed.Researchers are currently assessing demand for the drug and its effect on the number of new HIV infections in England.Some gay and bisexual men and trans women are eligible to receive Prep on prescription through the trial, along with heterosexual people at high risk.Responding to a request for comment for this article, NHS England said it was planning to fund a further 13,000 places on the trial.The trial itself is controversial as Prep is provided on the NHS in Scotland and via anuncapped study in Wales <https:\/\/www.bbc.co.uk\/news\/uk-wales-43484106>.Initially, NHS England said it was up to local authorities to provide the drug <https:\/\/www.bbc.co.uk\/news\/health-35870296>. Currently, 42 trial centres across England have filled their places for gay and bisexual men.The National Aids Trust, which forced NHS England to provide Prep after taking it to the High Court <https:\/\/www.bbc.co.uk\/news\/health-36946000>, said it was concerned people had been turned away.\"Clinicians are now speaking with distress about seeing people getting HIV, which could have been prevented had they been on the Prep trial,\" the charity's director of strategy, Yusef Azad, said before the additional places were announced.At the Whittall Street Clinic in Birmingham, there is a waiting list until May to get on the trial.The clinic's HIV consultant David White explained: \"If this wasn't a research project we could put more people on Prep and we could do it in a wider geographical area.\"He said the biggest demand came from gay men.\"If you look at the other high-risk groups, we have higher numbers than other centres but that's because we are trying to engage other communities.\"Dr White, from Birmingham, said only a handful of people on the city's trial were black African men and women, despite an estimated 25,000 diagnosed as living with HIV in the UK, according to Public Health England.He puts this down to many reasons, including stigma around HIV in the African community.In the north of England, 13 trial clinics, including in Hull and Bradford, have not started giving out Prep, despite the trial starting in 2017.\"It puts pressure on places like Leeds, where people from areas with no access to Prep are registering,\" said Tom Doyle, who heads sexual health organisation Yorkshire Mesmac.\"So there is now no space left on the trial in Leeds.\" He pins the problem on the trial focusing on maintaining those sites already up and running.He added: \"On the trial's community advisory board, we spend a lot of time to make access to Prep equitable, but it really is not in parts of England.\"Those not able to get on the trial can buy generic Prep from about £20 a month, cheaper than the branded Prep Truvada. An estimated 10,000 people are self-sourcing, according to website I Want Prep Now.The Terrence Higgins Trust has launched a fund to give the drug to 1,000 people on no or low incomes who cannot get on the trial or buy it themselves.Ian Green, CEO, said: \"Quite frankly, it is a scandal a charity is having to help people buy their own Prep; what we should be doing and are doing is putting pressure on NHS England to commission Prep.\"What we know is that [the] lifetime cost of treating someone with HIV is over £300,000. The cost of generic Prep is around £20 a month, so it is absolutely cost effective.\"The full results of the trial will be available in early 2021. In an open letter last month, MPs and peers called on public health minister Steve Brine to urgently expand access to Prep in England.Labour MP Lloyd Russell-Moyle, who last month revealed in a speech to the Commons that he's living with HIV, said a cliff-edge scenario was approaching.\"We know of people who have become infected with HIV because they cannot access this HIV game-changer,\" he said.\"I want to see Prep have a long-term home as part of sexual health services, but in the meantime, NHS England and local authorities must act now and agree to increased places on the trial.\"NHS England described the trial as a \"huge success with over 10,000 participants\", and said the increase in places was important for addressing questions from the trial about the need for Prep among women and other groups.In a statement issued on Friday, director of specialised commissioning for NHS England John Stewart said: \"The trial researchers have submitted a case for increasing trial places and NHS England will play its part in delivering on this recommendation by committing to fund additional places in line with existing funding arrangements.\"This will help ensure the learning from the trial is robust enough to fully inform the planning of a national Prep programme in partnership with local authorities for the future, as well as protecting more people from HIV right now.\"The Trial Oversight Board - this includes local authorities, which fund part of the trial - will make a decision later this month whether to pass the proposal to double places on the trial to 26,000.It will then be up to individual local authorities to determine how many additional places they take up.In reaction, sexual health charities including the National Aid Trust welcomed the proposal.Its chief executive Deborah Gold said: \"It's crucial that the Trial Oversight Board approves this measure, so that we can move swiftly on to the great deal of remaining work to be done in making sure that everyone who might benefit - especially women and heterosexual men - hears the news that there's now an effective HIV prevention pill.\""}