{"author":"By Cemlyn Davies","title":"Cardiff Airport sale possible without Covid - ex-minister","news_category":"general","content":"The Welsh government could have considered selling Cardiff Airport were it not for the pandemic, according to the country's former economy minister.Ken Skates' comments come 10 years after the government bought the airport for £52m <https:\/\/www.bbc.co.uk\/news\/uk-wales-21952079>. The airport's boss said this arrangement is a \"value\" to Wales.The government said it had \"put in place a recovery package designed to make Cardiff airport self-sustainable and profitable for the future\".Conservatives said ministers lacked the \"business acumen\" to make it a success.The Welsh government bought Cardiff Airport in March 2013 to \"secure its future\" following a slump in passenger numbers.After peaking at 2.1 million in 2007, the number of people travelling from the airport had fallen to one million by 2012.But the 10 years since the government's takeover have been turbulent, with positive steps forward being undermined by significant setbacks, including the Covid pandemic.Several airlines have also ceased operations at the airport, with WizzAir announcing earlier this year it waspulling out <https:\/\/www.bbc.co.uk\/news\/uk-wales-64224834>.In the years after the Welsh government's takeover, passenger numbers grew to 1.7 million before Covid hit,\"wiping out\" <https:\/\/www.bbc.co.uk\/news\/uk-wales-61025639> the airport.Last year the airport had fewer than 860,000 passengers.Now a backbench Labour MS <https:\/\/www.bbc.co.uk\/news\/uk-wales-politics-52442634>, Ken Skates was the government minister responsible for the airport between 2016-2021.\"I'm in no doubt had Covid not happened we would have passed two million passengers per year by now and be very competitive with other airports,\" he told the BBC's Politics Wales programme.Asked if that meant the government would have been able to consider selling the airport to recoup money for the taxpayer, he said: \"Yes, I do believe that's the case.\"However he added that in those circumstances he \"would have been arguing for the retention of the airport in public ownership\".\"If you have such an asset making money for the public then it stands to reason that you would not want to sell it off,\" he said.Since the purchase, ministers have invested an additional £158m in the airport, with more in the pipeline.They have also written off £42.6m of debt <https:\/\/www.bbc.co.uk\/news\/uk-wales-59434267>.The airport is currently valued at about £15m <https:\/\/www.bbc.co.uk\/news\/uk-wales-politics-56350712>.Spencer Birns, the airport's chief executive, said the \"communities owning the airport is critically important\".He said \"over 90% of airports in the world are actually owned by their communities\".Mr Birns told BBC Politics Wales programme <https:\/\/www.bbc.co.uk\/programmes\/m000dk1n>, that the airport is working towards \"sustainability and viability\" following a big dip in passenger numbers following the pandemic.\"Prior to Covid we were generating significant economic value - it was over £240m a year in economic value,\" he said.\"The demand for travel is there, our flights are full, the aircraft operating out of Cardiff - it's very rare we've got a flight that's not full.\"I would argue that we're on this rescue and restructuring plan with the Welsh government, which is a five-year plan, to get ourselves back to where we need to be for sustainability and viability.\"The Welsh Conservatives' spokeswoman on transport, Natasha Asghar, accused the Welsh government of \"frittering taxpayers' money\".Asked what the Welsh government should do, she said: \"One-hundred per cent, sell the airport, privatise it, get a good buyer in.\"I just don't think that this Welsh government has the business acumen to make it a success.\"Travel journalist Simon Calder told the programme it had been a \"heck of a struggle\" to find a viable business plan for Cardiff Airport and the answer was to build a new airport in a different location.\"As a nation, Wales needs an international airport and Cardiff is the obvious place to put it.\"But I'm very sorry that the current location is not sustainable at all, and something with good rail and road links, maybe between Cardiff and Newport, would be the solution.\"That would absolutely transform aviation in the nation.\"Prof Mark Barry, from Cardiff University, said he agreed with Mr Skates' assessment of the airport's prospects before the pandemic, but that post-Covid the world was \"different\".\"We have a climate emergency so we have to reduce flying and only support the kind of flying that's more economically necessary, so that's medium and longer haul flights,\" he said.\"So that doesn't really work for Cardiff Airport, which is much more focused on shorter haul.\"So the choice Welsh government has got is: 'do we continue to subsidise it or do we accept it will probably close?'\"A Welsh government spokesman said: \"Since the pandemic, demand for air travel across the world has fallen.\"Despite this, and the downturn in the UK economy, we are committed to maintaining an airport in Wales.\"We have put in place a recovery package designed to make Cardiff Airport self-sustainable and profitable for the future.\"Politics Wales, BBC One Wales, 10:00 BST on 2 April and on BBC iPlayer <https:\/\/www.bbc.co.uk\/programmes\/m000dk1n>"}