{"author":"","title":"Richard Bacon thanks his wife on last full day in hospital","news_category":"general","content":"Television and radio presenter Richard Bacon has paid tribute to his wife Rebecca ahead of his expected release from hospital.The 42-year-old, who lives in Los Angeles, became ill on a flight from the US with suspected pneumonia <https:\/\/www.bbc.co.uk\/news\/uk-england-44818526>.He was later put into a coma to allow his body to fight the infection.Bacon tweeted: \"Last full day in hospital. Every facet of my life would be worse without Rebecca in it. How will I ever thank her?\"The message continued: \"I was in a coma for nine or ten nights (I just learned). That's a lot of staring at your husband and his pipes. And a lot of worry.\"This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Former Blue Peter presenter Bacon, who was born in Mansfield, Nottinghamshire, said he had been diagnosed with an \"unidentified double chest infection\".On Monday he posted on social media saying he had \"nearly died\". In tweets which were later deleted he said: \"So, I did six days straight in a coma. Been here another four since. \"It's an (as) yet unidentified double chest infection. I nearly died. \"At one point, as I was run down a hallway to ICU (an intensive care unit) at midnight, with a massive needle jammed in my chest - bit like Pulp Fiction - I thought, 'This is it.'\"This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.He has also praised the NHS and Lewisham Hospital, where he has been treated.The presenter tweeted: \"Low on energy but I love and admire all the team LEWISHAM HOSPITAL. VivaTheNHS.\"This video can not be playedRichard Bacon, who was diagnosed with ADHD aged 42, was taken ill with suspected pneumonia earlier this monthOn 5 July Bacon posted photos of the hospital and himself being treated, but the seriousness of his condition emerged on Friday when his sister Juliet posted an image of hospital doors on Instagram, saying she had been visiting him for a week.By the end of the day it had been confirmed doctors were reducing his medication to bring him round.Bacon, who started his career on BBC Radio Nottingham, has presented The Big Breakfast, Top of the Pops, BBC Radio 5 live and BBC 6 Music.Follow BBC East Midlands on Facebook <https:\/\/www.facebook.com\/bbceastmids\/>, onTwitter <https:\/\/twitter.com\/bbcemt>, or on Instagram <https:\/\/www.instagram.com\/bbceastmidlands\/>. Send your story ideas to eastmidsnews@bbc.co.uk <mailto:eastmidsnews@bbc.co.uk>."}