{"author":"","title":"Just Stop Oil: Climate change pair on trial over bridge protest","news_category":"general","content":"Two protesters caused \"gridlock for miles around\" after they scaled the Dartford Crossing bridge and police closed it to traffic, a trial heard.Just Stop Oil activists Morgan Trowland, 40, of Islington, London, and Marcus Decker, 34, of no fixed address, deny causing a public nuisance.Using climbing equipment they climbed 200ft (60m) up the Queen Elizabeth II Bridge cables, the prosecution said.They then unfurled a protest banner and \"rigged up hammocks and stayed there\".The bridge linking the M25 over the River Thames between Essex and Kent was closed from 04:00 BST on 17 October until 21:00 the following day, the prosecutor said.\"This closure caused gridlock for miles around throughout that period, which we say was the point,\" prosecutor Adam King told Basildon Crown Court in Essex.\"Morgan Trowland, while up there, arranged interviews with the press and posted on social media from a Just Stop Oil account.\"One post was a video of him setting out the group's demand that the government immediately stop issuing oil licences.\"Small businesses lost, in some cases, hundreds of thousands of pounds, people missed loved one's funerals, children were left on the side of the road waiting for buses.\"Mr King said there may be evidence about climate change and what the defendants \"sought to achieve\", but he told jurors: \"We're not here to litigate the government's climate change policy.\"He said the pair came down at about 17:30 on 18 October \"with the help of police and a very tall cherry picker crane\", but the bridge was not reopened to traffic until later.In police body-worn camera footage shown to jurors, the protesters confirmed to attending police that they were there to protest and not for a suicide attempt.Jurors were also shown drone footage of the two men, on the vertical uprights on opposite sides of the bridge, with their hammocks set up and banner displayed.The trial continues.Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}