{"author":"By Eleanor Lawrie","title":"Hebrides: Life on beautiful islands with the UK's worst fuel poverty","news_category":"general","content":"With its white sandy beaches, rugged hillsides and turquoise sea, the Outer Hebrides looks like an idyllic place to live.But more than half the residents will be plunged into fuel poverty, according to charity Energy Action Scotland,when energy prices rise on Friday <https:\/\/www.bbc.co.uk\/news\/business-58090533> - the highest rate in the UK. In her cold and damp house on the Isle of Lewis, Karen Macleod is one of them. The mum of two, who can't work because of mental and physical health problems, can't believe she's ended up in this situation.\"I never saw myself struggling like this - when I worked in Edinburgh I had a nice wee flat. It's just thinking you've got an extra £20 or £30, but then a direct debit comes off that you've forgotten about and that's all the money gone,\" she says.Karen's electricity tariff has risen by £40 a month since January to £250 - or £3,000 a year, partly to help cover the debts she has already run up with the energy company.The increase has taken its toll. The family don't have hot water and have switched off almost all of their electric storage heaters. Karen's 10-year-old daughter sometimes needs to sleep in with her for warmth, and she goes to her dad's house for a hot shower.\"The little one's school uniform is cold,\" she says.\"We've got electric blankets on all the time to stop the bed from getting damp. When I let the fire go out and go to bed my hands are cold, my feet are cold, I've got a fleece on and my gloves. You've got to keep moving about to feel some heat, because it's so cold.\"When Karen's energy bills go up in April, she says she'll look to cut down on food, and potentially switch off the heating altogether.A few miles away in the town of Stornoway, Christopher and Faith Thompson are setting up the twice weekly food bank, which initially opened as a response to the pandemic.At first they operated out of a cupboard in their Salvation Army corps, but the scale of local need means the couple ended up taking over a room in the local golf club.They've seen record numbers of people attend in the past few weeks, up to 150 at a time.\"I think the reason people are coming to us is beyond just a Covid response. Often they find an unexpected bill, their car breaks down, or a heating bill comes in and it's a big shock when you haven't budgeted for it,\" Christopher says.\"Some of these people are pensioners, or they have young families and they just can't make ends meet at the moment.\"The islanders are quite private by nature, he adds, so they often have clients come from miles around.\"We are a tiny community and if you go to a food bank in a small village the person who delivers your food could be your next door neighbour or postman,\" he says. \"We are seeing people travel to us from all across the island just to get some extra help.\"Rural poverty is a pressing issue, with one report finding the cost of living for people in remote areas of Scotland <https:\/\/www.gov.scot\/publications\/cost-remoteness-reflecting-higher-living-costs-remote-rural-scotland-measuring-fuel-poverty\/pages\/5\/> between 15 and 30% higher than those in urban areas of the UK.That's because of factors like having to run at least one car or use a more expensive local shop and needing a tumble dryer because of the cold weather.On 1 April, the maximum price energy suppliers can charge households in England, Scotland and Wales is being raised.This added financial pressure means about 57% of Hebrideans will be in fuel poverty, says Energy Action Scotland, spending more than 10% of their income on energy after housing costs.That's despite the Highlands and Islands producing three times as much energy as they use.Some in the community are going back to the land to try to save money. Crofter Domhnall Macsween is being battered by the soaring cost of petrol and animal feed, coupled with a £100 increase in his monthly electricity bill.He rears sheep and Highland cattle and is now considering growing his own vegetables to save money.\"It's almost going back to my grandfather's way of life, where you would have some livestock and some oats, barley, potatoes, carrots, turnips, really basic things but it kept them alive,\" he says.In late spring, the crofter will revert to an ancient practice of cutting and burning peat for fuel, and will also have to put up the price of the eggs he sells.\"I have to survive. I'm not a charity, and food security is becoming more and more important.\"The UK government says it's trying to ease cost of living pressures through measures such as a £150 council tax rebate and a £200 energy bill discount in October, as well as the energy price cap."}