{"author":"By Phil Shepka & Jon Ironmonger","title":"Whittlesey care home resident not given CPR after 'same name mix up'","news_category":"general","content":"The daughter of a care home resident said no attempt was made to resuscitate her mother after records were mixed up with a person with the same first name.Joyce Parrott, 81, died at The Elms in Whittlesey, Cambridgeshire in April 2020 and an inquest heard a paramedic was wrongly advised she had a \"do not resuscitate (DNR)\" order in place.Ms Parrott's daughter said a nurse \"mixed my mum up with another Joyce\".Care home operator HC-One has apologised to the family.Relatives of three other families had previously raised concerns with the BBC about The Elmsafter their loved ones died in 2019. <https:\/\/www.bbc.co.uk\/news\/uk-england-cambridgeshire-61597345>Ms Parrott moved to The Elms in February 2020 and had vascular dementia, said her daughter Caroline Porter.Ms Porter said prior to her death she had once found that her mother had been left in soiled underwear for five days.She said that when she spoke to the home, they said they had \"offered her personal care but she'd declined... I was quite annoyed because she would, with encouragement, change them herself\".At an inquest this month, Cambridgeshire and Peterborough coroner Caroline Jones said on 29 April 2020 an ambulance had been called to the care home after Mrs Parrott displayed \"abnormal\" observations.Mrs Parrott was seen to stop breathing shortly before paramedics arrived, Ms Jones said.The coroner continued: \"When the rapid response paramedic attended, he was advised that Mrs Parrott had a [DNR] directive in place so did not commence CPR, but attached the electrocardiograph monitor which showed that Mrs Parrott's heart rhythm was asystole - when there is no electrical activity in the organ.\"A few minutes later, it was advised that Mrs Parrott did not have a [DNR] in place, by which time she had not been breathing for a prolonged period, so CPR was not commenced.\"According to Ms Porter's lawyers, Ashtons Legal, an expert said it was \"highly unlikely that the outcome would have been different\" had CPR commenced when Mrs Parrott went into cardiac arrest.But Ms Porter said: \"I understand what the experts mean, but even the small chance is a chance and she was denied that chance.\"The inquest concluded Mrs Parrott died from natural causes.Ms Porter said she felt \"let down\".\"I just don't feel they did everything they could have for her that morning,\" she said.She said she had read a transcript of the 999 call made by a nurse at the care home, in which the nurse replied \"I don't know\" when asked if there was a defibrillator at the property.\"She was the nurse on duty, surely she should have known where the defibrillator was?\"Regarding the DNR, Ms Porter said the nurse, who it was believed had since left the country, \"admitted that she'd been working off two care plans, both with the first name of Joyce and she'd mixed my mum up with another Joyce\".A spokesman for The Elms said: \"The health, safety and wellbeing of all our residents is our absolute priority.\"We are therefore deeply sorry that on this occasion, a mistake was made which led to this individual not being supported in line with their care plan when they fell critically ill.\"Since this historic incident occurred, we have made important changes to the way we communicate key information to our full-time and temporary care colleagues to ensure that such a mistake is not repeated.\"He said they had strengthened record-keeping systems, improved shift handover processes and provided staff-enhanced refresher training and that the inquest \"recognised these improvements and the policies and procedures we have in place\".Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}