{"author":"By Antoinette Radford","title":"Alexei Moskalev: Father of girl who drew anti-war picture arrested on run in Minsk","news_category":"general","content":"A man sentenced to jail in Russia after his daughter drew an \"anti-war\" picture has been caught in Belarus, after seemingly fleeing the country.Alexei Moskalev was given a two-year jail sentence in absentia on Tuesday for discrediting the army.He came to the attention of authorities last year - after, he said, a school reported the drawing to police.A lawyer said he was probably caught in Minsk after switching on his mobile phone, which revealed his location.Speaking to Reuters, lawyer Dmitry Zakhvatov said \"someone had made a mistake\" to give away his location.\"Most likely it was due to him using a mobile phone improperly,\" he said.That version of events was supported by journalist Marina Ovsyannikova, known for her anti-war protests.\"He was warned in advance to turn off his mobile phone and pull out the SIM card before escaping. But in Minsk, Alexei decided to turn it on for some reason,\" she wrote, but then deleted the post.In 2022, Ms Ovsyannikova also escaped from house arrest, but she managed to leave Russia safely. <https:\/\/www.bbc.co.uk\/news\/world-europe-64604233>The Belarusian authorities confirmed Mr Moskalev had been detained at Russia's request.It is unclear how he made it to Belarus, but people who seek to leave Russia unnoticed by the authorities often leave via Belarusian territory.Mr Moskalev lived about 320 kilometres (200 miles) south of Moscow in a town called Yefremov.His problems began after Masha Moskalev, then 12, drew a Ukrainian flag in April last year with the words \"Glory to Ukraine\", rockets and a Russian flag with the phrase \"No to war!\"He said the school reported his daughter's drawing to police. After that, Mr Moskalev was fined for an anti-war social media post.But after his flat was searched in December he was charged under the criminal code because he had already been convicted of a similar offence.Authorities separated Masha from her father and placed her into a children's home, after the case began. She has not been seen in public since 1 March.On Tuesday, when Mr Moskalev was sentenced to two years in jail, the court press secretary said he had escaped his house arrest.He had pleaded not guilty to the charges, but apparently fled Russia in anticipation of a guilty verdict.Speaking to the BBC after the sentencing, the town councillor Olga Podolskaya said she was in \"shock\".\"A prison sentence for expressing your opinion is a terrible thing. A two-year jail term is a nightmare.\"Another lawyer representing the family said he did not know if the teenager had been told her father was on the run."}