{"author":"By Bernd Debusmann Jr","title":"'He'll be our next president': Florida protesters stay faithful to Trump","news_category":"general","content":"When 31-year-old hot dog vendor Dirk Frazel heard the news that Donald Trump had been indicted, he \"knew he had to do something\", so he got in his car.His destination was Mr Trump's home at the Mar-a-Lago resort in Palm Beach, Florida, a five-hour drive from Mr Frazel's home in St Augustine.The Mar-a-Lago rally, along with a second event held outside a nearby Trump-branded golf course, totalled no more than several dozen people on Saturday, despite earlier calls for protests by Mr Trump ahead of the indictment.\"I heard he was indicted on Twitter and knew there would be people down here,\" Mr Frazel told the BBC, standing on a bridge near Mar-a-Lago where he was handing out \"Trump hot dogs\" to passing motorists.Inside the resort a few hundred metres away, Mr Trump has reportedly been meeting with his advisers and legal team to plan his legal defence against criminal charges in connection with a $130,000 (£105,000) pay-out to porn star Stormy Daniels.He is expected to hand himself over to authorities in New York on Tuesday, 4 April, with a hearing due to take place at 14:15 local time (19:15BST).The specific charges Mr Trump faces are not yet public.Sources familiar with the case have told US media that the former president is being charged with falsifying business records in the first degree - a felony under US law.Despite the small showing, many Trump supporters at the rallies expressed confidence that Mr Trump would emerge politically unscathed from his legal battles, and go on to win the 2024 presidential election, even if he is convicted.\"I think he'll be our president again. We'll be seeing a lot more people coming out to support him because of this,\" said Dina, a Palm Beach resident. \"I hope we see this through until his next presidency.\"Another demonstrator, a woman who asked to be identified only as Marcy, said she believed the New York indictment would ultimately help Mr Trump's presidential bid.\"Nothing will come of this indictment,\" she said. \"Knowing the way he is, he's probably going to print t-shirts with his mugshot and make millions of dollars.\"\"Any free publicity is good publicity,\" she added, gesturing towards the Trump International golf course.Mr Trump's campaign has already claimed that it raised over $4m (£3.24m) in donations in the 24 hours following the indictment, a quarter of which it said came from first-time donors.But while Mr Trump leads opinion polls among the current field of Republican candidates, polls suggest he would not win an election against President Joe Biden, were he to run again.Many of the supporters wore red \"Make America Great Again\" hats and waved flags with Mr Trump's picture and campaign slogans on them, prompting horn honking and approving shouts from passing cars.Occasionally, motorists hurled expletives and made lewd gestures at the pro-Trump crowd, with one woman repeatedly shouting \"lock him up!\" from a passing vehicle.Nearby, a boat anchored in the waters near the resort flew large flags with the words \"Trust the plan\" and \"Trump or death\".The supporters gave the BBC a variety of reasons for supporting Mr Trump, ranging from support for local businesses to vague unsupported claims that he was combating \"communists\" and the \"deep state\".Others - echoing the words of prominent Republicans - accused Manhattan District Attorney Alvin Bragg who is in charge of the investigation against Mr Trump of \"weaponising\" the law for political reasons.\"The Democrats are trying to make an example out of him, to show that they're in control,\" said a local resident who identified herself only as Mary, echoing a refrain common among the demonstrators.\"We had a Bill of Rights, and a Constitution, things that were so sacred. We don't have that anymore.\"Another woman, who asked to remain anonymous, said that some Trump supporters in her social circles saw the indictment as a sign that the Democrats were frightened of Mr Trump's continued appeal.\"We knew this [the indictment] was coming. They know their days are done if he comes back. They're desperate. It's almost comical,\" said a woman who asked to remain anonymous.In her eyes, a Trump victory is all but certain in 2024. \"Even if he's in jail, he can still run, and he can still win. No matter what,\" she said. \"We love Trump and just hope that God has him in his hands.\""}