{"author":"By Jonathan Amos","title":"Photo of butchered rhino wins top award","news_category":"general","content":"A shocking image of environmental crime has been declared the top entry in this year'sWildlife Photographer of the Year (WPY) competition <http:\/\/www.nhm.ac.uk\/visit\/wpy.html>. Taken by South African Brent Stirton, the picture shows the slumped form of a black rhino in Hluhluwe Imfolozi Game Reserve.Poachers killed the animal at night, with a silencer, and then dehorned it. Stirton took the photo as part of an investigation into the illegal trade in rhino products.The photographer visited more than 30 such crime scenes in the course of his probe - experiences he said he found depressing.\"My first child is going to be born in February; I'm 48. And I think I left it such a long time because I kind of lost faith in a lot of the work we see as photojournalists. You lose faith in humanity to some extent.\"Stirton, who collected his award at a gala dinner at London's Natural History Museum, believes this particular piece of butchery was probably carried out by local people, but working to order.The usual practice is to sell the animal's two horns to a middleman. This individual then smuggles the merchandise out of South Africa, most probably through Mozambique, to China or Vietnam.In those Asian countries rhino horn has a street value higher than gold or cocaine.The trade is driven by the misguided belief that horn - the same material as toenails - can cure everything from cancer to kidney stones.Brent Stirton told BBC News: \"For me to win this, for the jury to acknowledge this kind of picture - it's illustrative that we are living in a different time now, that this is a real issue. The sixth age of extinction is a reality and rhinos are just one of many species that we are losing at a hugely accelerated rate and I am grateful that the jury would choose this image because it gives this issue another platform.\"Lewis Blackwell, the chair of judges for WPY, said the rhino image had had a searing impact on his panel: \"People may be disgusted, they may be horrified - but it draws you in and you want to know more, you want to know the story behind it. And you can't escape it; it confronts you with what's going on in the world.\"The rather more peaceful image of a young western lowland gorilla feeding on breadfruit is the subject of the Young Wildlife Photographer of the Year winning entry.This was taken by Daniël Nelson from the Netherlands, who entered the picture in the 15-17-years-old category.The gorilla is about nine years old and is called Caco by the trackers who took the young Dutchman to see the ape in Odzala National Park in the Republic of Congo.Western lowland gorillas are critically endangered. Their numbers are being denuded by illegal hunting for bushmeat, disease (notably the Ebola virus), and habitat loss (to mines and oil‑palm plantations).Daniël, who is now 18, said he first became aware of WPY when he was six. \"It inspired me immediately, and since then my passions in life have revolved around wildlife, photography and conservation.\"This image is called Contemplation, taken by Peter Delaney (Ireland\/South Africa). It wins the Animal Portraits category. It shows a resting chimpanzee on the forest floor in Uganda's Kibale National Park. Peter is from County Wicklow but WPY inspired him to move to Africa to pursue his photography career.Crab surprise is the title of this picture from Justin Gilligan (Australia). It claimed the Invertebrates category. It shows an octopus choosing a meal in a field of giant spider crabs in Mercury Passage off the east coast of Tasmania.Tony Wu (US) calls this The giant gathering. It is the Behaviour: Mammals winner. Tony is a specialist in photographing sperm whales. This huge gathering was captured off Sri Lanka's northeast coast. Very rarely have such scenes been witnessed by cameras.This unusual photo is titled The ice monster. Laurent Ballesta (France) captured the scene in waters off East Antarctica, close to the French Dumont d'Urville scientific base. It shows the underside of an iceberg. It's actually a mosaic of many images stitched together. It won the Earth's Environments category.Palm-oil survivors is the work of Bertie Gekoski (UK\/USA) - the winner of the Wildlife Photojournalist: Single image award. It is taken in eastern Sabah, on the island of Borneo. Three generations of Bornean elephants are seen moving across an oil-palm plantation being cleared for replanting. The palm oil industry has reduced and fragmented the animals' habitat. When the animals stray into plantations they often get shot or poisoned, says Bertie.The grip of the gulls, taken by Ekaterina Bee from Italy. Ekaterina is the winner in the 10 years and under category. She got these herring gulls to play for her camera by throwing some bread for them. Ekaterina is just five-and-a-half years old.WPY is one of the most prestigious competitions of its type in world photography.Started in 1964 by what has since become BBC Wildlife Magazine, it has grown in scale and this year accepted 48,000 entries from 92 countries. The current competition is organised by London's Natural History Museum.An exhibition of the best images opens at the South Kensington institution on Friday. Next year's competition starts taking entries from Monday.Jonathan.Amos-INTERNET@bbc.co.uk <mailto:Jonathan.Amos-INTERNET@bbc.co.uk> and follow me on Twitter:@BBCAmos <https:\/\/twitter.com\/#!\/BBCAmos>"}