{"author":"By Jonathan Marcus","title":"Trump's National Security Strategy: A pragmatic view of troubled world","news_category":"general","content":"This video can not be playedAnalysis: Trump's plan to confront - and sometimes work with - US rivalsThe Trump administration's National Security Strategy - based on what the White House calls \"principled realism\" - marks a significant shift in emphasis from the past, presenting both a decidedly more pessimistic view of the world but nonetheless a markedly optimistic view of America's place in it.It is easy for critics to write off the president's pronouncements. Certainly at times President Trump sounded as though he was still on the campaign trail in launching the new 68-page document, castigating the previous Obama administration and wrapping his new strategy in decidedly populist terms.Nonetheless this is a document that should not be dismissed and it will repay careful reading. It sets out a pragmatic view of a turbulent and troubled world and it recasts some of the president's favourite slogans - not least his consistent call to put \"America First\" - in a new and unexpected light.The strategy document itself is divided into four main sections <https:\/\/www.whitehouse.gov\/articles\/new-national-security-strategy-new-era\/> touching on all aspects of national power: diplomatic, economic and military.In its opening preamble, President Trump asserts that \"the US is leading again on the world stage\". He insists that \"the whole world is lifted by America's renewal and the re-emergence of American leadership\". But he speaks of \"an extraordinarily dangerous world\" where, perhaps in a muted echo of the Cold War, rival powers are \"aggressively undermining American interests around the globe\".The document is divided into four broad \"pillars\": the first dealing with \"protecting the American people, the homeland and the American way of life\". This deals with a variety of threats from jihadist terrorism, to cyber security and stresses the need to strengthen border controls and immigration policy - a key theme of Mr Trump's presidential campaign.The next section emphasises the need to \"promote American prosperity\". There is a lot here that is familiar Trump policy - the need to promote fair and reciprocal economic relationships; protecting US technical innovation and rejuvenating the domestic economy. Whatever people's views on the merits or otherwise of Mr Trump's policies, this pillar reflects a fundamental truth: American strength abroad fundamentally rests upon prosperity at home.The third pillar deals with traditional military strength in its conventional, nuclear, cyber and space forces. This is uncompromising on the role of rival powers, noting that \"China and Russia want to shape a world antithetical to US values and interests\". It appears to signal an end to a long-standing approach to Beijing which sought to make China what Americans liked to call \"a responsible stake-holder in international society\". Instead, the new Trump strategy asserts that \"contrary to our hopes, China expanded its power at the expense of the sovereignty of others\".There are some instructive departures from the rhetoric found in the president's tweets. On the US nuclear arsenal, for example, the document says that the \"US does not need to match the nuclear arsenals of other powers\" but that it should \"sustain a stockpile that can deter adversaries\".The final section or pillar on advancing American influence redefines Mr Trump's central credo in surprisingly internationalist terms: \"Our America First foreign policy,\" it asserts, \"celebrates America's influence in the world as a positive force that can help set the conditions for peace and prosperity and for developing successful societies\".It argues that \"allies and partners are a great strength of the United States\". The US, the document asserts, will continue to be engaged abroad, where it serves US interests to counter instability; places like Afghanistan \"where state weaknesses or failure would magnify threats to the American homeland\".So overall then this is a document that, despite the packaging and rhetoric, is less of a departure from established US foreign policy norms than many might have expected.True, key elements of the Obama administration's approach are rejected. There is an antipathy to multilateral trade deals; there is no mention of climate change as a security threat; and there is no aspiration toward a world free of nuclear weapons.But its emphasis upon economic strength as the basis for a strong foreign policy is realistic. Will Donald Trump's policies deliver that strong American economy? Who knows?Projected increases in defence spending are all very well when it is not yet in real money. Budget constraints need to be lifted to give the Pentagon a clear sense of what funding they can expect over a multi-year period. Many experts have told me that having larger forces is not enough - quality matters just as much. The era when the US held an unrivalled technical dominance may be at an end.This document, like all the other strategy documents presented by previous administrations, is a bird's eye view of many complex and inter-locking problems.Much of the detail as to how policies will be enacted is absent. So too is any clear sense of priorities - especially where goals may compete for scarce resources. Indeed there is little on how many of these extravagant ambitions will be funded and delivered.Some aspects of Mr Trump' policies already appear to be working in the opposite direction. The drastic cut-backs happening in the staffing, influence and prestige of the state department surely run counter to a strategy that talks of \"preserving a forward diplomatic presence\".Mr Trump's tax cut plans may increase pressure on an already strained defence budget."}