{"author":"","title":"Virgin Orbit: Date set for historic Cornwall rocket launch","news_category":"general","content":"The first ever orbital space launch from the UK is expected to take place on the night of Wednesday 14 December.Entrepreneur Sir Richard Branson's Virgin Orbit company will run the mission out of Newquay, Cornwall.It will see a repurposed 747 release a rocket over the Atlantic to take nine satellites high above the Earth.The date is provisional. Virgin Orbit still needs a licence from the UK Civil Aviation Authority (CAA). Any launch must have the regulator's approval.The zone of operation will be just off the coast of Ireland. The rocket will head south, past Portugal, as it makes its ascent.Official notifications have been posted to aircraft and mariners, warning them of the activity.The mission is timed to occur within a two-hour window, starting at 22:16 GMT, with the scheduled moment of launch expected at 23:45 GMT.If the launch day is delayed or the operation is scrubbed mid-air for some reason, there should be the opportunity to try again later in the week.The mission will be a historic moment for the UK, as it seeks to turn itself into a hub for the launch of small-sized European satellites.Virgin Orbit chief pilot Mathew \"Stanny\" Stannard, on secondment from the RAF, will be at the controls of the 747, nicknamed Cosmic Girl, on the night.\"There's a huge amount of pride that I get to be involved in this,\" he told BBC News.\"It's a big deal for the UK. It's a big deal for Cornwall. And the idea that I get to be the pilot on this mission is incredible.\"Cornwall Airport Newquay, home of Spaceport Cornwall, received its operational licence from the Civil Aviation Authority last month.As soon as Virgin Orbit gets the regulator's approval, the mission is \"Go!\".One of the final acts of preparation is for Virgin Orbit to conduct a fuelling rehearsal for the rocket, called LauncherOne. This is likely to take place in the next few days.Cornwall is just one of several locations around the UK setting up launch facilities.Plans are also well advanced in Scotland for rocket launches in the county of Sutherland and from Shetland.Their first flights should occur next year.Internationally renowned for making satellites of all sizes, the UK's space industry has always had to send its products to foreign spaceports to get them into orbit.Adding a launch capability means the sector will in future be able to do everything from first design through to mission operations.The first Virgin Orbit mission to fly out of Newquay will support a range of applications, both civil and defence.Quite a number of those nine satellites are doing research and development (R&D), proving technologies for use on later operational spacecraft.This is the case for Prometheus-2 - two satellites jointly funded by the UK defence research agency, DSTL, and aerospace manufacturer Airbus.Their cereal box-sized spacecraft will test new equipment to image the Earth, and new types of radio that can, among other functions, monitor the transmission environment - the sort of thing that could be used to detect the communications of smugglers or illegal fishers at sea.Rick Greenwood is chief technology officer for military space at Airbus UK.\"The buzzword is responsive space. That's what a UK launch capability is all about,\" he said.\"Having something on our doorstep that's regularly available is going to be an advantage, in terms of the time saved but also in lowering our costs. We don't really want to be shipping expensive spacecraft around the world to get them launched, if we can possibly help it,\" he told BBC News."}