{"author":"By Maria Zaccaro","title":"Afghanistan: Asylum seeker waits for decision over UK refugee claim","news_category":"general","content":"This video can not be playedMohammed decided to leave Afghanistan after he was shot at by the Taliban while driving to workAn asylum seeker who fled Afghanistan after being shot at by the Taliban fears his family is being put in danger by the delay deciding his claim.Mohammed, whose name has been changed, was forced to leave the country in 2021 without his wife and children when his life was threatened.He now lives in Hampshire, but a year after claiming asylum in the UK he is still waiting for a decision.The government said it aims to consider claims \"without unnecessary delay\".Mohammed left Afghanistan after his work campaigning for women's rights angered the Taliban, whotook control of the country when US forces withdrew <https:\/\/www.bbc.co.uk\/news\/world-asia-58223231>. He said he decided to flee to the UK when his car was shot at while he was driving to work.Mohammed's family cannot join him in the UK unless he is granted refugee status by the government <https:\/\/www.gov.uk\/settlement-refugee-or-humanitarian-protection\/family-reunion>.Despite contacting the Home Office several times he has not been told why his application has not yet been decided.The government's website states asylum seekers usually get a decision within six months <https:\/\/www.gov.uk\/claim-asylum\/decision>. He said: \"I am so much worried about them because the Taliban is conducting door-to-door search operations.\"I am afraid that when they will go to my home and when they will ask questions they will find that they all belong to me.\"Like other asylum seekers, Mohammed is also unable to work until his application is decided, and has to live off a government grant of £40.85 a week.He has said this means sometimes he does not eat for a few days as he is unable to afford food.\"Living a life as asylum seeker is really, really difficult. Sometimes I feel that I am not part of this beautiful world,\" he added.But Mohammed said life in the UK was the only hope for him and his family, and he would not stop fighting.Chris, a volunteer who works in support of asylum seekers, has been helping Mohammed with his claim.He said many applicants wait more than a year for a decision to be made. \"The Home Office's system is under-resourced and overloaded and unfortunately now there are many people waiting,\" he added.A Home Office spokesperson said: \"The government is committed to ensuring asylum claims are considered without unnecessary delay.\"All asylum claims are considered on a case by case basis, based on the facts presented by the claimant.\"Follow BBC South on Facebook <https:\/\/www.facebook.com\/bbcsouthnews\/>, Twitter <https:\/\/twitter.com\/bbcsouthnews>, or Instagram <https:\/\/www.instagram.com\/bbcsouthnews>. Send your story ideas to south.newsonline@bbc.co.uk <mailto:south.newsonline@bbc.co.uk>."}