{"author":"","title":"High Court judge criticises Prince Charles on barracks","news_category":"general","content":"A High Court judge has criticised the Prince of Wales for an \"unexpected and unwelcome\" intervention in a planned £1bn complex at Chelsea Barracks.Developer CPC Group claimed its Qatari partner pulled out after the prince attacked the proposed design.It gained a partial victory when Mr Justice Vos ruled that the Qatari group breached its contract.He refused to award CPC Group the £68m value of the deal but will consider a claim for damages or loss of earnings.The judge said both CPC Group and Qatari Diar \"were faced with a very difficult position once the Prince of Wales intervened in the planning process\".\"His intervention was, no doubt, unexpected and unwelcome,\" he added.He went on: \"Qatari Diar was not withdrawing because it wanted to, or because it wanted to stop CPC getting its money.\"It was between a rock and a hard place, and was doing the best it could in difficult circumstances.\"The prince's spokesman, Paddy Haverson, told the BBC: \"He has every right to express an opinion privately, which he does with passion, because he cares.\"Now to whomever he expresses that opinion, they have the right to decide whether to pay attention to it or not.\"CPC Group had been seeking £68.5m, which it insisted it was owed under the terms of the contract.Its QC, Neil Kitchener, said it would now be seeking the costs of the case, given there was a breach of contract.After the judgment Christian Candy, one of the owners of the CPC Group, said he was \"very happy\".A spokesman for Qatari Diar said: \"CPC's aim in bringing this action was ultimately about money.\"They wanted early payment of a sum potentially due to them under a contract, and they have failed.\"Lord Grabiner QC, representing CPC Group, told the court last month that the prince had written in May 2009 to the Qatari prime minister, who is also chairman of the Qatari Diar development company.The prince said his \"heart sank\" when he saw Lord Rogers' design for the site, the peer told the court.A month after the letter was sent, Qatari Diar pulled out of the plan.Lord Grabiner said: \"He urged Sheik Hamad bin Jasim to reconsider the plan before it was too late, and attached a scheme by a different, classical architect he preferred.\"Prince Charles and Lord Rogers had form in the way that they had previously crossed swords and Prince Charles's opposition to modern architecture is notorious,\" he added.But Qatari Diar's lawyer had insisted the allegation was \"unjustified\".The barracks site, which stretches over 12.8 acres, is in one of London's most expensive residential areas.In January 2008 it was sold by the Ministry of Defence for £959m.The developers planned to build 638 homes plus a hotel, shops and sports centre, on the prime site near the River Thames.Commenting on the ruling, Lord Rogers said: \"The way in which the Prince of Wales intervened in helping to get the original Chelsea Barracks planning application withdrawn was wrong.\"I hope that this judgment demonstrates that similar interventions should be considered far more seriously before they are made in the future.\""}