{"author":"","title":"Exhausting, costly, miserable: My search to rent a one-bed flat","news_category":"general","content":"When the rent on her east London flat rose by £350 a month, BBC journalist Lorna Acquah decided to look elsewhere. Her search to find a new one was filled with long queues, bidding wars and greasy kitchens.For the past two months, I've been living in rental hell. My mornings begin with a new daily ritual - logging onto property websites to check the listings and dashing off as many messages I can. During the day, I race around the city to attend viewings. At night, I dream of magnolia walls and white metro tiles.My partner and I hadn't planned to move, but the tenancy on our flat - a one-bed shoebox in Dalston, east London - came up for renewal. The landlord wouldn't budge - he wanted £1,650 a month, a 27% increase. We could just about afford it, but after a leak flooded the bedroom we opted to try for something cheaper elsewhere.So far, I've seen 20 flats all over the city - and I still don't have a contract to show for it.My first viewing was a £1,200 a month one-bed on the busy Holloway Road in north London. The flat was above a café and outside, rubbish bags and abandoned cups littered the pavement. A queue of exhausted renters had formed by the doorway. Most were in their late 20s and early 30s, but others were well into their 40s.Inside, we avoided eye contact while fighting for space to take pictures. The bathroom stank of damp, with stained yellow tiles and sprawling patches of black mould. In the living area, we tiptoed around the existing tenant who continued his work call about computer code. Best offers were needed by 3pm that day, but I didn't make one.Next on my list was a £1,080 a month studio in Haringey, a zone three area in the north-east of the city. Here, the microwave was on the floor beside the sink with the bathroom door inches from the the bed. To save even more space, the landlord hadn't bothered to install a washing machine. I left quickly.Fed up, we widened our search area and raised our budget to £1,600 per month. And we're not alone - spending more on rent is a national trend. The cost of living crisis, rising interest rates and an increase in the number of people returning to cities after the pandemic are pushing prices up all over the country.Rents have risen 4.4% across the UK in the past year, according to the ONS <https:\/\/www.ons.gov.uk\/economy\/inflationandpriceindices\/bulletins\/indexofprivatehousingrentalprices\/january2023>. Analysis by Zoopla, one of the UK's largest online property portals, suggests rents have increased by 11.5% for tenants entering new leases.After being outbid on flats I wouldn't have considered a year ago, the whole process started to feel like another full-time job. One agent asked me to submit a personal statement and a link to my LinkedIn profile. Some would-be-renters said they were spending 40 hours a week searching or had sneaked out of work to attend viewings.In areas close to central London, I heard from people who had been asked to pay six months' rent upfront or sign three-year leases. Some tenants were spending more than 30% of their income on rent,an amount the ONS says is unaffordable <https:\/\/www.bbc.co.uk\/news\/business-62525269>. But things were crazy further out too. In a grease-stained kitchen in zone five south-east London, an agent told me I'd need to make a swift offer or the flat would be let.Another reason for the chaos is a supply and demand issue. Some landlords are selling their properties to free up cash, reduce costs or avoid new regulations, says Zoopla's executive director Richard Donnell. Investment in new rental homes has stalled over the past six years, he says. A typical estate agent now has just eight available homes to rent, half the pre-pandemic average.I hopped on a train to see what the situation is like in other parts of the country. The East Midlands has seen some of highest rises in the UK -rents there have gone up 5% in the past year <https:\/\/www.ons.gov.uk\/economy\/inflationandpriceindices\/bulletins\/indexofprivatehousingrentalprices\/january2023>.After calling 20 listings, I secured just three viewings in central Nottingham. All were in decent condition and required offers by the end of the day. The estate agents said most of their lettings are to NHS staff or working professional couples.This keeps renters like Claire Fitzpatrick and her son Alistair from making a successful bid. Claire's disabilities means she's unable to work and is on benefits. She's on the social housing list, but that will take years. In the meantime, she's forced to battle it out on the private market, losing out to people like me.\"I'm priced out in Nottingham; you just can't get anywhere, it's just awful,\" she told me.\"If you've got a couple, or a teacher in front of you and they're earning 30, 40, 50 grand a year, they're not going to pick me.\"Mould, leaks and electrical hazards were a constant issue in the family's previous two-bedroom rental. But in October, the rent went up by £75, a 12% increase. Sharp rental rises are legal,though guidelines recommend increases should be be in line with market rates for the area. <https:\/\/www.gov.uk\/renting-out-a-property\/rent-increases>For now, Claire and Alistair are staying with relatives.Dan Wilson-Craw, deputy director of Generation Rent, has heard many stories like Claire's. He's calling for a rent freeze until the cost of living crisis eases, but says rent controls - a limit on the amount a landlord can charge for rent - should be part of the long-term solution to help renters.It's an approach taken in countries like Germany, but others, like Zoopla's Richard Donnell, say controls can discourage investment and lead to more landlords leaving the market.Both say the solution lies in building more homes and allocating a greater proportion of them to low-income households. Dan Wilson-Craw says the Renters' Reform Bill, which is due to be published this year, could give renters more security and greater powers to negotiate on rent.In the meantime, I'm stuck. With interest rates so high, buying a place of our own seems an ever more distant prospect.A couple of weeks ago, we moved back in with our families as our tenancy ended. I know I'm lucky to have this option, as others don't, but when I look at my lilac bedroom walls I feel like I've regressed to my teenage self.After a short break, I'll be back to the rental rat race - hoping I can soon put this frustrating situation to an end.Illustrations by Jenny Law. Additional reporting by Yazmina García-Fernández. "}