{"author":"","title":"West End top theatre ticket prices up 21% since pandemic, study says","news_category":"general","content":"Prices for top tickets to see West End shows have risen by 21% since before the pandemic, according to research by theatre publication The Stage.The average top ticket price is currently £140.85, up from £116.09 in June 2019,the outlet said <https:\/\/www.thestage.co.uk\/news\/the-stage-ticketing-survey-2022-top-prices-surge-20-from-pre-pandemic-levels>.The most expensive show in the survey is Cabaret at the Playhouse, for which some tickets will set you back £303.80.But the research found that the lowest-priced tickets have risen by an average of just 3.3% since 2019, up to £22.56.Average UK inflation over the past three years is around 12%.The most expensive seats for West End musicals now cost an average of £154.36, although that was a relatively modest increase of 3.5% since 2019, The Stage said.Plays had an average top ticket price of £114.69 - a jump of 38% compared with three years ago.One factor in the high ticket prices for Cabaret was the redesign of the theatre to accommodate the production.Several hundred seats were stripped out, reducing the Playhouse's capacity. The survey, which took prices for performances on Saturday 25 June, comes a month after a furore over the price of tickets to see the play Cock at the Ambassadors Theatre.The drama, which starred Taron Egerton and Jonathan Bailey, cut its top prices after criticism over the £400 cost.The Stage editor Alistair Smith said that on the surface, the average face value of top-price tickets has \"skyrocketed\", but that overall it \"is more of a mixed picture than previous years\", partly because London's lucrative international tourist market has not fully recovered.\"As well as those handful of shows that have had quite significant increases to the top-price tickets, you've also got quite a few shows that have actually dropped their top-price tickets,\" he said.\"What you're seeing is, to some degree, the impact of the pandemic and the fact that you now have a sort of two-tier system where hit shows are able to sell the best seats in the house to well-off domestic audiences.\"Whereas some of the long-runners, which maybe relied more on a tourist market, are having to actually lower their top prices to try to attract domestic audiences.\"A representative for Cabaret said 54 seats per week are priced at £300, with £25 tickets available for every performance in a lottery.A spokeswoman for the Society of London Theatre said top ticket prices \"always fluctuate year on year\" and were often influenced \"by a very small number of high-profile shows\".She added: \"We are pleased to see the average lowest ticket price has stayed roughly the same. This consistently low bottom pricing demonstrates producers' ongoing commitment to offering a wide range of prices, so that as many people as possible can experience London's world-leading theatre.\""}