{"author":"By Laura Devlin and Kate Scotter","title":"Mundesley: 'I'm very nervous about any further cliff falls'","news_category":"general","content":"A \"substantial\" cliff fall <https:\/\/www.bbc.co.uk\/news\/uk-england-norfolk-59600753> happened at Mundesley, Norfolk, sometime between Wednesday night and Thursday morning. How do those who live just metres from where it happened feel?\"I'm very nervous and agitated about any further incidents,\" says Antony Lloyd.He rents a flat in a sub-divided house in Seaview Road and says he first heard about the cliff collapse when he got a note through his letterbox.\"It's hard to wake up to it and to sleep, I'm very tired thinking about it all and I'm going to have to move I reckon now,\" he says.\"You can't sit and eat your tea without thinking 'what if it goes?'\"Mr Lloyd says he is particularly concerned as winter has \"only just started\" and the weather is \"still continuing to be bad\".He says his landlord has tried to reassure him that the coastguards \"would somehow let him know about the situation\".Coastal erosion has been reported along Norfolk's coast, but Mundesley's cliff collapse came as a \"bit of a surprise\" for Pete Revell, station manager at Bacton for HM Coastguard.\"We all know Happisburgh has got lots of cliff erosion so we always keep a close eye, but Mundesley's fairly stable to be honest,\" he says.\"Overstrand is a bit unstable but Mundesley has not been as bad in recent years.\"He says the cliff fall just off Sea View Road was \"very substantial\" and, although you get cliff falls in the winter, \"never to this extent to be honest\".Mr Revell repeated a warning to stay away from both the clifftop and the beach.Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}