{"author":"","title":"Diversity's Ashley Banjo says Britain's Got Talent critics are 'the minority'","news_category":"general","content":"Diversity star Ashley Banjo has said the dance troupe have received \"hundreds of thousands\" of messages of support after their performance on Britain's Got Talent last week.The Black Lives Matter-inspired routine has attracted more than 21,000 complaints to media regulator Ofcom.Banjo, who is also a BGT judge, said: \"Trust me. I'm right in the centre of it. The negativity is the minority...\"We stand by every single decision we made with that performance.\"Ofcom is now weighing up whether to launch an investigation into the performance.It included a white performer kneeling on Banjo's neck, a reference to George Floyd's death in police custody, and dancers dressed as riot police. It also featured themes about the coronavirus pandemic, poverty and capitalism.Critics complained that ITV's prime-time Saturday night entertainment show was an inappropriate platform for a political statement. The number of complaints stood at 21,673 on Monday, Ofcom said.But Banjo explained that it was meant to be \"a round-up of an extraordinary year\", and to \"summarise the crazy rollercoaster of emotions\" in 2020.This article contains content provided by Instagram. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readMeta’s Instagram cookie policy, external <https:\/\/privacycenter.instagram.com\/policies\/cookies\/> and privacy policy, external <https:\/\/privacycenter.instagram.com\/policy> before accepting. To view this content choose‘accept and continue’.\"It was layered,\" he said on Instagram. \"It was something we wanted to bring to the stage to give people hope, but also not to shy away from the difficult conversations and the difficult issues that have arisen this year.\"Banjo said the support, in the form of \"hundreds of thousands of messages, comments, DMs and just interactions in the street\", had been \"overwhelming\".But he said the routine had also sparked \"a lot\" of negativity, and he posted a series of examples of the racist abuse he has received on social media.He had received \"everything from racial abuse to threats to some really nasty stuff\", he told followers.\"A lot of the negativity and the nastiness and the racism shows exactly why this performance was needed, and exactly why this conversation that has now arisen from it is necessary. Racism is very real. I knew it before, and I definitely know it now.\"He said he \"just can't get on board\" with the argument that BGT was the wrong platform for their message. \"If an artist and a creative can't use real-world human issues - like universal issues - to inspire their art and to come through in how they express, then what's the point?\" he said.\"Britain's Got Talent has been a stage for so many incredible performances and artists and talents to express all different kinds of emotions and views and stories. Human ones. Of course political ideas are going to work their way into human stories because it affects us every single day.\"He added: \"The bit that has really seemed to connect with people and agitate, annoy and offend some people is the fact that we stood up and we said that racism is real, and as far as we're concerned has to change and will not be tolerated, because black lives matter.\"A lot of people were offended at the political nature of that statement, but that's never what we intended. Black lives mattered long before it was anything political or affiliated with any one set of people.\"Follow us on Facebook <https:\/\/www.facebook.com\/BBCEntsNews\/>, or on Twitter @BBCNewsEnts <https:\/\/twitter.com\/BBCNewsEnts>. If you have a story suggestion emailentertainment.news@bbc.co.uk <mailto:entertainment.news@bbc.co.uk>."}