{"author":"","title":"Russia 'violated 1987 nuclear missile treaty', says US","news_category":"general","content":"Russia has violated a key arms control treaty by testing a nuclear cruise missile, the US government says.Russia tested a ground-launched cruise missile, breaking the Intermediate-Range Nuclear Forces Treaty signed in 1987 during the Cold War, the US said.A senior US official did not provide further details on the alleged breach, but described it as \"very serious\".The bilateral agreement <http:\/\/www.state.gov\/t\/avc\/trty\/102360.htm> banned medium-range missiles with ranges between 500 and 5,500 km (300 to 3,400 miles).Analysis: BBC world affairs correspondent Nick ChildsThe Intermediate-Range Nuclear Forces Treaty was a landmark Cold War agreement. It essentially eliminated an entire, and highly controversial, class of nuclear weapons. For that reason, it still has resonance.There have been questions dating back at least to 2008 over whether Russia was developing a weapon that might breach the treaty. So one issue is why Washington has decided to make its declaration now. Is it a reflection of the general deterioration in US-Russian relations, and in particular the fallout from the Ukraine crisis?Russia has said little. It might argue the Americans are simply wrong, that the missile falls below the range limit. But the widespread suspicion is that it does breach the limits of the treaty. Moscow might also argue the treaty has been overtaken by world events, that other countries are developing similar missiles, and - after all - the Americans pulled out of the Anti-Ballistic Missile Treaty when it suited them.But there is also the argument that such an iconic treaty should actually be expanded beyond the US and Russia, rather than falling into disuse.The US claims come at a time of heightened tensions between the two sides, with the US criticising Russia for its alleged involvement in the conflict in Ukraine.A senior US official, who was not named, said in a statement that the testing of the missile was \"a very serious matter which we have attempted to address with Russia for some time now\".\"We encourage Russia to return to compliance with its obligations under the treaty and to eliminate any prohibited items in a verifiable matter,\" the official added.US President Barack Obama has written to Russian leader Vladimir Putin over the matter, officials say.This is the first time the US government has made its accusations public, though the issue has simmered for years, the BBC's Paul Blake in Washington reports.In January, the New York Times reported that <http:\/\/www.nytimes.com\/2014\/01\/30\/world\/europe\/us-says-russia-tested-missile-despite-treaty.html?_r=0> US officials believed Russia had begun testing ground-launched cruise missiles as early as 2008.The US State Department had said at the time that the issue was under review.The 1987 treaty is at the heart of American-Russian arms control efforts, and was signed by then-Presidents Ronald Reagan and Mikhail Gorbachev in the final years of the Cold War, our correspondent says."}