{"author":"By Susana Mendonça","title":"Labour group Momentum 'intimidating Haringey councillors'","news_category":"general","content":"A culture of complaints is being used by left-wing members of a local Labour party to intimidate colleagues, a councillor has claimed.Barbara Blake says she has lost her role at Haringey Council after pressure by Momentum, a group that supports Jeremy Corbyn.Momentum's national branch said the complaints were legitimate.Council leader Claire Kober resigned after claiming she was subject to sexism and bullying <http:\/\/www.bbc.co.uk\/news\/uk-england-london-42870086> from colleagues.Rows within the local party escalated as Momentum and other groups urged the Haringey Council to halt a controversial £2bn deal with a private property developer to build 6,500 new homes.At least 15 Haringey Labour councillors have withdrawn from, or been deselected from running in, elections this May.Complaints were made by Momentum members about a news article Ms Blake retweeted, in which they were mentioned.She said the Local Campaigns Forum - which ran the process to select Labour candidates for the local council elections - sent letters threatening not to endorse her as a candidate.Ms Blake said: \"I wasn't actually asked to give my side of the story.\"It [the complaint] was designed by councillors who were involved - part of Momentum, who were running the process - to intimidate you.\"She said she is not the only one to be targeted by \"spurious\" complaints.Ms Blake, who has been a councillor for St Ann's ward since 2014, will not be standing in the local elections in May.\"The Labour Party has been my life. And to say that I could be disciplined - well, it just breaks my heart,\" she added.However, the vice chair of Momentum's national branch, Emina Ibrahim, who is also a Haringey councillor, said the complaints were legitimate.\"People are raising what they describe as a complaints culture in public as a mechanism of intimidating candidates and councillors from making complaints.\"I don't feel that I should be prevented from making a complaint if I'm genuinely aggrieved by somebody's behaviour towards me.\""}