{"author":"","title":"Oscars: An Irish Goodbye nominated in short film category","news_category":"general","content":"This video can not be playedAn Irish Goodbye star James Martin tells of his joy and excitement over the film's Oscar nominationNorthern Ireland film An Irish Goodbye has been nominated for an Oscar in the Best Short Film category.Irish language film An Cailín Ciúin (The Quiet Girl) has been nominated for Best International Feature Film.The Banshees Of Inisherin has nine nominations, including Best Actor for Irishman Colin Farrell <https:\/\/www.bbc.co.uk\/news\/entertainment-arts-64384478>.Martin McDonagh was also nominated for Best Director for The Banshees Of Inisherin, which is up for Best Picture at the 95th Academy Awards.Directed and written by Ross White and Tom Berkeley, An Irish Goodbye tells a story of two estranged brothers who come together after their mother's death.The film was shot on location in Londonderry, Templepatrick and Saintfield.As well as being nominated in the short film category, it has been nominated for a Bafta for Best British Short Film.The film is a black comedy set on a rural farm in Northern Ireland.Speaking to BBC News NI shortly after the nomination was announced, Ross White said he was blown away.\"The Oscars are a thing that I have grown up watching and are almost like the pinnacle for any aspiring filmmaker,\" he said.\"I really can't believe it and I am just so proud of the whole team because a short film really is a labour of love.\"Everyone, absolutely everyone, put their heart and soul into this film and there was so much enthusiasm and love put into it - I think that's what is maybe resonating with audiences.\"One of the film's stars James Martin was with his family when the nominations were announced.\"We were all so excited that we cried our eyes out completely when my brother Daniel texted and said it was shortlisted for the Oscars,\" he said.The actor is hopeful that he will spend his birthday, which falls on the day of the awards ceremony, mixing with his favourite celebrities.\"I would love to meet Robert De Niro. Liam Neeson, of course.\"I'm into my Friends and so is my granda so it would be nice to meet Jennifer Aniston or Courteney Cox.\"An Cailín Ciúin (The Quiet Girl) is the first Irish language film to be nominated for Best International Feature Film, a category formerly named Best Foreign Language Film.Directed and written by Colm Bairéad, the film is adapted from Claire Keegan's 2010 book Foster.It is set in 1981 and tells the story of a nine-year-old girl sent to live with relatives in Ireland.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.It follows Cáit, who is withdrawn and neglected but finally finds herself in a loving home for the first time.The film has won over critics at numerous festivals, both in Ireland and abroad, after premiering at Berlinale (Berlin International Film Festival).An Cailín Ciúin picked up the audience award at Dublin International Film Festival and eight Irish Film and Television Academy and Awards (Iftas).It was the first ever in the Irish language to win the Ifta for best film.The Banshees of Inisherin is set on a remote island off the west coast of Ireland and tells the story of two friends who fall out after one decides to abruptly end their relationship.The film sees Colin Farrell reunite with director Martin McDonagh and co-star Brendan Gleeson.The trio previously worked together on the 2007 cult film In Bruges.Kerry Condon has been nominated for Best Supporting Actress for her role, while Brendan Gleeson and Barry Keoghan both picked up nominations for Best Supporting Actor for the film.It has also been nominated for best original score and for best original screenplay.Paul Mescal, who starred in the popular TV series Normal People in 2020, is also nominated in the Best Actor category for his performance in Aftersun.In the film he plays a young father grappling with how to raise his daughter.Irish talent behind the camera has also been recognised in this year's nominations.Jonathan Redmond has been nominated for Best Editing for the film Elvis, while Richard Baneham is nominated for Best Visual Effects for his work on Avatar: The Way of Water.Richard Baneham previously won an Oscar for his visual effects work for the film's predecessor Avatar."}