{"author":"By Tom Edgington","title":"Energy saving tips: Five ways to cut costs this winter","news_category":"general","content":"Winter weather has arrived, but many people are struggling with the cost of heating and other home energy bills.Here are some ways to help keep costs down. While the actual savings differ for different people, at the end of each section we explain how the savings figure was worked out.Most of the energy we use at home goes on heating.But turning the thermostat down by just one degree could save you about £150 annually.Also consider using your boiler's timer - if it has one - so that your heating switches off when the house is empty.While it might be tempting to avoid using the heating to save money, the government recommends a room temperature of at least 18C <https:\/\/ukhsa.blog.gov.uk\/2014\/10\/21\/preventing-avoidable-deaths-this-winter\/>. Older people and those who are ill or disabled may need it to be warmer. If your house is too cold it could encourage damp - which can lead to mould <https:\/\/www.bbc.co.uk\/news\/uk-63642856>. People living with mould are more likely to suffer from respiratory illnesses, infections, allergies or asthma.How this saving is worked out: Experts at Cambridge Architectural Research (CAR) found that turning the thermostat down from 19C to 18C would save 13% on an average annual gas bill - that's about £157 now. It suggests 68% of homes could benefit. Its findings are based on estimated energy use in 12,300 homes surveyed by the English Housing Survey. CAR was asked to carry out the study by the government in 2012. The Energy Saving Trust estimates a saving of £145 a year, if temperatures are reduced from 22C to 21C in main living areas.If you have a combi boiler, try reducing the flow temperature for the water heating your home <https:\/\/moneysavingboilerchallenge.com\/walkthrough\/> to 60C. This is the temperature of the water the boiler sends to the radiators.A higher temperature will heat your home faster, but it could also mean higher bills.That's because combi boilers tend to capture and recycle heat less efficiently at higher temperatures - meaning it requires more gas to heat your home.If you have a conventional boiler (ie a system with a hot water tank), you could try setting it to 65C. It's important not to set it any lower as it could create a health risk -legionella bacteria <https:\/\/www.nhs.uk\/conditions\/legionnaires-disease\/> could develop in the water.If you want to consider adjusting the flow temperature, the Energy Saving Trusthas more information <https:\/\/energysavingtrust.org.uk\/should-i-turn-boilers-flow-temperature-down\/> and the Nesta charity has aguide to walk you through the process <https:\/\/moneysavingboilerchallenge.com\/walkthrough\/>.If you rent your home you might want to check with your landlord before making changes.How this saving is worked out: CAR modelled the saving for reducing the temperature of combi boilers from 75C to 60C. It found this would save 8% on an average annual gas bill - about £97. It suggests 38% of homes in the UK could save money with this measure. The study was carried out in 2022.There are a couple of ways to save money when you shower.Firstly, shorter showers could save you about £84 a year. This is based on cutting the length of an average shower from about seven minutes <https:\/\/www.waterwise.org.uk\/wp-content\/uploads\/2018\/02\/Waterwise-2009_The-Water-and-Energy-Implications-of-Bathing-and-Showering-Behaviours-and-Technologies.pdf> to four.Secondly, you could consider buying a water-efficient showerhead <https:\/\/www.which.co.uk\/reviews\/electric-showers\/article\/eco-shower-heads-buying-guide-aklCM9Y5kuG5> - which will cost from about £10. (Check they are compatible with your shower before buying one).They work by restricting the amount of water coming through the head. This means you use less hot water for the same length of shower. This could mean a saving of about £98 a year if you don't have shorter showers.How this saving is worked out: CAR assumes that each household takes two showers a day, that an average shower lasts seven minutes, uses eight litres a minute and has a temperature of 41C. It says four-minute showers would save an average of 24 litres of hot water, resulting in an energy saving of 1.1 kWh per shower, or around 800 kWh per year for a household. CAR also estimated that a low-flow shower head would save an average of 28 litres of hot water, resulting an energy saving of 1.3 kWh per shower, or around 950 kWh per year for a household.Radiators in many homes have valves which control the temperature in each room.If used correctly, these thermostatic radiator valves - often numbered one to five (sometimes up to six) - can save you money.In rooms you use less often, consider turning the valve to the midway point (this should still heat the room to 18-20C).Keeping doors closed will also help trap heat.How is the saving worked out: CAR's study found that homes with radiator valves are likely to have partially adjusted them so that rooms outside the main living area are already 1.5°C cooler. However, reducing the temperature by a further 1.5°C could save 5.5% of the total gas bill (a saving of £68). Its modelling found that 76% of UK homes could save with this measure.If your home is poorly insulated it will lose heat more easily and be harder to keep warm.Draught-proofing is one of the cheapest and most effective ways to save energy.To stop cold air getting in and heat escaping consider:If you intend to carry out any draft-proofing, do not block extractor fans, wall vents and airbricks. These are necessary for ventilating certain rooms (like your kitchen and bathroom).The cost will depends on how much and which areas you want to draught-proof. Professional draught-proofing could save more energy because they should know which materials to use. The Energy Saving Trust hasfurther advice <https:\/\/energysavingtrust.org.uk\/advice\/draught-proofing\/>. How this saving is worked out: The saving is based on a typical three-bed gas heated, semi-detached house using a gas price of 10.3p\/kWh and electricity price of 34.0p\/kWh. The Energy Saving Trust's figures are based on the government's methodology for energy modelling in homes.Note: All savings figures are based on a typical gas-heated home in Great Britain with an annual usage of around 12,000 kWh of gas and 2,900 kWh of electricity, using a gas price of 10.3p\/kWh and electricity price of 34.0p\/kWh (based on Energy Price Guarantee October 2022).Combining all measures could potentially save a typical household £530 per year, according to Nesta\/CAR\/Energy Saving Trust calculations. Due to the potential for double counting, this is less than the £625 total of adding up each individual measure in this article. There are dangers in overly severe energy rationing - underheated and damp homes come with health risks.These tips have been chosen in collaboration with UK broadcasters - including the BBC, ITV, Sky, Channel 4 and Channel 5 - as well as Citizens Advice, the Climate Change Committee, Energy Saving Trust and Nesta."}