{"author":"By Aimee Thomas","title":"Autism diagnosis six years longer for girls, research finds","news_category":"general","content":"\"I knew I always felt different, but I didn't know I was autistic.\"For Rhiannon Lloyd-Williams, it would take until she was 35 to learn just why she felt different.Now research by Swansea University has found it takes on average six years longer to diagnose autism in women and girls than in males.Now charities in Wales are calling for greater investment into services to help better understand autism in females and speed up a diagnosis.Rhiannon, from Llangynfelyn in Ceredigion, previously worked with autistic children but did not recognise the signs in herself.\"I thought I had a good knowledge of autism, but it was based on misunderstandings about what autism is.\"The beginning of me realising I was autistic was in my early 30s when I read an article by an autistic woman.\"\"She described me in great and painful detail... all the things I had tried to hide throughout my life and didn't want anyone to know about.\"I realised, as an autistic woman, we often mask and hide our condition. We've been pushed into fitting in, I think there's female socialisation in that, we're encouraged to act a certain way.\"It was not until years later that Rhiannon spoke with her GP, but she was frustrated that her reasons for seeking a diagnosis were questioned.\"It was really hard getting across to [the GP] that I needed a diagnosis because deep down I felt broken.\"I felt there was something fundamentally wrong with me. I felt like a faulty person. Although I was happy in most of my life, I was never looking at my strengths - only my weaknesses.\"There was a long wait for a diagnosis. It was really difficult dealing with the uncertainty.\"The eventual diagnosis of autism came as a \"huge relief\" and while it may have brought more questions, it ultimately gave Rhiannon a reason for feeling the way she so often did.\"I was elated. I finally had a reason why I was different. I could final understand how I worked and I can plan to put things in place to help myself,\" she said.Rhiannon, now 42, has since started writing a blog <https:\/\/autistrhi.wordpress.com\/> about her experience which, she said, is helping both her and others, from as far away as Brazil, to cope.\"When you grow up autistic you grow up alone. But when I wrote that first blog, this autistic community appeared out of nowhere. Finding that is so important, because you find people like you. You're a perfectly formed autistic person.\"Now charities are calling on the Welsh government to invest in health services to improve diagnostic times for autistic women and girls.The National Autistic Society said women and girls are often misdiagnosed, which can lead to girls developing co-existing mental health difficulties like anxiety, eating disorders or depression.Research by Swansea University has found it takes on average six years longer to diagnose autism in girls.A study of 400 participants found that 75% of boys received a diagnosis before the age of 10 - but only 50% of girls.It also found the average age of diagnosis in girls was between 10 and 12 - but between four and six for boys.\"The parents responding to the study said there was a marked impact on the girls mental health while waiting for a diagnosis,\" said Steffan Davies, who carried out the research.\"Girls represented in the study had a lot more pre-existing diagnosis, which suggests they are being misdiagnosed with anxiety disorders, eating disorders, and that tends to defer from the root diagnosis which tends to be autism.\"Autistic UK said this gender gap has long been an issue and is the down to the diagnosis criteria and research used, which has been focused around young boys.\"Many girls end up missing out on education, because the environment they're expected to learn in is just too overwhelming, while accessing healthcare can be difficult. Women are often not believed,\" said executive director Willow Holloway.\"We have a structure in Wales which is far different than in England, and it is improving things. Work is being done to recognise the needs of autistic women and girls.\"With the implementation of the new Additional Learning Needs acts, support should be available without a diagnosis, but historically this hasn't happened.\"She added that autism within the LGBTQA community and ethnic minorities can also be missed due to the \"narrow range of stereotypes\" used in diagnosis.She said: \"We need far more training for the people working in diagnostic services on the different presentations of autism, and increase understanding of the condition in general and pre-diagnostic support.\"The National Autistic Society (NAS) said it has seen a steady increase in referrals of women and girls and said recent research found there is one autistic female for every three autistic males.Dr Sarah Lister Brook, clinical director at the NAS, said: \"Every autistic person is different but women and girls can be better at 'masking' what we traditionally think of as the signs of autism.\"It means many still go through their lives without a diagnosis, a full understanding of who they are.\"A diagnosis can be life-changing and vital to getting timely care and support.\"Gender should never be a barrier to diagnosis and things are changing, in part thanks to autistic adults like Christine McGuinness, Melanie Sykes and Holly Smale talking about their autism. But we still need better understanding.\"The Welsh government said a review of all neurodevelopmental services would be published soon."}