{"author":"","title":"Covid: Cardiff Airport passenger numbers drop to 1950s levels","news_category":"general","content":"Cardiff Airport passenger numbers dropped to the lowest levels since the 1950s during the pandemic, its chief executive has said.Spencer Birns told a Senedd committee that in 2020-21 passenger numbers fell from 1.6 million to 48,000.Cardiff saw a bigger drop than other UK airports, because the Welsh government discouraged people from travelling overseas, Mr Birns said.Welsh ministers had \"quite rightly\", he said, been focused on health.Cardiff Airport was bought by the Welsh government in 2013 for £52m, but in March a \"worst case scenario\" valuation estimated it could be worth as little as £15m due to the impact of the Covid crisis.That estimate was revealed a week after ministers gave the airport a £42.6m grant and also wrote off a similar value of debt.Mr Birns was asked why Cardiff's passenger numbers had dropped more steeply, when he appeared before the Welsh Parliament's Public Accounts and Public Administration Committee on Wednesday.\"There was more traffic handling at other airports than there was at Cardiff, but then don't forget we've been in a position in Wales where, and quite rightly so, the government have been so heavily focused on the health of the nation, that actually encouraging people not to travel overseas has been a major factor in the Welsh government's approach to how we contain the virus spread,\" he said.\"And that is a factor that is bearing out in terms of the numbers.\"It's not too dissimilar to what you're seeing on the rail figures, where recovery in England has been quicker than it has been to Wales.\"Mr Birns told the committee that by the end of March 2021 \"we'd actually looked at a reduction in passenger volumes from 1.6 million down to 48,000\".\"That's a 98% reduction in volume through the airport and it's actually the lowest the airport's ever been since the 1950s,\" he said.Cardiff, and the rest of the aviation industry, were predicting it would take five years to recover from the pandemic, he said.But Mr Birns said Cardiff Airport has a \"pretty large flying programme\" from spring next year \"that if it all pans out will probably get us close to a million passengers\".\"The challenge we've got is we don't know if we're going to be past the Covid pandemic by then or not,\" he said.\"We don't know if people are going to be encouraged to travel or not.\""}