{"author":"","title":"Coastal erosion: Climate group warns communities of cost","news_category":"general","content":"Coastal homes worth an estimated £584m could be lost to the sea by 2100, a climate action group claimed.One Home compiled a map identifying 21 at-risk villages and hamlets stretching the length and breadth of England.It warned people living in coastal areas that protection and compensation may not be available at all.\"We urgently need to help seaside communities prepare for the damage that will come,\" One Home chief executive Angela Terry said.The group said 2,218 properties were vulnerable at locations on its interactive map -from Cornwall, along the south and east coast, and in Cumbria <https:\/\/onehome.org.uk\/campaign\/campaigns\/coast\/interactive-map\/>.It used data from the Environment Agency's National Coastal Erosion Risk Mapping <https:\/\/www.data.gov.uk\/dataset\/7564fcf7-2dd2-4878-bfb9-11c5cf971cf9\/national-coastal-erosion-risk-mapping-ncerm-national-2018-2021> (NCERM) dataset.Policies on whether to defend, retreat or abandon sections of coast were contained in shoreline management plans (SMPs), but although readily available to view, SMPs were not a guarantee of support, the One Home said.Ian Brennan, of Save Hemsby Coastline, revealed the prospect of storm damage <https:\/\/www.bbc.co.uk\/news\/uk-england-norfolk-64455311> was taking \"a huge toll on the mental health\" of local people.He said more than 90 homes in the Norfolk village could be lost in the next 25 years if nothing was done.Ms Terry said: \"Sea levels are rising as global temperatures soar and so larger waves batter our coast during severe storms.\"These irreversible changes mean some cliff faces are crumbling fast.\"We can't turn the tide or build a wall around the entire coast so we urgently need to help seaside communities to prepare for the damage that will come.\"Shoreline management plans are publicly available documents but most people are unaware of their existence.\"She said the map would explain SMPs in an \"easy-to-digest way\" as homeowners might be unaware their property was at risk or whether decisions were being made about them.\"Even where communities have been chosen to be saved, the money might not be there, giving people false hope that their home will be protected long term,\" she said.\"Owners might be asked to pay to demolish their homes while still paying their mortgage.\"More than a third of England's coastline has a designation of \"no active intervention\", One Home said, meaning that nothing more would be done to defend against erosion.An Environment Agency spokesman said: \"We know the devastating impact that flooding and coastal change can have, which is why improving the resilience of people and communities is our top priority.\"From 2015 to 2021, we invested £1.2bn to better protect around 200,000 homes from coastal erosion and sea flooding.\"However, climate change means that our coast is changing at an accelerated rate, meaning in some places we and coastal authorities will need to help local communities adapt and transition away from the current coastline.\"The 21 communities at risk were:Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}