{"author":"By Katty Kay","title":"Will an FBI 'raid' supercharge Trump?","news_category":"general","content":"The torrent of outrage from Donald Trump's supporters on Tuesday has been predictable. Of course they were going to vent their fury after FBI agents searched the former president's home.It plays straight into the narrative Mr Trump himself perpetuates that he is a victim of a corrupt establishment. As he likes to say at his rallies, no political leader has ever been treated as badly as he has. In fact, the FBI search Mr Trump has called a \"raid\" is helping to solidify his campaign of grievances against the state.Listening to the gist of what his supporters are saying, there is a specific point about government overreach in persecuting Mr Trump.Marco Rubio, a Florida Republican senator and Trump critic-turned-acolyte, compared the FBI's actions to \"something we have seen many times from third world Marxist dictatorships\".Kristi Noem, the South Dakota governor who has only ever been a staunch Trump fan, called it the political weaponisation of the FBI, which she said had \"been after President Trump as a candidate, as president, and now as a former president\".There is a mobilising effect to this theme. Again, as Mr Trump often says, if he is being persecuted, his supporters, by extension, are also under threat. He is their guy. It's a sentiment I've heard repeatedly from Trump voters: \"In going after him, they are going after us.\"Which gets us to the interesting question of how this FBI search changes the American political landscape.First, it will no doubt galvanise Trump voters to turn out in November's midterm elections. Pro-Trump Republicans are already using it as a way to raise campaign funds for Trump-endorsed candidates.They clearly see the operation as a money spinner. It also forces Republicans who have previously voiced differences with the former president to rally around him.Even Ron DeSantis, the Florida governor who is seen as the main contender for the Republican nomination if the former president doesn't run in 2024, quickly came out to publicly defend Mr Trump after the search, also calling the search a \"weaponisation of federal agencies\".All this could prompt Mr Trump, encouraged by the instant outpouring of pro-Trump fervour, to seize the moment and announce that he'll make a tilt for the White House again.Around the country millions of his fans are waiting for him to do just that. An early announcement might disappoint some Republican strategists, who fear it casts the former president, who is still a very divisive figure, as a central player in the critical midterm elections. They would prefer that the midterms focus almost exclusively on inflation and the poor state of the US economy.For Democrats meanwhile, the FBI search of Mar-a-Lago holds its own political peril. Not only does it motivate the Republican base, it takes attention away from the Democrats' achievements in Congress this week, passing a sweeping economic package that addresses everything from health care to climate change.For Democrats in tight races, \"the spending bill is a series of victory laps,\" said Democratic strategist Mary Anne Marsh. But the first lap has now been truncated. Democrats wanted this week's political talk shows to be all about the climate change and spending bill that the Senate passed this weekend, instead they were all, once again, about Donald Trump.The politically unfortunate timing prompted some Democrats to refute pro-Trump allegations that this search was orchestrated by the White House.\"I'm a student of the law, and I care about the rule of law, and I like that we do not have a White House that picks the calendar of what the Department of Justice is doing,\" said Congresswoman Madeleine Dean, a lawyer and Pennsylvania Democrat. She was one of the impeachment managers at Mr Trump's second impeachment, after the 6 January Capitol riot.In the longer run, many Democrats believe Mr Trump is the best candidate for them to face in the 2024 presidential election. A June Fox News poll suggested 55% of registered voters view him unfavourably. He is a divisive figure and Democrats think his focus on the last election won't help him with the next one. When he is in the news, they believe, it helps Democrats across the country.Ms Marsh, the Democratic strategist, believes her party will see a big turnout this November, partly because of the Supreme Court ruling overturning a constitutional right to an abortion, but also because the Republican party have failed to hold their party leader accountable for the 6 January riot.Whether he runs or not, whether he announces before the midterms or not, in some ways that's no longer the important question. After the FBI search, we saw how quickly Republican leaders took up his cause.\"This is less and less about Trump being in the frame of the picture,\" Michael Steele, a Trump critic and former Chairman of the Republican National Committee, told me.\"This is no longer Trump having to go round the country and perpetuate the lie about the election and perpetuate the destruction of the administrative state. Now he has his minions who will do it for him.\"This summer, I spent a hot few weeks travelling around the US talking to Trump supporters. More than once I heard them say a civil war is coming in the country. Monday night on social media, Mr Trump's most ardent fans said the FBI's action will lead to violence.Steven Crowder, a Trump influencer with 1.9 million followers on Twitter wrote: \"Tomorrow is war. Sleep well.\"I still find the prospect of a new civil war in America hard to believe. But someone who's been in the heart of Republican politics for decades, Mr Steele, is less sanguine. \"It is serious. This has been an underlying theme (in the fringe of the Republican party) for 10 or 15 years. Trump just gave licence to it. He uncorked the bottle. If they indict this man, these people will lose their minds.\"I hope he's wrong. "}