{"author":"By Steven McIntosh","title":"Paul O'Grady: Camilla says she is 'deeply saddened' by TV star's death","news_category":"general","content":"Camilla, the Queen Consort, has said she is \"deeply saddened\" by the death of TV and radio host Paul O'Grady.The broadcaster died \"unexpectedly but peacefully\" on Tuesday evening at the age of 67,his husband has announced. <https:\/\/www.bbc.co.uk\/news\/entertainment-arts-65108130>In a statement, Camilla said O'Grady's \"warm heart and infectious humour lit up the lives of so many\".Celebrities paying tribute included Sir Elton John, Amanda Holden, Zoe Ball and Paddy McGuinness, who described O'Grady as an \"icon of British TV\".Strictly Come Dancing judge Craig Revel Horwood, with whom O'Grady had been sharing the role of Miss Hannigan in a theatre production of Annie,remembered the performer as <https:\/\/twitter.com\/CraigRevHorwood\/status\/1640976213605859329> a \"gorgeous colleague and friend\".\"He was such a wonderful human being, funny and to the point,\" Horwood said. \"Paul, legend, RIP darling.\"Comic Peter Kay said <https:\/\/twitter.com\/peterkay_co_uk\/status\/1641085069333807104> he had \"happy memories of the lovely Paul O'Grady\", who he said was \"kind, genuine and naturally funny\".This video can not be playedWatch: Paul O'Grady's life on screenMark Downie, former editor of daytime programmes at Channel 4,  recalled the star's generosity <https:\/\/twitter.com\/markmdownie\/status\/1640983433621954561>. \"When we worked together at Channel 4, Paul O'Grady insisted that new roles on his show were advertised in the local Job Centre,\" he said.\"He wanted anyone and everyone to be able to apply so they could get a break like he had. And it made the show better. A kind and generous man.\"Sir Elton remembered the broadcaster as a \"brilliant entertainer\", a \"supporter of LGBTQ+ rights\" and someone who was at the forefront of the \"fight against Aids and HIV\".In an emotional Instagram post, the singer thanked O'Grady for, among other things, hosting his and husband David Furnish's \"stag party before our civil partnership in 2005\" - the first year ceremonies could be performed in England.\"Thank you for all the joy you brought into the world, Paul,\" Sir Elton said. \"You went places nobody had gone before and we will miss you very much.\"This article contains content provided by Instagram. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readMeta’s Instagram cookie policy, external <https:\/\/privacycenter.instagram.com\/policies\/cookies\/> and privacy policy, external <https:\/\/privacycenter.instagram.com\/policy> before accepting. To view this content choose‘accept and continue’.O'Grady's impact on and contribution to the LGBTQ community was highlighted by several of those paying tribute to the entertainer on social media\"When it felt like no one I ever knew in my life was gay, turning on the telly at tea time seeing someone so charismatic, camp and beloved was beyond comforting for so many of us,\"said journalist Harrison Brocklehurst. <https:\/\/twitter.com\/harrisonjbrock\/status\/1640967731469078529>Comedian and campaigner Joe Lycett added: <https:\/\/twitter.com\/joelycett\/status\/1640996175703683073> \"I'm sad about Paul O'Grady. I hoped I might meet him one day to tell him what an inspiration he was to me: I loved [how] gloriously loose and effortless his shows were, how he proved you could be political in a light entertainment space and that you could do all this and be really, really funny.\"One of O'Grady's most recent TV appearances came last year with Camilla, the Queen Consort, for a one-off episode of ITV's For The Love of Dogs - a series the star helped launch in 2012 that followed the work of the Battersea Dogs and Cats Home, an organisation for which he was an ambassador.A statement released on behalf of Camilla on Wednesday said she was \"deeply saddened to have learned of the death of Paul O'Grady, with whom she worked closely to support the work of Battersea Dogs and Cats Home and whose warm heart and infectious humour lit up the lives of so many\".Following his death, the animal home remembered O'Grady as a \"devoted animal lover\" and a \"champion for the underdog\".QI host Sandi Toksvig said: <https:\/\/twitter.com\/sanditoksvig\/status\/1640976055761526785> \"Working with Paul O'Grady was one of the greatest pleasures of my life. Funny, fearless and full of rage. The best. The world seems a little less bright.\"This video can not be playedWatch: Paul O'Grady speaks to Michael Parkinson about his alter ego Lily Savage (2002)Gaby Roslin, who occasionally sat in for O'Grady on his BBC Radio 2 show, said his death was \"unbelievably sad news\", describing him as a \"one-off\".\"Goodness me, we laughed together so much,\" she said. \"Our chats lasted for hours and he'll be up there now nattering away and keeping everyone laughing.\"O'Grady broadcast his final BBC radio show in August 2022, <https:\/\/www.bbc.co.uk\/news\/entertainment-arts-62543036> having hosted the Sunday afternoon programme for nearly 14 years.Speaking on her BBC Radio 2 breakfast show on Wednesday, Zoe Ball said: \"We're all heavy of heart here this morning at the news of our dear friend Paul O'Grady. I know he was so loved by the Radio 2 listeners and all of us here.\"Top Gear host McGuiness said <https:\/\/twitter.com\/PaddyMcGuinness\/status\/1640965616239509505> that O'Grady, for whom he stood in on his chat show more than 15 years ago, \"was always supportive, kind and just great to be around\".\"Paul started in the pubs and working men's clubs but finished as an icon of British TV. I'll miss him very much.\"Former BBC Radio 2 presenter Ken Bruce described O'Grady <https:\/\/twitter.com\/RealKenBruce\/status\/1640961783195107328> as a \"unique and brilliant broadcaster who brightened the nation\".Drag queen Danny Beard told BBC Breakfast that the star was \"the most important person in British culture for drag\".\"I don't think there's anyone who does the job that I do that doesn't class Paul as an icon,\" added Beard, who won series four of Ru Paul's Drag Race UK.By Josh Parry, LGBT reporterWhenever we talk about on-screen representation, there's a saying; \"If you can't see it, you can't be it.\"And as tributes to Paul O'Grady pour in, it's clear the saying has never been more appropriate.He played pubs and clubs as rough-around-the-edges drag queen Lily savage in the 80s, and brought the character to the mainstream in the 90s.But it was what Paul did next - and how he did it - that made him a trailblazer for gay representation on screen and inspired a whole generation of entertainers that might not ever have thought it possible.As Britain emerged from the AIDs crisis, with homophobia and stigma still rife, Paul managed to become a staple of prime-time light entertainment; not just as Lily, but as himself. A working class gay man from Birkenhead.He never assimilated. He never attempted to \"straighten up\" or change his persona.And for so many in the LGBT community - who are used to making ourselves smaller or hiding parts of our personality in certain company - that was a game changer.From documentaries, to his own chat shows, the Blind Date reboot and of course his ITV show Love of Dogs, he never dimmed himself down or tried to make himself more palatable for certain audiences.He was unapologetically camp, and bitchy. He was Paul - perhaps, though, always with a hint of Lily…O'Grady was also mentioned by several MPs during Wednesday's Prime Minister's Questions.Labour's deputy leader Angela Rayner and MP Chris Bryant both paid tribute to the entertainer, while deputy prime minister Dominic Raab said Lily Savage \"broke glass ceilings and broke boundaries\".This video can not be playedLabour MP Chris Bryant pays tribute to Paul O'Grady's role in British gay life and makes an unusual offer to Dominic RaabComic Omid Djalili said <https:\/\/twitter.com\/omid9\/status\/1640996174373978112> he was \"just coming to terms with the unexpected passing of Paul O'Grady\".\"I don't think I've ever been so immediately enamoured with a personality on a first meeting. He truly elevated the very atmosphere in which he moved. God rest his mighty soul.\"Presenter and actor Les Dennis described O'Grady <https:\/\/twitter.com\/LesDennis\/status\/1640945030935322624> as \"a true comedy great\", adding: \"His twinkly, mischievous presence will be missed by so many.\"Actor and TV host Rob Brydon said: <https:\/\/twitter.com\/RobBrydon\/status\/1640986926609240066> \"Paul O'Grady was a lovely warm and caring man with a lightning fast and devastating wit. What terrible news.\"This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Speaking on BBC Radio 4's Today programme, TV presenter Carol Vorderman said: \"He just fizzed, he was one of those people that just made you feel every part of you was alive.\"He exploded through the daft, made-up rules of society. He was a massive talent, but you can't forget he was a social worker when he was younger, he saved babies and young children from abuse, he lived in Soho before it was gentrified, he never judged the vulnerable, the weak, the misunderstood.\"O'Grady had recently been on tour playing Miss Hannigan in the musical Annie and had been due to present on Boom Radio in less than two weeks time for Easter Sunday.The presenter was born in Birkenhead, on the Wirral, Merseyside, in 1955, to a mother whose maiden name was Savage - which is believed to have inspired his famous drag act.He began performing as Lily Savage in the 1970s. His drag persona later helmed in a solo show that ran for eight years at London's Royal Vauxhall Tavern, and made a name by speaking out about LGBT issues.Later, he hosted chat show The Lily Savage Show for BBC for a short run in 1997, before turning his hand to hosting a revived version of game show Blankety Blank, which remained on air until 2002.O'Grady later hosted teatime programme The Paul O'Grady Show on ITV from 2004 to 2005, before moving with it to Channel 4 from 2006 until 2009. It was later revived in 2013 on ITV and remained on air for two years.During 2013, the chat show was fronted by guest hosts <https:\/\/www.bbc.co.uk\/news\/entertainment-arts-25000088> after he suffered a health scare. He had previously had heart attacks in 2002 and 2006, the latter requiring a stay in intensive care.During his career O'Grady won a TV Bafta, British Comedy Award and a National Television Award for The Paul O'Grady Show.In 2008, he was made an MBE in the Queen's Birthday Honours for services to entertainment."}