{"author":"","title":"'Extremist' protests at Pembrokeshire asylum army base criticised","news_category":"general","content":"Asylum seekers arriving at a former military base have become a target for \"hard-right extremist\" protestors, first minister Mark Drakeford has said.Police remain at the Penally Army centre, near Tenby, after protesters tried to block the entrance on Monday.Mr Drakeford said they had come from around the UK to \"exploit\" the cause.Others say they welcome the asylum seekers but the site is \"completely inappropriate for vulnerable people who have fled terror and suffering\" <https:\/\/www.bbc.co.uk\/news\/uk-wales-54227032>.Mr Drakeford agreed the site was unsuitable but blamed the Home Office for its handling of the situation, saying his request for a two-week delay for the housing was blocked.\"It has led to Tenby becoming the target for hard-right extremist groups from right across the United Kingdom who've heard about this and think this is a cause that they can latch on to and exploit,\" he said.\"Those people are not welcome in Wales and I hope that we will soon be in a position to make sure that the police take the action that is necessary to make sure that they cannot inflame local sentiments,\" he added.Mr Drakeford was responding to a question from Carmarthen West and South Pembrokeshire Member of the Senedd Angela Burns who said there were \"shocking scenes\" at the camp on Monday night \"with people bussed in from outside with very unpleasant political agendas\".Some local people have also said they felt the protests were being led by people from outside the area.One man who did not want to be named said: \"People who live here are calmer about it all by now.\"They're here and we have to accept it but we should have been given more information about what's happening. There's been no community engagement at all.\"The Penally Army centre is one of several sites being considered <https:\/\/www.bbc.co.uk\/news\/uk-wales-54167641> for housing asylum seekers.Proposals to house about 230 at the base until their claims are processed have not been discussed with the Welsh Government <https:\/\/www.bbc.co.uk\/news\/uk-wales-54183849>. The base was used by the army and Ministry of Defence until the Home office took it over on Monday.The UK's Welsh Secretary Simon Hart, also the local MP, has said the site is due to be open for up to 12 months and most of the people are arriving there from Iran and Iraq.Supt Anthony Evans, of Dyfed-Powys Police, said any protester found breaking the law would be prosecuted.He said: \"We understand that tensions are running high in the community, but last night's scenes endangered everyone and caused understandable alarm.\"We are actively reviewing a significant amount of footage extracted from our officers' body-worn cameras, from footage shared to social media and intelligence obtained from other sources.\"The Home Office said it was working with Pembrokeshire council and police to ensure \"vulnerable asylum seekers\" had suitable accommodation as facilities in south-east England were under strain.\"During these unprecedented times, the government is working with a range of partners and across departments to secure further accommodation, and the MoD has offered use of some of its sites,\" an official said.\"When using contingency accommodation we work closely with organisations, including local authorities and law enforcement, throughout the process to ensure value for money and that vulnerable asylum seekers, who would otherwise be destitute, have suitable accommodation while their claims are processed.\""}