{"author":"","title":"Ukraine: Refugees in Wales urge help for people fleeing war","news_category":"general","content":"A Chilean who moved to Wales as a refugee after being imprisoned and tortured has urged more support for those fleeing Ukraine.Jose Cifuentes said his \"heart goes out\" to all affected by \"an extremely disturbing experience that no human being should have to face\".A group who arrived in Swansea as refugees have written an open letter calling for more support.The UK government has resisted calls to eliminate visa rules, citing security.Home Secretary Priti Patel said Ukrainians with passports will be able to apply <https:\/\/www.bbc.co.uk\/news\/uk-60686254> for UK visas entirely online from Tuesday.Mr Cifuentes, an educational psychologist, arrived in Swansea in 1977 with his wife and one-year-old daughter after being imprisoned and tortured by the Pinochet regime in Chile.\"To those mothers, children who have been separated against their own wishes to protect their own lives, it is an extremely disturbing experience that no human being should have to face,\" he said.\"It is something that only the people who go through that will know what that is like.\"In 2010, Swansea became the second City of Sanctuary in the UK <https:\/\/swansea.cityofsanctuary.org\/> and first in Wales, and has helped refugees \"regain their voice\", according to Mr Cifuentes.He called for a rethink of the current system, saying people who suffer \"extreme circumstances\" need a \"safe way\" to get to the UK.The Swansea group, which includes refugees from Chile, Egypt and Turkey, said they \"know from experience that fleeing for your life means not being able to choose how to travel or where you arrive\".Five people who arrived in Wales as refugees have signed the letter, including Otis Jean Paul Bolamu Basiki, a former election monitor from DR Congo.He said: \"In Ukraine there is a very difficult time with people becoming refugees and suffering.\"It is winter, they have families with children and nothing to eat and no water, no-one can accept this. I don't want to see this happening.\"Better to talk and find agreement and stay together. People need peace, everywhere.\"More than two million people have fled since Russia invaded Ukraine and the Home Office has come under pressure to speed up visa processing after it emerged just 760 had been issued so far.Their letter states that \"the British government's Nationality and Borders Bill <https:\/\/www.bbc.co.uk\/news\/newsbeat-59651523> may prevent people like us from finding safety here in future. We add our voices to those of the bishops and peers who are opposing this divisive bill.\"Under the Nationality and Borders Bill being debated in the House of Lords, if the British government wants to remove someone's citizenship it will no longer need to tell them.Home Secretary Priti Patel said the law would be used in \"exceptional circumstances\" on people who pose the most risk to the UK.But protests have been taking place against the plans - some fear that ethnic minorities could be treated differently to white Britons for committing the same crime.The group wants urgent amendments, saying the law would \"pose a cruel threat to those forced to flee in this way (from war) by treating them as criminals\" and does not want it to create \"two classes of refugees, and of citizens, with limited rights for some\".They said it was impossible to foresee that the Ukraine conflict would develop so \"quickly and dramatically\", adding it was a \"dangerous indicator \"of what could happen \"anywhere in the world\".\"Ukraine is now not much different from Syria, Iraq, Afghanistan, and Palestine,\" the letter adds.On Wednesday afternoon, the mayor's office in Calais told the BBC that 87 Ukrainian refugees were taken by bus to Lille <https:\/\/www.bbc.co.uk\/news\/uk-60686254> to a visa centre to be processed.The government said the new temporary visa application centre for people applying to come to stay with Ukrainian family in the UK would open on Thursday in Lille, rather than in Calais, \"in light of the risk from criminals actively operating in the area\" around the port.A spokesperson said the UK stood \"shoulder-to-shoulder with the people of Ukraine\" and it was taking urgent action to process visas at speed - with extra staff deployed to help people through the process."}