{"author":"","title":"Clifton Suspension Bridge: Police blame climate protesters for closure","news_category":"general","content":"Clifton Suspension Bridge has been closed by police due to planned protests by Extinction Rebellion <https:\/\/www.bbc.co.uk\/news\/uk-48607989>.Two women from the climate campaign group's youth arm locked themselves together on the bridge on Thursday.They were arrested in Bristol at about 23:00 BST on suspicion of wilful obstruction of the highway and conspiracy to cause a public nuisance.Police said more protests were planned and the bridge, closed for \"public safety\", could be shut until Tuesday.The teenage women who were arrested were members of XR Youth Bristol, a separately organised youth wing of Extinction Rebellion in the city. XR Youth Bristol said it planned to occupy the bridge during the day on Friday.Aden Harris, from Bristol's XR Youth, said they were taking the action \"to call the government to account\".\"We need leadership and a country that's capable of tackling and reversing the ongoing crisis.\"We want the government to get behind the Climate and Ecological Emergency Bill now,\" he said.Members of the Extinction Rebellion campaign group have also said they are planning various activities and demonstrations in Bristol over the bank holiday weekend.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Acting Ch Insp Rob Cheeseman, of Avon and Somerset Police, said: \"Public safety will always be our top priority and following several multi-agency meetings, a joint decision has been made to close the Clifton Suspension Bridge from midnight Thursday.\"We cannot risk any protest activity impacting on the bridge which is currently used by around 10,000 to 12,000 vehicles every day, in addition to pedestrians and cyclists.\"We know from experience that Extinction Rebellion have engaged in disruptive tactics which have not been disclosed in advance to our liaison officers and we have to take all necessary steps to mitigate the impact this action could have on the safety of the public using the bridge.\"He said the decision to close the bridge had \"not been taken lightly\" and the closure would be \"reviewed continuously\".Bridge master Trish Johnson said the bridge was closed to vehicles, cyclists and pedestrians from midnight \"following the advice of the police and the local authorities\".\"We'd like to apologise to all our users for the inconvenience this will cause them.\"Protesters also set up an \"installation of a life-sized African elephant\" made of \"recycled plywood\" on Princes Street Bridge.The bridge has been closed to traffic but remains open to cyclists and pedestrians.Christina Gray, director of public health at Bristol City Council, said: \"I urge anyone thinking about joining this weekend's Extinction Rebellion protest to take all necessary precautions to limit the risk of spreading the virus.\""}