{"author":"By Daniel Wainwright & Paul Bradshaw","title":"Rivers used as 'open sewers', says WWF charity","news_category":"general","content":"This video can not be playedMelissa Compton became seriously ill while swimming the length of the River SevernTargets for 75% of rivers to be healthy by 2027 are \"very unlikely\" to be met in England, a charity has warned.The World Wide Fund for Nature (WWF) says rivers are \"used as open sewers\".The Environment Agency predicts 75% of rivers in England and along the Scottish and Welsh borders will meet EU expectations by 2027, compared with just 14% now.It is planning an autumn consultation on \"challenges and choices\" faced in cleaning up water.The agency said it would review the target based on \"what can realistically be achieved\".Dr Andrew Singer, senior scientist at the Centre for Ecology and Hydrology, said: \"There is no river in the UK that is safe to be swimming in.\"We have so many sewage works that are on a river that even if you treated it perfectly, you would still have enough pathogens coming out of a well-operated sewage works that you wouldn't want to swim in the river.\"Melissa Compton was taken to hospital after \"swallowing sewage\" during a 220-mile swimming challenge in the River Severn.The 39-year-old was taken ill in Gloucester <https:\/\/www.bbc.co.uk\/news\/uk-england-shropshire-48744003> in June, having already suffered hypothermia and fatigue while swimming to raise money for charity.\"It was grey, it was very murky, there was a lot of debris in the water and then you could see evidence on the side of what looked like toilet roll,\" said the nurse, who works in Shrewsbury.\"You could taste it and see the debris on the surface.\"She believes the government should put more funding into cleaning up rivers and waterways.\"It's 2019, we should be able to clean up all of the waste that we produce.\"The European Union (EU) asked nations to grade rivers between poor, moderate, good and high. Governments should aim for rivers to be \"good\" - meaning relatively unaffected by human activity. \"High\" refers to upland streams in sparsely-populated areas.Under its Water Framework Directive the EU set a target for all rivers to be \"good\" by 2027 but exceptions were allowed if the cost of doing so would be too high.The UK government has aimed for 75% of rivers to be in good health \"as soon as is practicable\", according to its 25-year environment plan.As of the latest data available <https:\/\/environment.data.gov.uk\/catchment-planning\/> just 14% of rivers in England were in good health.By 2021 the Environment Agency currently predicts 19% of rivers to be \"good\", rising to almost 75% by 2027. But the WWF said this was \"very unlikely\" to be achieved without tougher regulation and work to restore rivers to a more natural state.This video can not be playedWho makes sure our tap water is clean?Dave Tickner, chief freshwater adviser at WWF, said: \"Our rivers are the lifeblood of the countryside - vital for wildlife and people, as well as our economy.\"As we prepare to leave the EU <https:\/\/www.bbc.co.uk\/news\/politics\/uk_leaves_the_eu>, the UK Government must fast-track flagship legislation to better protect and restore our waterways and invest in effective monitoring and enforcement to ensure water companies and agricultural industry can no longer use our rivers as open sewers.\"The Department for the Environment, Food and Rural Affairs (Defra) stressed it would \"not weaken any of our high environmental standards when we have left the EU\" and would look to enhance them further.The Environment Agency believes about 10,000 fish were killed by an agricultural waste spill in the River Mole in north Devon at the beginning of August.Roach and trout were among the fish that died when a chemical-based pollutant got into the river. <https:\/\/www.bbc.co.uk\/news\/uk-england-devon-49242485>While the agency said it took such incidents \"very seriously\" and was investigating, it has been accused of not doing enough to prevent such incidents from happening.Feargal Sharkey, former lead singer of The Undertones, said: \"Someone took their eye off the ball.\"Mr Sharkey, who is a fly fisherman and chairman of Amwell Magna Fishery in Hertfordshire, campaigns for better management of rivers. He said it was \"outrageous and abominable\" that 86% of rivers in England were not in good health.The Environment Agency said its teams \"urgently investigated\" the cause of pollution on the River Mole and \"prevented further pollutant from entering the stream, as well as restoring oxygen levels to protect wildlife\".It tweeted to say it believed the the incident, reported on 2 August, to be \"the largest ever fish kill in Devon and Cornwall\". A few days later 3,000 trout and bullheads died as a result of pollutionin the River Sheppey in Somerset <https:\/\/www.bbc.co.uk\/news\/uk-england-somerset-49233118>.Just 3% of rivers in the Thames basin district, which stretches from the Cotswolds and Northamptonshire through London to Kent and Hampshire, were in good health at the last reported check.Solway Tweed, which covers parts of Cumbria, Northumberland and the Scottish borders, has the largest proportion of good rivers, 43%, and is currently predicted to be 99% good by 2027.The data also covered parts of Wales where rivers crossed the English border.Just 10% of river water in the Dee basin district, which runs from Snowdonia in Wales to Chester, was good in 2016 but this is predicted to be 50% by 2027.The data does not cover the rest of Wales and Scotland or Northern Ireland, which have their own devolved environment bodies.We asked for your questions about this story and these are some of the things you wanted to know:If I am concerned about my local river, who do I contact?For rivers in England, the Environment Agency has an incident hotline <https:\/\/www.gov.uk\/report-an-environmental-incident> for people who want to report pollution to water as well as blocked rivers, flooding or dead fish. The 24-hour number is 0800 80 70 60.People in the rest of the UK can contact Natural Resources Wales <http:\/\/naturalresources.wales\/about-us\/contact-us\/report-an-incident\/?lang=en>, theScottish Environment Protection Agency  <https:\/\/www.mygov.scot\/report-environmental-incident\/>and the Northern Ireland Environment Agency <https:\/\/www.nidirect.gov.uk\/articles\/report-polluted-land-and-water>. How do I know whether my local river is clean enough to swim in?The Environment Agency only provides ratings on designated bathing waters <https:\/\/environment.data.gov.uk\/bwq\/profiles\/>, usually the sea or lakes.It does not make a judgement on whether rivers are clean enough for swimming, only whether they are good, moderate or poor for wildlife.How can we make a difference?There are various charities working to look after rivers. The South East Rivers Trust <https:\/\/www.southeastriverstrust.org\/get-involved\/522-2\/>, for example, says it uses volunteers to help with \"river restoration and cleanups to pollution busting and river monitoring\".The Rivers Trust <https:\/\/www.theriverstrust.org\/get-involved\/volunteer-with-us\/> has volunteers to \"plant trees, litter pick, remove invasive species or test the water quality\" of rivers.Water companies have been told their efforts to protect the environment are \"simply unacceptable\". <https:\/\/www.bbc.co.uk\/news\/uk-england-48934421>The Environment Agency recorded 1,623 sewerage pollution incidents in England in 2018, four fewer than the year before.These were cases in which water companies discharged raw sewage into the environment, something they should only do during extreme rainfall.Southern Water was  hit with a record £126m punishment <https:\/\/www.bbc.co.uk\/news\/business-48755329> for spills from its sewage plants and misreporting its performance.In July Thames Water was fined £607,000 <https:\/\/www.bbc.co.uk\/news\/uk-england-berkshire-48948413> for two incidents that saw millions of litres of raw sewage released in Maidenhead in 2014.Dr Singer said there needed to be \"zero tolerance\" of sewage pollution and a programme of \"habitat restoration\" to make rivers fit for different types of wildlife again.\"By conceding that 25% of rivers will not meet good ecological status the government is recognising some rivers have deteriorated so far that they need this kind of work to have a chance of getting there.\"I'm not aware of any implementation plan to achieve that 75% good status. If they could do it in such a short space of time, why not do it now?\"A spokesman for the Environment Agency said it would look at \"what can realistically be achieved by 2027 as part of the work to update the river basin managements to be published in 2021\".He said water quality was now \"better than at any time since the industrial revolution\" and the agency was \"taking robust enforcement action against those who pollute our waters\".A spokesman for the water companies' trade association, Water UK, said: \"Water companies have spent around £25bn on environmental work since 1995 - action which has improved around 10,000 miles of rivers. It means wildlife is flourishing again, whereas 30 years ago Britain was known as 'the dirty man of Europe' due to badly polluted rivers.\"He said the industry would spend another £5bn between 2020 and 2025 on environmental improvements."}