{"author":"By Ben Morris","title":"Dolphins seen in Bronx River for first time in five years","news_category":"general","content":"Dolphins are back in the Bronx River in New York for the first time in more than five years.Though they were recently seen in the city's East River, it is the first time the animals have been spotted in the Bronx River since 2017.Authorities keep the river stocked with a plentiful supply of fish, which they believe may have drawn the dolphins in.The city's Department of Parks and Recreation posted a video on Twitter, taken by someone who saw the dolphins.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.However, the joyous reception of the mammals' arrival came with a warning. \"Make sure that they're comfortable during their visit by giving them space and not disturbing them,\" wrote the department.The Bronx River flows through Bronx borough, just north of Manhattan, and is the only freshwater river in the city.The sightings were also confirmed by the Bronx River Alliance, a non-profit that works to protect and restore the waterway.\"There seems to be more dolphin pods swimming near NY Harbor!\" it wrote on social media. \"We are not sure why but authorities are further investigating their presence and we will keep you updated as we get more info.\"Pollution and habitat destruction have caused numbers of bottlenose dolphins, which are found off both the Atlantic and Pacific coastlines, to drop. Some are also injured by fishing nets and die.As a consequence, they are protected throughout the United States under the Marine Mammal Protection Act, which makes it illegal to feed or harass them.Dolphins are one of the most intelligent animals on the planet. The US military uses them to locate underwater mines and identify enemy military personnel."}