{"author":"","title":"One Direction: Sorry fans, there's another sign the band might not reform","news_category":"general","content":"Fans of One Direction were hoping to one day see the band back together, but it's now looking more unlikely than ever.Despite insisting that it wasn't breaking up for good, the group has now dissolved its touring company.Rollcall Touring Ltd, the company which the band set up in 2012, has been wound up, according to Companies House.Niall Horan, Liam Payne, Harry Styles and Louis Tomlinson were listed as its directors.It's three years since the group announced they'd be taking a break.Hearts broke around the world, but the band insisted they weren't breaking up. They boys have all since enjoyed solo success.Speaking in 2015 <http:\/\/www.bbc.co.uk\/newsbeat\/article\/34803109\/one-direction-were-all-going-to-take-a-break-but-were-going-to-come-back>, Liam said it would be nice to have time to write songs without the pressure of touring and travelling around the world.\"Obviously we're all going to take a break for a bit first and then consider where we are in the world,\" Liam said. \"Then I just want to write songs. That's been the most fun process out of this, except for touring, the writing of the songs.\"We're going to come back, so there's something to write for as well, for us and for other people.\"Rollcall Touring Ltd is the company which the band used to manage its touring. It saw the group play shows across more than 20 countries.It was set up back in 2012, two years after the boys finished in third place on the X Factor.After Zayn left the band in 2015, he went on to resign as a company director. While the news may come as a shock to fans, it's something that's been planned for a while.In October 2017 both Harry and Liam signed an application to strike the company off the Companies House register.Listen to Newsbeat live <http:\/\/www.bbc.co.uk\/radio\/player\/bbc_radio_one> at 12:45 and 17:45 every weekday on BBC Radio 1 and 1Xtra - if you miss us you can listen backhere <http:\/\/www.bbc.co.uk\/programmes\/b006wkry\/episodes\/player>"}