{"author":"By Catherine Evans and Karl Necke","title":"House prices in Wales rising highest, says Rightmove","news_category":"general","content":"Wales has seen the biggest increase in house prices in the UK, according to property website Rightmove.It said there had been a 2.3% rise in the past month alone and a 10.9% increase year-on-year.Meanwhile, the Principality Building Society reported that average price in Wales hit a new peak of £215,810 earlier this year.Torfaen and Bridgend saw the highest sale rate at 80%.Prices in eight authorities - Blaenau Gwent, Bridgend, Conwy, Merthyr Tydfil, Neath Port Talbot, Rhondda Cynon Taf, Vale of Glamorgan and Torfaen - reached new peaks in the second quarter of 2021, according to Principality.Those at the top rung of the property ladder bucked the trend, according to statistics from Rightmove, with an average asking price of £452,370 in August - a monthly increase of 3.1%, and a yearly increase of 18%.First-time buyers able to scrabble together a hefty deposit faced paying an average of £162,197 this month, 5.4% more than in August 2020.Buyers looking to move up the ladder to buy their second property - known in the industry as \"second-steppers\" - saw the average asking price rise by 10% to £224,470 in the same period.There are signs the strong pace of increases seen around the turn of the year are beginning to slow, said Principality, with only a modest increase across the quarter of 1.4%.This is likely a result of the Land Transaction Tax <https:\/\/www.bbc.co.uk\/news\/uk-wales-57665291> (LTT) ending in June, said the building society.But those looking for their next move are concerned about rising prices.Hayley Spencer-Edwards, who lives in Kenfig Hill, Bridgend county, with her husband Dave and their two children, said: \"As a homeowner in Bridgend, I was surprised to see the increase in prices in my local area.\"My husband and I had to move out of our home town to buy an affordable house. The dream of bringing up my children in the town we both grew up seems to keep being pushed further and further out of reach.\"The rate of sales across Wales has also soared this year, at 74% compared to 62% in 2020 and a UK national average selling rate of 68%.Estate agent director Jeanne Fry-Thomas said: \"Wales has always been perceived as a more affordable area and that has drawn in people who are selling much higher-priced properties outside the area.\"This in turn ends in a supply and demand situation and prices go up.\"In terms of Torfaen and Bridgend being the fastest-selling areas, she said: \"Both of those areas have good road links.\"Torfaen is benefiting from people who can't purchase in Newport because of a shortage of houses there - Newport and that part of the M4 corridor.The bridge tolls going <https:\/\/www.bbc.co.uk\/news\/uk-wales-46539184> started pushing up prices before Covid.\"Buyer James Burnett, 30, from Blackwood, Caerphilly county, said the days of putting in a \"cheeky offer\" were way behind.\"I'm looking in Torfaen, Caerphilly, Newport. Prices are ridiculous,\" he said. \"It's very difficult to find properties, they're snapped up, asking price or over.\"It's fierce, a lot of competition. I viewed one on Monday and there were nine others viewing it.\"You've got to get in there first. You've got to make good offers on the spot. You can't go in with a cheeky offer, them days are gone.\"Amid an increase in homeowners looking for larger and more rural properties following a series of lockdowns during the Covid pandemic, Rightmove also reported changes in the nature of inquiries from prospective buyers.\"To look pre-pandemic versus what has happened since the market reopened we have looked at July 2019-June 2020 versus July 2020-June 2021,\" said Rightmove in its report.It added that there had been a significant increase in city-based house-hunters making inquiries about village properties by 124%, and seaside properties by 115%.Rightmove's director of property data Tim Bannister said: \"This month's data shows how the property market in Wales remains robust, seeing the largest monthly and yearly increase in average asking prices for property.\"This is driven by many factors - including the rise in the number of city buyers inquiring for homes in villages or near the coast, compared to before the pandemic, in the search for sea and space.\"He added that Saundersfoot and Tenby in Pembrokeshire were among the most popular seaside locations.\"Wales is filled with beautiful and varied locations to live, and with working from home now a longer-term option for many, this has opened new doors for buyers,\" he said.Carmen Jackson, family support lead at HomeStart Cymru, said: \"In areas such as Monmouth and Torfaen, the huge rise in prices is putting the opportunity to buy beyond the reach of many working families.\"More families are housing insecure and rents are increasing when wages aren't.\""}