{"author":"By Kevin Peachey","title":"Cost of living: What payments are available and how do you claim?","news_category":"general","content":"Some groups will be eligible for payments worth hundreds of pounds to help with their energy bills and other costs, starting in April.Low-income households, pensioners and some disabled people will receive additional cost-of-living payments, as the scheme from last year is extended.However, a winter discount on everyone's energy bill is now over.Some groups will receive payments to help with higher bills, including:The first instalment of £301 for those on means-tested benefits will be made between 25 April and 17 May.The payment, in three instalments, is available to households who receive the following benefits:The payment reference on a recipient's bank account will be their national insurance number, followed by \"DWP COLP\".The 1.1 million people who receive only tax credits, rather than any of the other benefits, will be paid slightly later than others.People are not eligible for these payments if they receive New Style Employment and Support Allowance, contributory Employment and Support Allowance, or New Style Jobseeker's Allowance - unless they get Universal Credit.Anyone who thinks they should have received the help but did not should contact the office that pays their benefit or tax credits, orreport it here <https:\/\/secure.dwp.gov.uk\/report-a-missing-cost-of-living-payment\/welcome>.To qualify for the next instalment, people had to have claimed a benefits payment between 26 January and 25 February 2023, or received a payment for an assessment period ending between these dates. Pensioner households may be able to have a new pension credit claim backdated.An estimated 850,000 pensioner households do not claim pension credit <https:\/\/www.bbc.co.uk\/news\/business-61797309>, which is a gateway to these extra payments.Other eligibility details are outlined here <https:\/\/www.gov.uk\/guidance\/cost-of-living-payments-2023-to-2024>. None of these cost-of-living payments affect the tax you pay, or the benefits or tax credits you receive.Two payments totalling £650 have been made to more than eight million low-income households.The first instalment of £326 was paid between 14 and 31 July. The second instalment of £324 should have reached those eligible by the end of December.Payments of £300 were also paid to pensioners during the winter just gone, and a £150 payment was also made last year to those with disabilities.Some people would have received all of those payments, if they were eligible.Everyone's energy bill was cut by at least £400 <https:\/\/www.bbc.co.uk\/news\/business-61583651> during winter.This was applied over six months, with a £66 reduction in October and November, and a £67 discount every month between December and March.The discount was made automatically by energy suppliers in England, Scotland and Wales. However, there are no plans so far for this to be repeated next winter.Separate arrangements were made for households in Northern Ireland, which has its own energy market <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-64024396>. They are receiving a single payment of £600 starting in January, which is higher than the rest of the UK because a higher proportion of households use heating oil.Direct debit customers in Northern Ireland are having the money paid into their bank accounts. Other customers will be sent a voucher.Up to six million people on the following disability benefits will receive another £150 later in the year:Households that receive the Winter Fuel Payment - which is worth £200-£300 and is paid to nearly all homes with at least one person of pension age - should have received an extra £300 in November or December.That should cover nearly all pensioners across the UK. Another additional cost-of-living payment of £300 will be made next winter,Lower-income pensioners who claim pension credit receive the money in addition to the £650 support for those on benefits.This means a small group of pensioners with disabilities have already received a total of £1,500, with more to come.A £150 rebate, often through people's council tax bill, was made last year.The payment method depended on whether you pay your council tax by direct debit and where you live in the UK.Some people were given fuel vouchers through the Household Support Fund, which is distributed by local councils.The government launched an Energy Price Guarantee <https:\/\/www.bbc.co.uk\/news\/business-63283436> in October 2022, which limits a typical duel-fuel household's annual energy bill to £2,500.It is not a cap on how much customers actually pay - your bill depends on how much energy you actually use.The scheme was initially designed to last for two years, but was then reduced to six months.However, the government has now confirmed the guarantee will continue until July.The plan applies to all households in England, Scotland and Wales, but in Northern Ireland a typical bill is lower.The government also announced a scheme to cut energy bills for businesses, which ends at the end of March.Heavy energy-using sectors, like glass, ceramics and steelmakers, received a larger discount than others.How is the rising cost of living affecting you? Please get in touch by emailing:haveyoursay@bbc.co.uk <mailto:haveyoursay@bbc.co.uk?subject=Energy61592496>.Please include a contact number if you are willing to speak to a BBC journalist. You can also get in touch in the following ways:If you are reading this page and can't see the form you can email us at HaveYourSay@bbc.co.uk <mailto:Haveyoursay@bbc.co.uk>. Please include your name, age and location with any submission."}