{"author":"","title":"Covid: More public cash to help Cardiff Airport cope with pandemic","news_category":"general","content":"The Welsh government is giving tens of millions of pounds more to Cardiff Airport, including writing off debts.Covid-19 has had a \"catastrophic\" impact on the airport which is wholly-owned by the Welsh government, Economy Minister Ken Skates said.He said £42.6m of debt would be written off, with a grant of another £42.6m of public money being offered.The equity held by the taxpayer in the airport is also being written down by another £43m.This is to reflect the decline in its value since the pandemic began.Welsh Secretary Simon Hart criticised the decision, questioning whether it was value for money.The Welsh government bought the airport for £52m in 2013 <https:\/\/www.bbc.co.uk\/news\/uk-wales-21952079>.Welsh Conservative economy spokesman Russell George said the \"balance of support - including the writing off of millions of pounds of taxpayers cash already invested by Labour ministers before the pandemic even hit - will be rightly questioned when thousands of small businesses in Wales are crying out for more help\".\"Small firms desperately need support to help protect jobs but Labour ministers only seem to be interested in bailing out their wholly-owned enterprise,\" he added.But Mr Skates said the cash would \"help sustain up to 5,200 indirect jobs retained from the economic activity of the firms on-site at the airport and from the firms in the wider supply chain.\"He said there had been no financial support from the UK government, and suggested that without Wednesday's decision the site could be closed.He also confirmed 60 staff members had been diverted to work in a Test-and-Trace call centre.The minister made the announcement in a written statement.Simon Hart told BBC Radio Wales: \"People look at these things and see is this providing value for money for the tax payer? It's huge sums of money.\"It has been critiqued for perhaps devoting quite so much attention to the future of Cardiff airport without explaining how the business is going to grow and develop, and how its going to expand so tax payers can get their value for money. I think that's a job for Welsh government to come up with.\""}