{"author":"By Iqra Farooq","title":"Humza Yousaf: Can new SNP leader represent South Asian Scots?","news_category":"general","content":"Humza Yousaf has made history as the first Muslim to lead a country in western Europe.As the new leader of the Scottish National Party (SNP), he's taken over from Nicola Sturgeon as the country's first minister.It makes him the first ethnic minority leader of a devolved government and the first Muslim to lead a major UK party.BBC Newsbeat went to one of Scotland's most diverse areas to see what people there think about the new leader.From the halal bakery to the Asian jewellers and colourful clothes shops, the Pollokshields area of Glasgow is full of South Asian influences.Humza says he's keen to support communities like this one, which is in his constituency and also faces problems with deprivation and poverty.So do people living in the area think having a leader from a South Asian background will help them?Ismail Ahmed, who we spoke to on Albert Drive - billed as one of the most diverse streets in Scotland - thinks so.\"As a South Asian myself I think it's a pretty good thing our community is being represented,\" the 20-year-old says.\"I feel like Pakistanis, or even just South Asians in general, don't really have a big representation.\"And now that the first minister, the person that's controlling the country, is a South Asian, it just shows that there'll be more representation.\"Humza was widely seen as being the preferred candidate of the SNP establishment - including Nicola Sturgeon herself.\"I'm Pakistani South Asian. So I feel like he's more relatable than Nicola Sturgeon was,\" Ismail tells Newsbeat.\"I feel like she was doing a pretty good job. So if he's able to continue and maintain what she was doing, I think that's good enough.\"Nadia Anwar owns a clothes shop on the street and thinks Humza being the new leader could be massive for giving the community the confidence to speak up.\"There's a lot of things that need to get done. I feel the Asian community will be more forward speaking to somebody that is of ethnic minority, because sometimes our voice doesn't really get heard,\" she says.\"There's some people that are from Pakistan, from India, from Bangladesh, and they don't have anybody to actually call up to and say 'look this is my problem'.\"Because he's from that same kind of cultural background I feel as though he'll be able to understand more.\"He might not necessarily be able to help them, but then it's a good way of the Asian community being involved in politics.\"Because that's another thing as well, there's not a lot of ethnic minority people within the political environment. And I feel that that will be a good thing.\"Humza's dad is originally from Pakistan and emigrated to Scotland with his family in the 1960s, while his mother was born into a South Asian family in Kenya.He's often spoken of the racist abuse he has received and called the police after allegedly receiving threats at the start of the leadership contest.Talha Moqsud, 31, hopes having a Muslim leader will help the community deal with racism and discrimination.\"I think it's very important for us as Muslims, it gives us a little bit more hope,\" he says.\"Just hopefully [he] could bring in more opportunities for us. And get rid of any kind of discrimination [and] racism that still kicks about.\"Another person on Albert Drive was 18-year-old Zirva.She agrees with Nadia about their new leader being able to represent their community at the top table of Scottish politics.\"It's definitely good to have representation,\" she says. \"Obviously in the Western world, it's hard to see somebody that looks like you and has the same kind of beliefs to make up there so it's quite good.\"So now he's officially the new leader, can Humza deal with all of the issues in Scotland at the moment <https:\/\/www.bbc.co.uk\/news\/uk-scotland-65086105>?\"I'll be honest with you, I don't know,\" Nadia says.\"I hope he does well, I'll have every faith in him but we'll see.\"Follow Newsbeat on Twitter <https:\/\/twitter.com\/BBCNewsbeat> and YouTube <https:\/\/www.youtube.com\/channel\/UCe1Ef-K5jpnRsmVY5hCBhOw>.Listen to Newsbeat live <https:\/\/www.bbc.co.uk\/sounds\/play\/live:bbc_radio_one> at 12:45 and 17:45 weekdays - or listen backhere <http:\/\/www.bbc.co.uk\/programmes\/b006wkry\/episodes\/player>."}