{"author":"By Nada Tawfik","title":"Ron DeSantis: How the Republican governor conquered Florida","news_category":"general","content":"No longer can Florida be referred to as a swing state, so complete was the Republican victory there in the US congressional elections. This success was led by one man, a new star of the right. How did Ron DeSantis do it?He may be focused on tropical storm Nicole which made landfall as a rare November hurricane. But make no mistake, Florida Governor Ron DeSantis is also preparing for a political disturbance brewing in the Sunshine State.His historic win has put him on a direct collision course with former president and Florida resident, Donald Trump - they are both expected to run for president in 2024.But for now he can enjoy being the undisputed star of the Republican Party in the midterm elections.The only massive \"red wave\" that materialised was in Florida. Republicans won by astounding margins in all the key races and Republicans also flipped four House seats that were held by Democrats, a result helped by the fact that Governor DeSantis had pushed through a new congressional map that favoured his party.It was DeSantis himself who had the best night, winning by a landslide of more than a million and a half votes, the largest margin of any Florida governor in 40 years.Speaking to voters in Miami, the name Ron DeSantis evokes strong passions. But one message comes across again and again by those who support him - they began liking him during the pandemic when he rejected lockdowns, vaccine requirements and mask mandates in the name of personal freedoms.Kaitlin Cope, who is 30 years old, moved to Florida during the pandemic from New York. \"Florida and Miami are an open and free city and state,\" she said. Andre Ferraz Rocha, a longtime business owner, also credits DeSantis for his and his friends' ability to \"keep operating and making money\".Others backed him because they feel his party is the better of the two options. John Sanchez said Latinos are \"tired of having received promises never fulfilled by the Democratic Party\" and that the Republican Party stands for what they believe - family, faith and the economy.The Democrats tried to paint DeSantis as another Trump but for those who watch Florida politics closely, the two men have different appeals.Trump rallies \"the forgotten voters\" and inspires them to come out and vote, says Richard DeNapoli, a Republican state committeeman in Broward county who has worked with both of them.In contrast, DeSantis is very strong on policy, he believes. \"He gets into the nitty gritty, he passes legislation here in Florida that lots of people didn't think could pass in the past until he came along.\"Florida pollster Brad Coker of of independent firm Mason-Dixon says Mr DeSantis earned a considerable bump in popularity from Hurricane Ian in September.\"I think people gave him a lot of credit for the way he handled the hurricane. He stood shoulder to shoulder with Biden, didn't turn it into a political game, he played governor the way he was supposed to. I think some Democrats may have peeled off after that.\"But for voters like Deborah Klein, DeSantis is a polarising figure. She moved to Florida a little over a year ago and accuses him of \"spewing hate\" and acting in his own interests rather than Florida's.During the last two years, DeSantis relished making national headlines by banning any teaching of sexual identity in schools before fourth grade, outlawing abortion after 15 weeks without exceptions for rape or incest, and organising migrant flights to Democratic states.It helped bolster his image as a \"fighter\" against \"the woke liberal agenda,\" as he constantly reminds his supporters.This video can not be playedWatch: Five things to know about Ron DeSantisHis opponent, Democrat Charlie Crist, tried to rally Democrats against him during the campaign by declaring DeSantis \"the most dangerous and extreme candidate\" but in the end, he only won five out of Florida's 67 counties.Democrats did not make any inroads in Republican areas, turnout among their base was low, and many independents who backed Biden in 2020 this time went for DeSantis.\"Crist was just outmatched from a political standpoint,\" says pollster Brad Coker. DeSantis outspent him, he says, and Crist was simply a weaker candidate.DeSantis outperformed Trump's 2020 figures in key groups that Democrats will need to hold onto the White House. He made gains with Latinos, women and even slightly with black voters, which allowed him to flip counties that traditionally favour Democrats such as Palm Beach, Osceola and of course Miami Dade.He was the first Republican governor since 2002 to win the state's most populous and heavily Hispanic county - not only with Cuban Americans who traditionally lean Republican but also many South Americans and Puerto Ricans who tend to vote Democratic.Joe Biden won the Latino vote in Florida by seven points in 2020 and now DeSantis has carried it by 15 points. These results will shape Florida's politics for years to come. In his victory speech, the governor declared that they had \"rewritten the political map\".There is no question that Florida is now a Republican state, ending its status as one of the most important swing states in the nation.The day after results night, the front page of the New York Post, once Donald Trump's favourite newspaper, declared DeSantis \"DeFuture.\"Myra Adams, a conservative commentator and columnist for The Hill based in Florida, says DeSantis is ready to fight for the party's nomination for president because he believes he is the future of the party. \"The joke is DeSantis is Trump without the baggage or Trump without the crazy or Trump without the pending indictment.\"Some of his supporters in Miami agree. \"I would take him [DeSantis] over Donald Trump, I think Donald Trump ran his course and he's done,\" says business owner Andre Ferraz Rocha.Donors have also begun seriously betting on DeSantis, who raised more than $200m this cycle, more than Donald Trump since he left office.Voters across the US who didn't know Ron DeSantis before the midterms will be hearing a lot more about him now.Additional reporting by Holly Honderich"}