{"author":"By Tomos Morgan and Beth Edwards","title":"Covid: Social workers fear a 'generation of traumatised children'","news_category":"general","content":"A whole generation of children may have been left \"traumatised\" during the pandemic, social workers have warned.They say a 20% fall in child protection orders in Wales, a figure found by a BBC probe, paints a false picture.Charities and unions fear many of the most vulnerable children across the UK have slipped under the radar because of lockdown restrictions.And there is concern social care services will face an influx of referrals as those restrictions ease.A decline in the number of child protection orders - the mechanism used to place someone in local authority care - would normally be viewed as a positive.But with schools, youth workers and social workers unable to keep a close eye on the most vulnerable due to Covid restrictions, that decline could be masking the true figure.\"The opportunities to identify where problems existed at an early stage have been absent during the pandemic,\" said Alison Hulmes, director of the professional association for social workers in Wales, BASW Cymru.\"All the time that we're not identifying support that young people need, they're being damaged.\"There's potentially a whole generation of children and young people who are being traumatised, not being safeguarded, and that's simply not acceptable.\"There are also mounting fears for the future - and whether there will be enough resources and staff to deal with the anticipated rise in referrals.Ms Hulmes said: \"We're expecting those figures to shoot up, [so] we're really concerned about the impact on the profession of an inevitable increase.\"While being taken into care is a last resort for local authorities, for those who need the help it can be a lifeline - people like Emma, from Essex.\"I was severely abused by my parents, emotionally, physically… and then I was sexually abused by my father from a really young age, from six,\" she said.\"I had my hair shaved twice, I had flea bites, bruises all over me. I think it was obvious I was being abused.\"I was punched by one of my parents in front of the social worker, and was removed that way. It was only supposed to be two weeks but then my mum said she didn't want me back.\"Now aged 31, she said being taken away from her abusive environment was the right - and only - option for her.\"I went into a children's home and, on the whole, it was quite good being around children that had been through similar experiences,\" she said.\"It gave me some sort of rules and boundaries, which was probably what I needed. It was good.\"According to figures seen by the BBC, last year in Wales there were 1,120 care orders made by its 22 local authorities between March 2020 and January 2021.That is down from 1,400 the previous year.Christopher Dunn, from Voices for Care Cymru, said the findings were not a surprise.\"We know a high percentage of safeguarding referrals come from education and health settings, and you know those young people weren't visible to those sort of protective adults during lockdowns for very understandable reasons,\" he said.\"You tend to really only understand a story when you directly meet a young person in a safe environment and virtually you just can't get that connection as you can face to face.\"Tayler, from west Wales, said she would not have gone to university if she had not been through the care system from the age of four, along with her sister.\"It's such a shame that some people will have been missed but they don't know any different,\" she said.\"They think what they're going through is OK and that's the worrying thing. That's what's concerning, it's because they don't know what they're going through is neglect or abuse or anything like that.\"The Welsh Local Government Association said it was clear the real impact of coronavirus on children and children's services was \"yet to come\".\"Councils are very concerned about the impact of the Covid-19 pandemic on vulnerable children… and are increasingly highlighting concerns about demands that will be placed on services as lockdown measures are eased,\" said one association official.The body said it was continuing to press the Welsh government to ensure funding was in place \"to meet both the increasing demand and pressures in the short term as well as long term\".Ms Hulmes said there needed to be a \"clear route map\" out of lockdown, with guidance on personal protective equipment, to allow social workers to get into homes \"and undertake direct work\".The Welsh government said the pandemic had brought additional complexities to social work and \"this will have a future impact\".It said it was working with councils and partners to \"overcome these challenges\".The UK government said it recognised the \"tireless\" work of social workers during the pandemic.It said it had given councils in England £4.6bn \"to help them meet additional demands\" and was working alongside unions and the sector.The Scottish department of health and social care said social workers would have an important role to play as Scotland recovered from the pandemic.It said: \"Workforce planning is underway to ensure that the workforce of the future is recruited, trained and supported to fulfil this role.\"The Northern Ireland Executive said all health and social care trusts had rebuilding plans in place for the resumption of services affected by the pandemic.A spokesperson said: \"The Department of Health has recently invested in an additional 15 places on the OU [Open University] degree in social work programme in recognition of the rising demands on the profession.\""}