{"author":"By Robert Greenall","title":"Sanna Marin: Finland prime minister who loves to party","news_category":"general","content":"In more than two years as Finnish Prime Minister, Sanna Marin has frequently been a target of criticism for her apparent love of partying.But things came to a head when a video of her at a party singing, dancing and drinking circulated on social media and she was forced to deny that she had taken drugs.She later took a drugs test \"to clear up any doubts\" <https:\/\/www.bbc.co.uk\/news\/world-europe-62608831>, when further footage of the event showed her dancing with a Finnish popstar.Ms Marin makes no secret of her social life, and has often been photographed at music festivals. German news outlet Bild has dubbed her \"the coolest prime minister in the world\".But her tenure as leader has come at a difficult time for Finland, first with Covid-19 and then with neighbouring Russia's invasion of Ukraine.Ms Marin had been a rising star on Finland's political scene when she was catapulted to power in December 2019.At 34, she became the world's youngest serving prime minister, and her country's youngest ever.She headed a ground-breaking centre-left coalition which included four other female party leaders, only one of whom was over 35.Sanna Marin comes from a modest background.Her parents split up when she was very young, and in her early years her mother raised her alone. The family faced financial problems.In a blog, Ms Marin describes how she got a job in a bakery at 15 and distributed magazines for pocket money during high school <https:\/\/www.sannamarin.net\/blogi\/2016\/11\/17\/13947\/?page2>.In an interview for the Menaiset website (in Finnish) in 2015 she spoke about the stigma she encountered when her mother was in a same-sex relationship. She said thatshe felt \"invisible\" because she was unable to talk openly about her family <https:\/\/www.menaiset.fi\/artikkeli\/ajankohtaista\/ihmiset\/sateenkaariperheessa_kasvanut_sanna_marin_sateenkaariperheessa>.But her mother had always been supportive and made her believe she could do anything she wanted, she said.She was the first person in her family to finish high school and go to university.Ms Marin went into politics at the age of 20 and two years later was already running for a council seat in Tampere, a city north of Helsinki.She wasn't elected, but within just five years she had not just won a seat but become council leader, aged just 27.She rose quickly through the ranks of the Social Democrats (SDP), Finland's main centre-left party, becoming an MP in 2015.She is seen as being a left-winger in the party, and a strong advocate of Finland's welfare state.Kristiina Tolkki, a political journalist from Finland's national broadcaster YLE, says her rise to the top was almost inevitable.\"I met her at a ladies' sauna night some years ago and asked her if she was going to be leader,\" she says. \"She just looked at me as if to say - are you even asking me this?\"As an MP she quickly caught the attention of party leader Antti Rinne, becoming his deputy and essentially his favourite.In winter 2018-19, Mr Rinne fell ill with pneumonia on holiday and was later diagnosed with coronary thrombosis, meaning he was out of action as his party geared up for an election campaign.This was a chance for Ms Marin, then still only a first-term MP, to shine. After several months with her at the helm, Mr Rinne returned from sick leave to lead his party to victory.Ms Marin was appointed transport and communications minister in the new government, but it didn't take long for the clouds to gather.A row over the prime minister's handling of a postal strike led to his resignation within months of taking office.Ms Marin narrowly won a party vote to replace him.The mother of a toddler, she dismissed questions about her suitability for the job.\"I have never thought about my age or gender. I think of the reasons I got into politics and those things for which we have won the trust of the electorate,\" she told reporters after being chosen for prime minister.Almost immediately, she faced the onset of Covid-19. Finland fared better than most of its European allies, recording about 196,000 cases and 1,384 deaths in the first 21 months of the pandemic.But this relative success story was not without its pitfalls for Ms Marin.In December 2021 she was forced to apologise for going clubbing after close contact with her foreign minister, who had tested positive for Covid. <https:\/\/www.bbc.co.uk\/news\/world-europe-59577371>And she has since come under fire for holding parties at her official residence.This video can not be playedWatch: Demands unjust but I've done drug test - Finland PMThe latest revelations about her social life has led to criticism that she is behaving inappropriately for a prime minister - and whether she would be able to use sound judgement in the event of a sudden crisis.Her premiership has also coincided with Russia's invasion of Ukraine, and with Finland's decision - along with Sweden - to apply for Nato membership. Finland shares a long land border with Russia.Ms Marin has always maintained that her judgement has not been impaired by her behaviour, and her supporters defend her right to enjoy a social life with friends.Ms Marin is Finland's third female prime minister. The first, Anneli Jaatteenmaki, lasted barely more than two months in 2003 and the second, Mari Kiviniemi, was only in power for a year (2010-11)."}