{"author":"","title":"Minister Alun Davies says councillors 'like Oliver Twist'","news_category":"general","content":"Carwyn Jones should consider sacking Local Government Secretary Alun Davies after he compared councillors to Oliver Twist, council leaders have said.Mr Davies told a BBC radio debate that councillors should stop \"complaining\", prompting an angry response from the Welsh Local Government Association.His remarks follow calls for more council cash ahead of planned real-terms cuts <https:\/\/www.bbc.co.uk\/news\/uk-wales-politics-45789564> to local authority budgets.Plaid Cymru said Mr Davies' remarks were in \"poor taste\".Mr Davies said: \"I've had a lot of councillors coming to me like Oliver Twists over the past few weeks - 'Can we have some more?'\".Speaking on BBC Radio Cymru's Hawl i Holi <https:\/\/www.bbc.co.uk\/sounds\/play\/m0000tjw>, the minister said councillors agreed in private that the current system of 22 local authorities was unsustainable but were \"unwilling to say that publicly\".Charles Dickens' Oliver Twist is the story of an orphan boy born in a workhouse.Oliver asks \"please Sir, I want some more\" after he draws lots with other hungry boys, with the loser asking for more gruel.The local government secretary told the programme: \"Wales doesn't need 22 local authorities\".\"I want to see change and I want this change to come from councils,\" he said.\"I've spoken to them privately many times where they've agreed that the current system is unsustainable, yet they're unwilling to say that publicly,\" Mr Davies said.\"I've had enough of that and it has to change, so what I want to hear from councillors is no complaining.\"The minister said councils in England had suffered larger cuts and would soon lose central government funding altogether.Mr Davies said in the summer that councils would not be forced to merge, withdrawing proposals that had put the idea back on the table.Labour's Rob Stewart, Swansea council leader and one of the Welsh Local Government Association's two deputy leaders, said the first minister should \"distance himself from the comments of the cabinet secretary and consider whether or not it is appropriate for him to remain in the cabinet in his current position.\"\"The cabinet secretary's reference to Oliver Twist reflects a lack of understanding of both English literature and local government,\" Mr Stewart said.\"Is he seriously characterising himself as the 'Mr Bumble' of Welsh Government - the cruel overseer of the poorhouse?\"We make no apologies for asking for more resources from Welsh Government to save those services provided by hardworking teachers, youth workers, librarians and care workers that protect the communities of Wales.\"Dai Lloyd, local government spokesman for Plaid Cymru, called for Mr Davies to apologise.He said: \"Comparing councillors to Oliver Twist - the starving orphan boy begging for gruel, is in incredibly poor taste and ironically makes himself look like the villainous master in the story.\"The Welsh Conservatives' Mark Isherwood also compared the local government secretary to \"Mr Bumble\".\"Yet again the cabinet secretary puts himself in direct conflict with councils, and all he can do is patronise them,\" he said.Plaid Cymru has called for an \"urgent\" meeting with finance secretary Mark Drakeford to discuss the Welsh Government budget and their concerns about council funding.The party is in the second year of a two year budget deal with Labour.\"Councils are facing a situation where they will simply not be able to provide essential services to the public,\" said Plaid AM Rhun ap Iorwerth.\"This is not acceptable. I want a rethink, and for an assurance that increasing council funding will be a priority for Welsh Government should new finances become available in the forthcoming UK budget.\"Councils have been told by the Welsh Government that they will be a \"top priority\" if Wales gets in Chancellor Philip Hammond's announcement next Monday.The Welsh Government declined to respond to criticism of Mr Davies.A spokeswoman said: \"We have worked hard to offer local government the best settlement possible in this ninth year of austerity and have made further allocations to mitigate most of the reduction councils had been expecting following the final budget last year.\""}