{"author":"","title":"Birmingham Commonwealth Games: Baton relay will cover 90,000 miles","news_category":"general","content":"The Commonwealth Games baton is due to cover about 90,000 miles across the globe ahead of next year's event in Birmingham, organisers have announced.The journey is due to begin on 7 October and last for 269 days.About 7,500 \"baton bearers\" will carry it through 72 Commonwealth nations and territories, starting with the Queen at Buckingham Palace.The final carrier will return the baton to the Queen at the Games' opening ceremony in July 2022.It is scheduled to begin its journey in Cyprus, spending Christmas Eve in the Seychelles, new year in the Maldives and Easter weekend in Jamaica.The president of the Commonwealth Games Federation, Dame Louise Martin, said the baton relay was \"one of the most special aspects of the Commonwealth Games\".She said: \"It so vividly symbolises the friendship, respect and unity across our 72 nations and territories.\"I know that communities across the Commonwealth will be so excited to see the baton as it passes through their own villages, towns and cities.\"Organisers said planning a global trip during a pandemic had been \"challenging\" and a number of contingency plans had been put in place.\"It's a very strange new world,\" Lisa Hampton, who is head of the relay, said. \"It was never an option for us not to do a Queen's baton relay.\"The pandemic gave us an opportunity to think about how we would do it differently.\"The Queen will write a message to the Commonwealth which will be placed inside the baton for its journey.It was designed and created in the West Midlands and features a platinum strand along its length to mark the Queen's Platinum Jubilee year in 2022.Designers Raymont Osman and creative technology organisation BOM (Birmingham Open Media) led the design of the baton and its interactive technologies.Artist Laura Nyahuye's organisation MAOKWO worked as part of the wider creative team, engaging young people through the design process.Laura said other than the platinum streak, it was designed with less precious metals which would wear along its journey.\"Authenticity and honesty was key to the making of this baton,\" she said. \"How is it going to show its honest journey? Not just by coming back and looking brand spanking new.\"The Coventry-based artist also wanted the materials to be relatable.\"The materials were driven by how do we relate? How will the baton relate to the Commonwealth countries, to the everyday human?\"I love using copper, plastics... in those materials there's a story, and as the baton goes around, the humans that interact with it - it's adding to the story.\"The baton also features technology including a 360-degree camera to record and transmit stories from across the Commonwealth, and atmospheric sensors to analyse each country's environmental conditions.A heart rate monitor will display the heartbeats of baton carriers, and LED lights will change colour when two people hold it together.\"The baton is the stunning result of art, traditional craftmanship and innovative technology, all designed and made right here in the West Midlands,\" the Games' chief creative officer, Martin Green, said.\"I can't wait to see it embark on its epic journey.\"The Games will take place across the West Midlands from 28 July to 8 August 2022.Follow BBC West Midlands on Facebook <https:\/\/www.facebook.com\/MidlandsBBC\/>, Twitter <https:\/\/twitter.com\/bbcmtd> and Instagram <https:\/\/www.instagram.com\/bbc_midlands\/?hl=en>. Send your story ideas to: newsonline.westmidlands@bbc.co.uk <mailto:newsonline.westmidlands@bbc.co.uk>"}