{"author":"By Chelsea Bailey","title":"Oscars class photo: 10 things we spotted","news_category":"general","content":"This year's Oscars \"class photo\" has been released - and as usual there are several eye-catching details.Film fanatics have welcomed the triumphant return of the Academy Awards' yearbook snapshot after a pandemic-induced hiatus.Here are some of the things we spotted from an annual tradition that has been described as\"endearingly awkward\" <https:\/\/www.vulture.com\/article\/oscars-luncheon-class-photo.html>. Everyone loves a good comeback story, but even the best screenwriter couldn't have written a better story arc for Brendan Fraser.After all but disappearing from the big screen in the mid-noughties, Fraser is the frontrunner for this year's Best Actor nomination for his portrayal of Charlie, in The Whale.Director Darren Aronofsky is said to have spent nearly a decade searching for the right actor to portray the reclusive English teacher who struggles with severe obesity and is desperate to reconnect with his estranged daughter.Critics lauded Fraser's emotional tour-de-force alongside co-stars Sadie Sink and Hong Chau, who is also nominated for Best Supporting Actress.In a parallel dimension, Daniel Kwan and Daniel Scheinert, the directing duo behind multiverse movie Everything Everywhere All at Once, are probably smiling in the yearbook photo. But in this version, they look bemused.Perhaps that's because their zany, martial arts opus has become this year's unlikely frontrunner.The film has won 11 nominations, including a historic best actress nod for Michelle Yeoh. She is the first Asian-identifying actress to be nominated in the category.A beaming Brendan Gleeson - the co-star alongside Colin Farrell in tragicomedy The Banshees of Inisherin - sums up why Irish eyes are smiling at the Oscars this year.Nearly a quarter of this year's actor nominees are Irish, according to the LA Times <https:\/\/www.latimes.com\/entertainment-arts\/awards\/story\/2023-02-07\/oscar-2023-nominations-fun-facts>, and The Quiet Girl is also Ireland's first nomination for an International Feature Film.In the past, awards shows have been criticised for seemingly nominating the same actors every year - Meryl Streep, for example, has been nominated 21 times.But not this year. Sixteen of the 20 actors nominated are would-be first-time winners,according to the LA Times. <https:\/\/www.latimes.com\/entertainment-arts\/awards\/story\/2023-02-07\/oscar-2023-nominations-fun-facts>That includes Austin Butler, who is nominated for his spot-on portrayal of Elvis Presley. Mere days after Butler took home the Golden Globe for Best Actor, Elvis's daughter, Lisa Marie, died suddenly. Butler said her passing has made thisawards season \"bittersweet\" <https:\/\/people.com\/movies\/austin-butler-details-his-immediate-connection-with-lisa-marie-presley-we-got-so-close-so-fast\/> and he hopes to win for both Presley and her family.Costume designers are among the unsung heroes of the film world, but who would Elvis be without his bedazzled jumpsuit or Queen Ramonda without her glorious crown?This year's nominated designers helped create characters who travelled the multiverse, fought for Wakanda and revelled in the decadence of early Hollywood.Costume designer Shirley Kurata is nominated for Everything Everywhere All at Once.It's not every day you see Mr Bean on the red carpet. Director Shaunak Sen decided to keep things casual in his class photo.His film All That Breathes is nominated for best documentary feature. The story follows two brothers in New Delhi who try to rescue black kites, majestic birds who are dying because of the crowded city's toxic skies.Sometimes, it feels like it's been 84 years since Avatar premiered (That's a Titanic\/James Cameron joke). But all that waiting appears to have paid off.Avatar: The Way of the Water is nominated for Best Picture, which is perhaps why its Julian Howarth (centre, dark shirt, grey blazer), who is also nominated for his sound design on the film, looks so chuffed.And while it's rare for a summer blockbuster to be nominated for Best Picture, two of the highest-grossing films of the year are up for the top honour: Avatar: The Way of the Water and Top Gun: Maverick.Speaking of Maverick, there's Tom Cruise with his signature dazzling grin. Apparently today's event was slightly delayed because everyone seemed to want their photo with the mega star. First-time nominee Ke Huy Quan was reportedly jumping with joy to get a selfie with Cruise.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Top Gun: Maverick has picked up six nominations, including Best Picture, Best Visual Effects and Best Film Editing. It's Cruise's first nominated film in 23 years.Tom Cruise and Angela Bassett also had a mini-Mission Impossible reunion. Bassett starred alongside Cruise in the sixth installment of the franchise: Mission Impossible: Fallout. Bassett is nominated for Best Supporting Actress for her portrayal of Queen Ramonda in Black Panther: Wakanda Forever.She is the first actor to be nominated for a Marvel film. Bassett was last nominated for Best Actress in the 1994 Tina Turner biopic, What's Love Got to Do With It.Although she's been acting since the late 70s, this year marks the first time Jamie Lee Curtis has been nominated for an Oscar. She admitted to Parade that she felt \"totally shocked\" to be nominated for Best Supporting Actress for her role as Deirdre Beaubeirdre in Everything Everywhere All at Once. \"I'm 64 years old. I've been an actor since I was 19,\" she told AP Entertainment. \"I made horror films and sold yogurt. I never thought I would hear my name at the Oscars.\"The 95th Academy Awards ceremony takes place on 12 March 2023 in Hollywood, Los Angeles."}