{"author":"","title":"Isle of Man 'not complacent' about climate change","news_category":"general","content":"This video can not be playedClimate change: How 1.5C could change the worldThe Isle of Man is \"not complacent\" about climate change but has to balance any measures against \"financial limitations\", a minister has said.The Manx government faced criticism on Monday for licensing part of its seabed for gas exploration <https:\/\/www.bbc.co.uk\/news\/world-europe-isle-of-man-45839374>, days after a UN reportwarned of \"climate catastrophe\" <https:\/\/www.bbc.co.uk\/news\/science-environment-45775309>.Manx environment minister Geoffrey Boot said the island's \"present trajectory\" made it difficult to meet UN goals.Isle of Man Friends of the Earth said there was \"a moral obligation\" to act.The report by the Intergovernmental Panel on Climate Change (IPCC) found \"urgent changes\" were needed globally torestrict temperature rise to 1.5 degrees C <https:\/\/www.bbc.co.uk\/news\/science-environment-45775309>.Mr Boot said the government remained committed to Tynwald's climate targets, which include an 80% reduction in greenhouse gas emissions by 2050, but added that aim was \"ambitious\".He said the IPCC findings had \"moved the goal posts dramatically\".\"We're analysing the data and I'm finding it very difficult to see how we can meet those goals with our present trajectory and with the finances we have available,\" he said.He added that while the measures were important, it was a \"balancing act\" when weighed against the financial implications.\"As long as people are consuming natural gas and there's a market for it, then it could be worth millions to our small island community,\" he said.\"I feel gas will still be playing a role in our energy mix for years to come.\"IoM Friends of the Earth's Pete Christian said climate change was not \"something way off in the future which can be neglected\".\"[The IPCC's] clear message is that we have 12 years to limit a climate change catastrophe,\" he said.\"The island should be looking at renewable energy and not fossil fuels.\"Manx-based firm Crogga have been granted three years to conduct seismic surveys of a 165 sq mile (266 sq km) section of seabed off Maughold Head.A petition calling for a halt in plans to extract fossil fuels from Manx waters has received nearly 2,000 signatures."}