{"author":"","title":"Suffolk bishop frustrated by delay to home Ukrainian refugees","news_category":"general","content":"A month after signing up to host a Ukrainian family fleeing the war, Suffolk's leading Church of England clergyman has spoken of his \"frustration\" with the visa process.The Bishop of St Edmundsbury and Ipswich, the Right Reverend Martin Seeley, said he still had no idea when a family might arrive at his home.As of 7 April, only 1,200 refugees had arrived in the UK via the visa scheme.Bishop Seeley called for changes to speed up the process.More than 4.7 million people have fled Ukraine because of the Russian invasion,according to the UN <https:\/\/data2.unhcr.org\/en\/situations\/ukraine>.Government figures last week showed that 12,500 sponsorship visas had been issued from 43,600 applications, but only a fraction of those issued with their visas had arrived in this country.\"The frustration is that the government's approach to this continues to be quite protracted,\" said Bishop Seeley.\"Certainly people are getting hooked up to hosts, refugees are getting brought to this country, but the process is slow and the numbers are quite low in proportion to the number of people that have actually applied for visas.\"Ukrainians have been able to enter other countries, such as Poland and Germany much more easily because there isn't the visa requirement.\"Bishop Seeley acknowledged the Home Secretary's apology last week <https:\/\/www.bbc.co.uk\/news\/uk-61028712> over delays to the sponsorship scheme, but said: \"Actually lifting some of the requirements would make it a bit easier.\"What I would hope is to see the apology followed up by a change in the regulations and requirements.\"I am just struck that at a point of catastrophic crisis we still insist on a whole number of hoops to jump through when other countries in Europe have seen fit to set those aside.\"Offering to host a family in their home was \"in one sense... an instinctive decision\", he said.\"It goes back to love. You support people in desperate need because you love them and you want to show that love, and that love endures, and you sustain that because of that conviction,\" he added.\"I think the good thing that's happening here in Ipswich - and I know is happening across Suffolk - is that people are organising not just places for people to stay, but teams of people to provide that ongoing support.\"Meanwhile his family, who have previously supported a Syrian refugee in 2016, are still waiting to open their home to a Ukrainian family.A Home Office spokesperson said: \"We are continuing to speed up visa processing across both schemes [Ukraine Family Scheme <https:\/\/www.gov.uk\/guidance\/apply-for-a-ukraine-family-scheme-visa> and Homes for Ukraine <https:\/\/www.gov.uk\/register-interest-homes-ukraine>], including boosting caseworkers and simplifying the forms and we expect thousands more to come through these uncapped routes.\"Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk"}