{"author":"","title":"Suzy Lamplugh suspect hopes search will 'end speculation'","news_category":"general","content":"The man suspected of murdering missing estate agent Suzy Lamplugh hopes a police search of his mother's former garden will \"end speculation\".Police have been searching a property once owned by John Cannan's mother in Sutton Coldfield since Monday.Ms Lamplugh, from London, was 25 when she disappeared in 1986 and was declared dead, presumed murdered, in 1994. A body has never been found.Cannan, who is serving a life sentence, was named as a suspect in 2002.Ms Lamplugh disappeared after going to meet a client in Fulham on 28 July 1986. He was known only as \"Mr Kipper\" and was never traced.Cannan's solicitor Matthew Claughton said he continued to \"deny any involvement\" following this week's developments.\"Mr Cannan hopes that the search of his mother's former home will conclude swiftly so as to bring to an end speculation as to his involvement in this matter,\" the solicitor said.According to reports Cannan was nicknamed Kipper during an earlier prison sentence.He also bore a resemblance to an e-fit of a man with whom the estate agent was seen talking on the day she went missing - thought to be the mysterious Mr Kipper.Cannan, 64, is currently serving a life sentence for the abduction and murder of Bristol newlywed Shirley Banks, which he was jailed for in 1989.Assisted by West Midlands Police, the Met Police has been digging in the garden of the Shipton Road property for five days.Officers left the scene on Friday afternoon, but are expected to resume their search on Saturday.Police have also enlisted the help of a forensic investigation company that assisted in the search for Madeleine McCann.The garage in the garden has been dismantled and paving slabs have also been removed.The house is now owned by 52-year-old Phillip Carey, who described the search as \"surreal\".Ms Lamplugh's brother Richard told the BBC he was not holding his hopes \"too high\" for finding his sister's body.\"The overall hope is to find the body. I'd like to see her buried where we choose to bury her,\" he added."}