{"author":"By Steffan Powell","title":"Esports: How can they keep growing in 2023?","news_category":"general","content":"Whether you know your \"split-push\" from your \"powerspike\" or not, it's difficult to miss the ever growing popularity and influence of esports.With hundreds of millions playing and watching worldwide, brand partnerships with the likes of Gucci, BMW and Coca Cola, and a showcase at the Commonwealth Games - it seems that 2022 has been another successful year for competitive gaming.So what do traditional sport's noisy younger siblings have planned to keep that upward trajectory going in 2023?For those who are still a little unsure, esports refers to a range of different video games that are played competitively by professionals across the world. Often hosted in stadiums, events are televised and draw big audiences to watch. The esports market is estimated to grow to be worth $1.9bn (£1.4bn) by 2025.Dominic Sacco, founder of Esports News UK, argues that before continued growth and bigger audiences, the industry first has to come to terms with some fundamental changes to how much of it will be organised in future.\"At the start of 2022 a group backed by the Saudi Arabian government bought two of the biggest esports tournament operators in the world, ESL and FaceIt,\" he explains. \"I think we'll see more of this happening and it will be a big trend in 2023 and probably beyond\".That deal  was worth $1.5bn (£1.2bn) <https:\/\/www.sportsbusinessjournal.com\/Daily\/Closing-Bell\/2022\/01\/24\/ESL.aspx> and is only the beginning with the Saudi government-backed Savvy Gaming group saying that they want to invest $38bn (£31bn) to transform the country into a global esports hub by 2030.Sacco explains the deal has split the esports community, with some welcoming the investment as a way to boost growth, but adds: \"There's some LGBTQ talent wary of flying to events in Saudi Arabia, many others in the community have also said they feel uncomfortable going out there, and a Rocket League team refused to take part in an event there last summer.\"Saudi Arabia has been accused of 'sportswashing' in recent years  <https:\/\/www.bbc.co.uk\/sport\/articles\/c9ep0l0vdllo>- investing lots of money in popular sport, like buying Newcastle Football Club or setting up the new LIV golf tour. Some say it's being done in order to deflect attention away from its human rights record.Sacco says that some in the esports community feel like something similar is happening with them, which is taking some of the energy and enthusiasm out of the scene.If the trend continues as expected then players, presenters, commentators and event organisers could be spending more of their time in 2023 having serious ethical conversations about which events to attend. If the infighting caused by thecreation of LIV golf is anything  <https:\/\/www.bbc.co.uk\/sport\/golf\/64030944>to go by, it's sure to dominate conversation for a long time.For Naz Aletaha, the Global Head of League of Legends (LoL) Esports, the key to growth in 2023 and beyond is about not forgetting their core fanbase while going out in search of new audiences. The grass isn't always greener on the other side.Instead, she says, it's about creating content that is \"hyperserving\" the existing community while at the same time giving others a reason to care about the sport.\"The primary focus for us will always be the existing audience,\" Aletaha explains. \"Of course to grow we also want to lower the barriers to entry, we want to make the sport as entertaining and as accessible as possible. So I'd say our secondary target audience is people who play or know of LoL but that may not be actively engaged in the esports side of it.\"LoL enters its 13th season in 2023 and is considered one of the big three esports alongside DOTA 2 and Counter Strike. Its World Championships in 2022 saw players competing for a slice of the £1.8m prize pool.The number and size of that potential audience is significant. Aletaha says there have been \"over 600,000,000 people who have played and continued to play LoL\" - plenty of potential people to keep pumping up viewing figures.Everything Aletaha and her team do is targeted at making their sport as appealing as possible for those people because they already know their game, they know the rules and they know the universe.Their main vehicle for converting that crowd into more committed esports followers is their annual World Championship event, what Aletaha describes as their \"North Star\".Worlds, the League of Legends equivalent of the Super Bowl, had Lil Nas X perform in 2022, and the LoL boss argues it's the stories that big events like this create that will continue to draw in more casual followers.The target, she says, which is unlikely to be achieved in 2023, is to make the annual event as big as something like the World Cup, not talked about only for the action - but \"because they're just such culturally relevant moments\".\"I think this is the next step for us is really introducing the players for who they are and what they believe in,\" Aletaha says.\"Why should this audience care about some of our top players like Lee 'Faker' Sang-hyeok and Kim 'Deft' Hyuk-kyu? And all these players around the world. There are so many reasons why they should be interested in them, so storytelling, narrative building is a big focus of ours and those crescendo moments.\"Sacco agrees that set-piece events are vital for esports growth in 2023, not only for LoL but for a variety of other games in the industry as well.He argues that hosting major esports events in the UK is the best way to forge cultural and mainstream recognition, and while that is on the cards - he's worried that other locations are currently better placed.\"The business development group London and Partners, backed by the Greater London Authority say they want to make London the esports capital of Europe but at the moment we're behind places like Copenhagen and Paris,\" he notes.\"In France you've got President Macron talking about needing to do more in this space, but when it comes to major events we're lacking a little bit so I'd like to see our politicians get a better understanding of esports and the opportunities they create.\"This video can not be playedDan loves playing FIFA and wants to competeAletaha is confident in the continued trajectory of esports no matter what 2023 brings because she argues that: \"What will be the real game changer is when we see generational growth.\"The notion that people enjoy sport because they know the rules from growing up, and so when they turn it on they don't need a tutorial - they can just enjoy the storylines.\"So as the current generation of fans bring their children into it we will no doubt see the appeal of the sport grow even further.\"More crossover events will follow in 2023 with traditional sporting stalwart the Olympics hosting an esports test event in the summer.Four days of hybrid physical and simulated sports competition in Singapore. <https:\/\/olympics.com\/en\/news\/ioc-confirms-singapore-host-first-olympic-esports-week-june-2023>Sacco isn't excited about this development, however. He argues that the International Olympic Committee has misunderstood what makes esports so popular and should instead engage with the games that have thriving competitive scenes already - like the Commonwealth Games did in 2022.Until they engage with those titles, he doesn't think the esports community will engage in a meaningful way with the Olympics.Looking at the demographics of esports fans and the IOC's wish to get younger people more interested in the Olympics, he argues: \"To quote esports commentator Paul Chaloner, the Olympics needs esports more than esports needs the Olympics.\"Whether he's right or wrong - 2023 is set-up to be another busy and challenging year for competitive gaming.For more gaming content - go to Press X to Continue, the BBC Sounds gaming Podcast. <https:\/\/www.bbc.co.uk\/programmes\/p08x7kb5>"}