{"author":"","title":"Turkmenistan country profile","news_category":"general","content":"Known for its autocratic government and large gas reserves, Turkmenistan has been an island of stability in restive Central Asia.Despite the gas wealth, much of the population lives in poverty. After independence from the Soviet Union in 1991, the country entered a period of isolation that has only recently begun to end.Turkmenistan produces roughly 70 billion cubic metres of natural gas each year, and about two-thirds of its exports go to Russia's Gazprom gas monopoly.The government has sought out gas deals with several other countries, including China and neighbouring Iran, in order to reduce its dependency on Russia.President: Serdar BerdymukhamedovSerdar Berdymukhamedov took over in March 2022 as the third president of the authoritarian state.His father Gurbanguly had become president in 2007, on the death of his own mentor Saparmyrat Niyazov.Like his predecessors, President Berdymukhamedov wields absolute power, and is the focus of a personality cult in the state-run media. The Turkmenistan legislature is considered to be a rubber stamp parliament by outside observers,The government has an absolute monopoly of the media and state TV and radio pump out a steady stream of propaganda.Reporters Without Borders has called Turkmenistan \"an ever-expanding news black hole\".Foreign news and opposition websites are blocked and international social networks are often inaccessible.Some key events in Turkmenistan's history:6th century BC - Area of what is now Turkmenistan forms part of the Persian Empire of Cyrus the Great.4th century BC - Alexander the Great of Macedonia conquers Central Asia. 7th century AD - Arabs conquer Central Asia and convert inhabitants Islam. 10th-13th Centuries - Nomadic Oghuz Seljuk tribes - the ancestors of present-day Turkmens - and Mongols immigrate from northeast; Genghis Khan conquers the region.15th-17th Centuries - Southern part of modern Turkmenistan comes under Persian rule, while the northern part is dominated by the Uzbek-ruled states of Khiva and Bukhara.1881 - Area of present-day Turkmenistan incorporated into Russian Turkestan after Battle of Gok Tepe.1916 - Turkmens join other Central Asians in violently opposing Russian decree conscripting them for non-combatant duties.1921 - Turkmenistan forms part of the Turkestan Autonomous Soviet Socialist Republic (ASSR).1925 - Turkmenistan becomes a fully-fledged constituent republic of the USSR. 1948 - Over 100,000 killed when earthquake devastates Ashgabat. 1960-67 - Turkmen cotton production expands dramatically following the completion of the Karakum Canal.1991- Turkmenistan proclaims independence, with Saparmurat Niyazov as its leader.1999 - Parliament votes Saparmurat Niyazov president for life.2002 - President Niyazov renames the months of the year after himself, his mother and a book he wrote, the Ruhnama.2007 - Gurbanguly Berdymukhamedov becomes president on the death of his mentor Saparmyrat Niyazov. No opposition candidate was allowed to take part in the presidential election.2009 - A pipeline is opened for gas exports to China, breaking Russia's stranglehold on Turkmenistan's energy reserves.2015 - Construction work starts on a $10bn pipeline which will carry gas from Turkmenistan to India, Pakistan and Afghanistan.2022 - Gurbanguly Berdymukhamedov steps down as president in favour of his own son Serdar."}