{"author":"","title":"Tajikistan country profile","news_category":"general","content":"Battered by a five-year civil war at the onset of its independence, Tajikistan has struggled with poverty and instability since 1991.It remains dependent on Russia both for its economy and to help with security problems. In particular, Tajikistan depends on Moscow to fight drug smuggling and jihadist incursions from neighbouring Afghanistan.Tajikistan is expanding ties with China, which has extended credits and built roads, tunnels and power infrastructure. Chinese firms are investing in oil and gas exploration, as well as gold mining.President: Emomali Rahmon Emomali Rahmon, a Soviet-era cotton farm boss, was elected president in 1994, and has been re-elected regularly ever since in elections that fall far short of being free or fair.Rahmon played a vital role in Tajikistan's civil war, helping the former Communist effort to remove Islamist rebels from the capital Dushanbe in the early 1990s.After years of civil war and violence, some stability returned to Tajikistan. The president has a firm grip on power, but the country remains poor and underdeveloped.The media environment has become less free in recent years, with the authorities obstructing critical reporting.Websites and social media have been routinely blocked. Opposition websites operate from abroad.Television is the most popular medium. The state broadcaster is the main player in the sector.Some key dates in Tajikistan's history:8th Century - Tajiks emerge as distinct ethnic group; Arab invaders conquer Central Asia, including what is now Tajikistan, and introduce Islam.9th\/10th Century - Persian Samanid dynasty gains control of Central Asia and, in alliance with the caliph of Baghdad, develops Bukhara as centre of Muslim culture.13th Century - Genghis Khan conquers Tajikistan and the rest of Central Asia, which becomes part of the Mongol Empire.14th Century - Tajikistan becomes part of Turkic ruler Tamerlane's empire.1860-1900 - Tajikistan divided, with the north coming under Tsarist Russian rule while the south is annexed by the Emirate of Bukhara.1920s - Modern Tajikistan emerges as a republic under Soviet rule. 1960s - Tajikistan becomes the third largest cotton-producing republic in the Soviet Union; heavy industries, notably aluminium, introduced.1970s - Increased Islamic influence, violence towards non-indigenous nationalities.1978 - Some 13,000 people take part in anti-Russian riots.Late 1980s - Soviet leader Mikhail Gorbachev's policy of glasnost, or openness, leads to the formation of unofficial political groups and a renewed interest in Tajik culture.1991- Tajikistan declares independence, but a year later descends into a five-year civil war that claims 20,000 lives, displaces 600,000 and devastates the economy.1997 - Government and rebel United Tajik Opposition (UTO) sign peace accord; National Reconciliation Commission, comprising government and opposition members, created to supervise implementation of accord.1998 - President Rahmon pardons all opposition leaders in exile and agrees to appoint one of the Islamist opposition's leaders as first deputy prime minister.2011 - Tajikistan settles a century-old border dispute with China by agreeing to cede some land.2012 - Tajikistan grants Russia 30-year extension on Soviet-era military base seen as bulwark against Islamist militancy and drug-trafficking. The lease on the base had been due to expire in 2014.2016 - Work begins on the controversial Rogun hydroelectric dam on the Vakhsh river. Downstream neighbour Uzbekistan has strongly opposed the dam, fearing the impact on its agriculture.2021 - Following the takeover of the Taliban in Afghanistan, there are reports that Tajikistan is involved in the Panjshir conflict against the Taliban on the side of the National Resistance Front of Afghanistan.2022 - There are armed clashes, including the use of artillery, along much of the border between Kyrgyzstan and Tajikistan."}