{"author":"By Huw Thomas","title":"Covid: Cardiff Airport could take four years to recover","news_category":"general","content":"Cardiff Airport was \"wiped out\" by Covid and could take four years to recover, CEO Spencer Birns has warned.Budget airline Wizz Air will begin flights from Cardiff on Friday, which he hopes will boost passengers.Mr Birns said the pandemic was the \"most challenging time ever\" for the airport, with annual passenger numbers plunging from 1.6 million to zero.The business received an £85m bailout from the Welsh government <https:\/\/www.bbc.co.uk\/news\/uk-wales-59434267>, which Mr Birns previously said kept it afloat.Mr Birns believes at least 50% of pre-pandemic passenger numbers will return this year.\"We got wiped out, pretty much, by the Covid crisis,\" Mr Birns said. \"This time last year we were lucky to see 400 people a week coming through the building.\"He has overseen the arrival of Wizz Air, which he hopes will boost interest from passengers.Its new base at Cardiff Airport is the first from a low-cost airline since BMI Baby established itself there in 2002, before the carrier collapsed in 2011.Mr Birns said: \"At this stage we are seeing revival. Since the restrictions were lifted on 11 February we have started to see a big uptick in the number of people wanting to take trips.\"And for us we are expecting this summer to be much busier, we are expecting those people to take those trips when they have been saying they really, really want to go overseas again,\" he said.The airport's recovery is expected to be slow, with the wider air travel industry gradually resuming routes and re-establishing relationships with smaller airports such as Cardiff.Mr Birns said the impact of the pandemic put the airport \"right back to where we were in the 1950s\" when it first opened.\"We were in a position where we had gone from 52 routes down to none, we had gone from 1.6 million passengers using the facilities regularly to none,\" he said.The Welsh government, which owns the airport through an arms-length agreement, has supported it during the pandemic with non-repayable finance.Both parties have now entered a five-year \"rescue and recover\" agreement, which provides ongoing financial support while passenger numbers increase to pre-pandemic levels.Mr Birns said: \"We would expect to be back to normal by 2026. It is going to take time.\"For us it is about getting the routes back on, getting the flights to be viable with the airline partners, building on long-term relationships. And then building further success from that, which will ultimately be when the airlines add more flights and more choice.\"The ambition includes the return of Qatar Airways flights from Cardiff to Doha.The long-haul operator has yet to confirm if it will return to Cardiff, but Mr Birns hopes ongoing discussions will bring the route back into operation by 2024.Mr Birns said Qatar Airways had not ruled this out.\"It is about when is the timing right, and how do we continue to lobby and develop with them,\" he added."}