{"author":"","title":"Thomas Cashman: Olivia murder-accused hated but not guilty - trial","news_category":"general","content":"The man accused of killing Olivia Pratt-Korbel is \"probably one of the most hated people in the country\" but he is not guilty, his barrister said.Thomas Cashman is accused of murdering Olivia, 9, and injuring her mother Cheryl after chasing a man into their home in Liverpool on 22 August.John Cooper KC, defending, accused prosecutors of having \"temerity\" to suggest Mr Cashman, 34, was trying to pull the wool over the jury's eyes.Mr Cashman denies being the gunman. Manchester Crown Court has heard the defendant shot convicted drug dealer Joseph Nee, 36, in the street, before his victim fled into Ms Korbel's home as she tried to block his entry.The jury has heard Mr Cashman fired again, with the bullet travelling through Ms Korbel's hand before hitting and killing her daughter behind her.In his closing speech, Mr Cooper said: \"The suggestions are easy to make because the defendant is sitting in the dock, the only person there, probably one of the most hated people in the country.\"During his evidence, Mr Cashman told the jury he was a \"high-level\" cannabis dealer in the Dovecot area.Mr Cooper said: \"I'm not putting Cashman to you as an angel, far from it.\"I don't necessarily even have to like the guy, neither do you. We'll never talk again after this trial, we're not mates.\"It's a matter of doing my job and you doing your job.\"Mr Cooper said the family of Mr Nee, the intended target of the shooting, \"had their enemies\" and there were other people who wanted him dead.He said: \"When Tommy Cashman says to you, 'It wasn't me', it therefore must have been someone else - that's not pie in the sky, we submit, it's based on fact.\"He said a woman who claimed that after the shooting Mr Cashman came to her house, where she heard him say he had \"done Joey\" was telling \"downright lies\".Mr Cooper said the defendant had had a \"sordid relationship\" with the woman, who cannot be named for legal reasons, but was \"never ever\" going to leave his fiancée for her.He said: \"He was never going to play any meaningful part in her life - that obviously was not what she wanted to hear.\"In his closing remarks, Mr Cooper said: \"The defence have done their best now to show you the evidence for what it is.\"We ask you to carefully look at it and to conclude that on all counts this defendant is not guilty.\"Mr Cashman, of Grenadier Drive, West Derby, Liverpool, denies murdering Olivia, the attempted murder of Mr Nee, wounding with intent to do grievous bodily harm to Ms Korbel, and two counts of possession of a firearm with intent to endanger life.Why not follow BBC North West on Facebook <https:\/\/en-gb.facebook.com\/BBCNW\/>, Twitter <https:\/\/twitter.com\/BBCNWT> and Instagram <https:\/\/www.instagram.com\/bbcnorthwest\/>? You can also send story ideas to northwest.newsonline@bbc.co.uk <mailto:northwest.newsonline@bbc.co.uk>"}