{"author":"","title":"National Eisteddfod: Tregaron hosts first festival since Covid","news_category":"general","content":"The National Eisteddfod is \"back with a bang\" after a two-year hiatus, organisers have said.\"It's been a long time coming, but it's amazing to be back,\" said chief executive, Betsan Moses.Tregaron, in Ceredigion is finally hosting the festival after it was forced to cancel twice <https:\/\/www.bbc.co.uk\/news\/uk-wales-55804716> due to the Covid pandemic.Tens of thousands of visitors are expected between 30 July and 6 August.The town has a population of around 1,200, so many patrons will be staying in a huge, temporary caravan site next to the \"maes\", the main Eisteddfod field.\"Tregaron I think is the smallest market town in Wales, but it's such a perfect location,\" said councillor Ifan Davies.Mr Davies, who is the current chair of Ceredigion council, said: \"We are literally two and a half hours from the bottom of Wales and two and a half hours from the top of Wales, so it's as accessible as any Eisteddfod could ever be.\"\"That's the message really, there's a huge welcome for you here.\"Ceredigion, and Tregaron especially, has had a \"long wait\" to host the event, one of Europe's largest cultural festivals.Mr Davies said: \"I think it's been a long wait for Wales as well, but it's finally here and the excitement in Tregaron is building up.\"It's a great honour for us, and we're looking forward.\" Ms Moses said she got on the site a week ago, and it felt that they were back to normal.\"There are last-minute things and that's always the case, but the buzz is back.\"She added anyone driving through Ceredigion can already \"see the welcome in all the villages\".Organisers have been trying to get ahead of potential problems.A new one-way system is in place throughout the town, and new restrictions have been placed on parking outside homes and businesses in the middle of town, while the Eisteddfod is here.The aim is to maintain traffic flow, although some business owners have been frustrated.There will be 6,000 parking spaces near the \"maes\" and those travelling by car are advised to follow the travel advice on the Eisteddfod website, as well as road signs giving directions to Tregaron from across Wales.\"Information will be posted [from all directions] from Machynlleth, and as you come in to Lampeter, and Builth Wells and so forth,\" Ms Moses said.\"Follow the signs. Please don't think that you know better.\"Ms Moses warned the festival had faced challenges this year, including increased costs from inflation and Brexit, which made importing goods more complicated.Many specialist contractors they used, have left the festival industry since the pandemic, she added.\"If you talk to the industry, it's the perfect storm between Brexit, costs escalating and everything so it has been difficult, but we remain positive.\"She also said an issue with people wrongly claiming a batch of 15,000 free tickets <https:\/\/www.bbc.co.uk\/news\/uk-wales-55804716> which were set local, disadvantaged children and refugees has now been resolved.\"Everybody who should have had a ticket, has had a ticket and we've also released additional [free] tickets for schoolchildren under 12 from Ceredigion.\"\"So there's an opportunity for everybody who's in primary school in Ceredigion to come on the first weekend to experience the Eisteddfod.\"The Eisteddfod will host a wide range of competitions for brass band, choirs, soloists, dancers, artists and more.All events happen in the medium of Welsh but the festival welcomes non-Welsh speakers and a translation service is provided."}