{"author":"By Marie-Louise Connolly & Catherine Smyth","title":"Menopause: Women 'borrowing HRT drugs due to shortage'","news_category":"general","content":"This video can not be playedThe sharing of HRT drugs has been described as \"common and dangerous\" by a menopause expertWomen in Northern Ireland are borrowing each other's hormone replacement therapy (HRT) medication due to supply shortages, according to a menopause support group.Roisin Hillman, who founded the group, said supplies were either incredibly low or, at times, simply not available.Dr Shahzadhi Harper, a menopause specialist, described the move as \"common and dangerous\".The Department of Health said it was aware of supply shortages in the UK. Dr Harper said women's health was not being taken seriously enough.Confirming there was currently a nation-wide shortage of HRT, she said governments were failing to see it as an important issue.HRT is used to treat symptoms of the menopause which can include anxiety, night sweats, insomnia, brain fog and brittle bones.Many of the most commonly prescribed forms of HRT are out of stock in pharmacies across Northern Ireland.While alternative HRT products are often available, Dr Harper said most women were on a particular regime of medication and should not alternate from what had been prescribed.\"The dangers are that these women are stable in their regimes and HRT for these women is a necessity and taking away HRT is a bit like taking insulin away from a diabetic, women's lives can break down because of the lack of it,\" she told BBC News NI.Dr Harper said clients were emailing her saying they could not get hold of their medication.In 2021, the Royal College of Obstetricians and Gynaecologist described HRT shortages in Ireland and the UK as \"catastrophic\".Colin Deehan, a community pharmacist with Medicare Pharmacy Group in Northern Ireland, said there had been a number of shortages stretching back to 2018, but they tended to be \"temporary\".Roisin Hillman, who lives in Belfast, advised against women sharing their HRT medication.\"A woman will post that they have extra HRT and they will offer it until a woman gets her own prescription and then pays it back,\" she said.\"These are the lengths people are going to.\" Almost 2,000 women have joined Menopause Support Group NI, which Ms Hillman set up last June.She said a shortage had been an issue from the very start and as more women were talking about the menopause, demand was not meeting supply.Earlier this year, the Department of Health said affected patients should discuss alternative treatments with their doctor, adding that the government was working closely with suppliers to \"maintain the overall flow of medicines to patients\".There is a growing national campaign to increase accessibility to HRT. Last October, the government in England cut the cost of HRT prescriptions - they continue to be free in Northern Ireland.Labour and campaigning groups had called to make menopause treatment free, but the government would not go that far.Dr Harper said it was up to \"those at the top\" including government and others in senior positions to ensure menopause and HRT were regarded as important issues.She also said there needed to be greater choice for doctors to prescribe. \"GPs need to prescribe women months of their medication at a time, not just a month at a time and rationing it to them,\" Dr Harper said.\"Governments need to work with pharma companies to produce more supplies and to produce a greater variety of preparations.\"Northern Ireland's Department of Health said it was aware of \"ongoing issues\" affecting the supply of some HRT products to patients across the UK.It added that the Department of Health and Social Care (DHSC) in England, which has responsibility for for all UK medicine supplies, had previously issued medicines supply notifications to inform healthcare professionals across the UK of these supply issues.It was continuing to monitor the situation on a daily basis, it said.\"Women who are experiencing difficulties in getting HRT products on prescription are advised to consult with their GP who will be able to advise them about the most appropriate alternative HRT options,\" the department said."}