{"author":"By Amy Stewart","title":"ADHD: 'Dire' situation for adults waiting for diagnosis in NI","news_category":"general","content":"Adults in Northern Ireland seeking assessment for attention deficit hyperactivity disorder (ADHD <https:\/\/www.bbc.co.uk\/news\/topics\/c34g0ngwzket>) are being forced to go private because of a dire lack of referral services in some areas, a charity has said.Some health trusts have not been able to accept new referrals for adult assessment and diagnosis.ADHD charities said a lack of services or even waiting lists has forced many people to pay for a private diagnosis.ADDNI <https:\/\/addni.org\/> said people are taking out loans.The charity's chief executive Sarah Salters added that some people who do get a private diagnosis cannot then get medication from their GP through the NHS.Mark Bonello, 50, who lives in Ballymoney, County Antrim, told BBC News NI that he paid for a private assessment, but said not everyone was in a position to do that.\"It's so sad there is not the support there for adults,\" he added.Causeway Neurodiversity <https:\/\/www.facebook.com\/causewayneurodiversity\/?paipv=0&eav=AfZgZTbWctN5nbEQtdjlmnqD18kXLQGyiGzQbcc_FKfhsUnHB7ZtNIDTC69FgpjEia4&_rdr>, a north coast-based charity, has also been contacted by people who cannot get a diagnosis.The Department of Health said officials \"are considering longer-term arrangements\" for ADHD services, with future decisions \"likely to be subject to ministerial approval and availability of funding\".ADHD is a neurodevelopmental condition that can cause memory issues, problems concentrating, focusing or sitting still.A late diagnosis <https:\/\/www.bbc.co.uk\/news\/health-59038116> can have a negative impact on relationships and careers, as well as increase the risk of mental health problems such as anxiety, depression and eating disorders.The UK-wide ADHD Foundation said it has seen a 400% rise in adults going to them compared to before the Covid-19 pandemic. <https:\/\/www.bbc.co.uk\/news\/uk-wales-64359724>BBC News NI asked the five health trusts about their services for adults who think they may have ADHD.The Northern Trust said referrals documenting adult ADHD as a problem presented by patients has increased year on year.In October, an answer at the Northern Ireland Assembly showed that while the trust provides support it was notaccepting new referrals and was instead holding a register of those referred. <http:\/\/aims.niassembly.gov.uk\/questions\/printquestionsummary.aspx?docid=384256>However the trust told BBC News NI that in response to demand, work on a local service will begin in April to engage with patients who were referred into the service from November 2021.The Southern Trust does not currently provide a diagnostic ADHD service. In October, an assembly answer said the trust was\"not adequately resourced to provide support or assessment, in respect of personnel\". <http:\/\/aims.niassembly.gov.uk\/questions\/printquestionsummary.aspx?docid=384256>In a patient letter from February, seen by BBC News NI, the trust said it was in discussions to finalise a proposal to seek funding for a ADHD service.Other health trusts are currently providing some adult diagnostic services:For Mark Bonello, diagnosis came as a \"huge relief\".The artist and HGV driver, who lives in the Northern Trust area with his wife and two daughters, said he had always struggled to pay attention at school and was labelled disruptive.\"You spend your whole life questioning everything and then all of a sudden you may have the answer but there is no service,\" he added.Mr Bonello said art was the only subject in school \"that held my attention\".\"I knew I was intelligent but I wondered why I did badly.\"When he heard broadcaster Nicky Campbell talking about his own diagnosis on BBC 5Live things started to click. <https:\/\/www.bbc.co.uk\/programmes\/p0cysl4s>\"I was going through the check list in my head. It was just tick, tick tick.\" When he went to his GP, Mr Bonello was told a diagnosis through the NHS would not be possible.\"I was basically told: 'Sorry. There's no treatment for adults here. You'll have to go private.'\"After a three-month wait for a private diagnosis he was assessed and diagnosed with ADHD.\"People always talk about the grieving period when you get a diagnosis - but I felt like I had already been through it - I was happy,\" he said.He said one of the biggest sources of support has been talking to other people with ADHD.Cara Hunter, SDLP assembly member for East Londonderry, told BBC News NI her constituents were frustrated and that people were subject to a \"postcode lottery\".She said the situation was \"absolutely shameful\", with a student telling her she needed an official diagnosis so she could get support at university, but was unable to get one.Sarah Salters, from ADDNI, said the lack of adult referral services in the Northern and Southern trusts was a \"dire situation\".\"We have a high influx of calls and we don't have anywhere to send them but down the private route,\" she explained.\"That's not accessible to everyone,\" she said, adding that this, along with long waiting lists across Northern Ireland, meant there were people taking out loans to pay for assessment.Ms Salters said some adults will only realise they may have ADHD when their own child is diagnosed and they see similarities.It has been reported that there is a greater awareness of the condition because ofsocial media platforms like TikTok. <https:\/\/www.bbc.co.uk\/news\/av\/technology-64596756>However, Ms Salters said that while awareness was a good thing, diagnosis should come from a healthcare professional only.\"It's a bad idea to self-diagnose through social media,\" she said.As well as using treatment like cognitive behavioural therapy (CBT), some people with ADHD wish to start medication.But Ms Salters said that across Northern Ireland there were issues with private patients getting medication through the NHS.\"Many of our adults feel cheated. They get a confirmed diagnosis then are frustrated about not being able to get the help they need,\" she added.The Department of Health said that shared care agreements are put in place between private healthcare providers and GPs to oversee the prescription of specialist \"red amber list\" medication.ADHD medication falls in that red amber category.If a GP does not agree to a shared care agreement, the person must either wait to be referred to an NHS specialist or pay for prescriptions via private healthcare.\"It would not be usual or expected for a GP to prescribe a specialist amber drug at the request of a private provider in the absence of an agreed shared care arrangement,\" the department said.The ADHD Foundation said medication is only one of a range of strategies and people must not rely on medication alone to manage ADHD successfully. <https:\/\/www.adhdfoundation.org.uk\/wp-content\/uploads\/2022\/03\/ADHD_FOUND_Takeda_AdultsBooklet.pdf>Mum-of-three Sara Jane O'Donnell, who is on the board of Causeway Neurodiversity, said it was frustrating that so many \"can't get a diagnosis unless you're willing to pay\".\"People just want to know - is this who I am? Is this why my thinking is different to others?\"She has called for an ADHD strategy to support children with diagnosed ADHD - and adults who do not have a diagnosis yet.The Northern Trust does have a referral service for children, so Ms O'Donnell's daughter was given a diagnosis when she was six.She is currently receiving intervention at home and at school, but Ms O'Donnell worries about the services that will be available after she turns 18.While ADHD services are not currently commissioned in Northern Ireland there is somesupport and assessment for adults seeking ADHD assessment: <http:\/\/aims.niassembly.gov.uk\/questions\/printquestionsummary.aspx?docid=384256>"}