{"author":"","title":"Neighbours 'misled' over 'dream homes' on Barratt estate","news_category":"general","content":"A group of neighbours who bought \"dream homes\" on a new housing estate claim they were misled on management fees.Rob Howe said he was incorrectly told by Barratt that buying a new-build home anywhere involved paying a management company an annual fee.But people who do not want to pay fees can choose to buy a home on an estate where it has been agreed the land will be maintained by the local council.Barratt said customers were provided with \"full information\" on the charges.Residents claim they were told they had \"no option\" but to pay a private firm because it was \"too much for the council\" to maintain open spaces.There are 200 houses on the Autumn Brook estate and each household pays management fees of between £130 and £250 per year, depending on the size of the property.In 2004, national planning policy advice changed, which meant developers could either hand the land over to the council - and pay a certain amount for future maintenance - or set up a residents' company to maintain the public open spaces.People who would prefer not to pay a private management company would need to buy a property on an estate where developers had agreed the land would be maintained by the council.Open space on the Autumn Brook estate is not managed by South Gloucestershire Council after Barratt chose to adopt the land and took on responsibility for its management and maintenance.This video can not be playedNeighbours 'misled' over 'dream homes' on Barratt estate in YateBut an undercover investigation by BBC Inside Out West, who secretly filmed a Barratt salesperson in one of the company's sales offices, in the area, were told all new build sites charged management fees because \"the council can't take over the whole areas anymore\".Mr Howe bought his \"dream new build\" in 2017 and said that when he reserved it, he was told he would have to pay a management fee.He claims he was \"misled\" by Barratt into signing the management contract. He said the developer told him the council were \"not maintaining open spaces on new developments\".\"I thought, well I've got no choice, it doesn't matter where I go, I'm going to have to pay this management fee\", Mr Howe said.Rebecca Chambers, who bought her house in 2016, said: \"We were told the council wasn't taking on any new green space or any new development land. So we just assumed that this was the given deal and there wasn't an option.\"A Barratt spokesman said: \"At Autumn Brook, all customers were provided, through their solicitors, full information about the nature of the charges and management of public open spaces before purchase and all had access to independent legal advice throughout the process.\"On Autumn Brook specifically, the management company which controls the maintenance of the public open space will be handed over to residents following completion of the site. Residents will have control of the maintenance of the development and any associated fees.\"While we will ensure that our sales staff are more careful with the language that they use and apologise for any confusion, as the UK's largest house builder it is our experience that local authorities across the country increasingly prefer public open space to be adopted by a management company.\""}