{"author":"","title":"Paradise Wildlife Park: Zoo habitats will help to 'bring visitors back'","news_category":"general","content":"A family-run zoo is hoping new habitats it has built during lockdown will help boost its fortunes when it reopens.Paradise Wildlife Park in Hertfordshire had estimated last year's income would be £1.5m down on 2019, then saw its hopes to open at half-term delayed.Aaron Whitnall, one of the brothers who run it, said the impact of lockdown meant things were now \"a bit tighter\".But he hoped Jaguar Jungle and Sun Bear Heights would \"bring people back time and time again\".Three brothers - Aaron, Tyler and Cameron - help run the wildlife park, which has about 800 animals and sits on land near Broxbourne bought by their grandfather in the early 1980s.In December, the family said it had been a \"hard year\" and hoped that if the park could open for February half-term and the Easter holidays \"things would be OK\".With England going back into lockdown in January, that has not happened, but staff have spent the time preparing the latest developments and everyone is \"keeping positive\", Mr Whitnall said.\"Obviously [things are] a bit tighter now but we're still OK, there's no immediate cause for concern. We just hope the roadmap goes well,\" he said.Mr Whitnall said being able to open outside areas on 12 April was a \"huge relief\" and with rough dates for the further easing of restrictions, they could start making plans.Jaguar Jungle, a refurbishment of the big cats' old habitat, is due to open at the end of May.Resident animals Kedera and Kumal will return from a sister site, The Big Cat Sanctuary in Kent, to a new South American-themed area, three times bigger with a pool and underwater viewing.August will see the opening of Sun Bear Heights, where three species, the threatened bears, binturong and Asian short clawed otters, will share a habitat.The zoo said it wanted to be at the forefront of wildlife conservation, \"creating bespoke habitats\" where animal welfare is \"the top priority\".With each new area, it also explains what is endangering each species.\"We are something Hertfordshire can be proud of,\" Mr Whitnall said.\"The last year has been a crazy time, the hardest time, but things are as good as they can be and I just hope we have a good year so we can keep redeveloping.\"We've done the best we can under difficult circumstances and hope we are rewarded by people flooding back.\"Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk"}