{"author":"","title":"'Love letter' to Birmingham and Coventry in two tone drama","news_category":"general","content":"An upcoming BBC drama exploring the beginnings of the two tone scene is a \"love letter to Birmingham and Coventry\", says its creator.Peaky Blinders writer Steven Knight is also the executive producer of This Town, which opens in 1981 at a moment of social tensions and unrest.The six-part series pays homage to classic tunes and features \"fierce new music\", says the BBC.Filming is under way, but it is not yet know when it will broadcast.Actors Michelle Dockery and Nicholas Pinnock have been cast as leads.Dockery, 40, is known for playing Lady Mary Crawley in ITV's Downton Abbey and the big screen, while Pinnock has appeared in Top Boy.The family drama and thriller, being filmed on location in the Birmingham area, will tell the story of an extended family drawn into the world of ska and two tone.The music scene \"exploded from the grass roots of Coventry and Birmingham in the late (1970s) and early (1980s), uniting black, white and Asian youths\", said the BBC.Coventry bands such as The Selecter and The Specials <https:\/\/www.bbc.co.uk\/news\/magazine-13780074> played a central part in its growth.\"This is a project very close to my heart,\" said 63-year-old Mr Knight.\"It's about an era I lived through and know well and it involves characters who I feel I grew up with.\"I hope people from all over the world will relate to it.\"The series will be co-produced with Mercury Studios, which has \"high profile music artists\" lined up to provide the backdrop to the story, says the BBC.Alice Webb, Mercury Studios chief executive and co-president, said: \"Ska music has such a huge impact on music and culture - in the 1980s and through to modern day.\"Jo McClellan, BBC Drama commissioning editor, said: \"Steven's scripts are absolutely brilliant - they capture the wild energy of youth and a pivotal moment in time, all set to a fantastic soundtrack, and we can't wait to see this incredibly talented cast bring it all to life.\"Follow BBC West Midlands on Facebook <https:\/\/www.facebook.com\/MidlandsBBC\/>, Twitter <https:\/\/twitter.com\/bbcmtd> and Instagram <https:\/\/www.instagram.com\/bbc_midlands\/?hl=en>. Send your story ideas to: newsonline.westmidlands@bbc.co.uk <mailto:newsonline.westmidlands@bbc.co.uk>"}