{"author":"By Chelsea Bailey","title":"Miami Seaquarium is returning Lolita the killer whale to her home waters","news_category":"general","content":"The oldest killer whale in captivity may soon be returned to her home waters in the Pacific Northwest, more than 50 years after her capture.Lolita, a 56-year-old orca, was the star attraction at the Miami Seaquarium in Florida for decades.Animal welfare activists have spent years lobbying for her release.On Thursday, the aquarium announced it will begin the process of returning the orca to her natural habitat in the next two years.The Miami Seaquarium is partnering with the non-profit Friends of Lolita to send the whale back across the country.Footing the bill for Lolita's relocation will be Jim Irsay, owner of NFL football team the Indianapolis Colts.\"I'm excited about being part of Lolita's journey,\" Mr Irsay said. \"She is one tough creature. It's amazing. Ever since I was a little kid, I loved whales.\"Lolita, also known by her original name Tokitae or Toki, is a female Southern Resident killer whale.These orcas live exclusively in the North Pacific Ocean and spend several months of the year in Washington State's Puget Sound,according to the National Oceanic and Atmospheric Administration (NOAA) <https:\/\/www.fisheries.noaa.gov\/west-coast\/endangered-species-conservation\/southern-resident-killer-whale-orcinus-orca>.This special population of orcas were deemed an endangered species in 2005, due in part to captivity programmes that hunted the animals throughout the 1970s, when Lolita was captured.In his book documenting the history of the global fascination with killer whales, Jason Colby, an environmental historian and professor at the University of Victoria, describes how Lolita was captured in August 1970.At the time, captors would partner with local fisherman to heard young orca calves into nets, separate them from their pods, and ultimately sell them to amusement parks like Seaworld and Miami Seaquarium.\"When Lolita is captured, the captors accidentally end up rounding up nearly the entire population of Southern Resident (killer whales),\" he told the BBC. \"There was about 90 orcas behind their nets at one point.\"Mr Colby says that animal rights activists tried to free the whales by cutting the fishermen's nets, but some whales became entangled and four calves drowned. Eight orcas, including Lolita, were captured.\"This was in August 1970 - the Vietnam War was going on. It was the first term of Richard Nixon's presidency - that's how long she's been in captivity,\" he said.Lolita was sold to the Miami Seaquarium where she would perform alongside another Southern Resident whale named Hugo, according to the park's website. He died in 1980, so she has not had another orca whale to socialise with for over 40 years. Once released, she will be the oldest orca to be flown to a new habitat, Mr Colby said.In the more than 50 years since then, she has been living in an 80ft by 35ft (26m by 11m) tank at the Seaquarium, a space critics say is dangerously small for an animal that is roughly 20ft (6m) long.One critic of the tank's size was the daughter of Eduardo Albor, CEO of The Dolphin Company, the largest amusementpark owner in Latin America <https:\/\/thedolphinco.com\/>. Mr Albor visited the theme park with her shortly before acquiring the Miami Seaquarium in 2021.\"She told me, if we ever take management of this place, you promise me you will see how to improve this,\" he said.The next year, the Seaquarium announced Lolita's retirement from the stage after 52 years of performing. Mr Albor praised animal rights activists and the Seaquarium team for putting aside differences and working together.\"We have the same goal and now the world will see, amazing things are possible when we listen and work together,\" he said.But experts caution that relocating Lolita will have major hurdles. \"I fear that when people see that she's being brought home, people will imagine it's just going to be a sort of Free Willy moment where she swims over and connects with her family. I can't imagine that happening,\" said Mr Colby, the environmental historian.Lolita's age and the fact that she's lived in captivity for decades and is unable to forage on her own could complicate her release back into the wild, Mr Colby said.Instead of releasing Lolita back into the Salish Sea to live in the wild, Mr Colby said the orca will likely live out her remaining days in a sea pen that will allow her to feel her 'home waters' and reconnect acoustically with the pod she was separated from decades ago.That, he said, would still be a powerful, symbolic victory. \"If her coming back makes people commit to making sure that this orca family has a healthy place to live then it will be a great success,\" he said.This video can not be playedPollution threatens future of killer whales"}