{"author":"","title":"Birmingham 2022: Commonwealth Games one year away","news_category":"general","content":"This video can not be playedBirmingham 2022: Drones light show marks one year to goThe Commonwealth Games are set to get under way one year to the day.Birmingham hosts the Games between 28 July and 8 August 2022, with events also taking place in the wider region.As the one-year countdown began, chief executive Ian Reid said it would \"give us all something to look forward to\".With the Tokyo Olympics in the spotlight, Commonwealth Games organisers have set up a day of sporting events in Birmingham city centre.Centenary Square in Birmingham will be filled with sports activities, with Team England athletes in attendance as part of the sporting festival precursor.A total of 286 sessions will take place at the 2022 Games, involving 19 sports and eight para-sports.There will be venues hosting disciplines in Birmingham, neighbouring Sandwell and Solihull boroughs, Wolverhampton and Coventry, along with Leamington Spa in nearby Warwickshire, and Cannock Chase in Staffordshire.Emphasising the contribution beyond Birmingham, Mr Reid pointed to Solihull borough venue, the NEC.He said: \"The NEC will be a key hub, staging world-class badminton, boxing, netball, table tennis, para table tennis, weightlifting and para powerlifting, and the site is also one of the Games' three campus villages, hosting athletes from across the Commonwealth throughout next summer's event.\"After a challenging 18 months for everyone, we are sure that the Games and the six-month culture programme, which will accompany it, will give us all something to look forward to.\"He also encouraged residents to consider signing up as volunteers. <https:\/\/www.bbc.co.uk\/news\/uk-england-birmingham-57313350>A local ticket ballot, available to people living in Herefordshire, Shropshire, Staffordshire, Warwickshire, West Midlands and Worcestershire,opened on 14 July. <https:\/\/www.bbc.co.uk\/news\/uk-england-birmingham-57828933> and will close on on Friday at 16:00 BST.Organisers said it had already prompted \"thousands\" of applications. The main public ticket ballot will run from 8 to 30 September.Follow BBC West Midlands on Facebook <https:\/\/www.facebook.com\/MidlandsBBC\/>, Twitter <https:\/\/twitter.com\/bbcmtd> and Instagram <https:\/\/www.instagram.com\/bbc_midlands\/?hl=en>. Send your story ideas to: newsonline.westmidlands@bbc.co.uk <mailto:newsonline.westmidlands@bbc.co.uk>"}