{"author":"","title":"Kaliningrad profile","news_category":"general","content":"The Russian exclave of Kaliningrad on the Baltic Sea is sandwiched between Poland to the south and Lithuania to the north and east.It saw bitter fighting and suffered extensive destruction during World War Two. The German population was expelled or fled after the war ended and it was annexed by the USSR from Germany. It was a closed military zone throughout the Soviet period.Koenigsberg, as the city of Kaliningrad was once known, was founded by Teutonic knights in the 13th Century. It became one of the cities of the Hanseatic League and was once the capital of Prussia. The philosopher Immanuel Kant spent all his life in the city and died there in 1804.During the Soviet period, the Kaliningrad oblast or region, administratively part of the Russian Federation, was separated from the rest of Russia, more than 300km to the east, by the then Soviet republics of Lithuania, Latvia and Belarus.Since Lithuania and Poland joined the EU in 2004 it has been impossible to travel between Kaliningrad and the rest of Russia over land without crossing the territory of at least one EU state. There has been friction, particularly with Lithuania, over transit regulations.Kaliningrad is still of great strategic importance to Moscow. It houses the Russian Baltic Fleet at the port of Baltiysk and is the country's only ice-free European port.During the Soviet period, agriculture was a key industry. The market for Kaliningrad's produce was largely dismantled with the collapse of the USSR, causing the economy to nosedive in the early 1990s.Unemployment soared and poverty became very widespread, particularly in rural areas. Organised crime and drugs became increasingly problematic.In a bid to tackle the region's problems, in 1996 the Russian authorities granted it special economic status and tax advantages intended to attract investors. The region's economy benefited substantially.Kaliningrad underwent an unprecedented boom, and in 2007 a new $45m airport terminal was opened.The region began to see increasing trade with the countries of the EU as well as increasing economic growth and rising industrial output.However, the global financial crisis of 2008-9 affected the region badly, and by the beginning of 2010 unemployment had climbed to over 10% - considerably higher than the Russian average.In 2013, Russia deployed short-range Iskander ballistic missiles capable of carrying nuclear warheads in the region, in what it said was a response to US plans to deploy a ballistic missile defence system in Europe.In June 2022, following Russia's invasion of Ukraine, Lithuania implemented EU sanctions on certain Russian goods - including construction materials - and banned their movement by rail across its territory.Kaliningrad is heavily reliant on transit routes from the rest of Russia through Lithuania, and the move angered Russia. Lithuania lifted the ban a month later when the EU clarified that the sanctions applied to road and not rail."}