{"author":"","title":"Cambridge University anti-women students 'confetti and rockets' digitised","news_category":"general","content":"Confetti and fireworks, collected at an 1897 street protest opposing women's rights to get university degrees, are to be digitised for public record.They date from a demonstration in Cambridge held by male students opposed to student equality.The items have been stored in a box at Cambridge University Library.Archivist Sian Collins described them as \"a significant and physical connection\" to the protests and they will now be photographed and archived.The digitisation, which may involve 3D imagery, is considered timely as it is the centenary of the first votes for women in the UK.In the 1870s, women were permitted to attend lectures at Cambridge, but only at the discretion of individual academics.They did not gain the formal right to sit exams until 1881 - but still could not be awarded degrees.University-wide votes to allow women to be conferred full degrees were held in 1897 and 1921 - but were marred with heated street protests, including one in which an effigy of a woman on a bike was publicly mutilated in the Market Street area.Women did not gain full membership of the university until 1948.The library said the box was given to the university in 1921 and its contents, which include rocket fireworks and eggshells, were wrapped in confectionary paper.Sian Collins, archivist with the library's Department of Archives and Modern Manuscripts, said the materials date from an \"extraordinary time\".\"This find is important as it provides a significant and real physical connection to 1897,\" she said.\"It's not an eyewitness description or a newspaper report - these were actual items used to victimise people, things that don't normally survive.\"She said tests would now be carried out on the confetti and rockets before they are formally photographed and digitised - and added to the university'sCambridge Digital Library <https:\/\/cudl.lib.cam.ac.uk\/> online archive."}