{"author":"By Jonathan Amos","title":"Wildlife Photographer of the Year: 'Explosive sex' wins top prize","news_category":"general","content":"It's like an explosion underwater. Several camouflage groupers rush to release their sperm as a female fish drops a burst of eggs.This image taken at Fakarava Atoll in the Pacific has earned Laurent Ballesta the prestigious title of Wildlife Photographer of the Year (WPY).Jury chair Roz Kidman Cox said it was a technical tour de force.\"It's partly the setting, taken during a full Moon, but also the timing of it, knowing when to take the picture.\"The annual spawning of camouflage groupers occurs in July. It's been known to draw up to 20,000 fish, along with many reef sharks looking for a meal. Overfishing threatens the groupers, but this picture was captured in a reserve that gives them some protection.\"We spent five years in this place, 3,000 hours of diving, to get this particular moment,\" Laurent said.\"I'm attached to this picture because of the shape of the cloud of eggs: it looks like an upside-down question mark. It's a question of the future of these eggs because only one in one million will (survive to) become an adult, but it's maybe more symbolic of the future of nature. It's a very important question about the future of nature.\"As well as celebrating WPY's Grand Prize, the French photographer also wins the competition's Underwater category.Ten-year old Vidyun R Hebbar from India is the Junior Wildlife Photographer of the Year for this picture of a tent spider in its web. The image is called Dome Home.The blurred green and yellow colours in the background belong to one of those three-wheeled tuk-tuk taxis.\"Its focusing is pin sharp,\" Roz Kidman Cox told BBC News. \"You can actually see the little fangs if you blow up the picture. I love the way it's been framed and the way you can see all the texture of the web, its lattice structure.\"Vidyun recalled: \"It was challenging to focus the tent spider because the web shook every time a vehicle passed by.\"Started in 1964, WPY is organised by London's Natural History Museum. The competition attracts tens of thousands of entries each year. Scroll down to see some of the individual category winners.Adam Oswell wins the Photojournalism award for this picture which shows zoo visitors in Thailand watching a young elephant perform underwater. Elephant tourism has increased across Asia. In Thailand, there are now more elephants in captivity than in the wild.Brent Stirton was awarded the Photojournalist Story Award. His sequence of images profiles a rehabilitation centre caring for chimpanzees orphaned by the bushmeat trade in Africa. The director of the centre is seen introducing a newly rescued chimp to others in her care.WPY always has some great snow pictures and this one wins the Behaviour: Mammalscategory. Stefano Unterthiner watches two Svalbard reindeer battle for control of a harem. Watching the fight, Stefano said he felt immersed in \"the smell, the noise, the fatigue and the pain\".Majed Ali trekked for four hours to meet Kibande, an almost-40-year-old mountain gorilla in Bwindi Impenetrable National Park in southwestern Uganda. \"The more we climbed, the hotter and more humid it got,\" Majed recalls. This picture, which shows Kibande as cooling rains begin to fall, wins theAnimal Portraits category.Javier Lafuente's picture shows the stark, straight line of a road slicing through the curves of a wetland landscape that hosts more than a hundred species of birds, with ospreys and bee-eaters among many migratory visitors. The road, constructed in the 1980s to provide access to a beach, divides the wetland in two. The picture wins theWetlands: The Bigger Picture category.Gil Wizen is an entomologist and an expert photographer. This fishing spider is stretching out silk from its spinnerets to weave into its egg sac. Such spiders are common in wetlands and temperate forests of eastern North America. The image wins theBehaviour: Invertebrates category. The Wildlife Photographer of the Year annual exhibition at the NHM opens on Friday, 15 October, before touring across the UK and internationally to venues in Australia, Belgium, Canada, Denmark, Germany, the US and more."}