{"author":"","title":"How many people cross the Channel in small boats and where do they come from?","news_category":"general","content":"The number of people claiming asylum in the UK rose sharply in 2022. More than 166,000 people are waiting for a decision on whether they can remain.An asylum seeker is someone who has applied for protection in another country because they are fleeing persecution - or the fear of persecution. If their application is successful, they are granted leave to remain in the country where they sought refuge. If their application is refused, they can be removed.A migrant refers to someone who has left their country of origin and has not claimed asylum. Some migrants leave their countries for work or study.An illegal migrant is someone who entered the UK illegally (ie without a visa or prior permission) or someone who entered legally but remained in the country after their visa expired.The number of applications - including dependents - reached about 103,000 in 2002, as people fled conflicts in Afghanistan, Somalia and Iraq.Applications then fell sharply, dropping to a 20-year low of 22,600 in 2010. However, numbers rose again throughout the 2010s, as refugees fled Syria <https:\/\/www.bbc.co.uk\/news\/world-middle-east-35806229>.In 2022, more than 89,000 people - with the greatest number from Albania - requested asylum.In the same year, the UK authorities made initial decisions on 29,150 asylum applications and granted some form of protection to 17,747 people - 61%.How many people cross the Channel in small boats?Small boat arrivals accounted for about 45% of asylum applications made in 2022.In total, 45,755 migrants <https:\/\/www.gov.uk\/government\/statistics\/irregular-migration-to-the-uk-year-ending-december-2022\/irregular-migration-to-the-uk-year-ending-december-2022#how-many-migrants-were-detected-arriving-in-the-uk-via-small-boats> crossed the Channel that year, the highest number since figures began to be collected in 2018.In 2022, the highest number of asylum applications came from Albania: nearly 16,000 people, including dependants <https:\/\/www.bbc.co.uk\/news\/explainers-63473022>. Most (67%) arrived on small boats.The government calls Albania a \"safe country\" and has announced measures <https:\/\/www.bbc.co.uk\/news\/uk-63965141> to try to reduce these numbers. The second largest group, with just under 10,900 applications, came from Afghanistan, followed by Iran, Iraq and Syria.Ukrainian refugees are not included in the figures.In March 2022, two legal routes opened for those fleeing the war <https:\/\/www.bbc.co.uk\/news\/60555166> to come to the UK: the Ukraine Family Scheme and the Homes for Ukraine scheme.As at 21 March 2023, 223,000 visas had been issued under the schemes <https:\/\/www.gov.uk\/government\/publications\/ukraine-family-scheme-application-data\/ukraine-family-scheme-and-ukraine-sponsorship-scheme-homes-for-ukraine-visa-data--2>, with 167,600 Ukrainians arriving in the UK.There are separate arrangements for other specific groups <https:\/\/www.gov.uk\/government\/publications\/nationality-and-borders-bill-safe-and-legal-routes-factsheet\/nationality-and-borders-bill-factsheet-safe-and-legal-routes>, such as Afghan refugees and some Hong Kong citizens.Some people wait months or even years for their claims to be considered.In 2021, the average wait in the UK was 15.5 months, according to the Oxford Migration Observatory think tank.In France it was 8.5 months, in Germany 6.5 months and in Austria just over three months.The delay in the UK has created a backlog of more than 166,000 people <https:\/\/www.bbc.co.uk\/news\/uk-64744553>. The prime minister pledged to clear much of this <https:\/\/www.bbc.co.uk\/news\/uk-politics-63966778> by the end of 2023.Only 4% of people who arrived in the UK in small boats in 2021 have had a decision about their application.People are generally not allowed to work while their claim is being processed. If they have been waiting for more than 12 months for an initial decision, they can apply for permission to work. If granted, they can only do jobs on theUK shortage occupation list. <https:\/\/www.gov.uk\/guidance\/immigration-rules\/immigration-rules-appendix-shortage-occupation-list>EU countries allow applicants to work once they have been waiting for nine months <https:\/\/eur-lex.europa.eu\/legal-content\/en\/TXT\/?uri=celex%3A32013L0033>.In the UK, many asylum seekers are housed in hotels, due to lack of other suitable accommodation, at an estimated cost of £5.5m a day.In March 2023, the government announced that three ex-military bases will be used to accommodate several thousand migrants <https:\/\/www.bbc.co.uk\/news\/uk-65107827> in an attempt to reduce costs. The Home Office has the power to remove people who have no legal right to stay in the UK.Returnees include rejected asylum seekers, people who have entered the UK without authorisation, those who have stayed in the country longer than their visa permits and foreign national offenders.In the year to September 2022, there were nearly 35,000 total returns. Of these:The vast majority of enforced returns related to foreign national offenders and almost half (49%) were EU nationals.Of the top five nationalities forcibly returned, four European countries accounted for more than half:Brazil (9%) was the only non-European nationality in the top five. There were 2,192 returns of people who had previously claimed asylum in the UK. Asylum-related returns accounted for 6% of returns of all types in this period.The latest figures show that in 2021, the UK had the fourth highest number of asylum applications in Europe, with only Germany, France and Spain receiving more.Taking into account its overall population, the UK received 87 asylum applications per 100,000 people.On this measure, 12 other European countries with populations of more than two million people received more applications than the UK.Some smaller countries - Cyprus, Iceland, Malta, Luxemburg and Liechtenstein - also received higher numbers per 100,000.In 2021, the UK authorities made decisions on 22,890 first-time applications and granted 14,690 of them - 64%.France, a country with a population similar to the UK's, made 137,015 decisions, granting 33,875 of them - 25%.Germany made 132,680 asylum decisions, granting 59,850 - 45%. "}