{"author":"","title":"North Korea: What missiles does it have?","news_category":"general","content":"North Korea has continued testing missiles this year, after a significant increase in the number of tests carried out in 2022.It recently launched four missiles in the space of one week, including one that flew about 1,000km.North Korea has tested a variety of ballistic, cruise and hypersonic missiles. Hypersonic missiles fly at several times the speed of sound and at low altitude, to escape radar detection.In February, a dozen intercontinental ballistic missiles (ICBMs) were shown at a military parade in Pyongyang. <https:\/\/www.bbc.co.uk\/news\/world-asia-64577925>Also seen was a new ICBM launcher, which some analysts say appeared designed to work with a solid-fuel missile. These can be launched more quickly than liquid-fuelled ones.North Korea tested a record number of missiles in 2022, including ones capable of reaching US territory.In November last year, an intercontinental ballistic missile <https:\/\/www.bbc.co.uk\/news\/world-asia-63672399> was tested at a high angle, short-range trajectory. Launched at a lower trajectory, this same missile could have reached the US mainland, according to the Japanese government.Images from North Korean state media of Kim Jong-un with his daughter at the launch appear to show it was the Hwasong-17 - or possibly a modified version of it.Unveiled in October 2020, the missile is believed to have a range of 15,000km or more, and could potentially carry three or four warheads, rather than only one.Several earlier attempts to launch the Hwasong-17 are thought to have failed, althoughit may have been used in a test carried out in March 2022. <https:\/\/www.38north.org\/2022\/04\/north-koreas-march-24-icbm-launch-what-if-it-was-the-hwasong-17\/>In October last year, North Korea fired another type of missile which flew over Japan - thought to have been the intermediate-range Hwasong-12. This can travel up to 4,500km - putting the US island of Guam in the Pacific within range.North Korea has also been testing the Hwasong-14 ballistic missile with a range of 8,000km - although some studies suggest it could travel as far as 10,000km, making it capable of reaching New York.And there is the Hwasong-15 missile, which is believed to have a range of 13,000km, putting all of the continental US in its sights.The unveiling of the new missiles appeared to be a message to the Biden administration of the North's growing military prowess, say experts.\"North Korea has been testing missiles with longer and longer ranges,\" says Joseph Byrne, research fellow at the Royal United Services Institute.\"It could be the precursor to it testing another nuclear warhead, which has been predicted for some time,\" he adds.In March 2021, it carried out a launch of what it called a \"new-type tactical guided projectile\", which it said was able to carry a payload of 2.5 tons - so capable in theory of carrying a nuclear warhead.Analysts at the James Martin Center for Nonproliferation Studies told Reuters that it appeared to be \"an improved variant\" of a previously tested missile, the KN-23.The last time North Korea tested a nuclear bomb was in 2017. The explosion at its Punggye-ri test site had a force, or \"yield\", of between 100-370 kilotons.A 100 kiloton bomb is six times more powerful than the one the US dropped on Hiroshima in 1945.North Korea claimed this was its first thermonuclear device <https:\/\/www.bbc.co.uk\/news\/world-asia-41139445> - the most powerful of all types of atomic weapon.However, North Korea may now be aiming to test a smaller type of nuclear warhead with similar explosive force, according to Mr Byrne.\"It seems they are now testing a new capability - a miniaturised warhead that can be fitted onto a range of missiles, including short-range missiles\" he says.Six underground tests have previously been carried out at Punggye-ri. However, in 2018 North Korea saidit would shut the site down <https:\/\/www.bbc.co.uk\/news\/world-asia-44094740>, because it had \"verified\" its nuclear capabilities.Some of the tunnels into the site were subsequently blown up in the presence of foreign journalists. However, North Korea did not invite international experts to verify if it had been put beyond use.Satellite images released in 2022 suggested work to renovate Punggye-ri <https:\/\/www.bbc.co.uk\/news\/world-asia-60598235> had started.Any future nuclear testing at the site would breach resolutions from the United Nations Security Council.In 2018, North Korean leader Kim Jong-un made a promise to then-US president Donald Trumpthat North Korea would destroy all its nuclear material enrichment facilities <https:\/\/www.bbc.co.uk\/news\/world-asia-47082860>.However, the UN's atomic energy agency, the IAEA, says satellite images suggest that North Korea had restarted the reactor which makes its weapons-grade plutonium.In September 2022, IAEA chief Rafael Grossi said there were signs that a test site at Punggye-ri was open again. In March this year, Mr Grossi said that activity hereas well as at Yongbyon was \"deeply regrettable.\" <https:\/\/www.iaea.org\/newscenter\/statements\/iaea-director-generals-introductory-statement-to-the-board-of-governors-6-march-2023>The IAEA has not had physical access to North Korea's nuclear facilities since April 2009.Read more from Reality Check <http:\/\/www.bbc.co.uk\/realitycheck>Send us your questions <http:\/\/www.bbc.co.uk\/news\/uk-41928747>"}