{"author":"","title":"Charles Bronson parole hearing: Son says he has 'not done himself any favours'","news_category":"general","content":"Charles Bronson, one of the UK's longest-serving prisoners, has \"not done himself any favours\" during his parole hearing, his son has said.The 70-year-old, who is currently at HMP Woodhill in Milton Keynes, has been in prison for much of the last 50 years.A Parole Board panel is deciding whether he can be released. His son George Bamby, who lives in Devon, said: \"I think he deserves a chance to prove himself.\"Luton-born Bronson is being held at a specialist close supervision centre in the prison.Three parole judges - who have not been publicly named - are considering his case at HMP Woodhill while members of the press and public watch proceedings on a live stream from the Royal Courts of Justice in central London.Speaking to the BBC, Mr Bamby said: \"I'm not sure he has done himself any favours during the parole hearing with swearing and cursing.\"But Charlie is sat there in front of three people there in prison, authority figures again, and every time he sits down with them he is promised this and he is promised that and I think he's just so frustrated and fed up with the system.\"I think it is just pure frustration with Charlie - he's been in so long.\"\"He thinks they are making an idiot out of him and just won't ever let him out.\"Mr Bamby said his father had \"been a really naughty boy over the years and he has done some really bad things and I think he should have been locked up for a long time\".\"Having said that, I don't think he should have been locked up for 49 years. There are a lot of murderers, child killers and all sorts of people walking the streets.\"He's never murdered anybody, he's never hurt a woman or a child. He has been violent in prison - the majority of the violence he has done in prison has been against the system and against authority figures.\"He said his father had \"not been in any trouble\" in recent years and \"deserves to get out\".\"He is 70 years old now, he is an old man, he wants to get out and do his art work. He is not going to be a harm to anybody,\" he added.Bronson's first conviction was in 1974 when he was 21 and was jailed for seven years for robbery, aggravated burglary, assault with intent to rob and possession of a firearm.Born Michael Peterson, he changed his name to Charles Bronson in the 1980s as an alias dreamed up when he went into boxing.Bronson has become notorious for attacks on prison staff and other inmates.In 1975 he attacked a fellow prisoner with a glass jug and in 1985 he carried out a three-day rooftop protest.In 1994, Bronson held a prison librarian hostage and demanded an inflatable doll, a helicopter and a cup of tea as ransom.Four years later, he took three inmates hostage at Belmarsh Prison in London.Then 12 months on, he took a prison education worker hostage for 44 hours at HMP Hull and was sentenced to a discretionary life term, with a minimum of four years.Bronson - who changed his surname to Salvador in 2014 - is the second inmate in UK legal history to have his case heard in public after rules changed last year in a bid to remove the secrecy around the process.The third and final day of the proceedings will take place behind closed doors on Friday so confidential details can be discussed.The Parole Board will then consider whether Bronson should remain in prison, with a decision due at a later date.Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}