{"author":"By Rick Kelsey","title":"Leasehold first-time buyers: 'We're trapped in our own house'","news_category":"general","content":"\"I just want to own my own home.\"Ashleigh Wilson, who's 27, thought she'd achieved that dream when she bought a place in Knowsley, Merseyside, four years ago.\"I came to view the show home with my mum and I just fell in love with it.\"Four years on, she's in a home no-one will buy because of the strict rules on her lease - which charge her fees and stop her changing her floor tiles.A leasehold is when you own the right to live in a building but don't own the bricks or the ground it sits on.Now there's a consultation by the Law Commission <https:\/\/consult.justice.gov.uk\/law-commission\/commonhold\/> on whether to scrap leasehold flats and houses.More than six million properties in England and Wales are leasehold, according to the Leasehold Knowledge Partnership.And just under 40% of new-build homes sold in the last two years have been leasehold, the group says.Ashleigh was told that after three years she would be able to buy the freehold from the developers.A freehold is when you own the house outright, including the ground beneath it.But the freehold was sold on by the developers to an overseas investor.When she called the investor Ashleigh was told that buying the freehold was no longer an option.\"The issues with selling the house are the fees,\" Ashleigh tells us, frustrated at being stuck in a home she bought for £200,000 that's now worth much less.\"I pay an extra £800 a year for ground rent and service fees.\"And these fees have been rising.Although she can take the freeholder to a housing tribunal, freeholders know they have the cash to fight against leaseholders, who often don't.\"If I could go back in time I definitely wouldn't buy this house.\"I feel I am essentially renting a property with the responsibility of owning a property.\"The problem got so bad for many first-time buyers, the National Leasehold Campaign <https:\/\/www.facebook.com\/groups\/786983251448976\/> was set up.Backed by a group of MPs, it now hopes to give people stuck in Ashleigh's situation a way out.\"I want to have the freedom back to decide what I do.\"The Law Commission, which recommends changes in the law to government, is asking people if they'd like to move to the Scottish system of commonhold.Commonhold is when you communally own a building and have more say on how money is spent.The Home Builders Federation, which represents developers, disagrees with the proposals and thinks leasehold still has a place.David O'Leary from the group told us: \"By and large, leases are fair and reasonable and have ground rents that don't affect a property's value.\"He admits there are instances where leases have been created that are unfair, but believes they can be changed.\"Most responsible developers are going back and try to work with the freeholder and leaseholder to fix the problem.\"Harry Scoffin, 24, works for a charity that helps people stuck in leaseholds.He thinks first-time buyers are being conned: \"Developers say 'flats to buy', but actually you cannot buy it, you are only buying a lease.\"He wants people to push for the Scottish system of commonhold, saying it gives people more power over fees.\"Stay renting and push for commonhold, we cannot have leasehold anymore.\" Rob Godfrey, from the law firm Simpson Millar, says anyone thinking of buying a leasehold property should go through the contents on the lease with a solicitor to understand what is expected of them.He also says it's important buyers understand what the risk and downsides are if they don't comply with the lease.\"If you have a dispute in so far as the freeholder is concerned, first all you need to take some legal advice. Secondly you need to consider some form of direct engagement with them,\" he tells Newsbeat.\"There are alternatives to litigation - such as mediation. There are the land tribunals who can determine disputes which exist between the parties.\"In the event neither party is satisfied with the result you can go through the appeal process.\"Follow Newsbeat on Instagram <https:\/\/www.instagram.com\/bbcnewsbeat\/>, Facebook <https:\/\/www.facebook.com\/bbcnewsbeat\/> and Twitter <https:\/\/twitter.com\/BBCNewsbeat>.Listen to Newsbeat live <https:\/\/www.bbc.co.uk\/sounds\/play\/live:bbc_radio_one> at 12:45 and 17:45 every weekday on BBC Radio 1 and 1Xtra - if you miss us you can listen backhere <http:\/\/www.bbc.co.uk\/programmes\/b006wkry\/episodes\/player>."}