{"author":"","title":"House prices: Rise in Wales more than rest of UK","news_category":"general","content":"House prices in Wales rose more than any other nation or region of the UK over the past year, according to new figures.Figures for 2021 by mortgage provider Halifax showed prices in Wales increased on average by 14%.That was more than in every region of England, as well as in both Scotland and Northern Ireland.Halifax also ranked UK \"hotspots\", with Swansea at 12 and prices up 15.5%, bringing the city average to £211,950.Land registry figures <https:\/\/www.gov.uk\/government\/statistics\/uk-house-price-index-for-october-2021\/uk-house-price-index-summary-october-2021> up to October also found that Wales saw the highest rise over the past year, which they put at 15.5%The English region with the biggest rise was Yorkshire and the Humber, with 10.3%. In Scotland there was a 8.8% increase and Northern Ireland, 7.6% in the past year.Figures by Halifax showed that Taunton in Somerset topped the UK \"hotspots\" list overall. There price rises went up 21.8%, with the average house costing £315,759.London saw a fall in prices by 0.6% taking average house prices to £554,684, equating to a fall of £3,588.Nowhere in London appeared in the top 20 hotspots list. The London area with the highest growth was Enfield, where the average house price went up by 6.8% to £512,135.Westminster in central London recorded the biggest fall of any area, with average house prices there down by 6.9%.Halifax's managing director Russell Galley said: \"It is rare that no London boroughs appear amongst the areas of highest house price growth but that is the case in 2021.\"This shift echoes what we have seen from home-buyers over the last year - less focus on major cities and more demand in the suburbs and further afield.\"In August, another poll by the property website Rightmove also showed Wales had the biggest house price rise in the UK.The Rightmove report said there had been a 2.3% rise in the past month alone and a 10.9% increase year-on-year across Wales.Rightmove's director of property data Tim Bannister said the August figures showed \"how the property market in Wales remains robust, seeing the largest monthly and yearly increase in average asking prices for property\".\"This is driven by many factors - including the rise in the number of city buyers inquiring for homes in villages or near the coast, compared to before the pandemic, in the search for sea and space.\"He added that Saundersfoot and Tenby in Pembrokeshire were among the most popular seaside locations.\"Wales is filled with beautiful and varied locations to live, and with working from home now a longer-term option for many, this has opened new doors for buyers,\" he said."}