{"author":"By Liam Evans","title":"Ukraine: Woman's journey from teacher to refugee in three weeks","news_category":"general","content":"This video can not be played'It's scary, I don't know what will happen next for my family'A little under three weeks ago, 26-year-old Oleksandra was an English teacher in Ukraine.She now finds herself in north Wales, a refugee who has fled from war. It took her four days to make the gruelling journey from Zaporizhzhia, a city in south east Ukraine, to Anglesey where she is now living with family.She made the hard decision to leave her mum and grandmother behind, who live with no electricity and limited supplies.As Oleksandra adjusts to life in Wales, she says she does not know when she will be able to return home and see what is left of her hometown.Tensions had been building for months, with Russia accumulating troops around the border, before they invaded on 24 February.Anticipating war, Oleksandra had applied for a UK visa earlier in the month and decided to leave and join her family in Brynteg, Anglesey, just before.Leaving Zaporizhzhia, she said she \"understood, this is war, this is it\", adding: \"It was really hard for me as I didn't want to leave my family.\"But they rooted for me, they said, 'if not you then who?'\"They wanted to get me out of Ukraine and that's how I ended up here.\"She is currently living with Gwenda and John Thompson, whose son married Oleksandra's aunt eight years go.\"When we got the call we didn't know where Oleksandra was, only that she was on her way to the border with Poland but no-one could get in touch with her and we didn't know what she was facing,\" said Gwenda.\"But she got to Lviv and across the border to Poland and then she got a flight to Manchester.\"In all it took her four days to get to Anglesey, and Mrs Thompson added: \"We're just pleased we can help and do something for the family - we'd do it all again if her family could come over and leave Ukraine in the future.\"They are strong, brave, frightfully brave\". Mrs Thompson explained how Oleksandra's mother and grandmother did not want to leave their home country.\"She says if she is going to die then she will die on home soil and be buried with her husband,\" she added.Reflecting on her journey to leave the country, Oleksandra said she felt \"exhausted and confused\".\"It was sad, it was frustrating because I didn't understand why, why should we leave, why is it happening?\" she said.\"I have to say I got lucky getting out, but now it is madness there, but I won't complain.\"Oleksandra now spends her days helping the couple take care of their horses and trying to speak with relatives - often over video call - who are in darkness.Though she is now safe, the life she has here in Wales is a world away from what it was just a few days ago.She is \"extremely frightened\" for her family. \"I'm desperate to do something but I'm helpless although not hopeless, but I feel extremely useless.\"As she scrolls through photos of her life before fleeing to Wales, Oleksandra said she did not know when or if she will be able to return.\"I don't know if it will get bombed or if something will happen to my mum and grandmother.\"I hope the situation will improve and I will come to them, so they won't have to be refugees.\"However, Oleksandra believes \"in our army and our people\", adding: \"This isn't just a physical war, it's a war of values, of our existence.\"We will stand still and we will win.\""}