{"author":"By Tom Edgington","title":"UK visas: How does the points-based immigration system work?","news_category":"general","content":"The government is adding five construction occupations to its list of jobs for which it's easier to get a visa to come to the UK.The occupations include bricklayers, plasterers and carpenters.In the year ending June 2022, just under 1.1m people came to the UK and an estimated 560,000 departed <https:\/\/www.ons.gov.uk\/peoplepopulationandcommunity\/populationandmigration\/internationalmigration\/bulletins\/longterminternationalmigrationprovisional\/yearendingjune2022>.That means net migration (the difference between people arriving and leaving) stood at just over 500,000.This represents a record high and an increase of 331,000 on the previous year (ending June 2021).The Office for National Statistics (ONS), which compiles the figures, said the rise was driven by non-EU migrants, specifically students, and the resumption of post-pandemic travel.It also said the war in Ukraine, the resettlement of Afghans and the new visa route for Hong Kong British nationals had all contributed.In October 2022, Home Secretary Suella Braverman said her \"ultimate aspiration\" was to reduce net migration to the UK to the \"tens of thousands\".Official immigration data gathering was disrupted during the Covid-19 pandemic. Estimates from June 2020 are based on different data sets and are not comparable with earlier years.Before Brexit, European Union and UK citizens had the freedom to live and work in any other EU country without needing a work visa.However, this freedom of movement came to an end on 1 January 2021.In the year ending June 2022, net EU migration was -51,000. This means more EU nationals left the UK than arrived.Net migration of non-EU nationals, on the other hand, was +509,000.There was a net increase of +45,000 British nationals. The ONS said this figure included some British nationals arriving from Hong Kong as well as those returning during the pandemic.Many Brexit supporters - including Ms Braverman - say leaving the EU has given the UK more control over migration policy.Sir Keir Starmer has ruled out restoring freedom of movement and says the UK must wean itself off \"immigration dependency\" <https:\/\/www.bbc.co.uk\/news\/uk-politics-63707941>.However, the CBI - the UK's biggest business group - says immigration is needed to solve worker shortages <https:\/\/www.bbc.co.uk\/news\/business-63697458> and boost economic growth.Most people wanting to work in the UK have to apply for a visa through a points-based system <https:\/\/www.gov.uk\/guidance\/new-immigration-system-what-you-need-to-know#visa-application-process> (PBS).A points system was first adopted by the Labour government in 2008 and applied to migrants from non-EU countries. It was then overhauled by the Conservatives after the Brexit vote.The current PBS - which covers EU and non-EU migrants - was launched at the end of 2020 <https:\/\/www.bbc.co.uk\/news\/uk-politics-55133506>. Applicants need enough points to qualify for a skilled worker visa <https:\/\/www.gov.uk\/skilled-worker-visa>.A total of 70 points is required. Attributes like: English skills; qualifications; and being under 26 all count towards the total.Having an offer of a skilled job from an approved employer and being able to speak English would give 50 points for example.A further 20 points would also be awarded if the applicant's job pays at least £25,600 a year.There are some exceptions. Certain jobs in health or education, for example, will still award 20 points even if the salary is less than £25,600.The standard fee for a skilled visa is usually between £625 and £1,423.If granted, the visa will last for up to five years before it needs renewing.A \"shortage occupation list <https:\/\/www.gov.uk\/government\/publications\/skilled-worker-visa-shortage-occupations\/skilled-worker-visa-shortage-occupations>\" exists to help employers fill certain roles. These jobs have a lower salary threshold, making it easier for applicants to gain the required number of points.Jobs currently on the list include:The government updates the list based on advice from an independent group of experts - called the Migration Advisory Committee.At the Budget in March 2023, the government accepted the committee's advice to add five construction sector occupations to the list:The government is also having a wider review of the list, which will conclude in autumn 2023.Temporary work, like fruit picking, is covered by a seasonal worker visa <https:\/\/www.gov.uk\/seasonal-worker-visa>.Up to 40,000 of these visas are issued each year. However, the National Farmers' Union argues this number is too small andneeds to increase to 70,000 <https:\/\/www.nfuonline.com\/updates-and-information\/nfu-horticulture-mid-season-labour-survey-results\/>.Workers who are granted a visa must be paid at least £10.10 an hour.There is no limit on international students coming to the UK under the student visa application system <https:\/\/www.gov.uk\/student-visa>. However, Ms Braverman has suggested she wants to reduce the number of partners and children who come to the UK with students.Students who have already completed their degree can stay in the UK for two years under agraduate visa <https:\/\/www.gov.uk\/graduate-visa>."}