{"author":"","title":"Cornwall sees highest number of water pollution incidents","news_category":"general","content":"Cornwall had the highest number of serious water pollution incidents in England last year, data has revealed.There were 18 category 1 (most serious) or category 2 cases reported to the Environment Agency between April 2020 and March 2021.One campaign group described it as a \"shocking indictment\" that showed companies \"putting their profits before the protection of the environment\".The Environment Agency (EA) said it was working to improve the situation.In comparison, Devon saw 10 serious cases of water pollution reported to the EA last year.But over the last 11 years, Devon has seen a higher total number of incidents than its neighbouring county.Between March 2010 and 2021, Cornwall recorded 136 cases, compared to Devon's 198.Across England, water pollution incidents are on the rise. <https:\/\/www.bbc.com\/news\/uk-england-57804260> In the year from March 2020 to March 2021, there were 325 serious incidents logged with the EA, up 23% on the previous 12-month period.For many groups and campaigners in the South West, it's a problem that needs tackling head-on.The Plymouth River Keepers project started following a serious pollution incident in 2016 when money paid by South West Water in damages was redirected to the group as a form of reparations.Since then, the team has sought to improve water quality in the north-west region of Plymouth, a largely urban area which boasts \"pockets of ancient woodland,\" says project manager Lucy Morris.\"One of the most important things that we need to do in this project and more broadly is to understand the health of our environment and to do that we need data,\" she told the BBC.The group runs a citizen science scheme, which encourages residents to collect water samples from their local area and submit their findings.That data is added to a publicly-available database and helps the team to identify problem areas.\"It's really important to keep these streams clean,\" Ms Morris stresses.\"They're a very important habitat for a whole range of species and they're also an incredibly valuable resource for local communities as a place where they can come and enjoy nature.\"A report published by the EA on Tuesday shows South West Water was responsible for three serious pollution incidents in 2020.The company said it was \"disappointed\" with aspects of its performance and was investing £150m in its \"largest environmental programme for 15 years\".\"We take our guardianship of the natural environment very seriously and want to do more,\" director of waste water services Iain Vosper said.The water provider also recently agreed to replace a sewage pipe <https:\/\/www.bbc.com\/news\/uk-england-cornwall-57742886> that repeatedly leaked raw sewage into the Gannel estuary near Newquay.But the environmental charity Surfers Against Sewage says further action is needed.\"These incidents are something we're all too familiar with,\" says chief executive Hugo Tagholm.\"It's a shocking indictment of how those habitats are being treated, so sadly we're not surprised to see it because it's the same old story from an industry that is making a lot of money and putting their profits quite often before the protection of the environment.\"The most common sources of water pollution incidents in the South West are either crude sewage, slurry or dilute slurry, according to the EA.Philip Ward, a dairy farmer near Liskeard in Cornwall, said despite assumptions, many farmers want to play their part.\"I think some of the criticism doesn't keep up with what is going on in the industry,\" he said.\"I think everybody is trying to do the right thing. There are real constraints on getting the funding to do exactly what is needed.\"Mr Ward has been able to add a roof to his cattle feeding yard through the help of local initiatives - keeping the rain away from the slurry reduces its chance of seeping into local rivers.\"Not polluting means we're not wasting, which means things are going to be more profitable for the farmer, so it's better for the farmer and it's better for everybody else,\" he said.The Environment Agency said it was \"working with government, the water industry, farmers and others to improve water quality in our rivers and we are making the case for the funding we need to protect the environment in England\".Follow BBC News South West on Twitter <https:\/\/twitter.com\/BBCSpotlight>, Facebook <https:\/\/www.facebook.com\/bbcspotlight> and Instagram <https:\/\/instagram.com\/bbcspotlight>. Send your story ideas to spotlight@bbc.co.uk <mailto:spotlight@bbc.co.uk>."}