{"author":"","title":"Christopher Alder death: No timescale for police probe","news_category":"general","content":"Police investigating the discovery of Christopher Alder's body in a mortuary - 11 years after his family thought they had buried him - say they do not know how long the inquiry will take.The former paratrooper, 37, died in police custody in Hull 13 years ago.His body was found in a mortuary where it was thought the body of a woman, Grace Kamara, was being kept.South Yorkshire Police said that, given the complexity of the inquiry, it was hard to say how long it would last.The force started its investigation on Monday following a request from the Chief Constable of Humberside Police, Tim Hollis.It is believed the body of Mrs Kamara was buried in Mr Alder's place.She is understood to have died from natural causes in 1999 but her burial was delayed and finally scheduled for last week. It was at this point the apparent mix-up emerged.Det Supt Richard Fewkes said: \"Given the complexities, the investigation will be detailed, thorough and will need to take account of events over a 13-year period.\"For this reason, and at this stage, it is difficult to estimate how long the investigation will take.\"Family liaison officers continue to maintain contact with relevant family members and their representatives with regard to the very sensitive issues of identification.\"Earlier this week, Mr Hollis said: \"It is really important we do find out exactly what the facts are - whose body is in that grave?\"After the apparent mix-up emerged, Mr Alder's sister Janet told the BBC: \"I'm just in total shock, I really cannot believe that after all we've been through, after all the family's been through ... there can be so much incompetence.\"It just feels like contempt. It feels like adding insult to injury when you're trying to move on with your life.\"Police were accused of \"unwitting racism\" over the 1998 death of Mr Alder, who choked to death in a police station after he was arrested at Hull Royal Infirmary for an alleged breach of the peace.He had been injured in a scuffle outside a hotel in Hull city centre before being taken to the hospital for treatment.In 2002, five Humberside Police officers went on trial accused of manslaughter and misconduct in public office. They were cleared of all charges at Teesside Crown Court."}