{"author":"","title":"Charles Bronson bemoans video court hearing like 'Star Trek part'","news_category":"general","content":"Prisoner Charles Bronson has complained about appearing in court by video link - saying he felt like he had \"a part in Star Trek\".The 65-year-old appeared on screen at Leeds Crown Court from Frankland Prison charged with assaulting a deputy prison governor at HMP Wakefield.Describing himself as \"an old fashioned prisoner\" he said: \"I'm not used to all this technology. I don't like it.\"He was told his case was listed for trial at Leeds on 12 November.Bronson, who appeared in court under the name Charles Salvador, is accused of attempting to cause grievous bodily harm with intent to deputy governor Mark Doherty on 25 January.Yorkshire breaking news: Inquiry after fatal shooting; Row over plaque marking 'first modern lesbian' <https:\/\/www.bbc.co.uk\/news\/live\/uk-england-leeds-44980443>When asked to enter a plea, he addressed Judge Guy Kearl QC and said: \"I feel like I'm only standing here to save money.\"I should be in your courtroom today, as a man, respectful, honourable and facing what I'm facing.\"But talking to you by a TV screen I feel like I've got a part in Star Trek.\"He told the judge: \"I still believe British justice is the best on the planet and that's coming from a man who's been in prison all his life.\"He added: \"You should have had me in that court room today so I could travel - look out of the prison van at all the countryside, the animals, the people and buildings.\"You've denied me that today and you should be ashamed of yourself.\"Continuing to address the court, Bronson, who is serving a life term for the robbery and kidnap, said: \"I've been locked up in prison for four-and-a-half decades.\"I've never used a computer. The last time I had a mobile phone it was as big as a house brick.\"During the hearing he declined an invitation from the judge to sit down, replying: \"Thank you, your honour.\"That's a lovely wig you've got on there. Do they do them in black?\"After discussions between lawyers and the judge during the 10-minute hearing, Bronson looked at his watch and said: \"Come on - it's nearly dinner time. It's fish and chips today.\""}