{"author":"","title":"HRT shortage UK: Davina McCall says crisis is ridiculous","news_category":"general","content":"This video can not be playedWATCH: Menopause made me think I had a brain tumour or Alzheimer's - Davina McCallThe crisis in hormone replacement therapy in the UK is \"ridiculous\" and has to be fixed immediately, TV presenter Davina McCall has said.McCall - who has campaigned to raise awareness of the menopause - said not getting HRT could be life-threatening.\"Why is it taking this long to sort this out?\" she said.The government's Kwasi Kwarteng - who was listening to McCall - said it was \"really good\" that women were talking openly about the menopause and HRT.Earlier this week, the government announced it was rationing supplies <https:\/\/www.bbc.co.uk\/news\/health-61278325> so women would only be able to get three months' worth of certain HRT products at a time. It has also appointed a new HRT tsar to help solve the crisis.Speaking to the BBC's Sunday Morning programme, McCall recalled her own experience of the menopause, saying she felt like she was \"a mush\" when it hit and that she lost her ability to be organised, practical and good at multi-tasking.\"When somebody asked me if I was OK because I'd messed up on a TV programme, I said yes. And then when she shut the door and went away, I just burst into tears,\" she said.\"Because I thought, 'I'm not ok, I think I've got a brain tumour, or I've got Alzheimer's or something - help me'.\"Asked about the so-called 'Davina effect' - the idea that demand for HRT increased after McCall raised awareness in a Channel 4 documentary last year - she said: \"I'm not going to feel bad about that.\"I get really kind of annoyed when people are like, 'well it's Davina's fault'. You know what, we are actually trying to help women sort out their hormones and live a normal, healthy life.\"There were shortages way before that documentary came out last year. Apparently there is a surplus of hormones in Europe. Why is it taking this long to sort this out?\"The 54-year-old - whose follow-up documentary on the menopause will air on Channel 4 on Monday - added: \"It's a medicine. If there was a shortage in insulin or another drug that women or men had to take, that would get sorted out immediately.\"It can be life-threatening not getting women's HRT. But yes, I do want to get more women on HRT as it would benefit the NHS in a huge way. This has to get sorted. It is ridiculous.\"HRT is a treatment designed to relieve symptoms of the menopause. The shortage is thought to affect about a million women in the UK, with many left suffering from symptoms andsome even turning to the black market. <https:\/\/www.bbc.co.uk\/news\/uk-wales-61264110>It is not clear why there is currently a shortage in the UK, but some pharmaceutical companies have blamed it on increased demand. Prescriptions for HRT in England more than doubled since 2017.The Covid pandemic has also caused issues, the British Menopause Society has previously said. <https:\/\/thebms.org.uk\/news\/british-menopause-society-update-on-hrt-supply\/>But HRT is not the only type of medicine that has been in short supply - with a survey showing supply chain problems <https:\/\/www.bbc.co.uk\/news\/health-61227712> are a daily issue for a majority of pharmacies. Pharmacists have called for a simple law change that would allow them to make medicine swaps, saying it would help solve the HRT issue.The Department of Health and Social Care said demand for HRT had risen by 38% in the past seven years, as access had been extended, but most of the 70 products available in the UK remained in good supply.Business Secretary Kwasi Kwarteng - who was a guest on BBC Two's Sunday Morning show straight after McCall - said: \"Even only five, 10 years ago there was a taboo about issues such as the menopause, hormone replacement therapy.\"And it's really good we live in a culture and a society where we can talk about these things more openly,\" he said.Earlier this week, Health Secretary Sajid Javid said: \"I want to reassure women I have listened to their concerns and will not hesitate to take decisive action to ensure they can access the HRT they need.\"We will leave no stone unturned in our national mission to boost supply of HRT - and this next step will ensure women across the UK will be able to reliably access this vital medication and maintain this lifeline for millions who need it.\"This video can not be playedHRT: 'I've heard of women taking their own lives'Do you have any questions about HRT or the menopause? Please email: haveyoursay@bbc.co.uk <mailto:haveyoursay@bbc.co.uk?subject=Menopause61290934>.Please include a contact number if you are willing to speak to a BBC journalist. You can also get in touch in the following ways:If you are reading this page and can't see the form you will need to visit the mobile version of theBBC website <https:\/\/www.bbc.co.uk\/news\/have_your_say> to submit your question or comment or you can email us atHaveYourSay@bbc.co.uk <mailto:Haveyoursay@bbc.co.uk>. Please include your name, age and location with any submission."}