{"author":"","title":"Covid-19: Essex boy's lockdown art project auctioned for charity","news_category":"general","content":"A 12-year-old boy's lockdown painting project featuring collaborations with 250 artists from around the world is being auctioned for charity.Noah, who has hydrocephalus, epilepsy and cerebral palsy, began painting on cardboard at home in Dedham, Essex, last March.His father posted on Instagram, asking artists to finish the pictures and the project went viral.The resulting art was published in a book and displayed in a gallery <https:\/\/www.bbc.co.uk\/news\/uk-england-essex-54673977>.More than 200 pieces will be sold on eBay to raise money for Colchester and Ipswich Hospitals Charity.Noah's father Nathan Jones said it was a great way to thank the doctors who had \"played a huge part\" in Noah's life.He said the auction was the culmination of a year-long project which he \"never could have imagined\" would be so successful.\"We just started this as a way to pass time but it turned into something very special,\" he said. \"We have crammed so much into a year that would have otherwise been quite bleak.\"Artists from the UK, Colombia, Italy, Spain, France, Sweden, Germany, the US and Australia all collaborated with Noah onthe project <https:\/\/www.instagram.com\/background_bob\/?hl=en>.Mr Jones sent the backgrounds that his son had created to the artists, who finished them and posted them back.The family decided to make the art into a book, called Background Bob, and the work was exhibited atFirstsite gallery in Colchester <https:\/\/firstsite.uk\/event\/background_bob-and-his-amazing-friends\/>.They have already raised nearly £20,000 for the charity through book sales and donations.\"We hoped we would raise about £500 so the amount we are looking at now is just incredible,\" Mr Jones said.Mr Jones says he is planning to bid on several of the pieces of art himself, as the family are huge street art fans.\"There are definitely some pieces that, when they came through the post, I thought 'I really don't want to sell this one' so I will be bidding on a few of them to try and keep them in the family,\" he said.\"I feel like we have created a little piece of history over lockdown and hopefully the art is a reflection of a moment in time, that will become a bit collectable.\"The auction will begin at 18:00 GMT on Sunday 28 February and will run for a week. Mr Jones said anyone who would like to bid should search for 'Background Bob' on eBay.Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}