{"author":"By Matt McGrath","title":"Climate change: Sport heading for a fall as temperatures rise","news_category":"general","content":"Global sport faces major disruption from climate change in coming decades, according to a new analysis.By 2050, it's estimated that almost one in four English football league grounds can expect flooding every year.But tennis, rugby, athletics and winter sports will also face serious challenges from the impacts of rising temperatures, the author says.The study finds that sports leaders are, in the main, failing to address the issue seriously.While the Covid-19 pandemic has disrupted sports as much as any other aspect of social life, many experts believe that this is just a dress rehearsal for the long-term impacts on sport of a world that's way too hot.Extreme weather events, related to rising temperatures, have already disrupted some of the world's most high-profile sports in recent years.A typhoon, which wreaked havoc in Japan last year, also affected fixtures at the Rugby Union World being held there.Smoke from bush fires stopped play at the Australian Tennis Open at the start of this year.These and many other instances are a foretaste of the future, according to this new study compiled by academic and author David Goldblatt.As football slowly recovers from the coronavirus crisis, his analysis shows that 23 of 92 English football league clubs will face partial or total annual flooding of their stadiums by 2050.In the current Premier League, the home grounds of Southampton, Norwich, Chelsea and West Ham face a similar threat.Cricket faces huge challenges globally as temperatures rise in places like India, Australia and the West Indies.Venues in Adelaide and Perth will see a 60% increase in days with temperatures over 40C over the next decade.In golf, one in three British Open courses will be damaged by rising sea-levels, the report says.Winter sports also face an uncertain future. Researchers say that of the 19 venues that have already hosted the Winter Olympics, just 10 will be able to hold them by 2050.But as well as showing the likely impacts of climate change on sports, the new study also looks at the contribution that the sporting industry makes to carbon emissions.The author says that the scale of CO2 is equivalent to a country like Bolivia at the low end but as large as a country like Spain on the high end.The estimations are likely an underestimate as they exclude the global sportswear and sports broadcasting industries, who have impacts on carbon that are difficult to calculate.Whatever the size of its carbon footprint, the cultural significance of sport gives it a tremendous platform to effect change, says the author.\"Sport may be just big enough to register, in terms of carbon emissions, as a small nation state, or a single megacity, but its own efforts are just a fraction of a percentage point of the world total,\" said David Goldblatt.\"Making a carbon zero world the common sense priority of the sports world would make a huge contribution to making it the common sense priority of all politics,\" he said.While some organisations including the International Olympic Committee and FIFA have signed up to aUN action plan to make sport carbon neutral by 2050 <https:\/\/www.bbc.co.uk\/sport\/50681213>, the majority of sports authorities have not.The International Cricket Council is one of those who have not signed up. Among winter sports, only the ice hockey and skiing federations have joined, \"which makes one wonder what the people in charge of luge and bobsleigh think they are going to be sliding on in the future,\" the report waspishly notes.The report was commissioned by the Rapid Transition Alliance <https:\/\/www.rapidtransition.org\/about\/>, a international group of academics and campaigners who argue for a faster response to climate change.\"A first step would be to bring an end to sponsorship from fossil fuel companies and products promoting fossil fuel intensive lifestyles,\" said Andrew Simms from the group.\"If players also speak out and say they believe clean air and a stable climate matter, millions more will see the possibilities for change. It will not only send a message of hope for the wider world, but it will help to guarantee a planet that is safe for sport.\"Follow Matt on Twitter @mattmcgrathbbc <https:\/\/twitter.com\/MattMcGrathBBC>."}