{"author":"","title":"Black Lives Matter Norwich graffiti painted over by council","news_category":"general","content":"Graffiti supporting Black Lives Matter has been painted over by council workers in a \"hugely regrettable\" move.The work, created by artist Knapple in Norwich, has been completely covered with black paint.The city council revealed contractors covered the message with black paint following an online complaint.It offered to recommission the artist to restore the work on the Pottergate underpass.The graffiti, including the words \"Norwich against racism\" and \"all cops are accountable\" was painted on Monday following thedeath of George Floyd in US police custody. <https:\/\/www.bbc.co.uk\/news\/world-us-canada-52928304>Posting pictures of her work earlier this week, artist Knapple said: \"If you're not part of the solution, you're part of the problem.\"She added: \"We are all accountable.\"Photographer Joss Sibbering took pictures of the graffiti shortly after it was completed, but said he was disappointed to see someone had already scrawled the word \"lies\" on it.He had been \"filled with feelings of hope, love and strength\", before he noticed that, he said.However, on Thursday he went back to find it covered with black paint.\"It looked like it was done out of spite, anger and hate\", he said.Members of Norwich Pride also assumed someone did not share the artist's sentiment and wrote on Facebook: \"We're so appalled to see Ruth Knapp's powerful #blacklivesmatter graffiti painted over, adding to the pile of acts that demonstrate why we have such a way to go on eradicating racism and hate.\"Dozens of people replied saying the \"vandalism\" was \"mindless and disgusting\".However, the city council revealed its own contractors painted over the work after a complaint went through an automated system to them.\"This is hugely regrettable, and we were deeply disappointed when we heard it,\" a spokeswoman said.\"We do not believe the mural to be 'offensive graffiti'.\"This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Knapple said she was not too worried, although she was \"not sure what the contractors were thinking\".\"It's brought more attention to the cause so I'm quite happy,\" she said.The council said it \"would like to recommission the artist to restore the mural\"."}