{"author":"","title":"Gambling: Campaign group wants advert ban","news_category":"general","content":"Adverts for gambling should be banned to protect children, according to a campaign group.Coalition Against Gambling Ads (CAGA) visited the Senedd as part of British tour to raise awareness of the impact gambling has on people's lives.It wants the Welsh government to do more to protect children and support people with an addiction.The Welsh government cannot pass laws on gambling and advertising as it is reserved to Westminster.The UK government is currently reviewing gambling laws.According to the Gambling Commission, nearly 500,000 11 to 16-year-olds in the UK gamble.CAGA said research showed about 55,000 children in the UK have a gambling addiction.In December, the UK government started a wide-ranging review of the Gambling Act 2005, saying it wanted to ensure gambling laws were fit for the digital age.The Welsh government previously said it recognised gambling addiction as a public health issue.Nick Phillips from Swansea has overcome a gambling addiction which left him bankrupt twice and led him to try to kill himself.He now helps others with an addiction and is a member of CAGA.\"During my addiction I had nearly 12 years of going to Gamblers Anonymous here in Swansea and, during those 12 years, I had three significant relapses and gambling advertising had a big part in those relapses,\" he said.\"Whether it was a TV advert or getting offers of free bets online so the enticement to go back into that world were quite prominent, so that's why I say we really want to end gambling advertising because it's not just affecting those with gambling problems, it's everywhere in society.\"I'm a parent of two children who have mobile phones and it would be very easy for them if I wasn't monitoring it to just let things slip and the kids have accessibility to gambling.\"Director of CAGA, Matt Zarb-Cousin said: \"If people want to gamble then they should be able to in a legal and safe environment.\"But I think we need to return to the principle of unstimulated demand - not trying to encourage people to gamble that otherwise wouldn't have.\"Swansea East MP, Carolyn Harris, who is chairwoman of the Gambling Related Harm All Party Parliamentary Group said: \"We're all walking around with casinos in our pockets these days.\"Nobody envisaged that in 2005 when the gambling act was published but the problem has grown exponentially.\"There needs to be an acknowledgement that when you cross the line and it becomes an addiction then it's our moral responsibility to put in place measures to protect the vulnerable.\"She said Wales needed school projects about the danger of gambling and treatment centres paid for by the NHS that offer psychological assessments for people with a gambling problem.The Welsh government said a task and finish group had been set up to \"explore the options for developing new services to support those affected, including the potential for a dedicated NHS gambling service for Wales\".\"We await the outcome of the UK government review into areas such as reform of gambling advertising. This is not a devolved area, but we fully support moves to make it much harder for gambling companies to advertise their services, particularly in places where they could be seen by children and young people,\" it added.The Betting and Gaming Council said its members had a \"zero-tolerance approach to betting by under-18s\".It added: \"Last year, we introduced new rules to further prevent under-18s from seeing betting adverts online.\"It means our members must ensure that all sponsored or paid for social media adverts are targeted at over-25s, unless the website can prove that their ads can be accurately targeted at those aged over 18.\"The UK government has been asked to comment."}