{"author":"","title":"Richard Bacon: 'I think I am an addict'","news_category":"general","content":"This video can not be playedThe presenter opens up to 5 Live's Hooked podcast about his alcohol use.Richard Bacon has said that there are \"probably times I should have gone to rehab\" because of his drinking.Speaking to BBC Radio 5 Live's Hooked podcast <https:\/\/www.bbc.co.uk\/sounds\/play\/p07rngz6>, which focuses on addiction and recovery, the broadcaster said he believes he is an addict.\"We [Bacon and his wife Rebecca] are in a good place at the moment,\" Bacon said, \"but once you have accepted you're an addict to some degree, the danger is always there, isn't it?\"The presenter said he feels he has moved on from what was a difficult part of his past, and described the \"chaos and difficulty and uncertainty\" which his drinking has caused in his life.But he added that he hadn't actually stopped drinking. Describing his relationship with alcohol, Bacon said: \"I find it very hard not to keep going… if I have one drink, I want another, and another.\"I am jealous of people who only have one glass of wine and are content… I just want the journey to keep going.\"Bacon said it wasn't the sad or difficult times which made him want a drink - rather the desire came when things were going well: \"I am almost at my most vulnerable when things are great… I don't use [drink] to numb pain. If I am excited or happy about something I am more likely to go too far.\"Bacon said he's been through periods of drinking where it's been \"dangerous\" and where he has gone missing for a night - although emphasised that's not a place he's in now.In 1998, he was sacked from Blue Peter after he admitted taking cocaine, and admitted on the podcast that there was a definite link between his cocaine use and alcohol.\"When I've been through periods of my life where I have been using cocaine, it's only [after] two or three drinks where I quite fancy that as well.\"The 43-year-old now lives in Los Angeles with his family, and said he had been to a number of different Alcoholics Anonymous meetings. He said he really admires AA, but despite admitting to being an addict, he said: \"I never find that I really want to go\".Bacon revealed he was told to go to a rehabilitation clinic, but \"I didn't feel like I needed to\".In July 2018, Bacon had to be put in a medical coma in Lewisham Hospital, after being taken ill on a flight from the US to the UK. He told the BBC he was\"quite close to death\" <https:\/\/www.bbc.co.uk\/news\/uk-england-nottinghamshire-44916454> for two days after suffering a mystery lung infection.After that, he said he was giving up drinking and now says most of the time he doesn't drink but hasn't stopped entirely.Bacon described a recent trip to Edinburgh when he thought he'd have a couple of drinks, and ended up drinking \"loads of cocktails\".The next morning his wife said he smelt of alcohol, and \"it did feel kind of gross\".He described feeling embarrassed and admitted his current approach i.e. not giving up alcohol entirely, could be \"delusional\" and \"might not be sustainable\".Bacon opened up about his relationship with his wife Rebecca, and the impact his drinking had on her.He said through therapy, he had \"really come to truly realise how important my marriage is to me\", and \"if I'm going to get hammered, and do things I shouldn't do, and go missing\" then it's \"frightening\" for his wife.\"She would like me to do AA all the time, and I just don't, but I have said I will spend more time with our therapist examining my relationship to drink.If you're concerned about addiction, BBC Action Line <https:\/\/www.bbc.co.uk\/programmes\/articles\/1kS7QTDB16PWkywhsXJLzxz\/information-and-support-addiction-alcohol-drugs-and-gambling> has help and support.The latest episode of Hooked, featuring Richard Bacon, is now available on BBC Sounds. <https:\/\/www.bbc.co.uk\/sounds\/play\/p07rngz6>"}