{"author":"By Jordan Davies","title":"Coronavirus: Asylum seeker 'went without food' in lockdown","news_category":"general","content":"A former United Nations worker seeking asylum in Wales says she went without food for a week during lockdown.The woman, who does not want to be identified due to threats in her home country, did not eat so she could afford to feed her children.Asylum seekers receive £37.75 a week plus £5 for a baby under one, and £3 for a child aged between one and three.The Home Office said it has taken \"decisive action\" to look after asylum seekers during the pandemic.The woman, who wishes to be referred to as Khadija, said she was appalled by what asylum seekers - particularly women with children - had to endure during lockdown and said the pandemic has revealed how little support they receive.Despite having to flee violence in her home country, Khadija said her time in Wales during lockdown has been \"the worst period of my life\".She said she found it difficult to contact the NHS when she had coronavirus symptoms due to a lack of information about who to contact, and said asylum seekers in Wales have been \"forgotten about\" during the pandemic.\"For almost two months nobody even bothered to call us,\" she said. \"I couldn't call anybody because I didn't have any mobile credit.\"All the asylum seekers I know were really forgotten, nobody contacted them, nobody asked them if they needed anything, or if they had the symptoms, or if their symptoms had worsened.\"We didn't have much food stock - I was just trying to survive.\"She said she received no information from the Home Office, which has responsibility for asylum seekers.Khadija, who is now receiving the support she needs, said her situation was worsened by inflated prices during lockdown, particularly in local shops.She said lockdown has \"destroyed\" her \"mentally and physically\" and she lost weight going without food to make sure her children could eat.Sisters not Strangers, a coalition of charities which supports asylum seekers, published a report which found women have been exploited, forced to do unpaid work for shelter or enter into abusive relationships to access food and accommodation.Jessica Baker, a family and asylum officer and spokeswoman for Sisters not Strangers, said it was \"totally unacceptable\" for people to go hungry in Wales and said asylum seekers had been \"overlooked\".The organisation is calling for reform so asylum seekers have the same access to housing, healthcare, education and employment as everyone else - and an increase in the allowance they receive.Ms Baker said: \"I think the amount of money that's given per individual or family is just not enough to maintain a family, especially during this time - when places that families or women would usually rely on, such as food banks, charity shops for clothing, [are shut].\"When all that shuts down and your children are growing or you need food to sustain a healthy lifestyle, I think that's really difficult when those support systems were really relied on heavily before.\"BBC Wales has already reported how support for asylum seekers was \"scaled back\" during lockdown <https:\/\/www.bbc.co.uk\/news\/uk-wales-52288202>.The Home Office said it has been providing accommodation and essential living costs to those who would otherwise have been unable to support themselves.It said the weekly cash allowance is reviewed each year and recently had an above inflation increase.The Welsh Government said while asylum accommodation remains the responsibility of the Home Office, it had continued to support seekers during the pandemic.It said it provided a £10m fund for local authorities for emergency accommodation, legal advice to those refused asylum, access to emergency supplies, free school meals and translation of Covid-19 guidelines."}