{"author":"","title":"Donald Trump's 'hatred of sharks' benefits conservation charities","news_category":"general","content":"Donald Trump's alleged hatred of sharks has inspired people to financially support international shark charities.The US president's dislike for the marine animal was revealed last week in an In Touch Weekly interview with adult film actress Stormy Daniels.He reportedly said that he would never give money to shark charities, adding: \"I hope all sharks die.\"Shark conservation groups have since noted an uptick in donations, one with the message: \"Because Trump.\"Charities such as Atlantic White Shark Conservancy and the Sea Shepherd Conservation Society told MarketWatch they had an outpouring of donations. <https:\/\/www.marketwatch.com\/story\/shark-charities-flooded-with-donations-after-trump-says-he-hopes-sharks-die-2018-01-23?mod=mw_share_twitter>\"It can certainly be a challenge to raise money for a species that most people fear,\" Atlantic White Shark Conservancy chief executive officer Cynthia Wilgren told the financial news website. \"We have been receiving donations in Trump's name since the story was published,\" she said.According to Newsweek, someone adopted a 13-foot female white shark over the weekend <http:\/\/www.newsweek.com\/president-trump-hates-sharks-and-now-someone-adopted-wild-great-white-his-name-788805> last spotted off the coast of Mexico in the name of Donald J Trump.Even UK shark conservation groups like the Shark Trust, based in Plymouth, spotted a \"noticeable\" boost to their coffers. A spokesperson told the BBC that \"passionate messages\" came with the donations, but were not fit for publication.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.The surge in donations followed the publication on Friday of an interview Ms Daniels gave In Touch Weekly in 2011, in which she claimed to have had an affair with the property mogul that started in 2006.She claimed that after watching Shark Week on the Discovery Channel, Mr Trump said: \"I donate to all these charities and I would never donate to any charity that helps sharks.\"Ms Daniels said he was \"obsessed with\" and \"terrified of sharks\"."}