{"author":"","title":"Trump brands raid on lawyer Michael Cohen's office 'disgraceful'","news_category":"general","content":"This video can not be playedTrump: FBI raid of my lawyer's office is \"a whole new level of unfairness\"US President Donald Trump says the FBI's raid on the offices of his personal lawyer was a \"disgrace\" and an \"attack on our country\".\"I have this witch hunt constantly going on,\" he told White House reporters.Officials in New York seized \"privileged communications\" between Michael Cohen and his clients, his lawyer said after the raid on Monday.Documents regarding a payment to a porn actress were also seized, US media say.Law enforcement acted on a \"referral\" from Special Counsel Robert Mueller, who is investigating suspected Russian meddling in the 2016 election.Mr Trump criticised the investigation and described Mr Mueller's team as \"the most biased group of people\".On Tuesday morning he repeated his criticism of the raid, tweeting it marked the end of attorney-client privilege, or confidential communications between lawyers and their clients.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Mr Cohen has come under increasing public scrutiny since he admitted to making a $130,000 (£92,000) payment to adult film star Stormy Daniels, whose real name is Stephanie Clifford, just days before the 2016 presidential election.Ms Daniels claims she had a sexual encounter with Mr Trump shortly after his wife Melania gave birth to their son and says she was paid to keep quiet about the affair.\"Today the US Attorney's Office for the Southern District of New York executed a series of search warrants and seized the privileged communications between my client, Michael Cohen, and his clients,\" Mr Cohen's lawyer Stephen M Ryan said in a statement.\"I have been advised by federal prosecutors that the New York action is, in part, a referral by the Office of Special Counsel, Robert Mueller.\"This video can not be playedSchumer to Trump: Attorney raid not an attack on USMr Ryan called the raid \"completely inappropriate and unnecessary\". \"It resulted in the unnecessary seizure of protected attorney client communications between a lawyer and his clients. These government tactics are also wrong because Mr Cohen has co-operated completely with all government entities, including providing thousands of non-privileged documents to the Congress and sitting for depositions under oath,\" the statement said.Mr Trump, who has denied having an affair with Ms Daniels, said he was unaware of Mr Cohen's payment to her and referred questions to the lawyer.Anthony Zurcher, BBC News, WashingtonWhen a president's personal lawyer is the target of a federal law-enforcement raid, it is a Big Deal. How big a deal remains to be seen, but the fact that the move came at the request of the Justice Department's Southern District of New York - after a referral from Special Counsel Robert Mueller's office - could be an indication that Donald Trump's affairs are now relevant to a second criminal probe.Trump-watchers may recall that the president had fired the former US attorney for the Southern District, Preet Bharara, and was reportedly personally interviewing his replacement. A year later, the office is still under the direction of an interim appointment.According to the New York Times, FBI agents sought information on payments made relating to Mr Trump's alleged affair with porn star Stormy Daniels and other tax and business dealings. What was once largely a political embarrassment could have metastasised into legal jeopardy.Mr Cohen's ties to Mr Trump run deep. He's more than just a personal lawyer, he's a friend and fixer. He was already on Mr Mueller's radar for his work for the Trump organisation in Russia. Now the scope of his legal concerns may have dramatically expanded.Mr Cohen is under investigation for finance violations relating to the 2016 presidential campaign, The Washington Post reports.Mr Mueller reportedly gave the information involving Mr Cohen to Deputy Attorney General Rod Rosenstein, who then referred the matter to the US attorney for the Southern District of New York, according to Bloomberg News.Justice Department protocol requires Mr Mueller to consult Mr Rosenstein on evidence and subject matter that are beyond his jurisdiction."}