{"author":"By Gwyn Loader","title":"Ukraine war: Wales refugee family thwarted by paperwork","news_category":"general","content":"A Ukrainian refugee has slammed delays to processing applications to allow those fleeing the war to live in Wales.Olga and her eight-year-old daughter Alexa left their home in Kyiv when war broke out in late February.Since arriving in the Port Talbot area  <https:\/\/www.bbc.co.uk\/news\/uk-wales-60757940>to live with Olga's sister Olena, she has been unable to open a bank account, get benefits or secure school meals.The UK government has said its refugee scheme was \"one of the fastest and biggest visa programmes in UK history\".Olga said the family had received a huge welcome in Wales and she was very grateful for the support of the local community.\"We have received such huge support from the Welsh people. I really appreciate all the help I received,\" she said.\"I've met a lot of friends here, I've met a lot of people who wanted really to help us, not only by words but also in deed. I'm really grateful to Welsh people for everything.\"But since arriving on 14 March, Olga has struggled with paperwork.\"I have no bank account [which I can access in the UK]. They have no instructions [at the bank]. They want to help, but they are unable as they have no mechanisms to be able to help me.\"I have to wait. I have to receive Universal Credit confirmation. I have received BRP (biometric residence permit) and National Insurance number, but only with the help of my family.\"The people in the job centre, they don't know what to do with us - those like me. They don't have instructions or mechanisms. They can't help right now. It's taking time to create the instructions and mechanisms.\"A successful businesswoman in Ukraine, her company employs 100 people. Despite it being very difficult for the company to operate, her husband, still in Ukraine, is managing the business and ensuring staff are being paid.But since fleeing, Olga has been left frustrated by the bureaucracy which has thwarted her efforts to fully integrate and contribute to society.\"We need clear instructions. For now they don't exist. I'm trying to find myself here, trying to get used to live here.\"\"I don't want to be a burden. I don't want to be just a refugee paid for by the UK government. I got used to being a businesswoman in my country, I want to do the same here. I wish I were able to. I'm waiting.\"Her daughter Alexa, began studying at a local primary school last week. Newyddion S4C was given special access to the school, which is not being named to maintain the family's privacy.Alexa has settled well and said she is enjoying studying mathematics, reading and English and playing with new friends.Each of her classmates has drawn a welcome card and the teachers preparing a short written note and photograph to introduce themselves.Several members of staff and families of classmates have also donated clothes.But on Friday, Olga received an email telling her she is not eligible for free school meals for Alexa as she is not in receipt of benefits or receiving a taxable annual income of less than £16,190.Despite repeatedly attempting to register for benefits and to begin looking for work, she has been told she will not receive anything until 25 April - almost a month and a half after arriving in Wales.Aled Edwards, who sits on the Welsh government's taskforce for accepting Ukrainian refugees, confirmed the difficulties faced by Olga Samsonenko are commonplace.\"Those of us who advocate for refugees and work alongside them would say there's a rationale for providing them with financial means as soon as you can, particularly those who are able to work.\"But the Afghan model, Syrian model and now the Ukrainian reality would tell us there are enormous challenges in putting that system in place.\"It is regrettable there's a delay to people getting financial means.\"The UK government's Department for Work and Pensions said: \"People in the UK on either the Homes for Ukraine and Ukraine Family scheme have three years' leave to remain and have full access to work, study and benefits.\"They can apply for Universal Credit from day one and no-one has to wait five weeks for their first payment. People in these schemes will also receive an additional £200 payment whilst their Universal Credit claim is processed.\"\"Taken together, our generous schemes are one of the fastest and biggest visa programmes in UK history, with over 29,000 visas issued and thousands more expected to come through these uncapped routes.\""}