{"author":"By Ilya Barabanov & Nader Ibrahim","title":"Wagner: Scale of Russian mercenary mission in Libya exposed","news_category":"general","content":"This video can not be playedWagner: Scale of Russian mercenary mission in Libya exposedA BBC investigation has revealed the scale of operations by a shadowy Russian mercenary group in Libya's civil war, which includes links to war crimes and the Russian military.A Samsung tablet left by a fighter for the Wagner group exposes its key role - as well as traceable fighter codenames.And the BBC has a \"shopping list\" for state-of-the-art military equipment which expert witnesses say could only have come from Russian army supplies.Russia denies any links to Wagner.The group was first identified in 2014 when it was backing pro-Russian separatists in the conflict in eastern Ukraine. Since then, it has been involved in regions including Syria, Mozambique, Sudan, and the Central African Republic.Wagner's fighters appeared in Libya in April 2019 when they joined the forces of a rebel general, Khalifa Haftar, after he launched an attack on the UN-backed government in the capital, Tripoli.The conflict ended in a ceasefire <https:\/\/www.bbc.co.uk\/news\/world-africa-54660039> in October 2020.The group is notoriously secretive, but the BBC has managed to gain rare access to two former fighters. They revealed what type of person was joining Wagner - and its lack of any code of conduct.There is little doubt that they kill prisoners - something one ex-fighter freely admits. \"No-one wants an extra mouth to feed.\"This supports other parts of the TV documentary - Haftar's Russian Mercenaries: Inside the Wagner Group - by BBC News Arabic and BBC News Russian. Its other revelations include evidence of suspected war crimes, including the intentional killing of civilians.One Libyan villager describes how he played dead as his relatives were killed. His testimony helped the BBC team identify a suspected killer.Describing another possible war crime, a Libyan government soldier also recalls how a comrade, his friend, surrendered to Wagner fighters but was shot twice in the stomach. The soldier has not seen him since, nor three other friends taken away at the same time.The Samsung computer tablet also provides evidence of the mercenaries' involvement in the mining and booby-trapping of civilian areas.Placing landmines without marking them is a war crime.Just hours after the release of the BBC's report into Wagner's activities in Libya, the deputy public prosecutor at the Libyan Military Prosecutor's Office, Mohamed Gharouda, announced that an arrest warrant had been issued for the son of late Libyan leader Muammar Gaddafi.According to the order, which was released internally last week, Saif al-Islam Gaddafi is wanted on charges of war crimes committed by the group during Gen Haftar's offensive against the capital Tripoli.He was arrested during the 2011 uprising in Libya and later sentenced to death in absentia over violence against protesters. In 2017, however,he was released by the militia holding him <https:\/\/www.bbc.co.uk\/news\/world-africa-40236808>.Saif al-Islam has long been suspected of having connections to Russia and the Wagner group, and is believed to be Moscow's favourite candidate to rule Libya.The tablet was left behind by an unknown Wagner fighter after the group's fighters retreated from areas south of Tripoli in spring 2020.Its contents include maps in Russian of the frontline, giving confirmation of Wagner's significant presence and an unprecedented insight into the group's operations.There is drone footage and codenames of Wagner fighters, at least one of whom the BBC believes it has identified. The tablet is now in a secure location.A comprehensive list of weapons and military equipment is included in a 10-page document dated 19 January 2020, given to the BBC by a Libyan intelligence source and probably recovered from a Wagner location.The document indicates who may be funding and backing the operation. It lists materiel needed for the \"completion of military objectives\" - including four tanks, hundreds of Kalashnikov rifles and a state-of-the-art radar system.A military analyst told the BBC that some of the weapons technology would only be available from the Russian military. Another expert, a specialist on the Wagner group, said the list pointed to the involvement of Dmitry Utkin.He is the ex-Russian military intelligence man believed to have founded Wagner and given it its name (his own former call-sign). The BBC tried to contact Dmitry Utkin but has received no reply.And in our visual breakdown of the \"shopping list\" and another document <https:\/\/www.bbc.co.uk\/news\/extra\/8iaz6xit26\/the-lost-tablet-and-the-secret-documents>, the expert says the words Evro Polis and General Director suggest the involvement of Yevgeny Prigozhin, a rich businessman close to President Vladimir Putin.The US Treasury sanctioned Evro Polis in 2018, calling it a Russian company contracted to \"protect\" Syrian oil fields that were \"owned or controlled\" by Mr Prigozhin.Investigations by Western journalists have linked Mr Prigozhin to Wagner. He has always denied any link to Evro Polis or Wagner.A spokesperson told the BBC that Yevgeny Prigozhin has nothing to do with Evro Polis or Wagner. Mr Prigozhin commented that he had not heard anything on the violation of human rights in Libya by Russians: \"I am sure that this is an absolute lie.\"Russia's Ministry of Foreign Affairs told the BBC it is doing \"its utmost to promote a ceasefire and a political settlement to the crisis in Libya.\"The ministry added that details about Wagner in Libya are mostly based on \"rigged data\" and were aimed at \"discrediting Russia's policy\" in Libya.Officially, it does not exist - but up to 10,000 people are believed to have taken at least one contract with Wagner since it emerged fighting alongside pro-Russian separatists in eastern Ukraine in 2014.About 1,000 Wagner men are estimated to have fought with Gen Khalifa Haftar in Libya from 2019 to 2020.The BBC in Russia asked one of the ex-fighters to describe Wagner. He replied: \"It is a structure, aimed at promoting the interests of the state beyond our country's borders.\"As for its fighters, he said they were either \"professionals of war\", people looking for a job, or romantics looking to serve their country.The other ex-fighter told the BBC there were no clear rules of conduct. If a captured prisoner had no knowledge to pass on, or could not work as a \"slave\", then \"the result is obvious\".Andrey Chuprygin, an expert working with the Russia International Council, said the stance of the Russian government was - \"let them join this thing, and we'll see what the result is. If it works out well, we can use it to our advantage. If it turns out badly, then we had nothing to do with it\".Downfall of Gaddafi in 2011: Col Muammar Gaddafi's more than four decades of rule end in an Arab Spring uprising. He tries to flee but is captured and killedThe country splinters:  After 2014, major competing factions emerge in the east and westThe advance on Tripoli in April 2019: Gen Haftar, leader of the eastern forces,advances on Tripoli and the UN-backed government there <https:\/\/www.bbc.co.uk\/news\/world-africa-27492354>. Both sides get military and diplomatic support <https:\/\/www.bbc.co.uk\/news\/world-africa-53917791> from different regional powers, despite a UN arms embargoCeasefire in October 2020: Then in early 2021 a new unity government is chosen <https:\/\/www.bbc.co.uk\/news\/world-africa-55955228> and sworn in, to take the nation to elections in December. Foreign fighters and mercenaries were supposed to have left, but thousands remain"}