{"author":"By Nick Triggle","title":"Pandemic sees big rise in obese children in England","news_category":"general","content":"There has been a substantial rise in the number of obese children in England during the pandemic, data from NHS Digital suggests.In 2019-20, 10% of children were obese at the start of primary school, but in 2020-21 the figure was more than 14%.In the last year of primary school, it rose from 21% to over 25%. Rates were twice as high in the poorest areas.Experts said poverty, lockdowns and a rise in mental health problems will all have played a role.Once the proportion who are overweight is taken into account, 28% of those in reception were carrying excess weight, and 41% in year six.The jump that has been seen is in marked contrast to previous years, which had shown only very gradual increases.Obesity is defined differently for children: it's whether, after adjusting for age, sex and height, your weight would put you in the top 5% back in 1990.So it may be hard to believe that fully 25% of year six children are obese now, compared to only 5% back then, especially when the chart above shows that the numbers haven't been moving very much in the last decade.On top of that, once you switch from the childhood definition to the adult one, the levels of obesity suddenly dip.So the number of obese kids may be lower in truth than estimated here. But trends are more reliable, as is often the case, since the survey tries to measure the data in the same way every year.The figures have been drifting up gradually over the last decade, and the gap between the most deprived and the better off postcodes has been broadening.That's why experts are warning we should not dismiss these figures as a blip.Dr Max Davie, of Paediatrics and Child Health, said the increase was \"alarming\".\"While lockdown may have been a key factor, we mustn't assume that this year's results are an aberration since there may be other factors, including mental health difficulties, which will take time to address.\"He said poverty was also likely to be a crucial factor. \"Every year we see the gap between the most and least deprived children widen. Any attempts to address this problem therefore need to be focused on these groups, and the causes for their increased vulnerability.\"Caroline Cerny, of the Obesity Health Alliance, said she agreed poverty was playing a crucial role.\"We need to break the junk-food cycle to improve children's health,\" she added.The data is drawn from a sample of children this year - only around one in four were weighed and measured.Normally nearly every child takes part, but the closure of schools prevented that happening.NHS Digital said the findings were representative of the general population."}