{"author":"","title":"Ed Sheeran donates painting to Suffolk cancer charity raffle","news_category":"general","content":"Singer-songwriter Ed Sheeran has donated one of his paintings as a raffle prize for a cancer charity.The 29-year-old singer hopes his colourful abstract artwork, entitled Splash Planet, will boost funds for the Cancer Campaign in Suffolk (CCiS).In a video message for the charity, Sheeran described it as \"one of the big splashy ones\" from the cover artwork for his single Afterglow.A previous artwork, Dab 2, <https:\/\/www.bbc.co.uk\/news\/uk-england-suffolk-54874261> sold for £40,000 in a charity auction last year.\"I hope you enter, it goes to a really fantastic cause and it's going to help a lot of people, so thank you very much and lots of love,\" Sheeran said.Sheeran said Splash Planet was painted at the same time as he created Dab 2.In a previous interview, describing how he painted the artworks, Sheeran said: \"I painted a canvas a day for 30 days.\"It was really fun. It's kind of Jackson Pollock-y.\"I bought house paint and just layered it up by flicking it. I just do my art and I love doing it.\"It's something that makes me happy, that no-one else needs to judge,\" he said.The musician began work on the paintings after his long-running Divide world tour, which ended with a series of homecoming gigs in Ipswich in 2019.Karen Hare of CCiS, <https:\/\/www.ccisuffolk.org\/> said: \"We are a small local charity and are so excited and grateful to Ed for showing his support for our work in making this terrific gift to CCiS.\"Every pound raised helps hugely and will enable us to continue all our projects, give us some security and the opportunity to meet the future needs of those living with cancer.\"Proceeds raised from the raffle will help fund the charity's counselling, complementary therapies and beauty and wellbeing projects.Tickets costing £20 go on sale from Friday via the charity's website.Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk"}