{"author":"By Steffan Powell","title":"How Helsinki became the mobile gaming capital of the world","news_category":"general","content":"Think of the cities of the world which are renowned as hotbeds of innovative technology and Helsinki might not be near the top of the list.However, the often snow-covered streets of this relatively quiet northern European capital are home to some of the most ambitious and successful games makers in the world.The first Angry Bird was flicked across the screen of an iPad in Helsinki, it's home of major games studios like Clash of Clans maker Supercell, and is also the place Netflix has chosen to set up its first ever internal gaming studio. \"Why Helsinki? It is home to some of the best game talent in the world,\"the streamer has said. <https:\/\/about.netflix.com\/en\/news\/building-our-internal-games-studios>As a result of all this, the Finnish capital is considered by many to be the capital of mobile gaming, an industry currently worth an estimated £120bn to the global economy.Which leads to an obvious question, how did it develop this reputation?In the 1980s and 1990s, Finland wasn't considered to be one of the wealthiest countries in the world.Much of the population relied on computers that were far from top of the range. The restrictions that came with that would help fuel what was known as the \"demoscene\" - a subculture which saw programmers create art presentations, music and games that pushed the technology of the time to the limits of its power.Finns became used to doing a lot with very little, and then along came Nokia.Sonja Ängeslevä, CEO of Phantom Gamelabs, which is based in Helsinki, says this foundation is a significant reason behind the success of the games industry in the city today: \"Nokia showed an example that we could build something big from here,\" she explains.As a games maker, board member of the successful console developer Remedy games and the founder of a new development studio, Sonja knows the Finnish games sector inside out.She says that Nokia worked with the young talent from the Finnish demoscene, which meant that, despite the lack of big games, publishers in the city at the time the collaboration made people \"realise we don't need to travel, we can do it ourselves from here\".People in the city, which is roughly the same size as Glasgow, are very aware of its success in the games space, and happy to chat about it in bars and coffee shops. It's clearly been an area that politicians and officials have sought to capitalise on as well.Sartita Runeberg, head of gaming at technology infrastructure company Reaktor, says: \"Finns have been tech geeks since forever!\"The cultural situation here is that we're allowed to try and fail, and then try again. That's how many of the gaming companies have started, when you don't have to worry about failing you can be much braver.\"In order for games companies to be successful, they need the right infrastructure. From company governance to marketing and technology support, Reaktor provides that to many of the 200 games studios that operate here.Runeberg explains: \"We know we have the social security network to fall back on, so you don't have to mortgage your own house to set-up a company and the government is supporting gaming companies a lot. You can get grants easily for trying out new concepts, and funding for proof of concepts to see if something works in certain markets.\"The government has been motivated to get people to move here, nobody wants to move to Helsinki for the climate, for example, so we have to give them a reason to move.\"Thirty percent of the developers who call the tram-lined streets of Helsinki home have moved to live in the city from other countries around the world.Attracting the worlds best developers is a key part of Helsinki's plan to stay on top in the gaming space, and doing that is what the organisation Helsinki Partners does.\"All the companies recruit from aboard and they look for certain talent with expertise they need and they really go after them,\" says Johanna Huurre, director of strategic initiatives at Helsinki Partners. \"They're coming from South America, Europe, it's obviously easier to move around in Europe, America and Asia.\"Companies and developers are not offered major tax incentives or significantly higher salaries to set-up shop in Helsinki. Huurre says the sell is more straightforward than that.\"Helsinki is known for its work\/life balance, we have a good life here,\" she says. \"We are very ambitious with our work, but we like our free time so much we're very efficient in our work time, there are few nonsense meetings.\"Life is much easier here, and these soft values are becoming more and more important after the pandemic. Many people say that we have fewer worries here because we have a strong support system, we don't have to worry about schools or security so parents can feel much more free compared to other countries.\"The blend of Helsinki's tech heritage, government support and determined talent acquisition is working. The games studios of Helsinki made £2.8bn in 2022.For context the UK's games market was worth £4.7bn to the UK economy in the same period - but is 12 times bigger as a country.One of the big success stories of the scene in Helsinki is Supercell. Recently acquired by Chinese corporation Tencent it is reported that the games maker has a market valuation of $11bn (£9.2bn).Stuart McGaw moved form Scotland to work for the studio and is in charge of the famous base building mobile game Clash of Clans. \"Like many people, I remember playing [mobile game] Snake on the Nokia 3210 growing up,\" he laughs.Considering the reputation of the games development scene in Finland, the encouraged McGaw decided to move his life to the country after starting his career at home. \"People here have heard so much about the success stories of the games companies,\" he says.With studios that are \"punching above their weight for a country this size\", he thinks that local people are more aware of the work of developers and respect the industry as a really important one for the future of the country.Other cities around the work won't be able to replicate the Nokia heritage and skillset built in the 1990s, but there are interesting lessons here that show big things can happen in small places.For more gaming content, go to Press X to Continue, the BBC Sounds gaming Podcast. <https:\/\/www.bbc.co.uk\/programmes\/p08x7kb5>"}