{"author":"By John Campbell","title":"Wrightbus: 1,200 job losses confirmed as firm enters administration","news_category":"general","content":"About 1,200 Wrightbus workers have been made redundant after the company entered administration.Just 50 jobs will be retained at the firm - the last UK-owned bus manufacturer - administrators said.The company had suffered cash flow problems and had sought investment or a new owner.Talks with two potential buyers of the firm, best known for building the New Routemaster, known as the \"Boris Bus\",failed to reach a conclusion last week <https:\/\/www.bbc.co.uk\/news\/uk-49775262>. Deloitte, the firm's administrator, said the lack of a buyer for Wrightbus had caused the redundancies.The Wright family, who founded Wrightbus in 1946, said \"global changes from diesel to electric in bus technology have caused a sharp decline in demand for buses in the UK\".In a statement, the family said that it moved work from its facility in Malaysia to Ballymena in a bid to secure local jobs.\"These factors have resulted in significant losses at Wrightbus which our family have been covering for a over a year.\"This video can not be playedGovernment must 'invest in Wrightbus' - Jackie Pollock, Unite regional secretaryBut a statement added: \"It simply became impossible to sustain that level of support.\"Read more reaction here. <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-49829879>At a press conference on Wednesday afternoon, union officials called for the immediate intervention of the British government.They said they sought meetings with Prime Minister Boris Johnson and NI Secretary Julian Smith, who they said they must \"stand up for British industry\".Jackie Pollock, Unite's regional secretary, added \"the government must intervene to save jobs and skills\".\"The administrator will need to find someone of calibre and of real standing who has the wherewithal and the skill to take this company on,\" he said.by BBC News NI North East reporter Sara GirvinIt used to be a bustling market town - but the years have not been kind.The potential loss of so many jobs would be a blow to any town in Northern Ireland, but this isn't the first time Ballymena has been hit.The closure of big employers like JTI and Michelin in recent years have already left scars on the town.Read more about company closures in Ballymena here <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-49831876>.This video can not be playedStaff at the Ballymena bus manufacturer fear for the future as 1,200 lose their jobs.Norman Stephens has worked at Wrightbus for 30 years and said he is gutted.\"For the last five years, management has told us that they can't give us a wage rise as they were investing it in the company.\"Who is going to employ a 62-year-old man? I have nothing now. That's it.\"I'm off shift and due back in tomorrow night but I've been in since 8 o'clock hoping to find out if I've got a job.\"Latest accounts show that the Wrightbus group lost £1.7m on a turnover of £227m in 2017.But its financial situation has deteriorated since then.This video can not be played'This is a body blow for Ballymena' - DUP MP Ian PaisleyIt made two rounds of redundancies last year with 95 jobs going in February and June, which it said reflected continued low levels of demand for new buses in the UK market.The UK has traditionally been Wrightbus's biggest market but it has been contracting for over two years.Figures from the Society of Motor Manufacturers and Traders (SMMT) show that in the second quarter of this year new bus and coach registrations are down 30% compared to the same period last year.That marks the tenth quarter in a row that new registrations have declined.In 2012, Wrightbus was riding high. The company launched the New Routemasters, which were ordered by the then mayor Boris Johnson - and so became known as Boris Buses.It was a triumphant time for the Ballymena business, but now it's been brought low.Read more on the firm's financial fall here <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-49801334>. In the last six years Wrightbus has donated more than £15m to Green Pastures, a religious charity led by the firm's majority shareholder Jeff Wright.The donations helped it to develop plans for a huge church and village complex known as Project Gateway.In the wake of the firm's fall into administration, questions have been asked over the use of money.Read more here <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-49824525>.In March 2016, Wrightbus founder Sir William Wright became the first major business figure in Northern Ireland to voice his support for Brexit. <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-35752575>The businessman told the Ballymena Guardian newspaper: \"I am totally in favour of getting out.\""}