{"author":"By Shelley Phelps","title":"River pollution: Sewage spill prevention will hit water bills","news_category":"general","content":"Welsh Water customers face \"significant bill increases\" to pay for measures to stop sewage being released into rivers and seas, MPs have heard.The not-for-profit company told the Welsh Affairs Committee it had a \"part to play\" in improving water quality.More than 105,000 sewage spills were recorded in 2020, according to Natural Resources Wales (NRW).Sewage discharges are allowed during heavy rainfall to protect people's homes.MPs heard five of nine Welsh rivers designated as Special Areas of Conservation (SACs) were failing on phosphorus levels and excessive nutrients.Only 40% of Welsh rivers meet the criteria for good ecological status. For bathing water, 80% were ranked as excellent.\"We are going to have to go through a phase of significant bill increases to try and tackle these very important problems,\" said Steve Wilson, managing director of wastewater services for Welsh Water.\"To have five of the most iconic rivers in Wales, if not the UK, not meeting the right standards is really important.\"Welsh Water's discharges are accounting for around 20% to 30% of the problem in some of those rivers.\"We have got to get on top of that and invest in those assets to improve the quality.\"Welsh Water said it will spend nearly £1bn over the next five years. Protecting beaches and tackling storm overflows that cause environmental harm will be the priority, it added.\"We think it will cost between £14bn and £20bn to get storm overflows in Wales down to spilling 10 or 20 times a year,\" added Mr Wilson.That will mean higher bills for Welsh Water's customers, who are already paying £499 a year <https:\/\/www.bbc.co.uk\/news\/uk-wales-64491577> - the second highest average bill in Wales and England.Alun Moseley from Port Talbot is a lifeguard and a campaigner for Surfers Against Sewage, and said being in the water played an important part in his mental health.\"It's the kind of place I come to when I feel sad, happy, when I need to make major decisions, to relax, switch off. It's my go-to place,\" he said.Mr Moseley said he surfed at spots all over Wales and claimed that over the past few years he has fallen ill \"two or three times\" after being in the water, most recently in September.\"Vomiting, diarrhoea, sickness. I've experienced itchiness, rashes,\" he said. He said he believes sewage was the cause.\"The water was discoloured, bubbling, residue on the beach. You could see stuff floating around that looks like it came from the toilet.\"Mr Moseley, who also works as a surf instructor, said lessons have occasionally had to be cancelled due to sewage discharges.He wants to see tougher regulations to tackle the problem.Alice Hortop, an occupational therapist and a wild swimmer from Barry, Vale of Glamorgan, said: \"One of my friends' husbands who's a surfer got really ill when he had something he caught, went in his intestines and lingered.\"We have to keep an eye on the alerts - there's an app you get on your phone - and only three days ago there was an alert that stopped our Llantwit Major swim.\"You could see all the way along the coast there were different pockets being affected, and they only monitor the water between May and September, but actually people swim and surf all year round.\"Ms Hortop said the alerts are \"usually quite good\", but there was a time recently where the app went down for nearly a week.\"This is a historical situation that's been left literally to fester for a very long time,\" she toldBBC Radio Wales Breakfast <https:\/\/www.bbc.co.uk\/news\/uk-wales-65107512>.Welsh Water said many different factors contribute to water quality and wastewater can also come from private systems outside of their control.\"We do notify Surfers Against Sewage when our assets at bathing waters operate so that they can make people aware through their app,\" a spokesman added.The MPs' inquiry also heard from Surfers Against Sewage, which publishes a live map <https:\/\/www.sas.org.uk\/water-quality\/sewage-pollution-alerts\/> of spills in Wales.Committee chairman and Conservative MP Stephen Crabb said he felt \"pretty depressed\" for his constituents.\"They have the prospect of higher bills, but not necessarily a clear plan for reducing sewage discharges,\" he said.Water regulator NRW said it was proud of the good result for bathing water. It said: \"Nevertheless, we are concerned about the impact of storm discharges on our water quality and are taking action to address the issue.\"The Welsh government said: \"Ensuring our water is of the highest quality is a vital part of making Wales a prosperous, happy and healthy place to live.\""}