{"author":"","title":"Ukraine conflict: Wales providing 'phenomenal' support","news_category":"general","content":"This video can not be played'If I can show a bit of solidarity, that's cool by me,' say people at the vigilAbout 300 people have gathered at a rally at the Senedd to show solidarity with the people of Ukraine.Speaking at the Cardiff rally are Plaid Cymru leader Adam Price and Welsh Labour's Mick Antoniw, who is of Ukrainian descent.Mr Antoniw told the crowd the Welsh government would do \"all they can\" to assist Ukrainian refugees.\"One thing Putin cannot crush and that is the hope and the spirit of the Ukrainian people,\" added Mr Price.Mr Antoniw, who visited Ukraine earlier this month with Mr Price, has praised Wales for its \"phenomenal\" support.At the rally he labelled the steps the UK government has taken to assist refugees fleeing Ukraine as \"totally unacceptable\", adding that Wales is a \"proud nation of sanctuary\".His appeal to buy medical equipment for injured people in Ukraine has topped £23,500 despite a £5,000 target.Svitlana Phillips, of Voice of Ukraine Wales, said: \"People are absolutely terrified. They are exhausted, they are crying for help. They have no explanation for what's going on.\"But she added that the people she had spoken to in Ukraine were \"very grateful\" for the support shown.Ricky Wright from Rhondda, who was at the rally, said: \"I've got relatives in Ukraine and I just feel angry.\"Then the sadness kicks in and then I think there's this sort of unity in wanting to do something, regardless of what that is.\"Due to the unfolding events in Ukraine, the Senedd has cancelled Tuesday's St David's Day event, which was set to feature performances from artists throughout Wales.Speaking to BBC Radio Wales earlier on Monday, Mr Price said he hoped a display of solidarity would give the Ukrainian people \"strength and hope\".\"I have friends in Kyiv and I spoke to some of them this afternoon, their message is 'tell people in Wales - don't be afraid of Putin. We're not',\" he said.Mr Price added the sanctions imposed on Russia by UK Foreign Secretary Liz Struss \"don't go far enough\".\"What we need is a total economic embargo on Russia, the likes of which that have been implemented in the past for Iran and North Korea,\" he added.Mr Antoniw added: \"We need a complete economic, social, political and cultural boycott of Russia.\"It's got to be so sufficient that it forces those people around Putin to realise that Russia can have no future whatsoever.\"They might be able to fight with the tanks and the airplanes and the missiles, but the world can fight with the economic sanctions that will bring the Russian Federation to its knees until they withdraw their troops out of Ukraine.\"Meanwhile, community groups, businesses and other individuals across Wales are also contributing to the aid effort asRussia's invasion of Ukraine continues <https:\/\/www.bbc.co.uk\/news\/world-europe-60551688>.Mr Antoniw, Senedd Member for Pontypridd, told Jason Mohammad on BBC Radio Wales <https:\/\/www.bbc.co.uk\/programmes\/m0014vp4> that his cousin, a medic, wanted to purchase the medical equipment to treat those caught up in the invasion.He said he knew \"ordinary, working people\" who had taken up arms in Kyiv.\"Some have never fired a gun in their life and they are now on the front line,\" he said.\"The bravery is absolutely phenomenal and I know that so many of them we may never see again.\"A community group called Women of Newport <https:\/\/www.facebook.com\/WomenOfNewport\/posts\/1016899842568249> has been collecting clothing and toiletries for Ukrainian refugees fleeing to Poland.This article contains content provided by Facebook. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readMeta’s Facebook cookie policy, external <https:\/\/www.facebook.com\/privacy\/policies\/cookies> and privacy policy, external <https:\/\/www.facebook.com\/privacy\/policy\/> before accepting. To view this content choose‘accept and continue’.Kamila, who has family in Ukraine, said they had received donations from across Wales.\"Everyone seems desperate to help to do something,\" she said.But Anna Reid, a former Ukraine correspondent for The Economist, said so many items could easily be bought in Poland if cash was sent.She told BBC Radio Wales the message she was receiving from aid organisations was \"please, please, don't collect stuff, reach in your pockets\".St Mary's RC Primary School in Llanelli, Carmarthenshire, is receiving goods donated by the community to help people in Ukraine.Gosia Kujawa, who is originally from Poland and helped to organise the effort, toldBBC Radio Wales Breakfast <https:\/\/www.bbc.co.uk\/sounds\/play\/m0014vp2>: \"I have no words this morning to thank everyone enough.\"One day we will organise Polish coffee and cake to thank everyone,\" she said.Meanwhile, a donation centre has also been set up at offices run by the Association of Voluntary Organisations in Wrexham, organised by Anna Buckley from the Polish Integration Support Centre, with hundreds of donations made on the first day.Ms Buckley said: \"We need clothes, we need sleeping bags, we need baby wipes... we need everything.\"There are also collection points in Flint, Flintshire, and Welshpool, Powys, with five lorries due to ferry the goods to the Polish government from Saturday.Meanwhile, Bridgend Fabrics in Bridgend county said it was donating all sales proceeds on Saturday to children's charity Unicef.This video can not be playedWatch: The families fleeing a war, but having to leave loved ones behindZina Sheppard, who lives in the Conwy valley, said she was keeping in touch with her family in both Russia and Ukraine via WhatsApp.She said temperatures were very cold and families were having to leave their homes to go to shelters for protection \"whilst there is a fight going on\".\"It's not fair for people to be part of the political game,\" she said. \"It's annoying and terrifying.\""}