{"author":"","title":"Plaid Cymru: Anger as wife assault MP let back into party","news_category":"general","content":"Splits have emerged in Plaid Cymru after it was decided to let MP Jonathan Edwards back into the party after he was cautioned for assaulting his wife.Mr Edwards was suspended in July 2020 <https:\/\/www.bbc.co.uk\/news\/uk-wales-politics-53425091>, two months after being arrested at home <https:\/\/www.bbc.co.uk\/news\/uk-wales-politics-53205748>.At the time he said he was \"deeply sorry\", adding it was \"the biggest regret of my life\".After the incident, his wife Emma Edwards said she accepted her husband's apology.While a disciplinary panel has given the go-ahead for Mr Edwards to have his membership restored <https:\/\/www.bbc.co.uk\/news\/uk-wales-politics-62207015>, the National Executive Committee recommended he should not represent the party in Westminster.Plaid member and domestic violence campaigner Julie Richards believes Mr Edwards, who represents Carmarthen East and Dinefwr, should not be involved with the party.She said: \"I believe we should have zero tolerance. We're not showing that and not stepping up to the mark.\"In terms of values, as a party, this puts it all into question. Are we really serious about tackling these deep problems in society?\"Ms Richards said the wrong message was being sent out.\"The fact he has apologised and his wife has accepted that is a private matter between them,\" she said.\"This is more than just a private matter. This is something public. This person works in the public sector.Ms Richards said she was considering whether to renew her party membership: \"I can't be in a party that doesn't take this and tackle this seriously.\"The recommendation by the National Executive Committee that Mr Edwards should not rejoin the parliamentary group sparked anger within Mr Edwards' local party.Councillor Hazel Evans felt the committee had interfered.\"I don't understand why the executive decision was made in the first place,\" she said.\"It's been through a disciplinary process that was wholly independent.\"The decision was made to allow him back in and it should be up to the Westminster MPs to decide whether they should let him back. It should be nothing to do with the executive.\"She said Mr Edwards was sincere, hard working and well respected and it should be \"up to local members to decide\".She admitted the infighting was causing divisions in the party.She said: \"Yes it is, and it is unnecessary. All you do is weaken the party.\"Former Plaid Assembly Member <https:\/\/www.bbc.co.uk\/news\/uk-wales-politics-52442634> for Carmarthen East and Dinefwr, Rhodri Glyn Thomas, said: \"Having regained his membership of Plaid Cymru he should also regain the party whip within the group in Westminster.\"Plaid Cymru said the process of determining Mr Edwards' membership of the Westminster group had yet to be concluded."}