{"author":"","title":"Viewpoint: Why do fictional universes matter?","news_category":"general","content":"The myths that make up Western culture have changed. Extended fictional universes, from Harry Potter to Game of Thrones, have taken over from Shakespeare and the Bible, writes Ben Hammersley.We do not properly acknowledge the stories that truly make up our culture. We might like to think that the Western world is based on the noble myths of the Greeks and Romans, the tales of our greatest novelists, and a common understanding of the Bible and Shakespeare. But in truth, the stories that really bind us together are completely different.Our shared mythos, the cultural touchpoints we can use as a framework to tell each other stories, is no longer the Bible or the Odyssey. It's Star Wars and Star Trek, Gotham City and Westeros. The average person in the street probably would not be able to tell you the plot of Macbeth, but they all know who Luke Skywalker's father is. The story of John the Baptist, say, is overshadowed in the popular general knowledge by what would happen if you were to get bitten by a radioactive spider.Our modern civilisation, like all civilisations before it, has settled around a set of myths and legends as the basis of its culture. They are more complex, more interesting, more sophisticated, and with a much richer interaction between creators and fans than you might think. Far from being mere films or comic books, they are whole extended fictional universes, entirely self-consistent, with deep histories, hundreds of characters, and even a form of theological scholarship.Take Elio Garcia and Linda Antonsson, for example, the founders of Westeros.org <http:\/\/westeros.org\/>. This is a site that documents and discusses the world of the Songs of Ice and Fire series of books that has been made into the Game of Thrones television series. They act as sorts of guardians of the history of the lands of Westeros. They even advise the author George RR Martin about the facts of his own universe.For fans of all of these extended worlds, there is scholarship, debates, and a need to get the stories straight that rivals contemporary mainstream theology. Indeed, with the six (soon to be seven) films, plus the hundreds of comics, novels, cartoons, and other works set in the Star Wars universe, it's no wonder that Disney employs a whole team dedicated to keeping the mythos consistent. Recently, there has been a schism in the Star Wars canon, and stories known as the backdrop of this insanely popular world are being reassessed, with no sense of oddity, as to their actual historical accuracy.The fans and the creators can be forgiven for feeling torn. These shared stories breed more stories, providing a consistent world for us to create new characters, and write new archetypes. Fan fiction is our new folklore - a continuation of the traditions that gave us the tales of Robin Hood or the Knights of the Round Table.The six Star Wars films have taken $1.9bn (£1.2bn), a number which is sure to increase wildly this winter when the latest, The Force Awakens, hits the cinemas. Meanwhile the eight Harry Potter films have made $2.4bn (£1.6bn). And the Marvel Cinematic Universe - the Avengers, Iron Man, Captain America, and the rest - have taken $3bn (£1.9bn) at the box office alone. That is not including merchandise, books, comics, and TV spinoffs.But despite the snobbery brought about by the enormous commercial success of these films, I believe it's time to reassess their place in the ongoing creation of Western civilisation. It's time to appreciate their sophistication, and to examine their importance despite, not because of, their popularity.The upcoming revelation in December of exactly what happened to Luke Skywalker in the years since the destruction of the second Death Star, is just as important - perhaps more important - than any other revelation about the history of anything else that might have happened a long long time ago.Superheroes, space operas, boy wizards, swords and sorcery, are more important to us all than we dare admit.TV series Game of Thrones is frequently compared to fantasy creations such as the Lord of the Rings, but it owes an equally large debt to a cult French historical novelist.The cult French novels that inspired George RR Martin (April 2014) <http:\/\/www.bbc.co.uk\/news\/magazine-26824993>Ben Hammersley presents Homer, Hagrid and the Incredible Hulk on BBC Radio 4 at 10:30 BST on 17 October -listen on BBC iPlayer Radio <http:\/\/www.bbc.co.uk\/programmes\/b06hk68g>Subscribe to the BBC News Magazine's email newsletter <http:\/\/www.bbc.co.uk\/news\/magazine-26567792> to get articles sent to your inbox."}