{"author":"By David Brown","title":"Sewage discharged into rivers 400,000 times in 2020","news_category":"general","content":"Water companies discharged raw sewage into rivers in England more than 400,000 times in 2020, according to new figures <https:\/\/environment.data.gov.uk\/dataset\/21e15f12-0df8-4bfc-b763-45226c16a8ac> published by the Environment Agency.Untreated effluent, including human waste, wet wipes and condoms, was released into waterways for more than three million hours last year.Sir James Bevan, chief executive of the Environment Agency, said that his organisation was \"working actively with the water companies to ensure overflows are properly controlled\".He also said that the harm they do to the environment needed to be stopped.But the Rivers Trust, an organisation which campaigns to protect river environments in England and Wales, said: \"This is a shocking volume of untreated contaminated wastewater reaching our rivers and shows that our current approach and infrastructure, managing storm water in particular, needs a radical overhaul.\"The Environment Agency allows water utilities to release sewage into rivers and streams after extreme weather events such as prolonged heavy rain.This protects properties from flooding and prevents sewage from backing up into streets and homes.The agency says that overflows are \"not a sign that the system is faulty\", and that they are \"a necessary part of the existing sewerage system.\"Campaigners have argued for greater investment in the capacity of sewage systems to cope with heavy demand during extreme weather events, which may be becoming more frequent because of climate change.United Utilities, which operates in the north west, had the longest duration of spills.Water UK, which represents the water companies said: \"A total of £1.1bn is being invested by water companies to improve storm overflows over the next five years as part of a wider £5bn programme of environmental improvements. In addition, we are playing a leading role in the Government taskforce that is looking at long-term alternatives to storm overflows.\"Today's data shows the number of spills recorded increased to more than 403,000 last year from nearly 293,000 in 2019.But the Environment Agency says that's due to an increase in the number of monitoring stations.It's believed that wet wipes make up at least 90% of the material causing sewers to block. The agency says that keeping drains free of wet wipes and ensuring that fats and grease are not poured down the sink can reduce the need for sewage releases.The new data has been released ahead of what's likely to be a spike in river use for domestic tourism this summer.Open water swimmers, kayakers, paddlers and dog walkers have been asked to avoid contact with the water during and after sewage spills.One of the waterways affected by sewage overflows in 2020 was the River Chess in Buckinghamshire, a chalk stream which is home to rare wildlife including water voles and great white egrets.Paul Jennings, chairman of the River Chess Association, said: \"We're currently seeing these discharges every day, sometimes for multiple hours.\" He believes there is a direct correlation between sewage discharges and lower numbers of brown trout, grayling and invertebrates - animals without a backbone, including worms, snails and insects such as mayfly.\"Once you affect the invertebrates in a river, you change the whole balance of the ecology,\" he adds.Sewage is one of several sources of pollution in rivers. Other sources include run-off from farmland.Additional reporting by Becky Dale"}