{"author":"By Claire Starr","title":"NHS boss committed to bringing down waiting times","news_category":"general","content":"An NHS boss has said he is committed to bringing down waiting times despite the winter pressures on the service.But Steve McManus, interim chief executive of the integrated care system for Buckinghamshire, Oxfordshire and Berkshire West, said people may still experience longer waits than usual.More than 150,000 people were waiting for treatment at the end of September.The integrated care system commissions healthcare across the three counties and was established in July.Mr McManus told the BBC: \"We have clinicians leading the improvement in services across areas like urology, ENT [Ear, Nose and Throat] and orthopaedics.\"We have clinical leadership working right across our integrated care system on efficiencies in areas like our operating theatres.\"We can balance some of those emergency, acute, on the day care needs that our citizens require, and actually commit to those reductions in waiting times for elective care and access to cancer treatment.\"Right now we're trying to do things like increase access to primary care, so all of our primary care practices have looked at extended services into the evenings and weekends to open up more capacity.\"He said teams had also been working more closely with pharmacists and promoting access to NHS 111 and the NHS Digital website to improve results.An aging population, coronavirus and its effects, and workforce challenges have combined to put pressure on the NHS.It is also dealing with high numbers of people attending A&E <https:\/\/www.bbc.co.uk\/news\/uk-england-oxfordshire-63637251> as it heads into the winter.Oxfordshire-based GP Dr Rachel Ward said: \"We're doing more appointments than we've ever done before.\"She added: \"We're putting things in place to do absolutely what we can, but I think a lot of people this winter will feel disgruntled with the service they end up getting.\"In the Autumn Statement Chancellor Jeremy Hunt promised an extra £3.3 bn <https:\/\/www.bbc.co.uk\/news\/business-63555313> for the NHS for each of the next two years, but he also asked the service to tackle waste and inefficiency.Follow BBC South on Facebook <https:\/\/www.facebook.com\/bbcsouthnews\/>, Twitter <https:\/\/twitter.com\/bbcsouthnews>, or Instagram <https:\/\/www.instagram.com\/bbcsouthnews>. Send your story ideas to south.newsonline@bbc.co.uk <mailto:south.newsonline@bbc.co.uk>."}