{"author":"","title":"Worcestershire doctor's fight for unaccompanied Ukrainian teens","news_category":"general","content":"A hospital consultant struggling to get two Ukrainian teenagers to the UK without their parents said the situation was \"heart-wrenching\".Worcester-based Dr Catherine Hillman wants to take care of the children of two doctors so they can remain working.Her parents have been given power of attorney of the pair, but the Home Office said it would not allow entry.Only under-18s reuniting with a parent or legal guardian are eligible due to safeguarding concerns, it said.It is understood, however, the government is exploring options how to get more children safely to the UK.Dr Hillman, who works at Worcester Royal Hospital, has spent months trying to get Daria and Ivan from Kyiv through the Homes for Ukraine scheme and said the children were more at risk of harm if they stayed in the war-torn country.\"There are real concerns that this is going to lead to unnecessary harm or, dare I say it, the loss of life of a child,\" Dr Hillman said.\"They live in a city centre apartment in Kyiv, with no basement and use an internal corridor as shelter.\"Dr Hillman and her parents Graham and Francine Hillman, know Daria, aged 15 and Ivan, aged 14, and their families, through the international medical community.Both Daria and Ivan's mothers are doctors in Ukraine and need to stay and work. They also have elderly parents to look after.The teenagers have no other family members able to travel with them, with Daria's father, a lawyer, required to stay, alongside her 18-year-old brother.Ivan's father passed away in 2012 and his sister wants to stay and help in Ukraine.Both teenagers' visa applications were sent in April, with the forms being received, however, communication has since ceased.Dr Hillman and her parents, Graham and Francine Hillman, have written to their MPs and Lord Richard Harrington, the Minister for Refugees, for help, but said they had not had replies.Speaking to BBC Hereford and Worcester, Daria said: \"I am really worried about the situation in Ukraine, I really want to go to the UK and I'm worried about my family as they will stay here.\"I am disappointed about it,\" she added.The teenagers have secured a place boarding at Cheltenham College and Dr Hillman's parents' home in Essex, where the children would reside when not at college, is said to have been inspected by both social services and the Homes for Ukraine scheme.\"The teenagers will never be unaccompanied as their parents will bring them to the Polish border where we will then meet them,\" she said.Dr Hillman had originally asked the Home Office if the teenagers could come to the UK on a scholarship visa, due to them having a college place, but was told by the Home Office applications needed to be done through Homes for Ukraine.A Home Office spokesman said: \"It is tragic that children have been caught up in Putin's war.\"The safety and wellbeing of children is paramount and we have worked with councils throughout the scheme to make sure there are robust safeguarding processes in place.\"For this reason, only under-18s who are reuniting with a parent or legal guardian in the UK are currently eligible for Homes for Ukraine, but as we have always said we keep eligibility for all our schemes under review.\"Follow BBC West Midlands on Facebook <https:\/\/www.facebook.com\/MidlandsBBC\/>, Twitter <https:\/\/twitter.com\/bbcmtd> and Instagram <https:\/\/www.instagram.com\/bbc_midlands\/?hl=en>. Send your story ideas to: newsonline.westmidlands@bbc.co.uk <mailto:newsonline.westmidlands@bbc.co.uk>"}