{"author":"By Colletta Smith & Nicky Hudson & Ben King","title":"Renting: Number of UK homes available down by a third","news_category":"general","content":"The number of homes available to rent in the UK has fallen by a third over the past 18 months.The sharp drop in the number of listings has helped drive up rents for new tenants by 11%.Lettings agencies typically have 10 rentals compared to over 16 before September 2021, figures shared with the BBC by property website Zoopla show.This has left people like Ruth searching for months without luck. \"It seems completely hopeless\", she said.The total number of rental properties in the UK hasn't actually fallen. In fact, it has barely moved since 2016.But people like Ruth are finding it difficult because they're competing with far more other people in their search for a home, so there are fewer properties on the market at any one time.Demand for rented accommodation has risen to more than 50% above normal levels, Zoopla's figures show.Zoopla draws its information from listings on its website, which cover 85% of UK properties listed for rent.People who want to move but can't find anywhere new are having to stay put. That means their old place doesn't become available. And with people unable to move, fewer properties become vacant and appear in the estate agent's window.Even if people do find somewhere suitable, they're likely to have to pay much more than they did before.Ruth fell ill with fibromyalgia in 2015 and had to give up work. After splitting up with her long-term partner, she's been stuck in the house they shared in Kent whilst looking for somewhere smaller and more affordable to rent.\"I keep the browser open on Rightmove, Openrent, Zoopla, Facebook Marketplace and there has been nothing,\" she said. \"I'm trying to keep positive but it's difficult.\"Ruth is on benefits and has no guarantor. She believes this is stopping her being offered viewings.\"It made me feel like a lower-class citizen,\" she said. As part of the BBC's Rental Health week, listeners, viewers and readers from across the UK have been in touch about their experience of the rental market at the moment. You can listen to BBC Radio 4's Rental Health series on BBC Sounds. <https:\/\/www.bbc.co.uk\/sounds\/brand\/m001kgnf>\"We've seen a big increase in demand for rented housing from record high immigration, the economy reopening [after the pandemic],\" said Richard Donnell, executive director for research at Zoopla.\"But at the same time, we just haven't seen much new investment by landlords in rented housing. And that's creating a real crunch in availability.\"Higher mortgage rates, tax changes and new regulations for rented properties have made it less profitable for landlords to buy houses and offer them for rent.Lou Valdini from York has been a landlord for 20 years. He used to rent out three homes, but now has just one. The mortgage on his property has gone up from £294 a month to £621 and says he's \"not making any money\" and is \"actually losing an awful lot.\"As well as the mortgage, Mr Valdini has to pay several thousand pounds a year for ground rent, insurance, service charges and agent's fees. He's just put his tenant's rent up to £645 a month.\"She hasn't missed a day's rent since lockdown, so I'm not going to put the rent up an extortionate amount for her,\" he said. \"But it does mean I'm subsidising her.\"Large numbers of landlords are leaving the market - 11% of homes for sale on Zoopla were previously rented.For others, short-term lets, such as holiday lets or Airbnb, offer better returns than long-term tenants. Zoopla has seen a three-fold increase in short-term lets since 2019.But with private renters spending on average almost a third of their income on rent, Mr Donnell and other experts believe rents can't go on increasing, as people simply won't be able to pay any more.The government is due to introduce a new Renters' Reform Bill in England before the summer, which it says will redress the balance in the market and provide more security for tenants. Housing rules are different in each of the devolved nations, Scotland currently has tighter controls on landlords than the rest of the UK.Emily, her partner, and their baby son MJ had been renting a two bedroom flat in Aylesbury. The landlord wanted to put up the rent at the end of their current tenancy but the family couldn't afford it. They began searching for somewhere else to live, but it's been frustrating.\"There's been times when I've said, 'Yes, I'll take this one',\" said Emily, \"I love it, it's perfect, and then they'll say, 'It's gone'.\" It has been, she says, \"the most stressful time of my life - other than having a baby,\"After months of searching, the family had to move out of their home earlier this month. But they hadn't found somewhere new, so they had to move back in with their families - which means Emily and her partner staying under different roofs.\"On our actual relationship it's been really difficult,\" she says.The family now have one goal: \"To find a two-bed house, because then it'll have enough space for us three.\"There's more on your renting rights and where to go for help here. <https:\/\/www.bbc.co.uk\/news\/technology-65038459>Are you struggling to find somewhere affordable to rent? Do you have any tips for navigating a competitive rental market? Share your experiences by emailinghaveyoursay@bbc.co.uk <mailto:haveyoursay@bbc.co.uk?subject=Renting65090846>.Please include a contact number if you are willing to speak to a BBC journalist. You can also get in touch in the following ways:If you are reading this page and can't see the form you will need to visit the mobile version of theBBC website <https:\/\/www.bbc.co.uk\/news> to submit your question or comment or you can email us atHaveYourSay@bbc.co.uk <mailto:Haveyoursay@bbc.co.uk>. Please include your name, age and location with any submission."}