{"author":"By Daniel Rosney","title":"The Last of Us: TV series of hit game praised by critics","news_category":"general","content":"Critics have universally praised the TV adaptation of hit video game The Last of Us as it's made available in the UK.The series is described as \"comfortably the best adaptation of a video game ever made\" that has been able to \"break the curse\" on gaming-TV crossovers.Set in post-apocalyptic America, the Sony PlayStation franchise follows characters Joel and Ellie who are tasked with escaping.Sky Atlantic is showing the series and viewers can also stream it on Now.Writer John Nugent, for Empire Magazine <https:\/\/www.empireonline.com\/tv\/reviews\/the-last-of-us\/>, gave it five stars, claiming \"it never feels like you're watching a video game\".Although he commented \"it is a sometimes surreal experience to see its most iconic moments (the collapsed skyscraper, the giraffes) handsomely rendered in live action.\"The Washington Post praised the script for sticking close to the original material <https:\/\/www.washingtonpost.com\/video-games\/reviews\/the-last-of-us-hbo-season-1-review\/>, but also noted the development of some characters add to the narrative.Gene Park wrote: \"People who know the game by heart will likely be able to recite some lines right as they're being spoken in the show.\"The Independent's critic Nick Hilton gave it four stars, saying <https:\/\/www.independent.co.uk\/arts-entertainment\/tv\/reviews\/the-last-of-us-review-pedro-pascal-hbo-b2258847.html> it's \"undoubtedly a new landmark in the seemingly impossible task of adapting video games\".\"The series is successful in shrugging off the episodic nature of linear gameplay,\" he wrote. \"The design is stunning: vistas of deserted, bombed out metropolises are matched by sprawling, Western inflected, shots of rural America.\"Video game adaptations have a bad track record.Whether its the silver screen or your television screen - more often than not, gaming stories told in a linear medium have not fared well.Have a look at the audience and critical reaction to the Assassin's Creed movie, the recent Resident Evil Netflix show or Mortal Kombat Conquest in the 90s, and you'll see what I mean.However, some more recent attempts have fared better. League of Legends inspired animation Arcane, for example, showed it can be done in a way that keeps fans and newcomers entertained.The Last of Us, however, is dealing with a lot more pressure than arguably any other adaptation to date.Often seen as the pinnacle of gaming storytelling - The Last of Us will be seen by some as an opportunity to showcase how mature the games industry has become and how emotional, complex and moving the stories it tells can be. All this to an audience who may not traditionally engage with games.If the TV version fails to pack the emotional punch the game does - and have the same impact on viewers as it did players - then it might be seen as a lost opportunity to show how gaming has grown up, and now rivals the work of Hollywood.And if we believe the critics, they've gone and pulled it off.For more gaming content, go to Press X to Continue, the BBC Sounds gaming Podcast. <https:\/\/www.bbc.co.uk\/programmes\/p08x7kb5>The plot follows characters Joel and Ellie who are navigating a global pandemic (unlike Covid, there are no vaccines) 20 years after it first struck.Social distancing does feature though, largely because they're dealing with zombies - rather than a coronavirus.Joel Golby from The Guardian thinks there's some stand out acting in the series <https:\/\/www.theguardian.com\/tv-and-radio\/2023\/jan\/11\/the-last-of-us-tv-finally-has-the-perfect-video-game-adaptation> acknowledging \"it's a bold statement to make\" but episode three \"might well be one of the TV episodes of 2023\".The New York Times adds the plot is \"an extended horror story of single parenting\" <https:\/\/www.nytimes.com\/2023\/01\/12\/arts\/television\/the-last-of-us-review.html>.\"Through Joel, we feel the heartbreak of this world,\" its chief television critic said. \"Through Ellie, we see its wonder. When they come across the wreckage of a jetliner, she asks if he ever flew in one, and he recalls what an uncomfortable ordeal air travel was\".There are \"certain scenes early on that feel too gamey for television\", Stephen Kelly for BBC Culture claimed <https:\/\/www.bbc.com\/culture\/article\/20230109-the-last-of-us-review-the-best-video-game-adaptation-ever>. But he concluded: \"It is an encapsulation of the game's heart and soul - its full-blooded characters, its neat plotting, its mature themes of love and loss.\"It is, to finish Ellie's joke, 'outstanding in its field'.\""}