{"author":"By Annabelle Liang","title":"Virgin Orbit: Sir Richard Branson's rocket company cuts 85% of workforce","news_category":"general","content":"British billionaire Sir Richard Branson's rocket company Virgin Orbit says it will cut 85% of its workforce after failing to secure new investment.The firm will also cease operations for the foreseeable future, according to media reports.It comes weeks after the company paused operations in an apparent attempt to shore up its finances.Earlier this year, a Virgin Orbit rocket failed to complete the first ever satellite launch from UK soil.The company's shares plunged by more than 44% in after-hours trading in New York on Thursday.In a US regulatory filing <https:\/\/www.sec.gov\/ix?doc=\/Archives\/edgar\/data\/0001843388\/000184338823000063\/vorb-20230330.htm>, Virgin Orbit said it made the decision \"in order to reduce expenses in light of the company's inability to secure meaningful funding.\"The job cuts will impact approximately 675 employees who \"are located in all areas of the company.\"It said that Sir Richard's investment firm Virgin Investments has injected $10.9m (£8.8m) into Virgin Orbit \"to fund severance and other costs related to the workforce reduction\".Virgin Orbit said it expects the severance payments and other costs to total around $15m.It comes amid media reports that the company's boss has told staff the firm will suspend its activities until further notice.\"We have no choice but to implement immediate, dramatic and extremely painful changes,\" Virgin Orbit chief executive Dan Hart said at a meeting with employees, according to CNBC, which first reported the news.Virgin Orbit did not immediately respond to a BBC request for comment.The firm, which was founded in 2017, has not turned a profit as a public company.It develops rockets to carry small satellites and is part of Sir Richard's business empire, which includes airline Virgin Atlantic and space tourism company Virgin Galactic.This video can not be playedWatch: Virgin Orbit rocket heads into spaceIn January, Virgin Orbit attempted the first ever satellite mission launched from UK soil, which ended in failure <https:\/\/www.bbc.com\/news\/science-environment-64218883>.The company's LauncherOne rocket - which was launched from the Boeing 747 aircraft Cosmic Girl - reached space but fell short of reaching its target orbit.The mission was billed as a milestone for UK space exploration. It was hoped it would mark a major step forward in fulfilling an ambition to turn the country into a global player - from manufacturing satellites to building rockets and creating new spaceports.Earlier this month, Virgin Orbit said it was \"initiating a company-wide operational pause\" <https:\/\/www.bbc.com\/news\/science-environment-64973383> and \"anticipates providing an update on go-forward operations in the coming weeks.\""}