{"author":"","title":"Stormy Daniels 'told to leave Trump alone' over affair claims","news_category":"general","content":"This video can not be playedStormy Daniels: 'I was threatened'An adult film actress has said she was threatened to keep quiet about an alleged sexual encounter with Donald Trump in 2006.Stormy Daniels told CBS News' 60 Minutes programme that a man approached her in a Las Vegas car park in 2011.The stranger allegedly said \"leave Trump alone\", then looked at her young daughter and added: \"It'd be a shame if something happened to her mom.\"Mr Trump denies having had an affair with the actress.His lawyers are seeking $20m (£14m) in damages from her, saying she broke a non-disclosure deal signed before the 2016 presidential election.She has filed a lawsuit to scrap the agreement, saying it is invalid because Mr Trump did not sign it.Stormy Daniels, whose real name is Stephanie Clifford, said she had sex with Mr Trump just once, in a hotel room during a celebrity golf tournament in Lake Tahoe, California, in July 2006. Mr Trump married Melania Trump in 2005.Ms Daniels claims she and Mr Trump stayed in contact for years afterwards, and last spoke in 2010.While Mr Trump flew back to the capital from his Mar-A-Lago estate in Florida on Sunday night, Mrs Trump will reportedly stay in Florida for the remainder of spring vacation.In response to questions about the interview, spokeswoman Stephanie Grisham said Mrs Trump was, \"focused on being a mom and is quite enjoying spring break at Mar-a-Lago while working on future projects.\"This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.In the highly anticipated interview, which aired on Sunday evening, Stormy Daniels said she was approached by the man in the car park <https:\/\/www.cbsnews.com\/news\/stormy-daniels-describes-her-alleged-affair-with-donald-trump-60-minutes-interview\/> in 2011 after having agreed to sell her story to a magazine.But the magazine did not publish the story after legal threats from Donald Trump's lawyer, Michael Cohen, 60 Minutes reported, citing former employees. The interview was finally published in InTouch magazine earlier this year.\"I was in a parking lot, going to a fitness class with my infant daughter,\" she said.\"A guy walked up on me and said to me, 'Leave Trump alone. Forget the story'. And then he leaned around and looked at my daughter and said, 'That's a beautiful little girl. It'd be a shame if something happened to her mom'. And then he was gone.\"President Trump has not directly responded to the interview but tweeted on Monday about \"fake news\".After the programme aired, a lawyer representing Mr Cohen said he had nothing to do with the alleged threat, accused the actress and her lawyer of defaming him and demanded a public apology.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Stormy Daniels told CBS that her only sexual encounter with Mr Trump took place after he invited her to dinner in his hotel suite.She said he had shown her a magazine with his picture on the cover and she had jokingly smacked his bottom with it.\"He turned around and pulled his pants down a little, you know [he] had underwear on and stuff, and I just gave him a couple swats,\" she said.After they talked for a while, Mr Trump allegedly told her, \"You remind me of my daughter\". Stormy Daniels was 27 at the time.\"You know - he was like, 'You're smart and beautiful, and a woman to be reckoned with, and I like you. I like you,\" she said.She said that although she had not been attracted to Mr Trump, she had had unprotected sex with him, adding: \"I didn't say no. I'm not a victim.\"Mr Trump, she added, had suggested she might appear in his TV game show, The Apprentice, and she thought of the encounter \"as a business deal\".Stormy Daniels' lawyer said on Monday she was prepared to give further evidence of the alleged affair.\"She was prepared to discuss intimate details relating to Mr Trump,\" said lawyer Michael Avenatti on NBC. \"She can describe his genitalia.\"\"She can describe various conversations that they had that leave no doubt as to whether this woman is telling the truth.\"Stormy Daniels told CBS she later accepted $130,000 in \"hush money\" from Mr Cohen just before the 2016 election because she was concerned for the safety of her family.Mr Cohen confirmed in February he had privately paid her the money but did not say what it was for. Mr Trump's critics have suggested the money might amount to an illicit campaign contribution.Mr Cohen said last month that neither the Trump campaign nor the Trump Organization were parties to the transaction.Stormy Daniels told 60 Minutes she was risking a million-dollar fine by breaking the agreement and speaking out on national television \"because it was very important to me to be able to defend myself\".Given Mr Trump has been accused of sexual misconduct, infidelity and infamously boasted about grabbing women's genitals <http:\/\/www.bbc.co.uk\/news\/election-us-2016-37595321>, there have been questions asked about why this particular scandal matters, when it involves what Ms Daniels says was consensual sex.But Stormy Daniels' lawyer, Michael Avenatti, told the BBC his client's case was different to others' because of \"acts of intimidation and the tactics that have been used to silence my client\".\"I think that is very problematic and it should be very disturbing to not only the American people but anyone in western civilisation,\" he added.\"That is not how people in power should conduct themselves.\" It is also believed that Mr Trump could be called to testify in depositions if Stormy Daniels' court case proceeds.Stormy Daniels is one of three women who have taken legal action that could damage Mr Trump.Karen McDougal, a former Playboy model who claims she had an affair with Mr Trump between 2006 and 2007, has filed a lawsuit to invalidate a confidentiality agreement with tabloid newspaper the National Enquirer.She says she was paid for her story but the newspaper - published by a company run by a friend of President Trump - never ran it.Summer Zervos, a former contestant on The Apprentice, accuses Mr Trump of sexually assaulting her at a Beverly Hills hotel in 2007.Ms Zervos says that he groped her and \"began thrusting his genitals\" during a meeting to discuss employment opportunities.While president-elect, Mr Trump dismissed the allegations against him and said that Ms Zervos and other accusers were \"sick\" and driven by fame, money or politics.Ms Zervos filed a defamation law suit against Mr Trump in January 2017, but his lawyers argued that as the president he could not be sued.A judge in New York has now overturned that decision."}