{"author":"","title":"What is net zero and how are the UK and other countries doing?","news_category":"general","content":"The UK government has released plans to cut greenhouse gas emissions as part of its strategy to reach \"net zero\" by 2050.The strategy, called Powering Up Britain, focuses on boosting clean energy production.The government says it will reduce the UK's contribution to global warming, and lower electricity price, but the plans have been criticised for not going further.Net zero means not adding to the amount of greenhouse gases (GHGs) in the atmosphere.This involves reducing GHG emissions as much as possible, and balancing out any that remain by removing an equivalent amount.Greenhouse gases include carbon dioxide (CO2) and methane. CO2 is released when oil, gas and coal are burned in homes, factories and to power transport. Methane is produced through farming and landfill.These gases cause global warming by trapping the sun's energy.Meanwhile, rapid deforestation across the world <https:\/\/www.bbc.co.uk\/news\/59136545> means there are fewer trees and plants to absorb CO2.Under the 2015 Paris Agreement <https:\/\/www.bbc.co.uk\/news\/science-environment-35073297>, 197 countries agreed to try to keep future global temperature rises \"well below\" 1.5C to avoid the worst impacts of climate change.Scientists say that to achieve this, net zero must be reached by 2050 <https:\/\/www.ipcc.ch\/2018\/10\/08\/summary-for-policymakers-of-ipcc-special-report-on-global-warming-of-1-5c-approved-by-governments\/#:~:text=Global%20net%20human%2Dcaused%20emissions,removing%20CO2%20from%20the%20air.>.But UN Secretary General António Guterres recently urged all countries to bring forward their net zero targets by a decade. <https:\/\/www.bbc.co.uk\/news\/science-environment-65000182>Not all emissions can be reduced to zero, so those that remain have to be compensated for by removing greenhouse gases from the atmosphere. This is known as \"offsetting\".Natural offsetting methods include planting trees <https:\/\/www.bbc.co.uk\/news\/science-environment-55795816> and restoring peatlands - although there may not be enough space on the planet for the number required.Carbon capture and storage is another potential solution <https:\/\/www.bbc.co.uk\/news\/science-environment-64723497>. This involves using machinery to remove CO2 from the air, then solidifying it and burying it underground or under the sea.However, the technology is still emerging <https:\/\/www.iea.org\/reports\/carbon-capture-utilisation-and-storage-2>, and remains very expensive.The government was forced to release a new net zero strategy after the High Court ruled <https:\/\/www.bbc.co.uk\/news\/science-environment-62223551> that the original plan did not contain enough detail, and breached the government's legal obligations under the Climate Change Act.The new plan <https:\/\/www.bbc.co.uk\/news\/science-environment-65107072> includes measures such as:However, the Labour Party and many climate experts have criticised the strategy for lacking significant new policies or extra investment.Individuals will also have to change their behaviour to help meet the target.This could include:Reaching net zero could also mean flying less in future <https:\/\/www.bbc.co.uk\/news\/science-environment-58284257>, and eating less red meat <https:\/\/www.bbc.co.uk\/news\/explainers-59232599>Around 140 countries have pledged to reach net zero - covering about 90% of global emissions <https:\/\/climateactiontracker.org\/global\/cat-net-zero-target-evaluations\/>. However, not all have set 2050 as their goal. Some have a later date.China is currently the biggest producer of CO2 in the world, and is aiming for \"carbon neutrality\" by 2060 <https:\/\/www.bbc.co.uk\/news\/science-environment-54256826>. It hasn't set out exactly what this means or how it will get there.The US has historically been the biggest carbon emitter and is still larger than China when measured by head of the population. It has also pledged to be net zero by 2050.In August 2022, it announced a green investment package called the Inflation Reduction Act <https:\/\/www.bbc.co.uk\/news\/science-environment-62464546>, which is designed to grow the country's renewable energy market.The EU, the third biggest emitter of CO2, also has a 2050 net zero target. It recently announced its own green investment package,called the Net Zero Industry Act. <https:\/\/single-market-economy.ec.europa.eu\/publications\/net-zero-industry-act_en>India and Russia are also key emitters. They have pledged to reach net zero by 2070 and 2060, respectively but have published few policies to back this up.There's controversy about how some countries might try to reach net zero.For instance, country A might record lower emissions if it shuts down energy-intensive industries such as steel production.But if country A then imports steel from country B, it's effectively transferred its carbon emissions to country B instead of reducing the sum total of greenhouse gases.There are schemes that enable rich countries to offset their emissions by paying poorer countries to switch to cleaner fuels.However, some climate scientists worry such arrangements could let wealthier nations avoid reducing their own fossil fuel usage.And it's hard to say that initiatives funded to offset emissions elsewhere would not have happened anyway."}