{"author":"","title":"Bloody Sunday: 'Job well done' says former soldier","news_category":"general","content":"A former paratrooper being investigated for his part in Bloody Sunday has said he still believes it was a \"job well done\".The soldier also told a BBC Radio 4 documentary he refused to answer any questions when recently interviewed by the Police Service of Northern Ireland.The documentary is to be broadcast on Tuesday night.The soldier was arrested by PSNI officers as part of the investigation into the 1972 killings <https:\/\/www.bbc.co.uk\/news\/10283900>.Thirteen people died after soldiers opened fire in Londonderry on 30 January 1972. A 14th person died later.Meanwhile, Defence Secretary Gavin Williamson told the programme that he expects to have a solution early in the new year to prevent former service personnel being brought before the courts.The Defence Secretary Gavin Williamson is also challenged about his previous support for an amnesty.In a leaked letter sent to the prime minister earlier this year, he expressed his support suggesting if it had to apply to both sides in the conflict \"so be it\"But he refused to comment on the letter when asked by Peter Taylor. But he did say: \"No one would really want to see service personnel, who've served their country, being dragged through the courts.\"When asked if soldiers should escape prosecution he said \"we need to find a way to bring closure to events of the past.\" The former paratrooper was questioned at a police station in England.\"I served my country and I've served that, I think, well for 22 years,\" the former soldier told the programme presenter, journalist Peter Taylor.\"Now I'm being told I'm a murderer.\"Peter Taylor put it to the soldier that when he interviewed him in 1992 about Bloody Sunday, he said it was a \"job well done\", and asked: \"You still believe that?\"The soldier replied: \"I still believe that. They were not all innocent.\"He also insisted the three people he fired on that day were all armed, despite the findings of the Saville Inquiry.Asked about the prospect of being prosecuted and sent to jail, the former soldier said: \"Stick me in a jail, for what end?\"To what end would that help the situation in Northern Ireland?\" he asked.The Public Prosecution Service is currently considering a file from the PSNI and is expected to decide if former soldiers will be prosecuted for the killings on Bloody Sunday.Ida McKinney, whose husband, Gerry, was one of the 13 men shot dead told the programme she forgives the soldier who killed him.\"We forgive them all for what they've done. I've no bitterness against them,\" she said.But she would like to see the former soldiers stripped of the medals they received.\"They got them for a job well done and a job well done isn't exactly what happened, because they [the victims] were all innocent,\" her daughter Regina McGloughlin told the programme.The programme also considers calls for a statute of limitations on prosecutions for former members of the security forces.Former chief of the defence staff Lord Richards said he believes an amnesty would draw a line under the Troubles, but it would have to apply to former paramilitaries.\"My instinct is that it probably would have to be applied to both sides,\" he said.\"How much longer are these people on both sides you know, getting into their middle if not old age now - how much longer have they got to put up with this?Drawing A Line Under the Troubles will be broadcast on Tuesday 11 December at 20:00 GMT on BBC Radio Four."}