{"author":"","title":"Dover traffic: Eurotunnel rejects French explanation for Dover delays","news_category":"general","content":"This video can not be playedAerial video shows scale of queues leading up to DoverThe Port of Dover has declared a \"critical incident\" due to six-hour queues leading to the ferry terminal.Chief executive Doug Bannister said the port had been \"badly let down\" by French border controls.French authorities said an \"unforeseeable technical incident\" in the Channel Tunnel meant French border police were delayed into Dover.However Eurotunnel rejected this, saying it was \"categorically not the reason for the difficulties\".A spokesman added: \"The critical incident in Dover started overnight. The minor technical incident at the Channel Tunnel occurred at 07:00 BST, well after the critical incident.\"French border resources have now increased, the port said, and \"traffic is slowly beginning to move\".Dover's MP Natalie Elphicke claimed French border officers \"didn't turn up for work\", causing traffic to queue for miles.However in a statement this afternoon, the prefect for the Haut-de-France region, Georges-Francois Leclerc, said it was not correct to say that the French had failed to mobilise sufficient border police for the predicted rush.\"The increase in traffic for this weekend was fully anticipated and a suitable deployment was prepared,\" the statement said.\"The plan was to have all the police booths manned at Dover by 08:30 BST.\"An unforeseeable technical incident in the tunnel meant that police had to push back their full deployment by an hour.\"The port has warned that it would \"take some time to clear the backlog.\"A UK government spokesperson said they were \"working closely with French authorities, the Port of Dover, Kent Resilience Forum and police to ease disruption and provide on the ground support\".The leader of Dover District Council, Trevor Bartlett, said: \"Alongside the delays for tens of thousands of tourists, the local community is the biggest loser.\"He added: \"Serious questions need to be asked about how the emergency services would be able to respond to a major incident in Dover when it is completely gridlocked, and how this situation has been allowed to develop yet again?\"This video can not be playedWatch: 'We arrived in Dover at 7.30 and been in traffic since'Eurotunnel is not affected, but it will not have capacity to take any passengers from Dover.With most schools in England and Wales breaking up for summer this week, the RAC said an estimated 18.8 million leisure trips were planned in the UK between Friday and Monday.That is the most since the company began tracking summer getaway numbers in 2014.Francesco Caputo and his three children, aged 12, 11 and 7, were travelling from Southampton to Italy, via Dover, to see family.Speaking this morning he said: \"Everything has gone pear shaped.\"The family left Southampton with the advice to arrive two hours before the ferry.\"The ferry we were meant to catch was 07:50 BST. We arrived two hours before, 1.7 miles from the ferry terminal, but we're not even there now.\"I've tried to keep the children busy, so far so good. They've been rather patient.\"One traveller posted on Twitter: \"I'm booked onto 8am ferry from Dover and it's total gridlock. Moved 50 metres per hour. At this rate it'll be 34 hours before I get to the port.\"Another person attempting to make the Channel crossing said they had been \"waiting five hours and still not in the port\".Ferry operator P&O Ferries has advised passengers to arrive prepared with snacks and water, adding: \"Please be aware that there is heavy traffic at border control in the port of Dover.\"If you are booked to travel today please allow at least six hours to clear all security checks.\"The UK government blamed French authorities for the delays at Dover, with Europe minister Graham Stewart saying some disruption was inevitable, but the issue laid with French authorities.Ms Elphicke added there had been \"weeks of preparation\" for an anticipated busy week, by the port, the Department for Transport and Kent Resilience Forum, and \"much work with French counterparts too\".She said: \"Despite all this, French border officers didn't turn up for work at the passport controls as needed.\"In a statement the Port of Dover said: \"The port is working to do all it can with ferry operators and local partners to assist with clearing the queues caused by inadequate French border capacity.\"We urge French colleagues to adequately resource the border, not just to relieve the current situation, but for the rest of the weekend and indeed the rest of the summer to keep our community clear, to get families on their holidays and to keep essential trade moving.\"The port also called on the UK government to continue working with France to make sure this happened.Has your journey been affected by the delays in Dover? You can share your experience by emailinghaveyoursay@bbc.co.uk <mailto:haveyoursay@bbc.co.uk?subject=Doverdelays62263176>.Please include a contact number if you are willing to speak to a BBC journalist. You can also get in touch in the following ways:If you are reading this page and can't see the form you will need to visit the mobile version of theBBC website <https:\/\/www.bbc.co.uk\/news\/have_your_say> to submit your question or comment or you can email us atHaveYourSay@bbc.co.uk <mailto:Haveyoursay@bbc.co.uk>. Please include your name, age and location with any submission.Follow BBC South East on Facebook <https:\/\/www.facebook.com\/BBCSE\/>, on Twitter <https:\/\/twitter.com\/bbcsoutheast>, and on Instagram <https:\/\/www.instagram.com\/bbcsoutheast\/>. Send your story ideas to southeasttoday@bbc.co.uk."}