{"author":"By Andre Rhoden-Paul & Sean Seddon","title":"Matt Hancock: Eight government WhatsApp Covid messages revealed","news_category":"general","content":"This video can not be playedWatch: Matt Hancock WhatsApp message row in 83 secondsWhatsApp messages sent by Matt Hancock when he was health secretary during the pandemic have been revealed.The messages, including conversations with ministers and officials, provide an insight into the inner workings of government at the height of the pandemic.Here are a few of the private texts published in the Daily Telegraph <https:\/\/www.telegraph.co.uk\/news\/lockdown-files\/> newspaper. The BBC has not seen or independently verified the WhatsApp messages nor the context in which they were sent.After congratulating the then education secretary Sir Gavin Williamson on delaying A-level exams for a few weeks - a shorter period than some teaching unions called for - Mr Hancock had some choice words.On 1 October 2020, Mr Hancock messaged Sir Gavin: \"Cracking announcement today. What a bunch of absolute arses the teaching unions are.\"Sir Gavin replied: \"I know they really really do just hate work.\"In response, Mr Hancock returned two laughing out loud and a bullseye emoji. Mr Hancock texted his old boss George Osborne, ex-chancellor and then-Evening Standard editor, on 28 April 2020 to \"call in a favour\" asking for a favourable front page, as he tried to reach his own deadline to reach100,000 daily Covid tests <https:\/\/www.bbc.co.uk\/news\/uk-52140376>. Mr Osborne replied: \"Yes - of course - all you need to do tomorrow is give some exclusive words to the Standard and I'll tell the team to splash it.\"After replying with a quote, Hancock later writes in capital letters: \"I WANT TO HIT MY TARGET!\"The editor answered bluntly: \"I gathered.\" In another interaction, on 9 November 2020 Mr Hancock asked for an explanation about Mr Osborne calling for Boris Johnson to make testing his number one priority and insisted: \"OK but mass testing is going very well.\"\"No-one thinks testing is going well, Matt,\" Mr Osborne replied. Sir Gavin, messaging Mr Hancock, on 10 May 2020 ahead of schools reopening, asked for the health secretary's help in getting personal protective equipment (PPE) for schools \"as a last resort so they can't use it as a reason not to open\".The education secretary texted: \"All of them will [open] but some will just want to say they can't so they have an excuse to avoid having to teach, what joys!!!\"Boris Johnson had misgivings about the government's shielding advice in discussions with the chief medical officer Prof Sir Chris Whitty. In August 2020 the then-prime minister suggested that if renewed lockdown restrictions were needed over-65s be offered a choice on shielding.Mr Johnson, addressing Sir Chris in a WhatsApp group on 9 August, said: \"If you are over 65 your risk of dying from Covid is probably as big as your risk of falling down stairs. And we don't stop older people from using stairs. What do you think?\"Sir Chris conceded that he \"would think twice before shielding unless it threatened the NHS\". Chief scientific adviser Sir Patrick Vallance replied: \"We haven't found shielding easy or very effective first time round.\"Only a few days previously, shielding had ended  <https:\/\/www.bbc.co.uk\/news\/uk-53618776>for more than two million clinically vulnerable people in England, Scotland and Wales. Since March 2020 they had been advised to stay at home to avoid contracting Covid. Shielding later returned.Helen Whately, who was social care minister at the time, travelled 50 miles to a Covid test centre so a relative could be tested in September 2020, according to the Telegraph. There were restricted numbers of home testing kits and the public had to book a slot at a testing centre, where they could swab themselves and it would be sent to a laboratory.Speaking of the experience on 19 September, she messaged Mr Hancock: \"So my mystery shopping shows the system is definitely working, at least for some.\"Mr Hancock enthusiastically replied \"for MOST!\", despite UK labs struggling to keep up with demand and people being asked totravel hundreds of miles to get tested <https:\/\/www.bbc.co.uk\/news\/health-53990068>. Mr Hancock clashed with Sir Gavin over whether to close schools ahead of their return January 2021.In private WhatsApp messages with a special adviser, he said he had to take \"rear guard action\" to ensure schools did not open, while the then-education secretary was battling to keep children in school.During a meeting on Zoom on 28 December 2020 to decide on the fate of students, Mr Hancock and his special adviser Emma Dean appeared to send each other messages commenting on the call, according to the Telegraph.Ms Dean said: He's [Sir Gavin] freaking out. You can tell he isn't being wholly rational.\"Mr Hancock got his way as schools closed days later amid a national lockdown.In an earlier exchange in September the pair took aim at Sir Gavin following the education secretary being forced to abandon A-level and GCSE students being given grades byalgorithm <https:\/\/www.bbc.co.uk\/news\/uk-53810655>. Replying to Ms Dean's suggestion Gavin looked awful and questioning if the education secretary was OK, Mr Hancock said: \"He needs a haircut and a holiday somewhere other than Scarborough!\"During the May 2020 drive to hit the 100,000 tests per day target, trucks full were bought from Amazon.Mr Hancock was worried the government could look \"flaky\" if it was accused of using them to pad the stats.But there was jubilation when the target was hit - not least from Gina Coladangelo, the aide with whom Mr Hancock had an affair.She messaged: \"Drinks cold in fridge at [Department for Health]. Feel free to open them before we are back [beer emoji]\".But problems continued. Mr Johnson admitted in June he was \"going quietly crackers\" over capacity, asking \"what is wrong with us as a country that we can't fix this?\".In September, Mr Hancock was advised to avoid an interview with Andrew Neil \"because he could go hard on testing\".One set of messages shows Boris Johnson getting in a muddle over statistics.He flagged a Financial Times article stating the global case fatality rate had fallen below 0.04. Mr Johnson wanted to know why the British death rate appeared to be much higher at 4%.Chief scientific officer Sir Patrick, chief medical officer Sir Chris, aide Dominic Cummings, Cabinet Secretary Simon Case and Mr Hancock all chipped in.When Mr Vallance eventually pointed out the FT figure is a probability, not a percentage, the PM replied \"Eh\" followed by another message reading simply \"?\".He offers \"five marks\" to whoever can explain the difference and asks them to \"show working\" - before Mr Cummings assures him it is a \"common confusion\".In the same exchange, Mr Johnson says he \"knows what I would prefer\" if he was 80 and given a choice between exposure to Covid-19 and \"destroying the economy\".A collection of more than 100,000 messages sent between former Health Secretary Matt Hancock and other ministers and officials at the height of the Covid-19 pandemic have been obtained by the Telegraph. Here are our stories on the leaks:"}