{"author":"By Steven McIntosh","title":"Oscars 2023: Austin Butler's accent and 7 more awards season highlights","news_category":"general","content":"After last year's super-boring Oscars, where nothing remotely interesting or notable happened at all, thank goodness this year's Hollywood awards season has provided so many memorable moments.Instead of on-stage slaps <https:\/\/www.bbc.co.uk\/news\/entertainment-arts-60897004>, so far in the 2023 awards season we've witnessed comebacks, publicity stunts, awkward hosts, star selfies and a slightly questionable rap.The race reaches its climax with the Oscars ceremony in Los Angeles on Sunday, and we'll have more coverage of the Oscar-nominated films and assess their chances later this week.But for now, we're looking back at eight of the more light-hearted highlights of the past year.Every awards season needs a box office smash with a top-drawer movie star to balance out the lesser-known arthouse films, and Tom Cruise sprinkled ample stardust on proceedings this year.The 60-year-old launched Top Gun: Maverick by arriving at the film's world premiere in San Diego last May in a helicopter.After several Covid-induced delays to the film's release, Cruise said: \"This moment right here, getting to see everyone, no masks. This is pretty epic.\"It was the perfect way to launch what would become one of the biggest hits of the year, <https:\/\/www.bbc.co.uk\/news\/entertainment-arts-61630131> taking a staggering $1.4bn (£1.16bn) at the global box office.That figure was eclipsed only by Avatar: The Way of Water, which took $2.27bn (£1.89bn) - but James Cameron's sci-fi epic had the considerable advantage of being released in China,which Top Gun wasn't.  <https:\/\/www.bbc.co.uk\/news\/world-us-canada-61710500>One issue that springs up every year is the time limit awards producers impose on acceptance speeches - with many winners regularly going over their allotted 45 seconds.When the Golden Globes attempted to wrap Michelle Yeoh up by playing walk-off music in January,the actress told them from the stage: <https:\/\/twitter.com\/SpencerAlthouse\/status\/1612995320337633281> \"Shut up please. I can beat you up, and that's serious.\"To be fair, she had been talking for a full two minutes by this point, and continued for another two after successfully batting away the music.But having seen her performance in Everything Everywhere All At Once, we don't doubt Yeoh could've easily held her own in a scrap.The Elvis star's real-life speaking voice was the biggest shock since Killing Eve fans found out Jodie Comer was actually from Liverpool.Butler grew up in Anaheim, California, some distance from Presley's Mississippi roots, but became so immersed in his role as the legendary singer in Baz Luhrmann's biopic that he continued talking like Elvis long after filming had wrapped.\"I had three years where that was my only focus,\" he told reporters at the Golden Globes. \"So I'm sure there are pieces of him in my DNA, and I'll always be linked.\"We're OK with Butler hanging on to his gravelly timbre and southern drawl. If he ever leaves acting behind, we would warmly endorse him launching a new career hosting every podcast and voicing every audiobook.The best supporting actor frontrunner has been a joy to follow on social media, thanks to the selfies he takes with every Hollywood star he meets.Quan stepped back from acting for more than a decade after struggling to recapture the success he had as a child star in such films as Indiana Jones and the Temple of Doom and The Goonies.His casting in Everything Everywhere All At Once launched him back into the spotlight, and Quan has quite rightly been revelling in all the events he's attended throughout the season.He has posted selfies <https:\/\/www.instagram.com\/kehuyquan\/?hl=en> with stars including Cruise, Ben Stiller, Sigourney Weaver, Gwendoline Christie, Richard E Grant, Steven Spielberg and Harrison Ford - the latter two he knew from Indiana Jones - as well as a plethora of chat show hosts and red carpet reporters.The best part is the way he excitedly points at everyone he's taking a photo with, a gesture that translates as: \"Holy moly, look who I'm standing next to!\"This year's Screen Actors Guild (SAG) Awards was one of the most entertaining precursor ceremonies, attracting praise from film fans for letting acceptance speeches run long and not attempting to play anybody off.The SAGs had the luxury of airing on Netflix's YouTube channel after the streamer took over the rights from the previous broadcast network, which meant producers didn't have to worry about timings or ad breaks.The ceremony also gave us some of the best category presentations of the season - with perfect pairings such as Zendaya and Paul Mescal sending social media into overdrive.But the highlight was a brilliantly deadpan sequence <https:\/\/twitter.com\/SpencerAlthouse\/status\/1630015201180278785> from The White Lotus star Aubrey Plaza and Wednesday's Jenna Ortega. The pair stood awkwardly and complained they had nothing in common, before speaking in perfect unison and suddenly understanding why fans have drawn similarities between them.Now look here, we will not tolerate any jokes about this one, so stop sniggering at the back.Every year we hear complaints that awards ceremonies don't do anything fun, different or original to keep viewers entertained, so DeBose deserves credit for taking a big swing this year with her own rap paying tribute to the female nominees at the Baftas.Kicking off the ceremony, DeBose praised the performances of actresses such as Ana de Armas and Jamie Lee Curtis, in a verse that memorably featured the immortal words: \"Angela Bassett did the thing \/ Viola Davis my Woman King.\"She might have been out of breath, her pronunciation of certain names might have been questionable, but we salute you Ariana and request that you are booked again for next year.This year's Independent Spirit Awards provided several golden moments, including Women Talking directorSarah Polley's comedic response to Mark Wahlberg <https:\/\/twitter.com\/jordanjwoodson\/status\/1632167135937019904> getting the name of her film wrong when he introduced it at the SAG ceremony.But many of the Indie Spirit highlights came from host Hasan Minhaj, who delivered some genuinely funny jokes... but also some bits that didn't land.In one attempt to create a viral moment, Minhaj said to the audience: \"Let's get some YouTube views. I'm going to throw you a few clickbaity titles and you give me that YouTube thumbnail face.\"Cate Blanchett, however, was not in the mood to take part, so hid under her table <https:\/\/twitter.com\/SamTheParasite\/status\/1632153747609591809> as the host attempted to engage her.Undeterred, Minhaj asked director Todd Field and actresses Marisa Tomei and Regina Hall to pull faces instead. But all of them clearly thought Blanchett had the right idea, and promptly crawled under the same table.Brendan Fraser was a box office star at the turn of the millennium with films such as The Mummy and George of the Jungle.The 54-year-old then spent several years out of the spotlight, taking on smaller roles as he struggled to recapture his earlier success.Once he was cast as the lead in Darren Aronofsky's The Whale, however, his stunning and sympathetic performance reminded everyone of his capabilities and provided the kind of comeback story Hollywood loves.Becoming emotional at the Critics Choice Awards, <https:\/\/www.bbc.co.uk\/news\/entertainment-arts-64288415> Fraser said to Aronofsky: \"I was in the wilderness. And I probably should have left a trail of breadcrumbs. But you found me,\"A month later, at the SAG Awards, he voiced words of encouragement to other struggling actors. \"I just want you to know, all the actors out there who have gone through that or are going through that, I know how you feel,\" he said.\"But believe me, if you just stay in there and put one foot in front of the other, you'll get to where you need to go.\""}