{"author":"By Matt Precey & Nikki Fox","title":"Patients near Norwich hospital died after ambulance delays","news_category":"general","content":"A coroner has highlighted ambulance delays after two patients died despite being close to a hospital.Barbara Hollis, 71, and Christina Ruse, 79, required a transfer from a private unit to the Norfolk and Norwich Hospital (NNUH), less than two miles away.Coroner Jacqueline Lake has sent a report to the East of England Ambulance Service (EEAS).Chief executive Tom Abell apologised to the families of the women.Separate inquests were held into their deaths. The first hearing was told Ms Hollis' condition deteriorated following a knee replacement operation on 22 February at the Spire Hospital in Norwich.A decision was made to transfer her to the high dependency unit at the NNUH. The ambulance service was called at 19:51 GMT and was told that \"immediate clinical intervention was needed\", according to the coroner'sprevention of future deaths (PFD) report <https:\/\/www.judiciary.uk\/wp-content\/uploads\/2022\/10\/Barbara-Hollis-Prevention-of-future-deaths-report-2022-0264_Published.pdf>.But the correct procedure was not followed and Spire staff were told there would be a two hour delay in an ambulance attending.Another call was placed at 21:17 as Mrs Hollis continued to deteriorate and the vehicle arrived 10 minutes later.She died during the early hours of the following day.Ms Lake also highlighted how two months previously, in December 2021, Spire staff called for an ambulance to transfer Christina Ruse to the high dependency unit.They were also told there would be a two hour wait, despite it being a five minute drive away,the separate PDFR report said <https:\/\/www.judiciary.uk\/wp-content\/uploads\/2022\/10\/Christina-Ruse-Prevention-of-future-deaths-report-2022-0265_Published.pdf>.Ms Ruse had opted to go private for a hip replacement due to a lengthy NHS waiting list but there were complications following her surgery.An ambulance eventually arrived an hour and a half after the initial call at 19:27, despite it being coded as category two, requiring a response within 40 minutes.This video can not be playedAmbulance queue at Norfolk and Norwich University Hospital caught on cameraIn the meantime, surgeons at the Spire Hospital decided to initiate an exploratory operation as her blood pressure was low and there was bleeding.Eventually Ms Ruse was taken to the high dependency unit at 22:42, where she died the following day.In her report, Ms Lake noted that there were a lack of emergency ambulances due to high demand.She wrote: \"It is accepted that (the ambulance trust) have taken several steps following the increase in call demand and subsequent delays in responding to patients.\"However evidence was heard that it will take up to a year to see if these steps are effective.\"In the meantime, there is concern that future deaths will occur.\"Ms Ruse's partner of 40 years, Elana Katz, said that she did not blame the ambulance trust for the death of her loved one.She told the BBC: \"Christina had a lot of comorbidities but before the operation we had gone through enormous pre-op consultations where we talked about the issues quite extensively.\"She also praised the paramedics who had waited until after their shift had ended to ensure her partner was transferred.\"She was so full of life. If I had to blame anyone, it would be a government that is deliberately reducing funding to undermine a funded service to promote private interests,\" Ms Katz added.Tom Abell, the ambulance trust's chief executive, said: \"We would like to reiterate our sincere condolences to the families of Mrs Hollis and Mrs Ruse and apologise to them for the delays they experienced.\"We are giving careful consideration to the prevention of future death reports and are responding to the coroner.\"We have been facing incredibly high demand for some time and are seeing increasing numbers of very poorly patients, while significant handover delays at hospitals are continuing to have an impact on our ability to reach patients as quickly as we would like.\"We are working with NHS colleagues to identify ways to reduce hospital handover delays. We are also carrying out a number of initiatives to increase our capacity.\"This includes increasing the number of private ambulances we have on shift, recruiting additional clinical staff and using non-clinical drivers to support our clinicians to maximise the number of ambulances we have on the road.\"We are also developing projects across our region to reduce the number of patients requiring hospital admission, including directing patients to urgent community response services.\"A spokesperson for The Spire Hospital in Norwich said: \"Spire Healthcare again offers our most sincere condolences to the families of Christina Ruse and Barbara Hollis for the loss of their loved ones.\"A Department of Health and Social Care spokesperson said: \"The Health and Social Care Secretary has set out her priorities of A, B, C and D - ambulances, backlogs, care, doctors and dentists.\"Our plan for patients sets out a range of measures to help ease pressures, including an extra £500m to speed up discharge and free up beds.\"This is alongside NHS plans to rapidly boost capacity and resilience ahead of winter, including increasing the number of NHS 999 and 111 call handlers and creating the equivalent of at least 7,000 more beds.\"Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}