{"author":"","title":"Christopher Alder Hull mortuary mix-up: No prosecution","news_category":"general","content":"No-one will be prosecuted over a mortuary mix-up that led to a woman's body being buried in the grave of a man who died in police custody.Grace Kamara, 77, was buried in Christopher Alder's grave after he died at a police station in Hull in 1998.His body was discovered in a Hull mortuary in 2011. Mr Alder's sister, Janet, said the family was \"devastated\" at the decision made by South Yorkshire Police, who investigated the mix-up.In a statement, the force said there was \"no realistic prospect\" of conviction for misconduct or the prevention of a lawful burial.Following an exhumation, Ms Kamara's body was discovered in Mr Alder's grave in the city's Northern Cemetery.Mr Alder, a former paratrooper, choked to death at Hull's Queen's Gardens police station after being arrested in 1998.A group of five police officers charged with neglect of duty following Mr Alder's death were cleared by an independent inquiry in 2003 after their trial for manslaughter collapsed the previous year.Mr Alder was believed to have been buried in 2000 at Northern Cemetery but his body was found in the mortuary in November 2011.Both bodies have since been reburied.South Yorkshire Police said: \"On 29 April this year, the investigation team presented a detailed and extensive investigation report to the Crown Prosecution Service to seek formal advice relating to a number of mortuary staff to establish if they had committed criminal offences.\"After careful consideration of all the circumstances and the evidence available, the Crown Prosecution Service has concluded that there is no realistic prospect of a conviction for either misconduct in a public office or the prevention of the lawful burial of a body.\"Det Supt Richard Fewkes, who led the investigation, said: \"While the investigation will not lead to a criminal prosecution, I am now in a position to explain to the families of Christopher Alder and Grace Kamara the likely circumstances that may have led to these very tragic events.\"Miss Alder said the family was \"gutted\" at the news and no closer to finding out who was responsible for her brother's death or the subsequent burial mix-up.\"We are devastated. Nobody has answered any of my questions before, I can't expect anyone to do so now.\"I don't want a 'theory' about what happened. I want answers.\"Lawyer Ruth Bundy, acting for Mr Alder's family, said during the period under investigation management of the mortuary passed from the local council to Hull and East Yorkshire Hospitals Trust.Following the South Yorkshire Police statement, Hull City Council said: \"This was a tragic and most distressing event for the families and friends of both Mr Christopher Alder and Mrs Grace Kamara.\"We hope that we have acted as sensitively as possible since these events came to light.\"Phil Morley, chief executive of Hull and East Yorkshire Hospitals NHS Trust, said: \"We extend our thoughts to the friends and family of Christopher Alder and Grace Kamara for whom this has clearly been a very difficult and emotional time.\""}