{"author":"","title":"Syria conflict: Macron criticises Trump's withdrawal decision","news_category":"general","content":"This video can not be playedIs this the end for Islamic State?France's President Emmanuel Macron has said he deeply regrets President Donald Trump's controversial decision to withdraw all US troops from Syria.\"An ally must be dependable,\" said Mr Macron, who reportedly called Mr Trump to warn him against the plan.The US said the Islamic State (IS) group had been defeated, a claim disputed by allies and US politicians.France, a key part of the US-led coalition against IS in Syria and Iraq, said its troops would remain in Syria.Some 2,000 US troops have helped rid much of Syria's north-east of the jihadist group, but pockets of fighters remain.Critics of Mr Trump's decision say it could lead to a resurgence of the group, and Defence Secretary Jim Mattis resigned over the issue.Speaking on a visit to French troops in Chad, Mr Macron said: \"To be allies is to fight shoulder to shoulder. It's the most important thing for a head of state and head of the military.\"Mr Trump's sudden announcement on Wednesday and Gen Mattis' resignation sparked concern <https:\/\/www.bbc.co.uk\/news\/world-us-canada-46628811> even among Republican supporters of the president.The US special presidential envoy for the Global Coalition to Defeat IS, Brett McGurk, also quit over the decision. <https:\/\/www.bbc.co.uk\/news\/world-us-canada-46661384>Meanwhile, the French president paid tribute to Gen Mattis, calling him a \"reliable partner\".Mr Macron's remarks are the latest in a series of recent tense exchanges <https:\/\/www.bbc.co.uk\/news\/world-europe-46212727> between the two leaders who are often described as close allies <https:\/\/www.bbc.co.uk\/news\/world-europe-43840965> with a good personal and working relationship.He also stressed the importance of the Syrian Democratic Forces (SDF), an alliance of Syrian Kurdish and Arab fighters credited with playing a major role in the virtual elimination of IS after it overran large swathes of Syria four years ago.\"I call on everyone... not to forget what we owe them,\" he said.The president, who has long pledged to pull troops out of Syria, continued to insist that his decision was the right one and that, now that IS was defeated on the ground, other players could take care of the situation.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.The US troops have largely been stationed in the Kurdish region in northern Syria and the Pentagon said it was transitioning to the \"next phase of the campaign\", without giving details.This video can not be playedOn board the eye in the sky watching SyriaA recent US report said there were still as many as 14,000 IS militants in Syria <https:\/\/media.defense.gov\/2018\/Aug\/06\/2001950941\/-1\/-1\/1\/FY2018_LIG_OCO_OIR3_JUN2018_508.PDF> and even more in neighbouring Iraq. There is a fear they will shift to guerrilla tactics in an attempt to rebuild their network.But the partnership between the US and the Kurds has enraged neighbouring Turkey, which views the Kurdish YPG militia - the main fighting force in the SDF - as an extension of a banned Kurdish group fighting for autonomy in Turkey."}