{"author":"","title":"£1.4m mental health project to help school pupils","news_category":"general","content":"Pupils who are showing early signs of anxiety, depression or self-harm will be able to receive specialist help at school.A pilot scheme is being launched in Wales where NHS staff will be on hand to give better mental health support.They can help spot problems early and ensure a child has the right care.The £1.4m, two-year Welsh Government trial will take place across north east and south east Wales and Ceredigion.A week ago, the National Education Union urged the Welsh Government <http:\/\/www.bbc.co.uk\/news\/uk-wales-41267915> to introduce wellbeing officers into schools.In the 12 months to October 2016, there were 19,000 referrals to Child and Adolescent Mental Health Services (CAMHS) in Wales - a 3,000 rise on the previous year.Some children feel under pressure to do well in exams while others have said they are being bullied through social media.But a UK-wide benchmarking of specialist CAMHS in 2016 indicated about a third of all referrals were inappropriate.Carol Phillips, student support and child protection officer at Crickhowell High School in Powys, said she had noticed a big change over the years.\"In today's society for young people they are faced with so many challenges,\" she said.\"I think social media has had a major impact on how this generation are.\"They live their lives online, often skewing what's reality and what's not reality, and with that comes many problems.\"This video can not be playedCarol Phillips, student support officer at Crickhowell High School in Powys, highlighted the role social media has playedShe said it could affect self-esteem and their image but added there were other reasons people suffer mental health issues.\"We also see people who present to us with anxiety, depression, eating disorders, self-harm to name a few.\"In school as well there are exam pressures and [pressures] with the current changes in the framework of assessments for young people.\"Dr Dave Williams, divisional director of family and therapy services at Aneurin Bevan University Health Board, said there was concern about the number of children needing mental health help.\"There are lots of people who have mental health problems, not all of whom have mental illness.\"CAMHS has come under a lot of pressure to be able to be the solution to some of these problems.\"But if we don't do anything to turn the tap off, we'll run out of resource. It's a whole system approach which is required.\"This video can not be playedNaomi Lea, 19, said she suffered mental health problems when she was at schoolAnnouncing the trial Health Secretary Vaughan Gething said: \"One in four people in Wales will experience mental health problems at some point in their lives.\"Getting the right treatment at an early stage, coupled with greater awareness of conditions, can in many cases prevent long term adverse impacts.\"This will ensure children, teachers and others charged with caring for children in our schools, receive support to promote good emotional and mental health.\"In August, charity Samaritans Cymru called for lessons in emotional and mental health to be mandatory for all secondary schools <http:\/\/www.bbc.co.uk\/news\/uk-wales-41010828> in Wales and has launched a pilot scheme in Cardiff."}