{"author":"By Jonathan Amos","title":"Ape's fig challenge wins photo award","news_category":"general","content":"Who dares wins. An orangutan pictured climbing high into a tree to reach some figs has taken the top honour in the 2016 Wildlife Photographer of the Year (WPY) competition.American Tim Laman caught the scene using a remote camera placed in the rainforest canopy of Gunung Palung National Park in Indonesian Borneo.Of course, the field biologist and photo journalist first had to clamber up himself to position his equipment.That fearlessness has been rewarded.\"This is a shot I had imagined for many, many years,\" Tim told BBC News. \"I had followed this orangutan for several days and it led me to this wild strangler fig. After the first time the orangutan fed there and left the tree, I climbed up and rigged three remote cameras. I then waited for the orangutan to come back the next day when I triggered the cameras from the ground. This is the best image of several that I got.\"The chair of the WPY judges, Lewis Blackwell, commented: “It’s a difficult-to-achieve shot. This is very often what winsWildlife Photographer of the Year <http:\/\/www.nhm.ac.uk\/visit\/wpy.html>: a picture that has a high degree of technical difficulty, but one that also has something to say; and Tim’s image certainly has that as well.”The back story is evident when you look at the six pictures the American submitted to the WPY category for Wildlife Photojournalist Award, which he jointly won.This series of shots illustrates the pressure the Asian great ape is under because of habitat loss.Last year, vast tracts of forest in Indonesian Borneo and Sumatra were ravaged by fire in the dry, El Niño weather that gripped the region. Conservationists had to scramble to rescue in-danger and orphaned orangutans.\"It is so critical to protect the remaining habitat of these amazing animals,\" said Tim.This year’s junior award goes to 16-year-old Gideon Knight from the UK. His picture, taken in London’s Valentines Park, shows a crow in a tree backlit by the Moon.“It’s not an unfamiliar subject, but it’s got a freshness to it and a very pleasant aesthetic,” Mr Blackwell told BBC News.“I don’t know whether Gideon has been studying his art history but he’s got a feel for composition and artistic reference, which is terrific in someone so young.”This is the Urban category winner. It is called \"The alley cat\" and was taken by India's Nayan Khanolkar in a suburb of Mumbai that borders Sanjay Gandhi National Park. Leopards will often creep through the streets at night, which can lead to conflict with humans. Four months of effort went into getting this shot which is lit with a subtle flash so as not to dominate the mood of the alley.Gideon's picture, called simply “The Moon and the Crow”, is another perspective on the wildlife that exists in our towns and cities. And capturing animal activity in the urban setting was now a very noticeable trend in WPY entries, said the WPY judge.“I guess it’s an indication that more and more of us live in cities. And what we’re seeing is increasingly rich and important coverage of what that means for the natural world, in the way we live side by side with species.”This very industrial backdrop is in Spain. The oil refinery was noisy, polluted and constantly floodlit, but look closely and you can see a high-rise nest of white storks. There is a second nest in the lower left portion of the frame. The image was taken by Juan Jesús González Ahumada as a storm approached the refinery.The fox is the classic subject for an urban wildlife photograph. Sam Hobson took this photo in Bristol, UK. It took weeks to scout the right location and earn the trust of a fox family that eventually would accept him and approach him. This particular animal liked to sit on the wall in the evening.Wildlife Photographer of the Year was founded in 1965 by BBC Wildlife Magazine. Back then, it was just for animal pictures but has since expanded to include much broader categories, including landscapes.The Natural History Museum in London now runs WPY and, as has become customary, will be hosting an exhibition of the winning pictures that will eventually go on tour.Angel Fitor calls this image \"The dying of the light\". It won the Invertebrates category. It shows a barrel jellyfish in the shallow coastal lagoon of Mar Menor in southeastern Spain. It took Angel three years of preparation to get this shot.Valter Binotto's image of hazel catkins in northern Italy won the WPY's Plants category. Hazel has both male and female flowers on the same tree, though the pollen must be transferred between trees for fertilization. Each catkin comprises an average of 240 male flowers, while the female flower is a small bud-like structure with a red-tufted stigma.Paul Hilton's shocking image, \"The Pangolin Pit,\" won the Wildlife Photojournalist Award: Single image category. It's a huge seizure of 4,000 frozen pangolins that were destined to be illegally shipped from Belawan in Sumatra to Chinese and Vietnamese markets.Jonathan.Amos-INTERNET@bbc.co.uk <mailto:Jonathan.Amos-INTERNET@bbc.co.uk> and follow me on Twitter:@BBCAmos <https:\/\/twitter.com\/#!\/BBCAmos>"}