{"author":"","title":"Facebook moves to protect Afghan users' accounts amid Taliban takeover","news_category":"general","content":"Facebook has brought in new safety measures for users worried for their safety in Afghanistan, as the Taliban continue to cement their grip on power.The firm says it \"removed the ability to view and search the 'Friends' list for Facebook accounts in Afghanistan\" to protect people from being targeted.Professional networking site LinkedIn has also taken steps by hiding the connections of anyone in the country.There are concerns the Taliban are using social media to track opponents.The additional safety measures were announced on Thursday by Facebook's head of security policy, Nathaniel Gleicher.\"We've launched a one-click tool for people in Afghanistan to quickly lock down their account. When their profile is locked, people who aren't their friends can't download or share their profile photo or see posts on their timeline,\"Mr Gleicher tweeted. <https:\/\/twitter.com\/ngleicher\/status\/1428474000611573762>He said that on Facebook-owned Instagram \"we're rolling out pop-up alerts in Afghanistan with specific steps on how to protect your account\".Mr Gleicher added that Facebook was \"working closely with our counterparts in industry, civil society and government to provide whatever support we can to help protect people\".Earlier, the tech giant confirmed it would continue to ban Taliban content from its platforms <https:\/\/www.bbc.co.uk\/news\/business-58239786> as it considers the group to be a terrorist organisation.Meanwhile, Twitter said in a statement this week that its \"top priority is keeping people safe, and we remain vigilant\".\"The situation in Afghanistan is rapidly evolving. We're also witnessing people in the country using Twitter to seek help and assistance.\"Twitter has come under scrutiny for its handling of Taliban-related content.Taliban spokesmen used the platform to update their hundreds of thousands of followers, as the militant group retook control of Afghanistan.In response to BBC questions earlier this week about the Taliban's use of Twitter, a company spokesperson highlighted policies against violent organisations and hateful conduct.According to its rules, Twitter does not allow groups that promote terrorism or violence against civilians.In a statement emailed to the BBC, a LinkedIn company spokesperson said: \"Our team is closely monitoring conversations about developments in Afghanistan and taking action on any content that doesn't follow our professional community policies.\"We've also taken some temporary measures including limiting the visibility of connections for our members in the country.\"This video can not be playedAfghanistan crisis: 'Many here will be deeply fearful for their future'"}