{"author":"","title":"Woman single-handedly takes on BA and wins","news_category":"general","content":"A woman who represented herself in court using 80-year-old contract legislation has beaten British Airways (BA) in a row over flight vouchers.In January 2020, Jennie Barber booked two return flights to Japan departing that May, but the flights were later pulled due to Covid restrictions.BA offered a refund in the form of travel vouchers but Ms Barber wanted her money back. The airline refused.Representing herself, Ms Barber took BA to court and won a full refund.\"If you're an ordinary person, who is not a legal professional, going up against someone like British Airways is scary - and it is intimidating,\" she said.However, Ms Barber, who studied A-level law, was able to beat the airline giant in court using theLaw Reform (Frustrated Contracts) Act 1943. <https:\/\/www.legislation.gov.uk\/ukpga\/Geo6\/6-7\/40\/contents>Ms Barber said she had requested the vouchers - in effect store credit to the value of her flights - in March 2020, after Japan closed its borders to foreign travellers during the first wave of the pandemic.Her frustration began, she explained, when her preferred destination of Japan did not reopen its borders to visitors as quickly as other nations. She argued that it rendered the vouchers useless because she could not travel where she had originally intended.By December 2020, with Japan's borders still closed, she raised the issue with BA and requested a cash refund, but her request was denied.The Birmingham resident told the BBC she spent approximately 12 months - most of 2021 - trying to persuade BA to reconsider her request. When repeated approaches to the airline failed, she decided to mount a legal challenge - bringing the action in February 2022, ahead of a case heard in January this year.It was during this period that she came across legislation stating that because the sale involved, through no fault of her own, something that was subsequently impossible to deliver, she was legally entitled to her money back.Restrictions on travel to Japan - where Ms Barber once lived - were not lifted until November 2022.Ms Barber said she was moved to take matters into her own hands because she \"didn't feel it was right\" there was no leeway on vouchers when Japan's borders remained shut.Armed with an A-level in law from City College in Coventry, she began to conduct research at her local library. It was here she found out about the law she used to make her case.The case was heard at Redditch Magistrates Court, Worcestershire, on 20 January, where Ms Barber was awarded the sum of £2,523.42 to cover flights, interest up to the date of judgment and costs.Ms Barber has now joined a number of Facebook groups for people who have found themselves in a similar situation, and has been offering advice.\"If I can get more people their refunds....I think that is the ideal outcome,\" she said.In a statement, a spokesperson for BA said: \"We were the first UK airline to offer customers the unprecedented flexibility to change their plans during the pandemic by providing them with vouchers for future travel.\"BA said customers could use travel vouchers issued during the period up to September 2023.Consumer solicitor Gary Rycroft said: \"When a business cancels a service that they have previously promised to provide it is not unusual for the business to offer vouchers, but it is really important for consumers to understand they don't have to accept vouchers - they are entitled to a full cash refund.\"I am absolutely thrilled that Jennie decided to see through this case. She absolutely knew what her legal rights are and she stuck to her guns.\"Follow BBC West Midlands on Facebook <https:\/\/www.facebook.com\/MidlandsBBC\/>, Twitter <https:\/\/twitter.com\/bbcmtd> and Instagram <https:\/\/www.instagram.com\/bbc_midlands\/?hl=en>. Send your story ideas to: newsonline.westmidlands@bbc.co.uk <mailto:newsonline.westmidlands@bbc.co.uk>"}