{"author":"","title":"US envoy Brett McGurk quits over Trump Syria pullout","news_category":"general","content":"A top US official in the fight against so-called Islamic State group has quit over President Donald Trump's decision to pull troops from Syria.Brett McGurk, the US special presidential envoy for the Global Coalition to Defeat IS, brought his departure forward from February.Before Mr Trump's announcement he had insisted that the US would continue working against IS in Syria.Mr Trump described Mr McGurk's resignation as a \"nothing event\".This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Mr McGurk's decision to quit follows the resignation of Defence Secretary Jim Mattis on Thursday.Gen Mattis had also opposed withdrawing troops from Syria as well as reducing the US presence in Afghanistan.Mr McGurk, 45, is an experienced diplomat who was appointed to his current role in 2015 under the Obama administration.In early December he told reporters: \"We want to stay on the ground and make sure that stability can be maintained in these areas.\"He went on to say: \"It would be reckless if we were just to say, well, the physical caliphate is defeated, so we can just leave now. I think anyone who's looked at a conflict like this would agree with that.\"In his resignation letter, seen by AP news agency, Mr McGurk said that IS militants in Syria were on the run but not yet defeated <https:\/\/apnews.com\/a6be8c68c6b147549083da125d118446>. He said that withdrawing US forces from Syria would create the conditions that gave rise to IS.In an email to staff quoted by the New York Times, he said Mr Trump's decision to pull out troops \"came as a shock and was a complete reversal of policy\". It \"left our coalition partners confused and our fighting partners bewildered\", he said.\"I ultimately concluded I could not carry out these new instructions and maintain my integrity <https:\/\/twitter.com\/rcallimachi\/status\/1076520647038324736>,\" he went on to say.Mr Trump announced his decision to withdraw some 2,000 US troops from Syria on Wednesday, asserting that IS had been defeated.On Saturday, he continued to insist that the decision to pull out was the right one and that, now that IS was defeated on the ground, other players could take care of the situation.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.However, important allies including senior Republicans and foreign powers have disputed the claim and say the move could lead to a resurgence of IS.A Kurdish-led alliance, the Syria Democratic Forces (SDF) has also warned that IS could recover.US troops have helped rid much of Syria's north-east of the jihadist group, but pockets of fighters remain.A recent US report said there were still as many as 14,000 IS militants in Syria <https:\/\/media.defense.gov\/2018\/Aug\/06\/2001950941\/-1\/-1\/1\/FY2018_LIG_OCO_OIR3_JUN2018_508.PDF> and even more in neighbouring Iraq.US ground troops first became involved in Syria in autumn 2015 when then-President Barack Obama sent in a small number of special forces to train and advise local Kurdish fighters who were fighting IS.The US did this reluctantly after several attempts at arming anti-IS groups had descended into chaos.Over the intervening years the numbers of US troops in Syria increased, standing today at some 2,000, though some estimates place the number perhaps even higher.A network of bases and airstrips has been established in an arc across the north-eastern part of the country.The US has also been part of an international coalition conducting air strikes against IS and other militants.This video can not be playedIs this the end for Islamic State?"}