{"author":"By James Gallagher","title":"The Last of Us: Could a fungal pandemic turn us all into zombies?","news_category":"general","content":"Let me introduce you to something truly horrifying - the fungus that turns its victims into zombies.Its spores enter the body. The fungus then grows and begins to hijack the mind of its host until it loses control and is compelled to climb to higher ground.The parasitic fungus devours its victim from the inside, extracting every last nutrient, as it prepares for its big finale.Then - in a scene more disturbing than the scariest horror film - a tendril of death erupts from the head. This fruiting body of the fungus showers spores on everything around it - dooming others to the same zombie fate.It sounds like a work of fiction. But the kingdom of fungi - distinct from plants and animals - ranges from edible mushrooms to nightmare-fuel parasites.Species of parasitic Cordyceps and Ophiocordyceps fungi are very real. Here, on the BBC's Planet Earth series, Sir David Attenborough watches as one takes control of an ant:That clip of zombie ants inspired \"The Last of Us\" - possibly the best video game I've ever played, and now a hit TV series which follows the same plot.In both the game and on TV, Cordyceps makes the leap from preying on its usual insect victims, to infecting humans. The resulting pandemic leads to the collapse of society.But in the real world, is a Cordyceps pandemic - or one caused by another fungus - ever likely to happen?\"I think we underestimate fungal infections at our peril,\" Dr Neil Stone, leading fungal expert at the Hospital for Tropical Diseases in London, tells me.\"We've already done that for too long and we are completely unprepared for dealing with a fungal pandemic.\"At the end of October last year, the World Health Organization (WHO) issued itsfirst list of life-threatening fungi <https:\/\/www.who.int\/publications\/i\/item\/9789240060241>. There are some nasty bugs on there, but you'll be relieved to know that zombifying-Cordyceps do not feature.Why not?Dr Charissa de Bekker, a microbiologist at Utrecht University, has studied how Cordyceps creates zombified ants and says she cannot see the same ever happening in people.\"Our body temperature is simply too high for most fungi to nicely settle and grow - and this is the same for this Cordyceps.\"Their nervous system is simpler than ours, so it would definitely be easier to hijack the brain of an insect versus our brain, also their immune systems are very different from ours.\"Most species of parasitic Cordyceps have evolved over millions of years to specialise in infecting just one insect species. Most do not jump from one insect to another.\"For this fungus to be able to jump from an insect to us and cause an infection is a very big leap,\" says Dr de Bekker.Listen to James on the Inside Health podcast: Is a fungal pandemic possible? <https:\/\/www.bbc.co.uk\/sounds\/play\/m001hfd0>The threats posed by fungi have been dismissed for a long time. \"People think of it as something trivial, superficial or unimportant,\" says Dr Stone.Only a handful of the millions of species of fungi cause disease, but some of them can be so much worse than an irritating bout of Athlete's foot or an infected toenail.Fungi kill around 1.7 million people a year <https:\/\/microbialcell.com\/researcharticles\/2020a-kainz-microbial-cell\/> - that's about three times as many as malaria.The WHO has identified 19 different fungi it thinks are a significant worry. These include the sudden emergence of a deadly superbug, Candida auris - and a fungi, Mucormycetes, that eats our flesh so quickly that it leads to severe facial injuries.Dr Neil Stone invites me to Health Services Laboratory (HSL) in London, where samples from UK patients are analysed to see if their infections are caused by a fungus and what treatments may work. We discuss some of the biggest fungal dangers.Candida auris is the first we look at. It's a yeast-type fungus and you get that strong waft of a brewery, or bread dough, when you are near it.But if it gets inside the body, it can invade the blood, nervous system and internal organs. The WHO estimates up to half of people die if they have an invasive infection of Candida auris.\"It's like a monster which has appeared in the last 15 years or so, but it's now being found all over the world,\" says Dr Stone.The first documented case was in the ear of a patient at Tokyo Metropolitan Geriatric Hospitalin 2009 <https:\/\/onlinelibrary.wiley.com\/doi\/full\/10.1111\/j.1348-0421.2008.00083.x>. Candida auris naturally shrugs off anti-fungal drugs and some strains are resistant to all of the medicines we have. That's why it's considered a superbug.Transmission is mainly through contaminated surfaces in hospitals. It sticks to intravenous lines and blood pressure cuffs. It's really hard to clean off. The solution is often to close entire wards. This has happened even in the UK.Dr Stone says it is the \"most worrying\" fungi and we \"ignore it at our peril\" as, if it takes off, \"it could shut down entire healthcare systems\".Another killer fungus - Cryptococcus neoformans - is able to get into people's nervous systems and cause devastating meningitis.Sid and Ellie were only in the first days of their honeymoon in Costa Rica when Ellie started to feel ill.Her initial symptoms - headaches and nausea - were put down to too much sun, but then she started jerking and developed full-blown seizures. She had to be bundled up in a hammock and taken in a boat to get medical help.\"I've never seen something more horrifying and especially feeling so helpless,\" Sid tells me.Scans showed swelling on her brain and tests identified Cryptococcus. Fortunately, Ellie responded to treatment. She came out of a coma after 12 days on a ventilator.\"I just remember screaming,\" she says. She had delusions - including of having triplets, and that her husband had gambled their money away. \"So the first thing I said to him was it's over,\" she says.Now, Ellie is recovering well. She says she \"never\" thought a fungus could do such a thing to a person. \"You don't think you're going to go on your honeymoon and almost die.\"Mucormycetes also known as black fungus, causes the flesh-eating disease mucormycosis. It has a nickname that reveals its insidious nature - the lid lifter.It takes off so quickly. This image shows that, after just 24 hours growing in a petri dish, it can lift the lid off.\"When you have a piece of fruit and the next day it's turned to mush, that's because it has had a mucor-fungus [Mucormycetes] inside of it,\" says Dr Rebecca Gorton, a clinical scientist at HSL. She says it's rare in humans, but can be a \"really serious infection\".Black fungus is an opportunist that takes hold in people with weak immune systems. It assaults the face, eyes, and brain and can be fatal or leave people severely disfigured. A bad infection \"grows as quickly\" in the body as it does in fruit or the lab, warns Dr Gorton.During the Covid pandemic, there was an explosion of black fungus cases in India. More than 4,000 people died. Steroids being taken for Covid, which weakened immune systems, and high levels of diabetes, are thought to have aided the fungus's proliferation.Fungi are very different types of infection to bacteria or viruses. When a fungus makes us ill, it is nearly always picked up from the environment rather than spread through coughs and sneezes.We are all regularly exposed to fungi, but they often need a weakened immune system in order to take off. As medicine keeps more of us alive - such as surviving some cancer treatments - there are more of us with weaker immune systems.Dr Stone says a fungal pandemic would probably take \"a different form\" to Covid - in both how it spreads and the type of people it infects.He thinks the threat is there because of \"the pure volume of fungi in the environment... climate change, international travel, increasing number of cases and their deep neglect in terms of treatments we have\".Fungi might not turn us all into zombies, but they can cause far more problems than a bit of Athlete's foot.Follow James on Twitter. <https:\/\/twitter.com\/JamesTGallagher> Inside Health was produced by Erika Wright."}