{"author":"By Tom Housden","title":"Antarctic ocean currents heading for collapse - report","news_category":"general","content":"Rapidly melting Antarctic ice is causing a dramatic slowdown in deep ocean currents and could have a disastrous effect on the climate, a new report warns.The deep-water flows which drive ocean currents could decline by 40% by 2050, a team of Australian scientists says.The currents carry vital heat, oxygen, carbon and nutrients around the globe.Previous research suggests a slowdown in the North Atlantic current could cause Europe to become colder.The study, published in the journal Nature, also warns the slowdown could reduce ocean's ability to absorb carbon dioxide from the atmosphere.The report outlines how the Earth's network of ocean currents are part driven by the downwards movement of cold, dense saltwater towards the sea bed near Antarctica.But as fresh water from the ice cap melts, sea water becomes less salty and dense, and the downwards movement slows.These deep ocean currents, or \"overturnings\", in the northern and southern hemispheres have been relatively stable for thousands of years, scientists say, but they are now being disrupted by the warming climate.\"Our modelling shows that if global carbon emissions continue at the current rate, then the Antarctic overturning will slow by more than 40 per cent in the next 30 years - and on a trajectory that looks headed towards collapse,\" study lead Professor Matthew England said.The 2018 Atlas Study <https:\/\/www.bbc.com\/news\/science-environment-43713719> found the Atlantic Ocean circulation system was weaker than it had been for more than 1,000 years, and had changed significantly in the past 150.It suggested changes to the conveyor-belt-like Atlantic Meridional Overturning Circulation (Amoc) could cool the ocean and north-west Europe, and affect deep-sea ecosystems.A sensationalised depiction of the Amoc shutting down was shown in the 2004 climate disaster film The Day After Tomorrow.The report also highlighted how the slowdown would affect the ocean's ability to absorb carbon dioxide from the atmosphere.Dr Adele Morrison, who contributed to the report, explained that as ocean circulation slows down, water on the surface quickly reaches its carbon-absorbing capacity and is not then replaced by non carbon-saturated water drawn to the surface from greater depths.\"If the oceans had lungs, this would be one of them,\" Prof England, an oceanographer at Sydney's University of New South Wales, told a news briefing.Dr Morrison also warned that said a slowdown of the southern overturning could have an impact on marine ecosystems and Antarctica itself.\"Overturning brings up nutrients that have sunk down to the bottom when organisms die… to resupply nutrients for the global ecosystem and fisheries,\" she told the BBC.\"The other larger implication that it could have is a feedback on how much of Antarctica melts in the future. It opens a pathway for warmer waters which could cause increased melt, which would be a further feedback, putting more meltwater into the ocean and slowing down circulation even more,\" she added.Scientists spent 35 million computing hours over two years to produce their models, which assumed that emissions of greenhouse gases continue their current path. If they fall, this could lessen the amount of ice melting, and slow the decline in the ocean current.However, results suggest deep water circulation in the Antarctic could slow at twice the rate of decline in the North Atlantic.\"[It's] stunning to see that happen so quickly,\" said climatologist Alan Mix from Oregon State University, a co-author of the latest Intergovernmental Panel on Climate Change (IPCC) assessment.\"It appears to be kicking into gear right now. That's headline news,\" he told Reuters.The effect of Antarctic meltwater on ocean currents has not yet been factored in to IPCC models on climate change, but it is going to be \"considerable\", Prof England said."}