{"author":"By Kevin Peachey","title":"New energy price cap prompts call for help on bills","news_category":"general","content":"The amount suppliers can charge households for energy has been cut by regulator Ofgem but bills will still rise in April as government help eases.Ofgem's announcement itself does not directly affect what customers will pay for gas and electricity but it reduces the costs faced by government.The typical household bill will rise to £3,000 a year in April.Campaigners say ministers should stop the increase because Ofgem's new cap reduces the cost of support.The typical annual household bill is set to rise from £2,100 to £3,000 in April because government help - known as the Energy Price Guarantee (EPG) - will become less generous and a £400 winter discount on all bills ends.The government currently compensates energy suppliers with the difference between the guarantee and Ofgem's cap.The energy price cap was £4,279 in January but on Monday, Ofgem announced that the cap would drop to £3,280 in April because of falling wholesale prices.TUC general secretary Paul Nowak said: \"Energy bills are out of control. The government must cancel April's hike. With the cost of wholesale gas plummeting ministers have no excuse for not stepping in.\"Emily Fry, economist at the Resolution Foundation think tank which focuses on improving standards of those on low and middle incomes, said: \"While consumers won't have to face typical bills of £3,280 this spring, many are still set to see bills rise by a fifth as government support is scaled back.\"Chancellor Jeremy Hunt previously told the BBC <https:\/\/www.bbc.co.uk\/news\/business-64594707> that although the policy remained under review, he did not think the government had the \"headroom to make a major new initiative to help people\". Ministers also point out wider support, such as rising benefit payments in April, will help people.Under the government guarantee, a household using a typical amount of gas and electricity in England, Wales and Scotland is currently paying £2,500 a year for energy.Without state support, that annual bill would have been £4,279 since January. The chancellor has already announced that the EPG will become less generous in April, which means the typical household will be paying £3,000 a year.Ofgem has now announced what that bill would otherwise have been £3,280 from April to July, without the guarantee.Ofgem's chief executive, Jonathan Brearley, said that April's rise in bills was \"deeply concerning\" for many people, but there was some hope ahead.He said the announcement \"reflects the fundamental shift in the cost of wholesale energy for the first time since the gas crisis began, and while it won't make an immediate difference to consumers, it's a sign that some of the immense pressure we've seen in the energy markets over the last 18 months may be starting to ease\".The EPG began in October last year, and is scheduled to continue to April 2024. Falling wholesale prices mean the potential cost to the government could be billions of pounds less than initially thought but still totalling just under £30bn.Such figures were, and could still be, highly volatile. The government says the \"savings\" would be money not borrowed, rather than a pot of money available to spend elsewhere. However, the figures have prompted dozens of charities and campaigners to call on the government to reverse the plan for a typical annual bill to rise from £2,500 to £3,000 in April.The consumer finance expert Martin Lewis described the rise as a \"national act of harm\". However, he said he was hopeful the government would cancel the increase.\"I do not know it will cancel that rise but I am more hopeful than I was after some rune reading,\" he told BBC Radio 5Live. \"I think there is a better than 50% chance that it will cancel that rise.\"Labour also wants to stop the increase. \"Labour would use a proper windfall tax to stop prices going up in April,\" said Ed Miliband, shadow climate and net zero secretary.The Liberal Democrats have gone further and want energy bills to be cut <https:\/\/www.bbc.co.uk\/news\/uk-politics-64756960>. The SNP has also called for bills to be cut, seeking a \"minimum\" £500 cut to the level of the energy price guarantee.The government guarantee, like any energy price cap, does not limit the total bill. It limits the cost per unit of energy.The government also discounted everyone's bills by an additional £400 this winter but this support comes to an end in April. Lump sum payments have also been available in Northern Ireland, which has a more complex market, including many households using heating oil.People who pay for their energy by cash or cheque on receipt of a bill currently typically pay about £250 a year more than those who pay monthly by direct debit. This difference will be cut to about £200 from April.Historically, Ofgem has said costs for these customers were higher for suppliers as they were more likely to miss payments.Customers on top-up prepayment meters will also have a bill that is about £45 a year higher than a typical direct debit customer from April, owing to higher fixed costs.They include mother-of-five Myra Butcher, who told the BBC she had \"cut right back\" on her energy use over the winter.The 40-year-old, from the Isle of Wight, who lives in a rented property with a prepayment meter, said she had spent £80 a week heating her three-bedroomed Victorian home over the winter.Mrs Butcher, whose husband suffers with colitis and cannot work, has three young children and two over the age of 18, and wants the government to continue with the discount scheme it operated this winter - paid via a voucher to those on prepayment meters.\"I'd like to see the scheme continue. A lot of the time working families are getting overlooked. A reduction in energy prices is not going to happen any time soon,\" she said.She also managed to get a £50 credit, after the charity that runs her local food bank was given a grant.How are you being affected by the rising cost of living? Share your experiences by emailinghaveyoursay@bbc.co.uk <mailto:haveyoursay@bbc.co.uk?subject=EnergyPriceCap64748135>.Please include a contact number if you are willing to speak to a BBC journalist. You can also get in touch in the following ways:If you are reading this page and can't see the form you will need to visit the mobile version of theBBC website <https:\/\/www.bbc.co.uk\/news> to submit your question or comment or you can email us atHaveYourSay@bbc.co.uk <mailto:Haveyoursay@bbc.co.uk>. Please include your name, age and location with any submission."}