{"author":"","title":"Dua Lipa 'horrified' at DaBaby's HIV and gay comments","news_category":"general","content":"Dua Lipa says she's \"surprised and horrified\" at DaBaby's comments about people with HIV and gay men.The singer wrote on her Instagram story that she didn't \"recognise this as the person I worked with\" and stood \"100% with the LGBTQ community\".\"We need to come together to fight the stigma and ignorance around HIV and Aids,\" she added.Rapper DaBaby - a guest artist on Dua's hit, Levitating - has been criticised for comments he made at a US festival.Performing at Rolling Loud festival in Miami, he invited every audience member to \"put your cell phone light up\", apart from those who were HIV-positive or were gay men who had sex in car parks.He also made the false claim that HIV will \"make you die in two or three weeks\".Medication helping those with HIV to live long, healthy lives has been available for decades.DaBaby's comments were supported by rapper TI, who said <https:\/\/twitter.com\/PopCrave\/status\/1419723868592300032> if Lil Nas X - who regularly asserts his sexuality onstage <https:\/\/www.bbc.com\/culture\/article\/20210708-pops-gay-sexual-revolution> - was able to say and do as he liked, then DaBaby should be able to do the same.But DaBaby's faced criticism from many others, including the UK's leading HIV and Aids charity.\"It's wrong for people living with HIV to be made to feel lesser or excluded because of their diagnosis - it should be unacceptable in the music industry and in society at large,\" says Richard Angell, campaigns director at the Terrence Higgins Trust (THT).\"Comments like DaBaby's perpetuate HIV-related stigma and discrimination, as well as spreading misinformation about HIV.\"You can now live a long, healthy life with HIV thanks to medical progress when you're diagnosed and accessing treatment.\"Medication to manage HIV and stop it spreading has been available since 1996.The introduction of pre-exposure prophylaxis (Prep), which can be taken by people who do not have HIV to prevent catching it, has helped to reduce infection numbers.People who have HIV and are on treatment can be undetectable - meaning their blood carries such low amounts of the virus that they are unable to pass it on to others.DaBaby's comments have been widely criticised on social media - including by BBC Radio 1Xtra presenter, Yasmin Evans.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Following the backlash, DaBaby spoke on his Instagram story, saying what he does at his shows \"does not concern\" people online.\"What I do at the live show is for the audience at the live show. It'll never translate to somebody looking at at a five, six-second clip,\" he said.He then accused people on the internet of \"twisting\" his words and claims he is appreciated by straight and gay fans.He went on to claim his gay fans do not have Aids, and called people with the illness \"nasty\" and \"junkies on the street\".\"Even my gay fans got standards,\" he added.DaBaby is currently in the US Top Ten as a guest artist on Dua Lipa's hit, Levitating, and has a clothing collaboration with Boohoo.Boohoo says DaBaby's comments go against its \"core values\".\"Boohoo condemns the use of homophobic language and [we] are reviewing the relationship with DaBaby,\" the retailer told Newsbeat in a statement.\"We pride ourselves on representing the diverse customers we serve across the globe.\"DaBaby's performance at the festival was also criticised for his choice of guest stars.He performed after Megan Thee Stallion, and brought her ex-boyfriend Tory Lanez <https:\/\/variety.com\/2021\/music\/news\/da-baby-tory-lanez-megan-thee-stallion-rolling-loud-1235027337\/> onstage during his set.In August 2020, after the couple had broken up, Megan accused Tory of shooting her in both feet <https:\/\/www.bbc.co.uk\/news\/newsbeat-53566830> that July.Tory has denied Megan's accusations <https:\/\/www.bbc.co.uk\/news\/newsbeat-55000256> and the case is ongoing. In February this year, US media reported that a court had denied his request <https:\/\/pagesix.com\/2021\/02\/25\/tory-lanez-denied-right-to-speak-out-on-megan-thee-stallion-case\/> to speak publicly about the incident.Follow Newsbeat on Instagram <https:\/\/www.instagram.com\/bbcnewsbeat\/>, Facebook <https:\/\/www.facebook.com\/bbcnewsbeat\/>, Twitter <https:\/\/twitter.com\/BBCNewsbeat> and YouTube <https:\/\/www.youtube.com\/channel\/UCe1Ef-K5jpnRsmVY5hCBhOw>.Listen to Newsbeat live <https:\/\/www.bbc.co.uk\/sounds\/play\/live:bbc_radio_one> at 12:45 and 17:45 weekdays - or listen backhere <http:\/\/www.bbc.co.uk\/programmes\/b006wkry\/episodes\/player>."}