{"author":"","title":"Children in private care in Wales 'need an advocate'","news_category":"general","content":"As few as 5% of children in private care homes have access to an advocate who can act on their behalf, according to a new report.Charity TGP Cymru said many homes in Wales were not aware of 20-year-old recommendations children should have access to one.Now they say having a visiting advocate should be a condition of registration and inspection for homes in Wales.The Welsh Government said those in care were entitled to an advocate.Advocates promote the views, wishes and feelings of youngsters in care. \"From our enquiries we estimate that 5-10% of children's homes run by the private sector have residential visiting advocacy arrangements in place,\" the charity said in its report.It said there were 178 children's homes in Wales. While 23 are run by local authorities, 155 are run by the third sector or private firms.TGP Cymru said all of the council run homes already engage independent professional advocacy services.The charity said it was worried \"the concept\" of independent advocacy was \"not widely known or understood\" by those who own or work in private children's homes.\"We know that young people often access independent professional advocacy through an adult who they know and trust,\" it said.\"It follows that more needs to be done to ensure that children's key workers and children's homes managers know and understand independent professional advocacy and the rights of children and young people in their care to access such support.\"Access to an advocate was recommended in 2000 by Lost in Care - the report of the Waterhouse inquiry into abuse in north Wales children's homes.TGP Cymru chief executive Jackie Murphy, said: \"It's not just about safeguarding but making sure their lives are happy.\"It's not rocket science, there is no reason why it should not be done.\" Ms Murphy said it enabled children to raise matters like wanting to see siblings, visiting family at Christmas or telling someone they were not happy at school.She said children were not always aware they were entitled to an advocate.The charity presented its findings at the Senedd on Tuesday. A Welsh Government spokesman said: \"Children and young people at risk or in care in Wales are entitled to support from an independent advocate.\"We have funded the 'active offer' to enable local authorities to provide a national consistent approach to advocacy support.\"This covers a number of key concerns raised by the Lost in Care report. \"We continue to focus our attention on the importance of advocacy services for children and young people,\" the spokesman said."}