{"author":"By Emilia Belli","title":"Covid: Cardiff Airport dead without bailout, boss says","news_category":"general","content":"Cardiff Airport would not have stayed alive without an £85m bailout from the Welsh government during Covid, its boss says.Chief executive Spencer Birns said despite a slow recovery, it could \"provide the economic value back to Wales\".But the Welsh Conservatives said the Welsh government should sell it.The Welsh government said it was committed to the airport because of the benefits it brings the Welsh economy.Mr Birns said the the bailout had \"given us the framework to stay alive\". \"They've helped us get into position that we can help re-grow the business, that can provide the economic value back to Wales,\" he said.The Welsh government wrote off £42.6m of airport debt in March this year and also gave it a five year recovery grant of £42.6m.The airport's passenger numbers were down by 90% in August 2021, making it the second-lowest number in the UK.Its value has also dropped by more than two thirds.Mr Birns said that recovery had been slow \"primarily because people have been encouraged not to travel overseas this year\".Fifteen destinations are currently up and running, but prior to the pandemic there were 52.Next year, Wizz air will start running out of Cardiff, while TUI will increase the number of flights from the airport.The Welsh government bought the airport in 2013 for £52m and has since invested more than £130m of taxpayers' money into it.It's run at arm's length by an independent company HoldCo and before Covid it had seen significant growth in passenger numbers.But the Welsh Conservatives' transport and technology spokeswoman Natasha Asghar MS said funding the airport was \"pumping\" taxpayer money into an \"empty pit\".\"I would say cut your losses and sell it, accept what's happened and spend that money on other things more important and a priority to the people of Wales right now,\" she said.Despite airport debt totalling £27.2m in May, Mr Birns said the business contributes to the Welsh economy through employing 2,500 people.He said that in normal times it generates more than £240m a year in revenue. CBI Wales, which represents Welsh businesses, said having a Welsh airport would encourage international investment coming out of the pandemic.It would \"disadvantage\" Wales and be \"odd\" to not have one, CBI Wales' director Ian Price said.Last month, the UK government announced flight tax Air Passenger Duty would be halved for domestic journeys from April 2023 to boost the sector and develop better UK travel links.But Mr Birns questioned how helpful that would be.\"Why is the UK government waiting 18 months to do this?,\" he said.\"If they're talking about economic stimulation for connectivity to the regions, what's stopping them doing it tomorrow?\"The UK government said they have \"announced reforms and rates over 12 months in advance to provide airlines with sufficient notice and to acknowledge the length of airline booking cycles\".Meanwhile, longer-term concerns have been raised about the ownership of the airport.While the Welsh government committed to net zero by 2050, its own plans say that in future flights will be one of the biggest remaining carbon emitters.Professor Calvin Jones, an economist at Cardiff University's business school, questioned how compatible owning an airport was with tackling a climate emergency.\"They have something that probably don't know what to do with now,\" he said.\"I think that the right thing to do is just have some strategy where you wind the airport down.\"As soon as you take that on the chin and start to think about what we might do with this potentially valuable piece of land in a genuinely zero carbon way, then some good ideas might arise.\"The Welsh government said it was committed to maintaining an airport in Wales \"while recognising the challenges this creates for meeting our targets on decarbonisation\"."}