{"author":"","title":"Rhondda Cynon Taf scraps council tax for care leavers","news_category":"general","content":"Care leavers in Rhondda Cynon Taff are to be exempt from paying council tax.On Tuesday, the council's cabinet agreed with a report <http:\/\/www.rctcbc.gov.uk\/EN\/Council\/CouncillorsCommitteesandMeetings\/Meetings\/Cabinet\/2017\/12\/19\/Reports\/AgendaItem7CouncilTaxDiscretionCareLeavers.pdf> that recommended the move, making it the first council in Wales to scrap the tax for those up to the age of 25.Last month, Torfaen council voted in favour <http:\/\/www.bbc.co.uk\/news\/uk-wales-south-east-wales-41594064> of making care leavers up to the age of 21 exempt.The Welsh government said it was \"pleased\" councils were considering ways to address the \"important issue\".The tax relief will come into effect on 1 April 2018. Cabinet Member for Corporate Services Councillor Mark Norris, said: \"We recognise the principle sentiments that young people's transition out of care and into adulthood is extremely difficult, and that managing money for the first time without support from their family leaves care leavers at real risk of falling into debt.\"But charity the Children's Society has called on the Welsh government to make a pledge on the issue.Its chief executive Matthew Reed said: \"We are calling upon the Welsh government to follow the lead of its Scottish counterpart in pledging to exempt all care leavers from paying council tax.\"Doing so would avoid a postcode lottery and ensure all care leavers in Wales who are currently expected to pay council tax would quickly benefit, making life easier for them as they make the challenging move into independent living.\"He said care leavers had often experienced a difficult upbringing and may have faced abuse, neglect or family breakdown which can impact upon their life chances.\"Without the family support most young people get as they become adults, care leavers often struggle to juggle their household bills and make ends meet,\" he said.\"Council tax is one of those bills and asking young people to pay it just days after leaving care contributes to a situation in which many find themselves in debt, facing the threat of prosecution or visits by bailiffs and sometimes having to go without food or other basic necessities.\"This video can not be playedCare leaver Michael Ali said there are \"different stigmas attached to different areas\"A report from the charity <https:\/\/www.childrenssociety.org.uk\/what-we-do\/resources-and-publications\/claiming-after-care-care-leavers-and-the-benefits-system> has highlighted heightened challenges and poorer outcomes for people leaving the care system.A Welsh government spokesman said: \"We're pleased to see Welsh councils considering ways to address this important issue. \"We recently asked the WLGA and local authorities to look at using discretionary powers to grant care leavers a full dispensation from council tax - regardless of personal circumstances.\"We also recently confirmed we will be continuing with our Council Tax Reduction Scheme (CTRS) in 2018-19. This will ensure that care leavers on a low income remain fully protected.\""}