{"author":"By Vanessa Pearce","title":"Hundreds more photos saved from tip to be added to Coventry archive","news_category":"general","content":"Hundreds more photographic images, saved from being dumped at a tip, have been unearthed and handed over to a city archive.Some of the glass negatives, rescued by former cameraman Ian Hollands, have lain unseen for more than 30 years.The collection, depicting the lives of people in Coventry as the city restored itself following the devastation of the blitz in 1940, was taken by Arthur Cooper.More information had also come to light about the photographer himself. This video can not be playedPost-war images of Coventry saved from a tipMr Hollands had previously sent thousands of the negatives he had rescued to publishing company Mirrorpix where they were digitised and made available to view as part of the Coventry Digital initiative.Following a BBC report highlighting the Coventry University scheme <https:\/\/www.bbc.co.uk\/news\/uk-england-coventry-warwickshire-63871358>, Mr Hollands was prompted to hand over more boxes, containing about 500 negatives, to the project's director Dr Ben Kyneswood.Arthur Cooper, a freelance photographer, worked in the city from the 1930s to the 1960s, capturing weddings, award ceremonies and events as well as visiting celebrities and royalty for publications such as the Midlands Daily News and the Coventry Evening Telegraph.An \"early look\" at the collection showed it contained images similar to the 8,049 already digitised, Dr Kyneswood said.\"I was really hopeful that there was more out there,\" he added, \"so to find out that there was more out there and that they're in my office now - it's fantastic\".Keen photographer Mr Hollands, 75, said he had been alerted to the fact the valuable negatives were about to be taken to a tip some time in the late 1980s, and he had to act quickly to save them.He had retrieved the thousands of glass plates from the garden of Mr Cooper's widow, Marjorie, where they had \"just been chucked in rubbish bags\".\"I took them home and put them all in cardboard boxes, and they stayed on the shelf in my house for about 15 or 20 years,\" he explained.About ten years ago most of the collection he passed on to Mirrorpix via his son, Samuel Hollands, who worked for the Coventry Evening Telegraph at the time.\"One day a Ford transit van turned up and we loaded all the glass plate negatives into the back of this van and that's the last I saw them until I've heard about them now,\" he explained.\"I kept a few boxes back just so I could go through them, but they've been sitting around in my house ever since,\" he said, but had handed over the archive after being alerted to Dr Kyneswood's project.Samuel Hollands said he had been shocked to see the coverage of Arthur Cooper on the BBC.\"When I told my father he didn't believe me, he thought it must be something else,\" he said.\"But I just knew they were the ones that we'd given in all those years ago.\" \"I'm pleased I did something about it, because I could have just ignored it and they would have gone,\" his father added.\"More details had also emerged about the photographer himself, explained Dr Kyneswood.\"A family member had got in touch with some photographs of Arthur, and to say he had served in Egypt in World War Two, and detailed some of the military campaign medals he had won.\"Information from Mr Cooper's niece, 78-year-old Sandra Johnson, also revealed he had worked as a photographer to King Faisal II of Iraq when the ruler was just seven years old.He was also a Freeman of the city.He said since the story about Mr Cooper was published in January, about 100,000 people had viewed the photographer's images on the Coventry Digital website, which was \"amazing\".\"We've had some great stories come out, people being able to point out friends and families,\" he said.\"And they're able to tell me what they're looking at and give me some exceptional detail.\"The collection was significant because it gave people \"a chance to tell their stories, because they can see themselves, and their life in these pictures,\" he said.After scanning the latest negatives they would be driven to the Mirrorpix archive in Watford \"where they'll join the other Arthur Cooper archive negatives, and they'll be saved forever,\" Dr Kyneswood added.Follow BBC West Midlands on Facebook <https:\/\/www.facebook.com\/MidlandsBBC\/>, Twitter <https:\/\/twitter.com\/bbcmtd> and Instagram <https:\/\/www.instagram.com\/bbc_midlands\/?hl=en>. Send your story ideas to: newsonline.westmidlands@bbc.co.uk <mailto:newsonline.westmidlands@bbc.co.uk>"}