{"author":"By Jenny Hill","title":"Oder mass fish deaths: Searching for clues to Polish-German border mystery","news_category":"general","content":"The men in waders looked solemn as they heaved buckets of dead fish from a boat and lay the corpses on a tarpaulin stretched out on the riverbank.They had been doing this for eight days near the city of Szczecin, faces masked against the nauseating stench. \"I just feel numb now,\" said one worker, sadly.Something is killing fish - in their thousands - on the River Oder.The river forms a border between Poland and Germany. Despite weeks of investigation, experts from both countries have been unable to establish exactly what is to blame. Hundreds of tonnes of dead fish have already been removed.Scientists suspect someone polluted the water with a substance that appears to have caused high salt levels. That encouraged golden algae to flourish. The toxins it emitted killed the fish. The rotting corpses then further reduced the water quality.A deadly, chemical chain reaction which, they say, may have been exacerbated by a hot summer and low river levels. But they have yet to identify the original pollutant.\"It will be difficult to get a clear answer to what caused it,\" says Andrzej Kapusta, of the Inland Fisheries Institute. We joined him and his team on board a small boat as they tested the water in the Oder.\"The scale of this ecological disaster is unprecedented in Poland. It's a catastrophe. We have never found so many dead creatures, so many dead fish, clams or snails. It's the first time it's happened, and it is a serious warning.\"Hundreds of miles up-river, near the city of Gliwice, Ewa Sternal looks out over the boats bobbing in a small marina and says she saw it coming.Ewa runs the marina, which lies within a working port. Cranes shift large metal containers near piles of coal on the opposite bank as she explains that the water here flows, via the Gliwice canal, into the Oder.People here first reported fish dying, and the water changing, back in March.Ewa describes how the fish appeared to try to get out of the port, gathering near its entrance, \"to gasp for air, for oxygen\". When it happened again in June, she began to investigate for herself.\"All the signs and traces that I've followed led me to conclude that the pollution got into the water directly here. I talked to many people, conducted interviews. My conclusion is that someone dumped chemicals into the port.\"But who? Suspicion has fallen, with as yet no evidence, on Polish industry and Polish mines.Police have interviewed more than 200 witnesses and investigated 12 sites. A reward of more than €200,000 (£170,000) for information leading to the arrest of a perpetrator remains unclaimed.Fishermen we spoke to near Gliwice, who told us they also saw fish dying in March, expressed scepticism that anyone would be caught. \"Someone's responsible, someone's to blame, but we'll probably never find out who,\" said one.Investigators have, however, discovered nearly 300 unregistered outflow pipes and are investigating nearly 60 of them in connection to the fish deaths.The authorities on both sides of the Oder have acknowledged errors in the handling of the case. It is generally recognised that they were too slow to react to signs that something was wrong. And an undignified spat between the Polish and German authorities over their respective approaches was not helpful.Experts, like Andrzej Kapusta, say it is important to review the way the river is used. Worryingly, they warn that it could happen again, particularly while the original source of pollution goes unidentified.\"We need a precise monitoring system, an online monitoring that will inform the adequate authorities much more quickly,\" he says. \"A quicker response is certainly needed to prevent such disasters.\"Meanwhile, fish continue to die. Their corpses collected and sent for incineration.This video can not be playedWatch: Tonnes of fish found dead in German-Polish riverAs the workers near Szczecin drag large dead carp and catfish from the river, a pump works away in a desperate attempt to get oxygen into the water. From here the river flows into a lagoon and on into the Baltic Sea.It is hoped that the sheer amount of water means the toxins will be diluted, but there are concerns that what some here describe as a \"wave of poison\" will continue its deadly course downstream.\"Right now we have to wait for the worst to be over,\" says Lukas Potkanski, from the Polish Fishermen's Association. \"The most poisonous water has to flow down and mix with the healthy water.\"Lukas gestured to the corpses of carp and catfish and told us the fish recovered here were sometimes 20 or 30 years old.Life, he believes, will return to the Oder. But it will be years, perhaps decades, before the river's health is fully restored."}