{"author":"By Reality Check team","title":"Did Boris Johnson mislead Parliament over parties?","news_category":"general","content":"Boris Johnson has denied deliberately misleading Parliament when he made statements about gatherings which took place in Downing Street during lockdown.Mr Johnson is being investigated by the Privileges Committee of MPs which could recommend a range of sanctions, including suspension from the Commons, which could lead to a by-election in his Johnson's parliamentary constituency.On Wednesday 22 March, he gave evidence to them and admitted misleading Parliament but denied doing this on purpose.He was asked repeatedly about key statements he made when he was prime minister.Boris Johnson said this in response to a question from a Labour MP about whether he would tell MPs if there was a party in Downing Street on 13 November 2020.We know from civil servant Sue Gray's report  <https:\/\/assets.publishing.service.gov.uk\/government\/uploads\/system\/uploads\/attachment_data\/file\/1051374\/Investigation_into_alleged_gatherings_on_government_premises_during_Covid_restrictions_-_Update.pdf>into lockdown gatherings that there were two on this date:We know the rules were not followed \"at all times\" - the Metropolitan Police handed out 126 fines to 83 people for breaking Covid rules during the Downing Street gatherings.On the specific date he was being asked about, the Met issued fines <https:\/\/news.met.police.uk\/news\/mets-investigation-into-alleged-breaches-of-covid-regulations-op-hillman-concludes-448148> - for breaches of the rules on indoor gatherings of two or more people.Mr Johnson also told MPs the guidance was followed \"at all times\".The guidance for working in offices at the time said \"only absolutely necessary participants should physically attend meetings\" and should maintain social distancing.The photos in the Sue Gray report show Mr Johnson drinking in front of staff members - who are standing close to each other.The Privileges Committee's initial report said: \"We will consider why Mr Johnson told the House that no rules or guidance had been broken in No. 10 when he knew what the rules and guidance were and was in attendance at gatherings where the rules and guidance were breached.\"Appearing before the committee, Mr Johnson said: \"The guidance specifically allows for workplace freedoms to decide how to implement it.\"He argued that thanking staff in person at leaving events was essential for the operation of government.But there was nothing in the guidance for England from the time that implied that workplace gatherings such as leaving drinks were permitted.Boris Johnson made these opening remarks to Parliament after a video emerged of members of hisstaff joking about <https:\/\/www.bbc.co.uk\/news\/uk-politics-59572149> how to respond to questions about a Christmas party at Downing Street on 18 December 2020 - which involved wine, cheese and a Secret Santa.Mr Johnson says he did not attend that event.Mr Johnson's claim revolves around what assurances he was given. He told the Privileges Committee that he received those assurances from two of his senior communications advisers: Jack Doyle and James Slack and an unnamed No 10 official.The MPs asked why he had not sought advice from a government lawyer or from the head of the civil service, Simon Case.This video can not be playedWatch: Key moments from Boris Johnson's Partygate grillingThe committee has published evidence showing that Mr Case denied giving Mr Johnson assurances \"at any time\" that Covid rules and guidance \"were followed at all times in No 10\".And he said he was unaware of anyone else having given him these assurances. Boris Johnson said this in Parliament in response to the publication of the Sue Gray report. This was when he said he had corrected the record (referring to his statement of 8 December 2021).\"When I said - I came to this house and said in all sincerity that the rules and guidance had been followed at all times - it was what I believed to be true. It was certainly the case when I was present at gatherings to wish staff farewell\", he said.Committee chair Harriet Harman asked him if he still believed that to be the case in March 2023 and he replied: \"My view remains that the guidance allowed social distancing not to be carried out with rigid, drill sergeant precision.\"We know that at least two of the events that he attended (13 November and 14 January) led to police fines but we can't tell whether the rule breaches happened when he was there.When it comes to the guidance, the photos of the Lee Cain event apparently show people closer than 1m together, and thus not following the guidance, while Mr Johnson was in the room and looking on.The initial report from the Privileges Committee said it had received evidence that Mr Johnson had said at the 27 November 2020 event that it was \"probably the most unsocially distanced gathering in the UK right now\".Mr Johnson said he did not remember saying that, but pointed out that the official who had provided that quote went on to say of the former prime minister: \"he had a glass of water in his hand, made a short speech and then went up to his flat. He was the most sensible person there to be honest.\"What claims do you want BBC Reality Check to investigate? Get in touch <http:\/\/www.bbc.co.uk\/news\/uk-41928747>Read more from Reality Check <http:\/\/www.bbc.co.uk\/realitycheck>"}