{"author":"","title":"Gloucester family donate 900 Easter eggs in son's memory","news_category":"general","content":"The family of a boy who died with a rare condition have collected more than 900 Easter eggs to donate to young patients in his memory.Charlene Spackman's son Arthur was first treated at Gloucester Royal Hospital over the Easter period.She was touched to be given chocolate to take home for her daughter Ellie, then three.The mum-of-two said the simple gesture \"normalised things\" for the family and that she wanted to return the kindness.Ms Spackman, 34, from Brockworth, Gloucester, added: \"Receiving Easter gifts for Ellie took the pressure off us at a time when it wasn't easy to just go to the shops.\"Arthur Spackman was born with the terminal genetic condition nonketotic hyperglycinemia (NKH), which is understood to affect around 500 people worldwide.He died aged just two on 2 May, 2019 and the family has made collecting eggs each year to donate to children in hospital at Easter one of its traditions.Ms Spackman said every year Ellie is involved but only \"as much as she wants to be\".\"She's got memories of receiving chocolates and she enjoys knowing she's helping others,\" she added.Ms Spackman said: \"Ellie said she knows what it felt like when her brother was in hospital, and she likes the idea of helping others while they're in there.\"Her favourite part is getting them delivered to the different places.\"The family were surprised to receive so many donated eggs but it was Ellie's idea to approach more businesses.Ms Spackman said the family have been \"overwhelmed\" by how generous people have been as news of the collection spread on social media and by word of mouth.\"Ellie's quite shocked at how many we have and Arthur's room (where we store the eggs) is quite full with them.\"Arthur and Ellie's grandparents, aunties, uncles and friends all help with collecting the donations.\"It's a real family effort and we've got a good support network in the community as well.\"Ms Spackman said the project is incredibly important because \"we made Arthur a promise from the beginning we would keep his memory alive.\"Follow BBC West on Facebook <https:\/\/www.facebook.com\/pointswest>, Twitter <https:\/\/twitter.com\/bbcbristol> and Instagram <https:\/\/www.instagram.com\/bbcwest>. Send your story ideas to: bristol@bbc.co.uk <mailto:bristol@bbc.co.uk>"}