{"author":"","title":"What is the UK's plan to send asylum seekers to Rwanda?","news_category":"general","content":"The UK government plans to send some asylum seekers to Rwanda.The High Court has ruled the scheme is legal, but the decision is facing further challenges in the courts.The five-year trial will see some asylum seekers sent to Rwanda on a one-way ticket <https:\/\/www.bbc.co.uk\/news\/uk-politics-61097114>, to claim asylum there.They may be granted refugee status to stay in Rwanda. If not, they can apply to settle there on other grounds, or seek asylum in a \"safe third country\".The government says this will deter people arriving in the UK through \"illegal, dangerous or unnecessary methods\", such as on small boats which cross the English Channel.However, the numbers crossing have not fallen since the policy was announced on 14 April 2022 <https:\/\/www.bbc.co.uk\/news\/explainers-53734793>. More than 45,700 people used this route to come to the UK in 2022, the highest figure since records began.Opponents argue that Rwanda is not a safe destination for asylum seekers and that the scheme breaks human rights laws.But in December the High Court ruled that the plan is legal. It said the Rwanda scheme does not breach the UN's Refugee Convention.However, on 16 January, the High Court ruled that the some of the groups who lost the casehave the right to appeal against parts of its decision <https:\/\/www.bbc.co.uk\/news\/uk-64294461>. That means flights will not be able to take off to Rwanda while the case goes to the Court of Appeal. No date has been set.The UK government previously said \"anyone entering the UK illegally\" <https:\/\/www.gov.uk\/government\/speeches\/pm-speech-on-action-to-tackle-illegal-migration-14-april-2022> after 1 January 2022 could be sent, with no limit on numbers.Rwanda says it can process 1,000 asylum seekers during the trial period, but has capacity for more.Under the deal, Rwanda can also ask the UK to take in some of its most vulnerable refugees <https:\/\/www.gov.uk\/government\/publications\/memorandum-of-understanding-mou-between-the-uk-and-rwanda\/memorandum-of-understanding-between-the-government-of-the-united-kingdom-of-great-britain-and-northern-ireland-and-the-government-of-the-republic-of-r>.However, no asylum seeker has actually been sent to the country. The first flight was scheduled to go in June, butwas cancelled <https:\/\/www.bbc.co.uk\/news\/uk-61806383> after the legal challenges.Privilege Style - the airline which was scheduled to take asylum seekers to Rwanda - has said it will withdraw from its contract with the Home Office <https:\/\/www.theguardian.com\/uk-news\/2022\/oct\/21\/airline-hired-uk-rwanda-deportations-pulls-out-privilege-style>, following a campaign by refugee charities.So far the UK has paid the Rwandan government £140m for the scheme.Other costs would include flights to Rwanda, food, accommodation, access to translators and legal advice. Removing people from the UK by charter flight cost more than £13,000 per person in 2020.When the policy was announced, former Home Office Minister Tom Pursglove said the cost would be \"similar to the amount of money we are spending on this currently\". He said that \"longer term, by getting this under control, it should help us to save money\".The UK's asylum system costs £1.5bn a year. <https:\/\/homeofficemedia.blog.gov.uk\/2022\/04\/14\/factsheet-cost-of-asylum-system\/> Almost £7m a day is spent on hotel accommodation for refugees and asylum seekers.Critics say the daily cost is so high because of the time taken to decide on applications, and a ban on asylum seekers working while waiting for confirmation of their status.The UN Refugee Agency <https:\/\/help.unhcr.org\/uk\/asylum\/#:~:text=Article%2014%20of%20the%20Universal,seek%20asylum%20in%20another%20country.> defines an asylum seeker as someone who has applied for shelter and protection in another country.A refugee is a person who has fled conflict or persecution in their own country.The legal rights of refugees are protected by international law. However, it is up to host countries to decide whether an asylum seeker is granted refugee status.In 2022, the UK received more than 74,700 asylum applications <https:\/\/www.gov.uk\/government\/statistics\/immigration-system-statistics-year-ending-december-2022\/summary-of-latest-statistics#how-many-people-do-we-grant-protection-to>, the highest number for 20 years. Of these, more than 23,800 people and their dependants were granted a form of protection."}