{"author":"","title":"Olivia Pratt-Korbel: Woman denies lying to police over shooting","news_category":"general","content":"A woman denied lying to police about an alleged gunman accused of fatally shooting a nine-year-old girl, a jury has heard.The witness became involved in heated exchanges with the barrister defending Thomas Cashman, 34, who denies murdering Olivia Pratt-Korbel.The jury heard previously the witness had implicated Mr Cashman, telling police after the shooting he had gone to her home, where he changed clothing.Mr Cashman denies being the gunman.He is accused of chasing another man, Joseph Nee, into Olivia's home and firing his gun, which injured her mother Cheryl Korbel, 46, and killed Olivia in Dovecot, Liverpool on 22 August.The witness, who cannot be named for legal reasons, sat in the witness box at Manchester Crown Court, shielded from public view by a curtain.The witness claimed she heard him say he had \"done Joey\", the court was told.John Cooper KC suggested to the witness that she was someone he has previously had a relationship with and that she lied to police to \"ruin\" him.He said: \"Central to your dishonest evidence in this court is you with Thomas Cashman.\"Made you want to ruin him?\"She replied: \"No. Ruin him... you find out what you find out.\"I have had to do what I have had to do for a little girl here. I have had to go through a lot of pain, to think about what Tommy done.\"Mr Cooper continued: \"About the time of this tragic killing, you were angry, resentful and vindictive.\"\"I was not,\" she replied.She added: \"I have not been asked one question about a nine-year-old girl who lost her life. That little girl can't go home, so I'm passionate about that.\"Let's get to the good bits. Why not ask about the shooting?\"Mr Cooper replied: \"Good bits? Because we say you are a liar.\"The witness said she had not initially told police about having a \"fling\" with Mr Cashman because she was \"petrified\".She said: \"I have not got family. I was petrified. Absolutely petrified.\"Thomas Cashman has done what he's done and he can't own it, love.\"At one point during the exchanges, trial judge Mrs Justice Yip asked the witness to look at her, to take a moment and to calm down.Mr Cashman, of Grenadier Drive, Liverpool, denies the murder of Olivia, the attempted murder of Mr Nee, wounding with intent to do grievous bodily harm to Ms Korbel, and two counts of possession of a firearm with intent to endanger life.The trial continues. Why not follow BBC North West on Facebook <https:\/\/en-gb.facebook.com\/BBCNW\/>, Twitter <https:\/\/twitter.com\/BBCNWT> and Instagram <https:\/\/www.instagram.com\/bbcnorthwest\/>? You can also send story ideas to northwest.newsonline@bbc.co.uk <mailto:northwest.newsonline@bbc.co.uk>"}