{"author":"","title":"Hemsby cliff-top homes start to collapse","news_category":"general","content":"Houses left perched on a cliff edge will topple down the beach in the next few days, a council has said.The 13 chalets on The Marrams in Hemsby, Norfolk, were evacuated at the weekend and are now \"uninhabitable\".Close-up photos have shown parts of the houses starting to collapse, leaving rooms exposed and possessions strewn along the sand.Jan Davis, from Norfolk County Council, said the \"homes are going to be sliding down the dunes\" within days.He said strong winds and high tides were forecast until Wednesday night.\"As the sand dries out and becomes more powdery, over the next week the dunes will start to settle and adjust,\" said Mr Davis, head of resilience.He said 15 people had been left homeless and advised them to \"talk to their insurers and consider what options are open to them\".Widower Maurice Broom, 74, has watched his home - which he bought for £40,000 two years ago after his wife's death - partially collapse on to the beach.The retired construction worker said many of his possessions remained in the property and he was not allowed in to fetch things as it was unsafe.The entire bathroom floor, with the toilet still attached to it, dropped out of the home as the sand beneath gave way.He said it \"seemed sense\" to buy the house as it was 70 metres (230ft) from the cliff edge.\"It's disgraceful, upsetting, because that would have been my last home,\" he said.\"I'd found somewhere, a niche that I'd never found before.\"Mr Broom, who is originally from London and a heavy metal fan, said a treasured band T-shirt, which had taken him 10 years to get, was still in his washing machine in the house.Photos have shown some of the timber bungalows just propped up by their underpinnings.The crumbling ground has made it impossible to get demolition equipment to dismantle them.Eight of the 13 bungalows were permanent homes and the borough council has been organising emergency accommodation.Lance Martin, who retired to his now-stricken £95,000 bungalow in November, said surveyors had assured him everything would be fine.\"But I don't think anybody could have forecast what was going to happen with the weather,\" he said.\"I'm 60 and I thought I'd have a good 10, 15 years to see my life out.\"Hemsby Parish Council chairman Keith Kyriacou said the situation was a \"disaster\" andagain called on the government to provide sea defences <http:\/\/www.bbc.co.uk\/news\/uk-england-norfolk-43458926>.A petition to the government requesting sea defences has gathered more than 5,000 signatures in less than a day.Villagers - together with a grant from Norfolk County Council - raised £120,000 to put in partial sea defences along the beach in 2015 <http:\/\/www.bbc.co.uk\/news\/uk-england-norfolk-35006660>.Charles Beardall, eastern region area manager for the Environment Agency, said a permanent sea defence scheme would only protect a small number of homes and would be too costly.\"There are no easy solutions,\" he said.The Department for Environment, Food and Rural Affairs said local authorities had the responsibility and tools for managing coastal change.It said it is investing more than £150m by 2021 on coastal erosion projects across the country.\"But it is important that local authorities lead on management of coastal erosion risk, taking the decisions that are right for their communities,\" a spokeswoman said.."}