{"author":"","title":"Sweden arrests suspected Russian spy in Stockholm","news_category":"general","content":"An employee of a Swedish high-tech company has been arrested on suspicion of spying for Russia.The person, who has not been identified, was arrested in Stockholm on Tuesday evening, officials said.Counter-intelligence chief Daniel Stenling said they believed the suspect was recruited by a Russian intelligence officer posing as a diplomat <https:\/\/www.sakerhetspolisen.se\/en\/swedish-security-service\/about-us\/press-room\/current-events\/news\/2019-02-27-individual-arrested-on-suspicion-of-having-carried-out-unlawful-intelligence-activities-against-sweden.html>.Swedish media released video purporting to show the suspect being led from a restaurant after meeting their contact.The suspect had been working on \"tasks known to be the type of intelligence sought after by foreign powers\", a security service statement said, without giving details.\"It is suspected that the criminal activities have been going on since 2017,\" it added.A witness quoted by Swedish newspaper Aftonbladet said several officers of the Swedish security police, known as Sapo, stormed the restaurant and surrounded a table where two people were sitting having a meal.Swedish media said a second person was also detained in the operation but later released after claiming diplomatic immunity.Mr Stenling said security threats to Sweden were the most extensive for several years.\"Technological developments have made state actors' efforts to gather intelligence in cyberspace more sophisticated,\" he said.\"At the same time, the more traditional intelligence-gathering approach, using recruited agents to collect information, is still being used. This combination enables state actors to broaden and deepen their collection of classified information.\"Last year, the head of Sweden's security service told the BBC the agency was concerned about growing foreign political interference <https:\/\/www.bbc.co.uk\/news\/world-europe-42285332>.\"It's very important for us to follow this and we are not shy in Sweden - we say that the biggest threat to our security in that perspective is Russia,\" Anders Thornberg said.Analysts believe it is a debate within Sweden about whether to move closer to Nato that has made the country a particular target for Moscow."}