{"author":"","title":"Grant Shapps says UK government wants to 'fix' M4 and A55 congestion","news_category":"general","content":"A UK government project will examine the case for the M4 relief road and upgrades along the A55, according to Transport Secretary Grant Shapps.Major road projects in Wales have been the responsibility of Welsh ministers in Cardiff since devolution in 1999.But a Westminster review says there is a strong case for a pan-UK network.The Welsh government said there were \"important\" parts of the review but warned UK ministers not to \"trample over devolution\".Mr Shapps said he wanted to work with the Welsh government to get both roads - which have suffered from congestion over the years - \"fixed\".He said a £20m scheme off the back of the review - which is looking at a number of transport projects - would look at Wales' two busiest and most congested roads.The Welsh government has previously said the relief road was a matter for Wales <https:\/\/www.bbc.co.uk\/news\/uk-wales-politics-54469828>. The report looks at rail, road, air and maritime transport, with the review also looking at a ferry link between Holyhead and Northern Ireland.Mr Shapps denied the UK government wanted to take control of building trunk roads from the Welsh government adding: \"This isn't about powers.\"\"There's lots of areas we already work closely together, rail infrastructure for example, which we already work on together,\" he told BBC Wales.The £1.6bn M4 relief road was axed by the Welsh government in 2019 over cost and its impact on the environment <https:\/\/www.bbc.co.uk\/news\/uk-wales-48512697> following ministers inWales declaring a climate emergency <https:\/\/www.bbc.co.uk\/news\/uk-wales-politics-48093720>. To build roads in Wales, the UK government would need to change the laws that govern the country unless it worked with Welsh ministers.It is not clear in the review how a pan-UK network would be implemented and the study is being led by Network Rail chairman Sir Peter Hendy.An interim report says that following conversations with stakeholders \"the review believes that there is a strong strategic case for a new pan-UK transport network\".Both the A55 and the M4 in south-east Wales are identified by the report as being of interest to the review.It says that UK government funding would, like former EU funding for the TransEuropean Network for Transport, \"be used to add to existing funding streams, to enable higher capacity, faster, and more reliable connectivity\".This video can not be playedThis video reveals the possible route of the M4 relief roadPrime Minister Boris Johnson called for a UK-wide transport strategy in the Telegraph on Tuesday, saying the Welsh Labour government has \"mystifyingly junked\" the M4 relief road after spending £144m.Now, speaking to BBC Wales, Mr Shapps said: \"The A55, people know, gets very choca-bloca if you're trying to get through to Manchester and Liverpool and north Wales.The minister said: \"We've already been speaking to the Welsh government throughout, for example with Ken Skates in Welsh government who broadly welcomes this, and I think everyone's keen to make that connection between England and Wales work a lot more smoothly.\"And we know the M4 - there's been a lot of talk about an M4 relief road - or indeed the Welsh government through the Burns review has looked at different solutions to that.\"This is really just to say, 'brilliant, let's work together to get them fixed'.\"Mr Shapps said the review \"says we will primarily look to work with devolved administrations - the Welsh government in this case - to help to build, construct, with assistance where appropriate, and maintain these things\".The transport minister added \"the M4 relief road was the most obvious way\" to deal with congestion.The UK government said it would fund a £20m project to look at a wide-range of projects across the UK that were identified by the review.It will look at rail improvements in south-east Wales, building on ideas from the Welsh government's Burns Commission which proposed spending£800m on public transport <https:\/\/www.bbc.co.uk\/news\/uk-wales-55062433> to deal with the bottlenecks on the M4 around Newport, as well as the wider motorway.Mr Shapps said: \"I'm putting in £20m to kickstart work on some of these projects so we can get to the appropriate answers like what happens to the A55 in north Wales connecting England?\"What happens with the M4 - whether the relief road is the right approach or whether some other sort of Burns report type approach - is a question we can answer in the process.\"During the interview, Mr Shapps said: \"I think I'm right in saying something like a quarter of Welsh people actually work in England.\"Figures from Stats Wales showed that in 2019, 98,500 of 1.4m working Welsh residents commute outside of Wales - 6.8%.A spokesman for the Welsh government said: \"As a Welsh government we are clear. There are some important areas coming out of this Union Connectivity Review where governments across the UK can and should work collaboratively, respecting each other's powers, to create a stronger transport network.\"Today's review recognises the success of transport devolution and highlights the important role the recent Burns recommendations are to addressing issues like congestion on the M4.\"But if the UK government simply want to ignore all of that, including the content of their own report, and use this as yet another attempt to trample over the devolution settlement - just as it is with the Levelling Up Fund - then we will get nowhere.\"Plaid Cymru's Liz Saville Roberts accused the UK government of seeking to split Wales into north and south, with an obsession that \"all roads lead to London\".\"Proper cross-border links are of course needed. But any ambition to improve cross-border transport must prioritise improving transport links within Wales first as an essential foundation for improved cross-border connections.\"The interim report says the review will also look at faster and higher capacity connections for passengers from HS2 to Scotland and north Wales.Rail upgrades in south-east Wales to Bristol are also being discussed, as well as whether there should be a new ferry route from Holyhead to Warrenpoint in Northern Ireland.Meanwhile it is is assessing the feasibility of a bridge or tunnel between Northern Ireland and Scotland <https:\/\/www.bbc.co.uk\/news\/uk-scotland-south-scotland-49661019>.Part of the UK government's strategy to \"boost the union\" at the moment is to invest in projects - particularly infrastructure - around the UK, which can then be branded as \"UK government funded\".This review looking at transport links between the four nations appears to be their latest tool to do this.At times some Conservative MPs and figures in UK government have expressed frustration that they hadn't, until a new law passed last year, kept hold of powers as a central UK government to invest in devolved areas like road infrastructure in the nations.But the strategy hasn't always made them popular with the Welsh government who have accused them of trying to ride roughshod over devolved responsibilities.So what's not clear is: what happens if the UK government decide a project like the M4 relief road, which Welsh ministers scrapped, is a solution they want to invest in?"}