{"author":"","title":"Isle of Man to ban sale of petrol and diesel cars by 2040","news_category":"general","content":"The sale of new petrol and diesel fuelled cars will be banned on the Isle of Man by 2040, the Chief Minister has said.Howard Quayle said a new Climate Change Bill would be brought forward \"before the end of the next legislative year\".The proposed laws would also impose a ban on the use of gas and oil boilers in new houses by 2025.The Isle of Man Green Party's chairman Andrew Bentley said the pledge was a \"good step in the right direction\".Mr Quayle said the Manx government \"recognises the climate change emergency that is facing the planet\".The law will \"commit this government and future administrations to reach net-zero carbon emissions by 2050,\" he continued.The move would bring the island's target into line with recommendations outlined in the latest report by theUnited Nations Intergovernmental Panel on Climate Change <https:\/\/www.bbc.co.uk\/news\/science-environment-45775309>.The government's previous target was to reduce the island's carbon emissions by 80% by 2050.A consultation on climate change <https:\/\/consult.gov.im\/environment-food-and-agriculture\/climate-change-action-plan-2020-2030\/> and what action the government should take, which was launched in March, has attracted 600 responses so far.Mr Bentley said the announcement was \"mainly positive\" but, at this stage, it was \"only words\".\"Unless we change our direction, we are heading for a very big problem,\" he said.\"At the moment, we are living way beyond our environmental means.\"Manx Utilities chairman Alex Allinson said future moves towards renewable electricity generation on the island would need \"compromise\".\"Let's actually sit down together as a nation and say what we are prepared to do to meet the climate challenge that we've set ourselves,\" he said.\"That will need some compromise both in terms of what we build, how much we pay, but also the way we live our lives.\""}