{"author":"By Jonathan Amos","title":"Wildlife photo: Is this the world's most beautiful mosquito?","news_category":"general","content":"You can't help but marvel at its beauty. This female mosquito, with its fabulous furry legs and iridescent shimmer, is a total stunner.It's one of the Sabethes species found in central and South America. What a shame this particular specimen also happens to be an important carrier of tropical disease.The picture was taken by Gil Wizen <http:\/\/gilwizen.com\/> from Ontario, Canada. His work is highly commended in this year'sWildlife Photographer of the Year <https:\/\/www.nhm.ac.uk\/wpy> competition.Scroll down this page and you can enjoy some of the other highly commended images in what is the 57th year of the prestigious contest.Gil is an entomologist by training, so he really understands his subjects. And to get this kind of shot requires a lot of planning, patience - and even some pain.He describes Sabethes mosquitoes as being extremely skittish and difficult to photograph well, especially in the constant heat and humidity of the Amazon rainforest in Ecuador, where this picture was taken.\"The mosquito responds to the tiniest of movements and to changes in light intensity,\" he told me.\"This means you must stay very still while attempting to photograph it, and also be prepared for the mosquito's escape if using a flash. Fortunately, you are never alone with a single mosquito, because usually there are dozens of them hovering over your head.\"These mosquitoes are important vectors of several tropical diseases, such as yellow fever and dengue fever. While taking the photo, I was bitten by this mosquito and several others, increasing the risk of contracting a vector-borne tropical disease. But I am still alive!\"Anyone who's ever tried to take an insect picture will recognise that Gil has had to \"stack\" several differently focussed images to get the depth of field necessary to show all of the detail along its body.A vixen searches for salmon carcasses in the shallows of Karluk Lake in the Kodiak National Wildlife Refuge of AlaskaNotice how the mosquito's rear legs are held high as it feeds on blood from Gil's knuckle. They're sensory. The insect needs to remain hyper-aware of what's going on around it just in case there's a requirement to make a quick escape.And then, of course, there are those feathery \"paddles\" on the other legs. Their purpose is not entirely clear but are likely involved in attracting a mate.There are more than 3,300 species of mosquito in the world. They have few admirers.Most of us won't stop to examine them close up when we swat them. But if we did, we'd find many display colourful scales and hairs, says Erica McAlister, a senior curator at London's Natural History Museum, which runs the WPY competition.To some degree or other, everything has its place in nature.\"The female Sabethes is only going to blood-feed when she's about to produce eggs. The rest of the time she nectar feeds. Therefore, she will be a pollinator,\" Erica explains.\"You have to remember she's being manipulated by these viruses (dengue and yellow fever). That's one way to look at it.\"Gil's image is titled Beautiful bloodsucker. Below are some other highly commended pictures.This video can not be playedThere are only a few species of fungi that have the property of bioluminescenceA glowing fungus clings to a dead tree in the rainforest of Queensland, Australia. Click the image and you can see some video as wellStrong swimmers. Male cheetahs paddle across the flood-swollen Talek River in Kenya's Maasai MaraA drone looks down on a polluted river in the Geamana Valley, within Romania's Apuseni MountainsThree rose-ringed parakeet chicks pop their heads out of a nest hole as their father returns with food. This picture was taken by 10‑year-old Gagana from a balcony at his home in ColomboThe overall winners in the Wildlife Photographer of the Year <https:\/\/www.nhm.ac.uk\/wpy> competition will be announced at an awards ceremony on Tuesday 12 October. The annual NHM exhibition will open the following Friday, 15 October, and, as usual, will then go on tour."}