{"author":"By Steffan Messenger","title":"Climate change: Greener Wales 'must not hit poorer communities'","news_category":"general","content":"This video can not be played'We all recognise there needs to be a transformational change'Reshaping the economy to fight climate change must not result in making life \"even harder\" for disadvantaged communities, says a leading campaigner.Susie Ventris-Field is spearheading efforts to record 50,000 messages from Wales to present at a major UN climate conference.She said too often \"regular people's voices are missing from the mix\" in planning for a greener future.It comes as a \"jury\" of south Wales valleys residents publishes its ideas.They include setting up local \"hubs\" for remote working to cut down on commuting, with car-free town centres to tackle air pollution.More than 60 Welsh charities and organisations have joined forces to launch the Climate.Cymru campaign <https:\/\/climate.cymru>, and 1,000 individuals, families and businesses have already contributed their own personal stories and suggestions about addressing the threat of global warming.They will be presented to Welsh politicians and showcased as part of an interactive display in the events hall at the UN Climate Change Conference of the Parties (COP26) - which will be attended by world leaders in Glasgow later this year.So far, Ms Ventris-Field, the chief executive of the Welsh Centre for International Affairs, said they ranged from demands to protect nature and wildlife - which had become \"really important\" for people during lockdown - to making electric vehicles and public transport more affordable.The priority was to hear from communities that would be the most affected by the huge economic changes needed to meet goals around cutting greenhouse gas emissions over the coming decades, and those already being hit by the impacts of climate change, she explained.\"In order to make the transition (to a greener Wales) happen in a way that doesn't impact people who are already struggling - their voices need to be heard,\" Ms Ventris-Field added.\"You don't have to be a climate expert to see the changes in weather patterns, to see the increases in flooding that we've seen here in Wales which have been so difficult for people in a year where they're already battling with the pandemic.\"\"It's so important that we start to take robust action as soon as possible across all sectors and society - but in order to do that we need governments to set the right framework,\" Ms Ventris-Field added.\"Putting that into practice is going to need people from across Wales who can add their voice and say 'this is how we think it could happen'.\"Blaenau Gwent recently held a \"Climate Assembly\" involving 50 residents to help inform planning by the local council and other organisations.Meanwhile, a cross-party Environmental Justice Commission, set up by the IPPR think tank, asked people from across the south Wales valleys to be part of a \"citizens jury\" working with experts to provide suggestions for politicians.Others have been held in County Durham, Aberdeenshire and Essex.The organisation said it was vital these areas did not \"face a repeat of the injustices confronted during the last industrial transition\".Valleys areas continue to face adverse impacts caused by historic mine closures and the resulting loss of local employment, it warned.That affects how people travel - with many dependent on polluting cars to get in and out of the area for work, and limited public transport options.The jurors argued that it was key the transition to a greener future ensured people could succeed while staying local.Jesse Patton, from Ystalyfera, who runs a business supplying equipment to pubs and restaurants said it had been \"scary at times\" learning more about the severity of the climate situation.But he said the sessions had encouraged him to make changes to his business - ensuring all disposable products he supplied were biodegradable or recyclable, and ditching single-use plastics.\"You don't realise the severity of the issue until the facts and figures are given - but learning what we can do about it and how we can change was really informative, really good.\"The jurors called for an economic strategy for the valleys geared around \"anchor towns\" with local hubs for remote working and revitalised high streets to encourage people to shop sustainably.Significant investment in green public transport options was urged - with car-free town centres pitched as an attempt to improve air quality.And digital infrastructure - like fast broadband - \"should be treated as a basic human right\" - to support all sorts of jobs to be done remotely after the pandemic.Katie Lloyd, a sales and marketing executive from Neath, said the sessions encouraged her to go back to university and pursue a masters degree about sustainability.\"It's given us an opportunity to reflect on what we can do in our community and [how it could] create more opportunities locally, meaning people don't have to leave the area and really make the most of where they live,\" she said.Becca Massey-Chase, of the Environmental Justice Commission, said the jury was the \"first of its kind in Wales\" and had produced \"insightful and practical proposals for tackling the climate crisis and restoring nature in a way that is fair for everyone.\"\"Huge changes to the way we live and work were inevitable over the coming decades,\" she said.\"Things are going to be done but it's how it's done that's going to be really important.\"If we're going to make the progress that we need to make then we need to involve people, because we need the public to be supportive of the action and see it as fair.\"Our jury told us they want to be part of the change, they want to be involved in the decision making - they want things done with them not to them.\""}