{"author":"","title":"Oxford University Hospitals trust gets new radiotherapy machine","news_category":"general","content":"A new radiotherapy treatment machine has been installed at an Oxford hospital.The Stereotactic Radiosurgery (SRS) device uses many precisely targeted, high intensity radiation beams to treat tumours in the brain.The apparatus is based at the Oncology & Haematology Centre on the Churchill Hospital site.Oxford University Hospitals (OUH) boss Dr Anny Sykes said it was one of \"only a few NHS trusts\" with the capability.The machine, known as a Varian TrueBeam Linear Accelerator, will provide treatment for people living with a range of cancers under the care of Churchill Hospital specialists.The trust said its HyperArc capability would enable the radiotherapy team to treat patients with brain tumours faster and more efficiently.SRS is more complex than standard radiotherapy, with pinpoint targeting that destroys tumours while protecting the surrounding healthy brain tissues.Dr Sykes, the interim chief medical officer, said: \"This demonstrates that we are always finding innovative ways to treat our patients and making sure we provide quality and compassionate care.\"Ketan Shah, consultant oncologist and head of radiotherapy at OUH, described it as a \"significant advancement in technology and capability\" for the trust.He said: \"It has taken four months to set up, test and retest all the capabilities of this remarkable piece of clinical engineering - a process we call commissioning.\"Our excellent SRS service has built a national reputation and continues to grow and innovate.\"Head of radiotherapy physics Jonathan Lane added: \"Our scientific workforce is key in implementing new technology and optimising patient treatment to obtain the best possible outcomes.\"SRS is particularly complex and requires a deep understanding of radiation physics and very specialist skills to ensure treatment is safe and effective.\"The trust has a team of about 45 experts delivering radiotherapy to about 3,700 patients each year.They also conduct research to improve outcomes for cancer patients.Follow BBC South on Facebook <https:\/\/www.facebook.com\/BBCSouthNews\/>, Twitter <https:\/\/twitter.com\/bbcsouthnews>, or Instagram <https:\/\/www.instagram.com\/bbcsouthnews\/>. Send your story ideas to south.newsonline@bbc.co.uk <mailto:south.newsonline@bbc.co.uk>."}