{"author":"By Robby West & Orla Moore","title":"Ukrainian refugees mark Independence Day in Norfolk","news_category":"general","content":"This year, on 24 August, the people of Ukraine commemorate Independence Day in the midst of war. It also marks six months since the Russian invasion of the country began. At an aid centre in Dereham, Norfolk, a group of Ukrainian refugees are finding their own way to celebrate.Maria Pryzyhelei, 43, first escaped to Poland with her children when the war began six months ago.\"At first it was really horrible because all the time you are waiting, waiting for the rockets, waiting for the bombs because of the alarms and the shouting,\" she recounts.\"All our neighbours were going upstairs because of the alarms and shouting all day and all night. As a mother, it was so hard - I can't even speak. I can't explain.\"After spending time in Poland, Maria and her family eventually came to England on the invitation of British friends.\"I would never wish anyone to feel like this,\" she says. \"Being here, and feeling support from people, from the governmental programme, we feel like we are coming from the bottom of the sea to the sun.\"I feel like I'm getting better and better and now I can help other Ukrainians in Britain.\"This year, she says, Ukrainians are paying a high price for their Independence Day.\"Every day we are paying with our blood,\" she says. \"In this struggle, we deserve our independence.\"Maria's daughter, Bohdana, 17, said half of their family made it to the UK but her father and grandmother are still in Ukraine.\"It's very hard, and I'm really sad about it,\" she says. \"I miss my family and I hope that soon there'll be peace in Ukraine.\"This video can not be playedIlona Gurina says it is good to meet other refugees at the centreIlona Gurina, 40, says this Independence Day is the \"hardest celebration in my life\".\"To live in another country with your kids, I like travelling - but not this way,\" she says.\"At first it was really hard and I was always crying because I left my husband, I left my mum and my family. But I have very lovely hosts who helped me with everything.\"To have the kids here it's not so hard now - there are very lovely people in the village where I live now.\"She says it was interesting to meet other Ukrainian refugees on her first visit to the aid centre in Dereham.\"All the people who are leaving Ukraine now do it for the children,\" she says.\"I don't want my children to only remember the bomb shelters. I want my children to have an education. My little boy goes to school for the first time this year.\"Nina Bielova, 40, from Kyiv, says the celebrations in Dereham are \"a little part of our Ukraine\".\"Nowadays, it's the main party in our country,\" she says.\"Many of us here are not with family, we are without our husbands, the fathers of our children, so we try to be together and support each other.\"It's hard at this very moment. Sometimes we cry but we hope we will win and as quickly as possible.\"Olena Grabarchuk, 53, is hosting Ukrainian families in Norfolk.\"It's a very big day for all of us - it's Liberty Day - to celebrate Ukraine choosing its independence in 1991,\" she says.\"We like to be independent, we don't like to be under the Russians.\"Our freedom was our choice. For my family, my friends here, it is about making their lives as comfortable as it should be.\"We believe, all of us, we'll have a victory at the end of the day.\"Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}