{"author":"","title":"Olivia Pratt-Korbel: No CCTV at murder suspect's home, trial hears","news_category":"general","content":"CCTV from the home of the man accused of shooting Olivia Pratt-Korbel was never recovered, a trial has heard.Thomas Cashman denies murdering the nine-year-old at her home in Dovecot, Liverpool, on 22 August last year.Manchester Crown Court heard a crime scene investigation of Mr Cashman's home was carried out on 14 September.It found no electricity supply to the property and CCTV monitors and television cables were disconnected, the jury was told.Mr Cashman is accused of chasing another man, Joseph Nee, into Olivia's home and firing his gun, which killed Olivia and also injured her mother Cheryl Korbel, 46.The 34-year-old claims he was not the gunman.The court heard when officers went to Mr Cashman's home in the West Derby area of Liverpool they found an exterior electric cupboard was open and routers, smoke alarms, CCTV monitors and cables from the rear of televisions were disconnected.Det Con Craig Doyle told the trial that information from a BT router at the house showed a device called an XVR had last connected on 25 August.He said research showed a range of CCTV recorders had been in use, including the XVR.David McLachlan KC, prosecuting, asked: \"Was a CCTV recorder ever recovered?\"Det Con Doyle said: \"No.\"Mr McLachlan said: \"However, one had last connected on August 25 between 2pm and 4pm?\"Det Con Doyle replied: \"Yes.\"He said police had attributed six phones to Mr Cashman but, between 19 and 24 August they could not find a phone number which he was using.The jury heard Mr Nee suffered various gunshot wounds including an injury which was potentially life-threatening.A list of his injuries was read to the court and included a laceration to his scalp, an entry wound to his chest, a rib fracture, bleeding into his chest cavity and an injury to part of his colon.The trial also heard from Jade Holland, head of design at sports brand Foot Asylum, who gave evidence about a pair of Monterrain tracksuit bottoms which the prosecution claim the gunman was identified as wearing on CCTV footage.She said reflective markings on the trousers made them \"quite unique as a garment\".Mr Cashman denies being the person in that CCTV.He denies the murder of Olivia, the attempted murder of Mr Nee, wounding with intent to do grievous bodily harm to Ms Korbel, and two counts of possession of a firearm with intent to endanger life.The trial continues. Why not follow BBC North West on Facebook <https:\/\/en-gb.facebook.com\/BBCNW\/>, Twitter <https:\/\/twitter.com\/BBCNWT> and Instagram <https:\/\/www.instagram.com\/bbcnorthwest\/>? You can also send story ideas to northwest.newsonline@bbc.co.uk <mailto:northwest.newsonline@bbc.co.uk>"}