{"author":"","title":"BBC local staff to strike during May elections over radio cuts","news_category":"general","content":"Staff at local BBC radio stations are set to strike for a second time over cuts to schedules, the National Union of Journalists (NUJ) has announced.The walkout is due to take place on Friday 5 May to coincide with local election results.Journalists say they are concerned by proposed job losses prompted by stations sharing content.The plan is for more radio shows to be networked across several stations after 14:00 on weekdays and weekends.It would mean the BBC produces 20 afternoon programmes across England and 10 programmes in the evening.This is part of BBC strategy to place more digital jobs in local regions to help improve online and social media output away from the broadcaster's larger regional or national bases.The BBC rejected an initial claim by the NUJ <https:\/\/www.nuj.org.uk\/resource\/second-bbc-strike-over-cuts-to-radio-will-coincide-with-local-elections.html> that the plans meant that more than 100 hours per week of local programming on every radio station could be reduced to 40 - pointing out that the calculation did not take into account the hours of sports programming that would be retained individually on every station.A BBC spokesperson said: \"We are protecting all live local output from 6-2pm on weekdays as well as all sports programming across the week on every station. In addition, a number of our larger stations will retain their own dedicated local programmes in the afternoon across the week.\"Even where we propose to share some local programming across neighbouring stations in the afternoon, we will still produce 20 different local programmes across England.\"The NUJ later withdrew its claim of a 40-hour minimum figure but said that the cuts still amounted to slashing half the local output in large parts of England.BBC staff are being asked to re-apply for jobs - with 48 roles set to be scrapped.Paul Siegert, NUJ national broadcasting organiser, said: \"Video didn't kill off radio and nor will digital.\"We understand that digital services need to be improved but it shouldn't come at the expense of local radio which is at the heart of the BBC's public service remit.\"A first strike took place <https:\/\/www.bbc.co.uk\/news\/entertainment-arts-64964035> on 15 March to coincide with the chancellor's budget announcement.It resulted in several regional TV news bulletins being cancelled and was described as having a \"significant impact\" by the NUJ.A BBC spokesperson said: \"We're disappointed that the industrial action is taking place.\"We have a plan to modernise local services across England - including more news journalists and a stronger local online service - which will see no overall reduction in staffing levels or local funding.The statement concluded: \"Our goal is a local service across TV, radio and online that delivers even greater value to communities.\"We will continue to engage with the trade union and do everything possible to minimise the impact on staff.\"CLARIFICATION: This story was updated on 1 April when the BBC challenged an NUJ claim on the number of hours of local programming and the NUJ accepted the BBC's figures."}