{"author":"","title":"Raw sewage leaked into Gannel estuary near Crantock","news_category":"general","content":"A burst pipe has caused \"a torrent\" of raw sewage to pour into an estuary popular with swimmers and paddle boarders.The incident happened at about 09:00 BST on the Gannel estuary near Newquay, about 100m from Crantock Beach.A local surf school owner said he had to call businesses on the beach to get people out of the water.South West Water said it reacted as \"quickly as possible\" and will continue repairing the pipe over the weekend.Dale Unnuk from the Big Green Surf School said he'd been made aware of a \"foul smell\" on Friday morning and went to inspect it.\"I headed up there as we need to know what's going on in the water to keep our customers safe,\" he said.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.\"We heard this burbling sound and took a step back. \"It's lucky we did because a torrent of sewage came flying out the side - it must have been like a 30cm diameter fire hose cranked on.\"Mr Unnuk added: \"There were infants bathing and you could see this brown sewage coming down - we had to get everyone out to avoid contamination.\"Amy Slack, head of campaigns and policy at Surfer's Against Sewage said: \"It has completely exploded, leaking a lot of sewage into the estuary and therefore straight out into Crantock.\"We understand this is not the first time this has happened. It really raises the issue of sewage leakages into the environment and we need it to stop.\"We need action to be taken by the government and water agencies to end this.\"The Environment Agency collected samples from the leak and has advised the public to consult itsbathing water website <https:\/\/www.gov.uk\/quality-of-local-bathing-water> before swimming. A South West Water spokesperson said the discharge was stopped by 11:30: \"Tankers are in use to divert the sewer flows while we carry out our repairs now and over the weekend.\"We are working around the clock to complete the work, reopen the footpath and clean up any debris as soon as possible.\"We take our guardianship of the natural environment very seriously and want to do more.\"The footpath between Crantock Beach and Penpol Creek has been closed."}