{"author":"","title":"Channel migrants: Three boats with 96 people make the crossing","news_category":"general","content":"Almost 100 migrants crossed the English Channel in small boats on Monday, the Home Office has confirmed.Some 96 people crossed in three boats, with the French authorities preventing one boat with 56 people on board from making the journey.The number of people who crossed the English Channel in small boats last year was treble the number for 2020.Figures compiled by the BBC show at least 28,431 migrants made the journey in 2021This was despite huge UK investment in France to prevent crossings.Tom Pursglove, minister for justice and tackling illegal migration, said: \"People fleeing persecution should seek safety in the first safe country they reach and not risk their lives paying criminal gangs to cross the Channel.\"This government is reforming our approach to illegal entry to the UK and asylum by making the tough decisions to end the overt exploitation of our laws and its impact on UK taxpayers.\"The Nationality and Borders Bill will make it a criminal offence to knowingly arrive in the UK illegally and introduce life sentences for those who facilitate illegal entry into the country,\" he said.\"It will also strengthen the powers of Border Force to stop and redirect vessels, while introducing new powers to remove asylum seekers to have their claims processed outside the UK.\"In 2020, a total of 8,417 people crossed the Channel in small boats.Last year's record number for the current crisis - an increase of about 20,000 - saw arrivals peak in November when, despite falling temperatures, at least 6,869 people reached the UK.On 24 November at least 27 people died as their boat sank <https:\/\/www.bbc.co.uk\/news\/uk-59406355>.The same month saw a new record for a single day, when 1,185 people reached British shores aboard 33 boats <https:\/\/www.bbc.co.uk\/news\/uk-59257107>.In 2020 the most arrivals on a single day was 416, set in September.Follow BBC South East on Facebook <https:\/\/www.facebook.com\/BBCSE\/>, on Twitter <https:\/\/twitter.com\/bbcsoutheast>, and on Instagram <https:\/\/www.instagram.com\/bbcsoutheast\/>. Send your story ideas to southeasttoday@bbc.co.uk."}