{"author":"By Kate Scotter","title":"'I'm embarrassed I didn't know about the menopause'","news_category":"general","content":"When women go through the menopause, the ups and downs are often shared by loved ones. But it's not always an easy task when they haven't been through the hormonal changes themselves. How can partners and colleagues help women get through the experience?Neil Lawson, who has been married twice, says he is \"going through the menopause\" for a second time.He didn't feel able to support his first wife, but he is much more aware now with his second wife Catherine.The 57-year-old, from Cromer, Norfolk, says communication has been key this time around.\"The first time I knew nothing about it. My wife was not able to talk about it at all. I didn't know anything about the difficulties she was going through.\"I feel extremely embarrassed and stupid about it but she didn't say anything because she wasn't able to.\"But with Catherine, I'm much more aware that this train is coming and we're much better at communication than ever before,\" says Neil.The life coach says it is difficult for men to fully comprehend it because it is \"beyond our experience\".\"It's a bit like childbirth from the man's perspective. You can know about it, learn about it, read about it, but you have no clue what is really going on and can't do anything about it even if you wanted to,\" he says.\"One of the things that upsets me most is that there's nothing practical I can do. I don't know how Catherine is going to feel, I desperately want to do something but I can't.\"All I can do is be there for her as best I can, and ask her what she needs,\" he says.Massage therapist Catherine always tells him when she wakes up and \"feels completely rubbish\", he says.\"At least I can prepare and set my expectations for that day.\"I make her cups of tea if that's what she needs or I'll just hug her; all I can do is be OK with her not being OK,\" he says.His wife of 10 years Catherine is 49 and has been going through perimenopause - when a woman first starts to develop the physiological changes associated with menopause - for about four years.Neil says sometimes she can be \"weepy and incredibly emotional for no explained reason\", and there are moments when he has to \"bite his tongue\" or \"count to 10\".\"It's not her fault, it's something she is going through,\" says Neil. \"There's lots of compassion, laughing and being OK with not having a clue what this is.\"His advice to other couples is to talk about it and for women to express themselves to their partners.\"It's totally different for every woman and unlike pregnancy there are no common stages you go through, with perimenopause there's no pattern.\"Even it it were written down, it wouldn't help. The biggest support Catherine gets is from other women, especially on social media.\"That support has been absolutely amazing, speaking to other women is so valuable to her. It's just about being heard and to know that you're not going mad.\"Neil also ensures he takes time out for himself. He goes for a walk on the beach or in the forest, or goes to watch a \"boy movie\".Catherine says she is \"so blessed\" to have Neil.\"He is so patient with me and my erratic hormones. I know he counts to 10 and takes deep breaths a lot, bless him.\"To have that level of support from the person you spend your life with is priceless,\" she says.Catherine says they are \"very fortunate\" in their relationship because they \"talk and listen to each other\".\"Neil asked me at the beginning to let him know what is happening for me each day - physically, emotionally and mentally. Basically it helps him gauge whether to approach me, or just give me the chocolate, carbs and gin and back slowly out of the room.\"I speak with several ladies who don't have support and understanding from their partners, and those ladies are so unhappy. I hurt for them, because I have been there with my first marriage.\"To say I appreciate Neil is the understatement of the century. There are no words in the human language that truly express how thankful I am to have Neil as my partner through life,\" she says.Source: Victoria Howell, Menopause ServicesMenopause nurse Victoria Howell says communication is key, as is taking an interest.\"When women have these symptoms, they have no control, it's like they are a third person and they don't want to act like that.\"They worry that people are walking on egg-shells around them and many have partners and young or teenage children.\"If someone starts shouting, do not respond by shouting back, that's just going to escalate and people are going to feel worse.\"If irritability is the biggest symptom, think how you can create a calm and nurturing ambience, and ask what they need and how you can help,\" she says.She recommends tracking symptoms to see if there are patterns or triggers.Victoria also suggests loved ones should brush up on the symptoms, of which she says there are up to 38.\"If an individual can show an interest in what they are going through, like looking at the tracker together, that can help the person feel supported,\" she says.\"It's about knowing what to do and knowing how to help. No-one wants to see their loved ones, friends or colleagues suffer so it's about educating oneself, finding out the information or providing that information in the workplace.\"Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}