{"author":"By Jordan Davies","title":"Coronavirus: Support 'scaled back' for refugees and asylum seekers","news_category":"general","content":"Support for asylum seekers and refugees is being \"scaled back\" because of the coronavirus outbreak.Support workers say refugees and asylum seekers are becoming increasingly isolated, and are now relying on free food deliveries.And some support centre workers say they are having to travel further afield to restock food supplies because they cannot secure goods locally.The Welsh Government said it was working with partners to provide help.Reynette Roberts, director of the Oasis Centre in Cardiff, which supports about 300 asylum seekers and refugees, said providing help was becoming more difficult.\"I think there's a lot of confusion about what's going on. Access to food and other support is very difficult,\" she said.The centre provides free meals and household goods, and delivers to people who cannot leave their home.However, they say they are unable to get tinned and dry goods, and are having to travel into England to replenish their stores.\"The nappies and the baby milk, they go very quickly, so we're constantly having to go and restock,\" she said.\"We're actually planning a trip to a warehouse in London to try and get some stock.\"The centre is now shut for classes, activities and lessons during the lockdown.Asylum seeker Hashaam Siddiqui, who receives meals from the centre, said life during the pandemic had been \"terrible\".\"I'm really glad an organisation like Oasis is supporting us,\" he said.\"We are getting some benefits. We are very thankful for whatever we are getting from the government, but we still have to receive support like this.\"Figures from the Wales Strategic Migration Partnership for last October show there were 2,626 asylum seekers in Wales.Andrea Cleaver, interim chief executive of the Welsh Refugee Council, said: \"Those in the asylum system or on low incomes are facing a choice between isolation or starvation.\"We have been adapting our services to meet needs, for example we are now able to deliver English language courses through online platforms.\"However, those in asylum accommodation aren't allowed broadband connections and, with the closure of community centres and hubs, now depend on mobile data packages to access these lifelines.\"Living on as little as £5 a day means even the cheapest pay as you go options leave people with a choice to connect or to eat.\"A Welsh Government spokesman said: \"We are working closely with our third sector partners, including the Welsh Refugee Coalition, to ensure those seeking sanctuary in Wales are able to access the advice and services they need, including access to food.\""}