{"author":"","title":"Suzy Lamplugh: New search in Worcestershire for body","news_category":"general","content":"Officers probing the disappearance of Suzy Lamplugh have begun a new search for her body in Worcestershire.The 25-year-old west London estate agent went missing in 1986 and was officially declared dead in 1994.The Metropolitan Police are excavating a field off the B4084 between Pershore and the village of Drakes Broughton.The new area is about three miles from the site of the former Norton Army Barracks, which had been searched in December 2000 and February 2001.Officers were preparing to use ground-penetrating radar to examine the earth to see if it was disturbed more than 24 years ago.Two forensic experts were at the scene advising officers on the search.In April 2001, the Quantock Hills in Somerset were also searched for a week following new information.The Met has not searched the site in Worcestershire before.A Met spokesman said: \"Officers investigating the disappearance of Suzy Lamplugh will be carrying out a search on Tuesday of a small area near Pershore in Worcestershire.\"The Met remains committed to solving the Suzy Lamplugh case and we will continue to work towards this end. We will follow up any information in relation to this case.\"A spokesman for the Suzy Lamplugh Trust - set up in her memory by her parents Diana and Paul to raise awareness about personal safety - said friends and relatives were being careful not to get their hopes up.Her father Paul, 79, said: \"The police have kept me fully informed and I look forward to further information with interest.\"Miss Lamplugh, who worked in Fulham, vanished after going to meet a client named \"Mr Kipper\".Following her disappearance police conducted DNA tests on 800 unidentified bodies, before the investigation was scaled down in 1987.The investigation was reopened in 2000 and in December officers searched the site of the former barracks, near Worcester.Most of it was demolished to make way for a block of flats and a housing estate now stands on the surrounding land."}