{"author":"By Ian Youngs","title":"Actress Clara Darcy: Why I'm starring in a play about my brain tumour","news_category":"general","content":"Actress Clara Darcy is appearing in a play about her experience of being diagnosed with an extremely rare form of brain cancer. She explains why she is grateful to her tumour.Earlier in her career, Darcy took part in a common exercise where actors and drama students have to imagine what it's like to face death, to help them portray a character in that situation.\"As much as you can push yourself to imagine it, it is never the same as actually having genuinely been there on the precipice,\" she says now.\"As much as your imagination can let you go there, you won't actually ever appreciate it until you're at that precipice yourself.\"The next character Darcy is portraying is herself, in a play she has co-written about dealing with a chordoma - which left her with a tumour \"the size of a fist\" in her head.The show's title, We Should Definitely Have More Dancing, sums up the new perspective she says she has gained about what's important in life.That title refers to \"the freedom of being able to dance, the freedom of feeling totally alive\", she says. Dancing is a recurring theme in the play, whether it's slow dancing with lovers or drunken dancing with friends.\"You can't help but have that very close dance with death and, if you're lucky enough to survive it, come back and have a new-found respect for life,\" Darcy says in a rehearsal room at the Oldham Coliseum theatre.\"You really appreciate just being able to wake up every day. I can remember lying in hospital and being so scared of going to sleep because I wasn't sure if I would wake up the next day.\"You notice really small, beautiful things about the world and I just feel so grateful that I'm still here. Not everyone gets that chance, you know.\"So I guess the play is all about trying to pass that message on, trying to teach a bit of that wisdom of, try not to sweat the small stuff and just live for the here and now - and today.\"It is three years since Darcy, then 35, suffered the severe neck pains that her GP, a physio and chiropractor couldn't get to the bottom of. Eventually, a \"brilliant, wonderful\" junior A&E doctor sent her for a CT scan.It found she had a chordoma - a slow-growing type of cancer that's found in around just 25 people in the UK every year. A week later, she had 14-and-a-half-hour surgery to remove it through her nose.Darcy, from Stockport, Greater Manchester, has a long list of theatre credits plus guest roles in Hollyoaks, Emmerdale, The Royal and BBC Two's Eric and Ernie. When she was diagnosed, she had just finished performing in a theatre production of Brassed Off.In the original 1996 film <https:\/\/www.youtube.com\/watch?v=6F5vBsY9VZ8>, when Pete Postlethwaite's character was ill, the brass band tried to lift his spirits by performing outside his window. After Darcy's surgery, the band from her stage version did the same thing.\"I was just up in my bedroom in the attic and suddenly heard this brass music in the garden and thought, what the hell?\"This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.The video of that performance was spotted on Twitter by playwright Ian Kershaw, who offered to help Darcy write about her experience.First, the actress had the small matter of eight weeks of proton-beam therapy, a pioneering form of radiotherapy that targeted the small chunk of the tumour that couldn't be removed through surgery.But the month after finishing that treatment, she and Kershaw started meeting to write what became We Should Definitely Have More Dancing.\"I really wanted to tell the story, and the actual process of writing it was so therapeutic and cathartic,\" she says.The play is co-directed by Raz Shaw, who has also written about going through cancer himself. He was diagnosed with stage-four Non-Hodgkin lymphoma in 1995. In 2018, he published a book titled Death and the Elephant: How Cancer Saved My Life.\"I'm genuinely grateful to have had it because it has, in a very real way, made me who I am now,\" says Shaw, now 55.At the time, he was unhappy in a telesales job, but the illness gave him the impetus to pursue his ambition of working in theatre. He was also a gambling addict, but stopped gambling a month after getting the all-clear in 1996.\"I wrote about how cancer saved my life because it focused my mind into what's important. And a couple of years later I started doing this job.\"Darcy says she, too, is grateful for the way her illness has given her a fresh outlook on life.\"It would take a very different person to come back from that experience not having learned anything, not being grateful,\" she says.They are both, though, aware that they are the lucky ones. Anyone going through cancer or who has lost loved ones will be anything but grateful.\"It's awful. Of course, a lot of people die, and that's tragic,\" Shaw says. \"But a lot of people do survive.\"Source: The Brain Tumour CharityAnother reason for Darcy to feel grateful was because she met her boyfriend, Tom, while having treatment - she says they were the only two young adults going through proton-beam therapy at that time.\"I was single when I had my diagnosis and then started treatment,\" she says. \"We got chatting lots and nothing happened at that time.\"We didn't actually get together until nearly a year post-treatment, but it's that thing of [having] that shared language and shared understanding of what the diagnosis means, what surgery means.\"The play will be the first time Tom has seen his girlfriend on stage.He is also being played by one of the actors. \"Not only is he going to see you on stage, he's going to see him on stage,\" Shaw laughs.The other two cast members also play family members and medical staff, as well as alternative versions of Darcy herself, voicing her inner thoughts, or challenging the real Darcy when she's not being entirely truthful with herself or others.One thing her alter-egos must make her face up to is the possibility of her luck running out and her cancer returning.She is currently \"very well\", she says, and has precautionary scans every six months. But she has been told around half of chordomas grow back within five years (although she says those statistics are from before proton-beam treatment was used).\"That's the straw that breaks the camel's back, both for me personally, but also me, the character in the play,\" she says.\"As we say in the play, none of us know what's going to happen tomorrow. I've always been quite an optimistic person, anyway.\"It's difficult to let myself take myself to five years in the future and imagine those things, because there is a there is a real possibility that I might not be here in five years. So I am probably brushing some things under the carpet to some extent about the future.\"But that's possibly the only way you can deal with something that huge - just to be present and be in the moment and live day-to-day.\"We Should Definitely Have More Dancing is at the Oldham Coliseum until 2 July, then on tour in Scarborough, Keswick and the Edinburgh Fringe."}