{"author":"By Philippa Roxby","title":"What is the menopause and what are the signs?","news_category":"general","content":"This video can not be playedMenopause: Busting the most common mythsEvery woman goes through the menopause and symptoms normally start in the mid-40s.Here's our guide to what happens in the run-up to periods stopping.The menopause is when women's periods stop, which normally happens around the age of 51.This signals the end of the reproductive years and the start of a new phase of life.The lead-up to this happening, when periods become irregular, is known as the peri-menopause. It starts, on average, at 46.This is when many women notice their periods becoming unpredictable or heavy, and have feelings or physical problems they haven't experienced before.When periods haven't happened for 12 months, you can look back and say you've been through the menopause (the last period).For some, it can happen earlier - either naturally, or after treatment for another condition.Hormone levels are changing - specifically oestrogen, which controls the menstrual cycle.As women age, the ovaries produce fewer eggs, oestrogen levels fluctuate and then gradually reduce, and this leads to menopausal symptoms.This doesn't happen overnight though. It can take several years for this crucial hormone to fall to low levels - and then it stays that way - causing changes to the body along the way.When the ovaries stop producing eggs altogether, pregnancy is no longer possible and the menopause happens.Listen on BBC Sounds: Are 13 million women in the UK really menopausal? - More or Less <https:\/\/www.bbc.co.uk\/sounds\/play\/p0f4kd4q>The menopause - and the years leading up to it - affect women in different ways.The brain, periods, skin, muscles and emotions are all affected by falling levels of oestrogen.There are lots of possible symptoms and you can have some of them, all of them, or none - and for varied lengths of time.The most common symptoms are:Poor memory and concentration, usually called brain fog, is also often mentioned, as are painful joints and dry skin.Not all women get symptoms - but most do, around 75%. Menopause and me: Too young to feel so old <https:\/\/www.bbc.co.uk\/iplayer\/episode\/p0dnx428>Lots of women don't think about the menopause until they're in their 40s. But it could start much earlier. Emma, Soe-Myat, Olivia and Elspeth share their experiences to help others cope with menopause at any age.Watch now on BBC iPlayer (UK Only) <https:\/\/www.bbc.co.uk\/iplayer\/episode\/p0dnx428>And a quarter of women going through the menopause describe severe symptoms.They can last for an average of seven years, with one in three women experiencing them for even longer.If you're taking a contraceptive pill, it may be more difficult to know when you've reached the menopause because they can affect your periods in different ways.A lack of oestrogen. It is involved in the workings of the body's thermostat in the brain.Normally, the body copes well with temperature changes, but when oestrogen is lacking, the thermostat goes wonky and the brain thinks the body is overheating when it's not.Oestrogen can affect mood too. The hormone interacts with chemicals in brain receptors which control mood, and at low levels it can cause anxiety and low mood.Yes, progesterone and testosterone - but they don't have the same impact as low levels of oestrogen.Progesterone helps to prepare the body for pregnancy every month, and it declines when ovulation ceases and periods stop.Testosterone, which women produce in high levels, has been linked to sex drive and energy levels.It declines from the 20s onwards, and some women need it topped up.Tests are sold and marketed for diagnosing the menopause, but experts agree that they are not useful after the age of 45.A better way is to talk to a GP or nurse about the pattern of your periods and any symptoms you are experiencing.The tests measure levels of a hormone called FSH (follicle-stimulating hormones). However, hormone levels go up and down all the time, even during the course of a day, so the test can't really pin down what's going on.Women can still get pregnant if their periods are irregular - experts advise using contraception until the age of 55.Hormone replacement therapy (HRT) <https:\/\/www.nhs.uk\/conditions\/hormone-replacement-therapy-hrt\/> tops up hormones like oestrogen which start dipping around the time of the menopause, and help to relieve symptoms.But it may not suitable for people who have a history of some cancers, blood clots and high blood pressure.Women can improve how they feel by: There is even research that suggests eating plant oestrogens - contained in soy and red clover - could help with symptoms, and vitamin D supplements could improve bone health.One year after your last period and you're into the post-menopause stage. With production of oestrogen having stopped altogether, there is a long-term effect on the bones and heart. Much of this is part and parcel of ageing.With rising life expectancy, women are now living more than a third of their lives after the menopause."}