{"author":"","title":"Chepstow: School bungalow to house Ukrainian refugees","news_category":"general","content":"A primary school is refurbishing an on-site bungalow to house up to eight Ukrainian refugees.The three-bed bungalow at St Mary's school in Chepstow, Monmouthshire, has been recently used for storage.Chair of school governors Phil Cotterell said the aim is to house two parents and up to six children.Two retired teachers and a holiday park owner are among a number of people across Wales saying they will offer accommodation to Ukranian refugees.\"In terms of offering a haven, I think it's a lovely place to be,\" said Mr Cotterrell, who added the children would be able to attend the school.\"I'm old enough to remember my mum was evacuated from Liverpool with her family. The Welsh gave her a welcome then in the valleys and the Ukrainians will get a warm Welsh welcome too,\" he added.On Monday the UK government launched its Homes for Ukraine <https:\/\/www.bbc.co.uk\/news\/60735121> scheme, allowing anyone in the UK to apply to host refugees.\"As a governing body we agreed two weeks ago that we'd totally support the Ukraine crisis,\" said Mr Cotterrell.\"The support from the congregation has been outstanding, both financially and also offering hours, furniture, cash and their time to do jobs on the bungalow.\"The school estimate it will cost around £3-4K to refurbish the building, and they hope to have it finished within two weeks.\"It makes me feel really happy that the school is actually doing something about the terrible things that are happening in Ukraine,\" said 11-year-old pupil Jake.\"I know we are going to have to be very warm and welcoming, seeing as they are going to be quite nervous coming into a new school and new country.\"I'm sure the pupils of St Mary's are going to be very welcoming.\" \"I love having new students in our school, more people, more friends... more cultures and personalities, it's really exciting,\" said Maddie, 11.\"Hopefully if they learn English we can teach them a little bit of Welsh, and they can teach us about what Ukraine is like as well,\" she added.\"Wellbeing here is very much at the heart of everything we do here at St Mary's Primary school,\" said acting deputy headteacher Kirsty Stevenson.\"As soon as we heard about the terrible crisis going on in Ukraine, and within the wider world, together as a community we knew it was our turn to work together and see how we can support these families.\"Ms Stevenson added the school has all the facilities needed to care for the children, as it has staff trained in helping children through trauma, and staff are fully trained in supporting children learning English.Elsewhere, Jonathan Williams-Ellis, the owner of the Parc Glaslyn activity centre near Pwllheli, is keen to provide accommodation in static caravans and possible employment to refugees from Ukraine.\"We have all been following what is happening in Ukraine and it is absolutely desperate. I have been thinking what we can do to help,\" said Mr Williams-Ellis.\"We are short of staff here and I saw that we were offering to bring 100,000 people into Cardiff Airport. And I thought, where are all these people going? What will they do?\" said Mr Williams-Ellis.\"I can offer employment for maybe four or five people. They would be looked after, and it's a good thing to do.\"Our hand will reach out to them. It is better than charity. It is actually giving them worth and a sense of purpose of being here. We have to do something,\" he added.Cate and Gary Armitage, live in Colwyn Bay, Conwy county and they are keen to offer their home to refugees, but said it's been a complicated process so far.\"We've been watching events unfold, and we felt, gosh, how awful it must be for those parents and mothers and children,\" said Mrs Armitage.\"We can offer a lovely home that's very warm and very inviting and so we would hope that the process for helping us to match with somebody, that that could be done quicker.\"\"We have four single children's beds with all the toys and everything else that we've put together for when our grandchildren visit,\" said Mr Armitage, adding \"It still seems quite a complicated process.\"\"Because we both worked in education with vulnerable young people, we understand about all the checks that need to be in place and we're quite happy with that,\" he added."}