{"author":"","title":"Hemsby erosion: Clifftop homeowner faces race against time","news_category":"general","content":"A clifftop homeowner is facing a race against time to move his bungalow inland before it is demolished.Lance Martin has seen erosion on the coastline at Hemsby, Norfolk, destroy other homes <https:\/\/www.bbc.co.uk\/news\/uk-england-norfolk-64938849> and wash away part of an access road.He has booked heavy lifting equipment to move his home before a demolition order is enforced by the council.\"I am determined to move my house - that's my be-all-and-end-all of being here,\" he said.The coastal stretch at The Marrams has been battered by storm surges and spring tides during the course of the last 14 days.A 2,000-tonne consignment of granite is due to be installed as a revetment defence on the shoreline in the next few days.A meeting will be held in Hemsby on Friday for locals to have their say about how to save the vulnerable coastline.Demolition work by Great Yarmouth Borough Council is taking place on the north side of Hemsby Gap, a break in the dunes used by lifeboat crews to access the beach.Three homes on the clifftop were demolished at the weekend, with two more homeowners servedSection 77 notices <https:\/\/www.legislation.gov.uk\/ukpga\/1984\/55\/section\/77> by the authority on Monday.Mr Martin, whose home is on the south side of the gap, wants to try to save his \"dream home\" home of six years by dragging it further inland, back from the cliff edge.However, he said he accepted the public safety role of the council and if his house had to be demolished, he admitted \"that's life\".\"It's not just about me, it's about public safety and the environment,\" he said.\"I'm not losing hope at all. There's been a few setbacks, it's just the way the coast is around here, the sea has taken over everything and the wind behind it.\"I understand where the council are coming from, they have public health and safety and the environment to think about.\"Another homeowner, Sue, who did not want to give her surname, saw her home demolished on Saturday.She said her home was a \"real sanctuary\" with a \"lovely atmosphere and energy about it\", and its loss was \"amazingly fast\".\"When you start to think you have no home to come back to, there's actually nothing here whatsoever, that's quite difficult,\" she told the BBC.The council said the arrival of rock, sourced from an old airfield at Hopton, will act as a defence from further damage by the tides.Council leader, Carl Smith, said Mr Martin's home was \"on the brink\".\"It is a race against time,\" he said. \"Things have changed so dramatically over the last 14 days and we're expecting more next week as well.\"That's why it's important to get the rock in place here to save this road, to protect these nine or so houses that would be really affected within the next seven days.\"It's really important this work is carried out as swiftly as we can to protect lives and access to these people up here.\"Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}