{"author":"By Phil Shepka & Jon Ironmonger","title":"Whittlesey care home residents died weeks after fears voiced in family meeting","news_category":"general","content":"Three residents died weeks after a meeting with a care home in which loved ones raised concerns, relatives said.George Lowlett, Margaret Canham, and David Poole, died in 2019, having been residents at The Elms in Whittlesey, Cambridgeshire.Mr Poole's widow, Jeanne, said their families had all \"objected to the poor care\" at the meeting.The home said many of the \"allegations currently being made do not reflect the care that was provided\".The three deaths are all subject to forthcoming inquests.The HC-One-run home, which accommodates up to 37 people, is currently rated by the Care Quality Commission as requiring improvement.The three - and another resident who recovered - were all in hospital at the same time.Since their deaths, the bereaved families have sought answers through medical records andSubject Access Requests <https:\/\/ico.org.uk\/your-data-matters\/your-right-to-get-copies-of-your-data\/>.Mrs Poole said: \"My instinct was telling me that something was very seriously wrong; it had to be.\"It was really incomprehensible for such a small home that four residents were all in hospital on the same day.\"Her husband, 74, had Parkinson's disease and his widow said Cambridgeshire social services arranged a place for him at The Elms in September 2018.Mrs Poole said she believed carers there \"didn't really understand how to meet his needs\" and that there was no care plan in place for four weeks.She claimed he was not \"given his prescribed medication as he should have been\" and, in December 2018, made a formal complaint.In February 2019, she met with staff from the home and her social worker.\"I was told at that point that, if I didn't stop making complaints, David would be evicted from the home,\" she said.\"A couple of days after that there was a resident and family meeting at The Elms and it was then that the true feeling and concern of families and the residents that were able to speak for themselves came to light.\"It was not a very pleasant meeting.\"She said less than two weeks later her husband was admitted to hospital and she was told \"he'd only got a 50-50 chance of survival\".\"When I went in to see David, in the opposite bed was a gentleman called George, who was also a resident at The Elms, and his family were with him,\" she said.\"George died later that evening. A day or two after, I saw another relative of an Elms resident in the hospital. That was Margaret's granddaughter. She was on palliative care. She died a few days later.\"Mr Poole left hospital and was taken to another care home but died in March 2019.Mrs Poole said all three of those who died had sepsis, and that their families - alongside that of the fourth woman - \"were probably most vocal in a complaint\" at the meeting with the home.Other incidents at The Elms include:A spokesman for The Elms said it always sought \"to respond to family's feedback and concerns\".\"At the time, all three residents were seen by a GP who confirmed that their illness should continue to be managed in the home. When the condition of each resident did not improve over the next few days, we sought additional medical advice and the individuals were then admitted to the hospital,\" he said.\"At the time, the home and regional management teams were regularly engaging with the families in question, and the family's concerns were investigated. The local authority also independently investigated the concerns at the time.\"We believe many of the allegations currently being made do not reflect the care that was provided, the records or subsequent investigations, or the conversations held at the time.\"All three cases will next be reviewed by the coroner. We continue to engage with all external investigations and will await and act on the coroner's report.\"A Cambridgeshire County Council spokeswoman said it \"undertook a robust review in response to complaints received at the time and instituted specific changes with the provider as a result\".\"We stand ready to further investigate any new information being brought forward by relatives now.\"She added the council would be \"fully cooperating\" with the inquests and said: \"Ultimately, it is important that the inquest is allowed to undertake an independent assessment of what happened.\"Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}