{"author":"","title":"Christopher Alder: Legal action sought over body mix-up","news_category":"general","content":"The sister of a man found in a mortuary 11 years after he was believed to have been buried is planning to take legal action against South Yorkshire Police.Christopher Alder, 37, choked to death in a Hull police custody suite in 1998. An inquest found he died unlawfully.His family discovered the \"traumatic injustice\" in 2011 and the mix-up was investigated by the force.Janet Alder, his sister, said no-one had been held accountable and the inquiry was \"not thorough\".She said she had seen lots of documents relating to South Yorkshire Police's (SYP) investigation that concluded in 2013 <https:\/\/www.bbc.co.uk\/news\/uk-england-humber-24383324>, which she had received via her solicitor but could not disclose the details due to a court order.\"It was excruciatingly painful. I was reading some really awful, awful stuff about my brother's body in the mortuary and things like that.\"I had to put it down for months and then I'd be having nightmares. I was traumatised by what I was reading.\"It's taken so long to make sense of it all and I still don't have any answers as to who swapped the bodies and why it happened.\"It's appalling and shocking.\"Ms Alder said the documents showed there was \"evidence that was missed\" out of SYP's report.\"[The report] was more about how the mortuary was run, something totally irrelevant to what had happened.\"I want some answers to why this investigation didn't divulge who's responsible, why and how it happened.\"I want to get the truth out and make sure this never ever happens to another family ever again.\"Ms Alder is crowdfunding for the legal challenge and has so far raised more than £1,500.On the online fundraising page, she said: \"I do not believe that a thorough investigation was done.\"I believe that those responsible are being deliberately protected and I am determined to challenge this investigation.\"I am determined to get answers and justice for my brother. Justice which has been denied to him up to this day.\"South Yorkshire Police said: \"We are aware of the concerns raised by Mrs Alder and are currently exploring the detail of those concerns.\"Mr Alder, a former paratrooper, choked to death while handcuffed and lying face down and unconscious in a pool of blood in a police station, as a group of officers stood chatting nearby.But no one was held accountable and his sister has campaigned for more than 20 years over his death <https:\/\/www.bbc.co.uk\/news\/uk-england-humber-43581781>.His family believed they had buried him in Hull's Northern Cemetery in 2000, but Mr Alder's body was later found in a mortuary and following an exhumation of his grave in 2012, the body of a 77-year-old woman, Grace Kamara, was discovered in his place.Follow BBC East Yorkshire and Lincolnshire on Facebook <https:\/\/www.facebook.com\/BBCLookNorth\/>, Twitter <https:\/\/twitter.com\/looknorthBBC>, and Instagram <https:\/\/www.instagram.com\/bbclooknorth\/>. Send your story ideas to yorkslincs.news@bbc.co.uk <mailto:yorkslincs.news@bbc.co.uk>."}