{"author":"By Alex Homer","title":"Online casino searches at 'all-time high' during lockdown","news_category":"general","content":"Search interest in online casinos has hit an all-time high in the UK since lockdown began, data show.Google Trends shows gambling has moved online amid the closure of physical gambling venues and cancellation of sports events <https:\/\/www.bbc.co.uk\/sport\/52548523>. Problem gamblers told the BBC lockdown measures were a \"recipe for disaster\".Watchdog the Gambling Commission said there had been a rise in some online gambling, but there was no evidence yet of a rise in problem gambling.Despite an overall drop in gambling <https:\/\/www.bbc.co.uk\/sport\/52143636>, the commission said across the industry there had been an increase in some customers playing online slots, poker, casino gaming and virtual sports.Engaged gamblers are also spending more time or money during lockdown, data show <https:\/\/www.gamblingcommission.gov.uk\/news-action-and-statistics\/News\/gambling-commission-instructs-tighter-measures-to-protect-consumers-during-lockdown>.Anna Hemmings, chief executive of GamCare, a UK charity to help with problem gambling, saidthere was \"a concerning context for people at risk\" <https:\/\/www.bbc.co.uk\/sport\/52243820>.She said \"contributing factors [to gambling problems], such as financial distress, isolation and boredom\" were increasing with Covid-19.The watchdog has given new guidelines <https:\/\/www.gamblingcommission.gov.uk\/news-action-and-statistics\/News\/gambling-commission-instructs-tighter-measures-to-protect-consumers-during-lockdown> to gambling companies to help their customers.\"We are monitoring online operators closely and if we see irresponsible behaviour we will step in immediately, suspending licences if we need to,\" commission chief executive Neil McArthur said.  The BBC spoke to people in recovery from compulsive gambling on condition of anonymity.Steve, who works as a manager and is married, had maxed out his credit cards and had 14 concurrent payday loans to cover his debts before he sought help.\"The access to online gambling on mobile phones during lockdown is a recipe for disaster,\" he said.The gambling industry pledged earlier this month to halt radio and TV advertising during the lockdown but gamblers in recovery have voicedconcerns over exposure to online ads <https:\/\/www.bbc.co.uk\/news\/stories-52506113>. \"I'm certain bonus offers with gambling companies are better than they have ever been,\" Steve said.\"I worry about anyone who is not quite in a problem area but is close, as there are no other distractions.\"Paul has not gambled for two years and four months since joining Gamblers Anonymous.He said it was easy to become a \"concealed gambler\" as the click of a mobile phone button could start the spin of an online roulette wheel while you were sat on the sofa at home.The father-of-two said many people he had met in recovery had previously turned to gambling to improve their mood when they were stressed or anxious.Former landscape gardener Dan accumulated £50,000 in debts in a \"short amount of time\".\"I would be trying to borrow money from friends and family with no real intention of paying it back and you end up being blacklisted by those people without anyone understanding the problem because you become a compulsive liar.\"With this situation at present [lockdown], without the right help, there's going to be a real surge of financial ruin down to gambling.\"If I was left to my own accord, not working, I would have been on it all day on my phone.\"Using credit cards and e-wallets like PayPal, Skrill, and Neteller for gamblingwas banned <https:\/\/www.gamblingcommission.gov.uk\/news-action-and-statistics\/News\/protecting-the-safety-of-consumers-is-at-the-heart-of-todays-credit-card-gambling-ban> in Great Britain from 14 April.GamCare said the ability to use credit cards had exacerbated some people's issues as they chased gambling losses with additional funds they could not afford to repay.More than £16.5m had already been gambled on HSBC UK credit cards since the start of this year, with an average transaction value of £65, the bank said.Since lockdown began, its customers had spent more than £1.6m on gambling transactions.HSBC UK, which has worked with GamCare to train a team to help customers with gambling addictions, said its call centre was currently receiving an average of 1,000 calls a month about gambling.Since 31 March, all online gambling operators in Britain have had to be registered with Gamstop.Gamstop is a free service that allows gamblers to self-exclude from online gambling sites with one registration. They choose a minimum exclusion period of either six months, one year, or five years.There has been a rise since lockdown began in people asking Gamstop for their self-exclusion to be reversed but once registered, the system does not allow them to cancel until the minimum period they originally chose, has expired.In the past 30 days, searches for casinos not on Gamstop however have also increased, according to Google.Gamstop said this was a sign \"in one sense that the new regulatory system was working\".\"However, it is obviously irresponsible for anyone to promote unlicensed websites that are not regulated by the Gambling Commission and consumers are strongly advised not to use them,\" it said.Gamblers Anonymous said it did not remove the temptation by stopping using credit cards when gambling.\"It just makes it a bit more difficult,\" it said. \"If a compulsive gambler wishes to gamble online, they will find a way.\"Steve said systems set up by gambling companies to protect customers were purely \"tick-box exercises\" but \"99% of operators\" were covered by Gamstop.The commission said it had suspended the operating licences of two operators whoinitially failed to sign up to Gamstop <https:\/\/www.gamblingcommission.gov.uk\/news-action-and-statistics\/News\/gambling-commission-suspend-two-operator-licences-for-failure-to-participate-in-gamstop>.Where it saw individuals or companies not licensed in Britain, illegally interacting with British consumers, it said it would act to close them down.It said it expected operators to step in when they saw evidence of gambling-related harm and to carry out checks on people's source of funds.\"We take failures to do this extremely seriously,\" the commission said.If you or someone you know has been affected by addiction, help and support is available atbbc.co.uk\/actionline <https:\/\/www.bbc.co.uk\/actionline>.The Shared Data Unit makes data journalism available to news organisations across the media industry, as part of a partnership between the BBC and the News Media Association.For more information on methodology, click here <https:\/\/docs.google.com\/document\/d\/1n-Ymy3ymz674T4aaoof8fw50oCedwLnjCzzUDEvgrME\/edit?usp=sharing>. For the full dataset,click here <https:\/\/docs.google.com\/spreadsheets\/d\/1jli-f-XOvKcXuh3yzzdeEv5vA0L7cpbr_qNx9EBgxLY\/edit?usp=sharing>. Read more about theLocal News Partnerships here <https:\/\/www.bbc.co.uk\/lnp\/>."}