{"author":"By Liam O'Donoghue","title":"Ukraine war guns likely to end up on UK streets, says weapons expert","news_category":"general","content":"The war in Ukraine is likely to fuel gun crime on the streets of Merseyside for many years, a firearms expert said.Paul James set up the National Ballistics Intelligence Service, <https:\/\/www.nabis.police.uk\/> which uses sophisticated analysis to identify and track weapons used by criminals.Mr James said the Balkans conflict had been the main source of guns being trafficked into Europe since the 1990s.Guns held by civilians in Ukraine could also end up in the UK, he said, warning of a \"time bomb waiting to explode\".Mr James said millions of weapons could circulate when the Ukraine war ends, with many ending up in the hands of criminal gangs.\"From experience, over the last 15 to 20 years, the guns from the Western Balkans have been the main source of firearms trafficked into Europe,\" he toldBBC North West Tonight. <https:\/\/www.bbc.co.uk\/programmes\/b006pfjx>\"They have been used in a lot of very high-profile crime and terrorist incidents, and we're still trying to reduce the flow of firearms from there. I think the situation in Ukraine is going to be much worse than that.\"Last year there were five gun murders in Liverpool - Sam Rimmer, Ashley Dale, Jacqueline Rutter and Elle Edwards in addition to Olivia Pratt-Korbel,whose killer Thomas Cashman was convicted <https:\/\/www.bbc.co.uk\/news\/uk-england-merseyside-65088182> on Thursday.Mr James said Merseyside had long been a key area for criminals in the North and Midlands seeking to acquire guns. Many of them were leading figures in drug gangs.The weapons were used to \"enable a lot of the organised crime in the Merseyside area\", said Mr James.The National Crime Agency said: \"There is currently no evidence Ukrainian weapons are being sold to criminals but we will closely monitor the threat with our international partners.\"Even without weapons being trafficked from Ukraine, there are still a significant number of guns on the streets.Ch Supt Mark Kameen of Merseyside Police said: \"Handguns are the weapon of choice, but we are now seeing Skorpions coming into the force area.\"These sub-machine guns have a huge rate of fire, they're absolutely deadly.\"Twenty years ago Sicarius McGrath was one of the criminals involved in supplying guns to Merseyside's gangs.He said he ran a lucrative \"gun factory\".Previously deactivated weapons are easy to transform into firearms capable of firing live ammunition, said McGrath, who was most recently released from prison in 2020 and now campaigns against violent crime.He said the process used to take him less than half an hour and \"the profit margin is massive\".\"I don't know how many people were harmed as a result of me putting firearms on the street,\" he said, \"but no doubt people were harmed, and it's something I massively regret\".McGrath believes intense, hard-hitting education programmes would deter young people on the fringes of crime from becoming members of serious organised crime gangs.\"We want them to see the reality of gun crime. We want to take them to gravesides, and we want them to speak to victims' parents, and show them not just the injuries sustained, but the ripple effects it has upon families, the effects it has upon the children who have to go and see their fathers in prisons for 30 years.\"McGrath warned of \"a new breed of criminal\" who are \"reckless, fearless, and have a strong appetite for violence\".He said urgent action was needed because \"otherwise many more innocent victims will die as a result of gun crime\".Why not follow BBC North West on Facebook <https:\/\/en-gb.facebook.com\/BBCNW\/>, Twitter <https:\/\/twitter.com\/BBCNWT> and Instagram <https:\/\/www.instagram.com\/bbcnorthwest\/>? You can also send story ideas to northwest.newsonline@bbc.co.uk"}