{"author":"By Ross Hawkins","title":"Housing benefit cuts: Who loses out?","news_category":"general","content":"Politicians making savings know for every cut they make they will have to argue not just that it is prudent, but that it is fair.So it is hardly surprising policy changes that will affect more than 750,000 households are being scrutinised for fairness.The prime minister says it is unfair housing benefit claimants can live in properties other workers could only dream of.His opponents argue - in the strongest terms - the policies are profoundly unfair. Labour frontbencher Chris Bryant said they would lead to the \"cleansing\" of the poor from expensive areas.A government impact assessment provides plenty of numbers over which both sides of the debate can argue.It shows the restriction of Local Housing Allowances - which are currently based on the median rent in an area - to the 30th percentile of private rents will affect 774,970 households across the UK, who will lose an average of £9 a week.New limits on the amount paid according to the size of a property, including a cap of £400 a week on a four bedroom house, will affect fewer households more dramatically. A total of 21,060 will lose on average £74 per week.The percentage of privately rented properties available to housing benefit claimants in central London will fall from more than 50% to just 7%.That impact will be felt most keenly in expensive inner city areas, but some MPs in the suburbs are said to be anxious about the impact of a possible influx of would-be residents.Labour MPs are keen to point out this is not just a discussion about the unemployed. There are 680,000 working households claiming housing benefit, 14% of the total housing benefit caseload.And yet there is one rather straightforward number the government would have us bear in mind considering all this.Housing benefit payments cost the taxpayer around £20bn a year. As housing minister Grant Shapps pointed out to a Parliamentary committee recently, that is roughly equivalent to the police and the whole of the universities' budgets put together.Work and pensions secretary Iain Duncan Smith has described the total, and the speed at which it has risen, as absurd. The government's opponents blame rising rents for the housing benefit bill.But the Treasury expects changes announced in the budget and the spending review to trim almost £2bn a year from the bill by 2014, and it is substantial savings like that the government says are necessary to deal with the deficit."}