{"author":"By Elen Wyn and Geraint Thomas ","title":"Ukraine War: Granddaughter, daughter and dog rescued","news_category":"general","content":"This video can not be playedUkraine War: Granddaughter and daughter rescuedTwelve-year-old Albina was wearing her Minnie Mouse pyjamas when she was reunited with her family at Ukraine's border with Slovakia.Her mother was with her, but she had to leave her father behind.Gareth Roberts and his wife Nataliia, Albina's grandmother, were in Wales when Russia invaded Ukraine.After seeing reports of fighting near their home, they flew to Slovakia before driving to the border to rescue the family members they could.Gareth, 73 and Nataliia, 64, were immediately concerned about the safety of Nataliia's daughter Angelina, her 12-year-old granddaughter Albina and son-in-law Vova.The couple knew their son-in-law would not be allowed to leave, but wanted to bring Angelina and Albina back home to Wales to safety.Gareth and Nataliia travelled almost 1,500 miles (2400 km) from their home near Trawsfynydd, in Gwynedd, to the Slovakia-Ukraine border.In Ukraine, Angelina and Albina packed everything they could in to the family car, including their dog Giina, and left their family home last week, heading for the Slovakian border village of Vysne Nemeck.At the border Gareth and Nataliia searched the faces of each passer-by, hoping to find their loved ones.\"Nataliia and I are really happy that we have arrived at the border,\" said Gareth, draped in a Welsh flag, his wife with a Ukrainian flag around her shoulders.\"And we know that Angelina and Albina are here as well, which has raised our spirits.\"Suddenly, Angelina and Albina are spotted - and the four are reunited. \"You're safe now,\" said Gareth as they embrace. \"We'll look after you now.\" Albina tells her grandparents about her escape, and how her father helped pack the car and how he was left behind to defend his hometown.\"We are looking forward to getting back to Wales,\" said Gareth, \"but we are also looking forward to the return to Ukraine, but it could be months before we can do that.\"We do hope things settle, we are keen to see our son-in-law again.\"Having been fed by one of the charities based in the village, Gareth Roberts talks of his admiration for the volunteers, many from the UK, who travelled here to help.\"There are people dressed as clowns here entertaining the little children\", he said.\"But it is getting cold here, and I think it will be many degrees below zero tonight and there are thousands [here].\"You do wonder where all of them are going to sleep.\"Gareth describes his admiration for their 12-year-old granddaughter: \"I am so glad to see her, she's grown.\"She has got such a strong personality. 'I am positive', she says, 'all this is the fault of a silly man in Russia.'\"The next challenge is to return to Wales. The visa requirements are being relaxed so Ukrainians with passports and family in the UK can complete the Biometric stage of the application process at home, rather than wait for an interview in Europe.Tonight this Welsh-Ukrainian family are reunited.But the relief and happiness is bitter-sweet - there is no certainty they will see the loved ones they left behind again."}