{"author":"","title":"Wales to get extra cash from new NHS and social care tax","news_category":"general","content":"Wales will receive extra cash for health and social care services from a new tax, under UK government plans.Ministers in Cardiff will receive £700m a year more to spend by 2024-25. Prime Minister Boris Johnson called the cash a \"union dividend\" as he unveiled plans toreform the social care system <https:\/\/www.bbc.co.uk\/news\/uk-politics-58469872> in England.But the Welsh government said the announcement was severely lacking in detail.The prime minister announced he would raise National Insurance (NI) - a UK-wide tax on earners - by 1.25 percentage points, meaning someone earning £30,000 a year would pay an additional £255.From 2023, the increase will become a separate tax on earned income, with the cash it generates ringfenced.There are long-standing calls for reform of social care in Wales, as costs steadily increase.Mr Johnson announced a cap on the cost of care in England, but it will be up to the Welsh government to decide if it wants to do something similar.The service is partially funded through the money the Welsh government receives from the UK Treasury.However, those who receive care often have to pay a contribution, according to how much income and assets they have.Plaid Cymru said the plan to raise NI was unfair.Under the prime minister's plans no-one in England would have to pay more than £86,000 for care across their lifetime.Anyone in the country who has assets below £20,000 will have their care costs fully covered by the state. Those with assets between £20,000 and £100,000 will also get means-tested state support.Mr Johnson said the devolved nations would altogether get an extra £2.2bn a year, 15% more than what they would raise through the levy.The Institute for Fiscal Studies said this reflected that earnings in the devolved nations - Wales, Scotland and Northern Ireland - were lower than England.Wales already receives £1.2bn from NI - the announcement means this will increase.Social care costs for older people in Wales are expected to rise over the coming years.Costs stood at £586m in 2017-18, and are expected to rise to £723m by 2022-23.The overall Welsh health and social care budget meanwhile stands at £8.49bn.Under the current system, people in Wales have to pay a maximum of £100 a week for non-residential care if they have a high level of disposable income, and if they have savings and investments over £24,000.If they have capital over £50,000 they have to pay the full cost of residential care - under that amount councils will help to pay, according to income.At the Welsh Parliament election in May, Welsh Labour said it would pursue a UK-wide solution for social care so it was \"free for all at the point of need\" but held off providing its own solution, saying it would wait and see the UK government's plans.Taxes on dividends from shares will also rise by 1.25% as part of the UK government's proposals.Timothy Williams's mother has been in a care home in Newport since March 2020 - he said they are spending their savings to pay for it and are in the process of selling her house.\"We are rocketing through mam's savings,\" he said. \"Both my parents worked all their lives. If they hadn't, the council would pay the fees. It makes my blood boil.\"\"I've been in touch with the county council and they won't do anything until her funds get down to £50,000.\"Even then, the council will only make up a part of the payments, the family will have to make up the rest.\"The prices that homes charge when their residents have a bit of cash and a house is diabolical.\"Any assistance that government can give can only be good. But the level of funding that is needed, the chunk of the payments will still fall on the families.\"Following the announcement Mr Johnson invited Wales' First Minister Mark Drakeford and colleagues in Scotland and Northern Ireland to a meeting next month.\"We now face together the shared challenge of recovery, above all for our economy and our public services,\" he wrote.On Monday evening it was announced the Welsh government would get an extra £320m in 2021-22 from £5.45bn extra for the NHS in England.Mario Kreft, chairman of Care Forum Wales, which represents care providers, said the money gave a \"once-in-a-generation\" opportunity to fix Wales' \"broken\" social care system.\"What we have now is an opportunity to sort out social care, which is incredibly important for so many reasons, including the fact that it underpins the NHS,\" he said.Plaid Cymru MP Ben Lake said the decision to use NI was a \"deeply unfair and regressive method of raising funds, disproportionately impacting young people, businesses and those on the lowest income.\"The Welsh government said: \"We have set out ambitious plans for social care in this term, including paying social care staff a real living wage and offered to work with the UK government on this very important agenda.\"While we support action at UK level to provide much-needed additional and long-term funding for social care, today's announcement by the prime minister is severely lacking in detail.\"Welsh ministers now face a big question on what their answer is to the pressures and costs faced by social care services, now the UK government has given its own.That question went unanswered on Tuesday and the Welsh Labour government's response to the prime minister was critical but muted.Meanwhile, Boris Johnson's comments that he would direct the new cash to be spent on health and social care in Wales, Scotland and Northern Ireland, raised its own queries.BBC Wales was briefed at the time that the cash would be legally ringfenced, but commentators cast doubt on whether that would mean a lot in practice.David Phillips of the IFS suggested that even if the new money is legally restricted, the devolved governments' control of the rest of their budgets mean they could shift other parts of it elsewhere, should they choose to.And officials at the Welsh end of the M4 stress that nothing has changed in terms of how their funding works, and the Welsh government already gets cash from National Insurance.Also, part of the £700m does not arise from the National Insurance increase and comes from elsewhere, so, technically, Welsh ministers could spend that how they like, as they usually are allowed to do when their budget increases."}