{"author":"By Marianna Spring","title":"How Elon Musk's tweets unleashed a wave of hate","news_category":"general","content":"I had just finished my investigation into whether Twitter can protect users under Elon Musk's ownership, when - to my surprise - the man himself tweeted about it.\"Sorry for turning Twitter from nurturing paradise into a place that has… trolls,\" he said in one tweet, posting a screengrab of the report.According to Twitter's own data, that tweet was seen by more than 30 million profiles.\"Trolls are kinda fun,\" Mr Musk said in another reply, in his response to my BBC investigation -Twitter insiders: We can't protect users from trolling under Musk <https:\/\/www.bbc.co.uk\/news\/technology-64804007>.The investigation made clear Twitter was never perfect. But it had exposed how hate is thriving under Twitter's new owner. Current and former Twitter employees told me \"nobody is taking care of\" features designed to protect users from hate and harm.I had approached Elon Musk as part of my Panorama investigation, but he didn't respond.Instead, he decided to share his reaction to it afterwards with more than 130 million followers on his social media site.His tweets then unleashed a torrent of abuse against me from other users <https:\/\/www.bbc.co.uk\/iplayer\/episode\/p0f9y7hm#xtor=CS8-1000-%5BEditorialPromo_Box%5D-%5BNewsEditorial_Promo%5D-%5BNewsEditorial_Promo%5D-%5BPS_IPLAYER~N~p0f9y7hm~P_BTSMS%5D>.There have been hundreds of posts, many including misogynistic slurs and abusive language. There have also been threatening messages, including depictions of kidnap and hanging.Mr Musk posted again, responding to one tweet that was critical of the BBC investigation. He wrote \"roflmao\" - \"rolling on the floor laughing my ass off.\"I now found myself wading through more hateful messages sent from accounts predominantly based in the US and UK. Mr Musk's tweets triggered a huge volume of hate, some sent from accounts which had previously been suspended.More proof to back up BBC Panorama's investigation - that hate on Twitter is thriving.The majority of hateful messages were directed at me. Abuse on Twitter is nothing new for me. After all, I'm a reporter who shares my coverage of disinformation, conspiracies and hate there.For my initial investigation, a team from the International Center for Journalists and the University of Sheffield tracked the hate I had received and revealed it had tripled since Elon Musk's takeover, compared to the same period the previous year.Behind The Stories <https:\/\/www.bbc.co.uk\/iplayer\/episode\/p0f9y7hm#xtor=CS8-1000-%5BEditorialPromo_Box%5D-%5BNewsEditorial_Promo%5D-%5BNewsEditorial_Promo%5D-%5BPS_IPLAYER~N~p0f9y7hm~P_BTSMS%5D>Disinformation Correspondent Marianna Spring talks about reporting on trolls, online abuse and Elon Musk.Watch on BBC iPlayer now (UK Only) <https:\/\/www.bbc.co.uk\/iplayer\/episode\/p0f9y7hm#xtor=CS8-1000-%5BEditorialPromo_Box%5D-%5BNewsEditorial_Promo%5D-%5BNewsEditorial_Promo%5D-%5BPS_IPLAYER~N~p0f9y7hm~P_BTSMS%5D>Elon Musk's Twitter StormMarianna Spring investigates how Elon Musk's ownership is transforming one of the world's most influential social media platforms.Watch Elon Musk's Twitter Storm on BBC iPlayer (UK Only) <https:\/\/www.bbc.co.uk\/iplayer\/episode\/m001jwb5\/panorama-elon-musks-twitter-storm#xtor=CS8-1000-%5BEditorialPromo_Box%5D-%5BNewsEditorial_Promo%5D-%5BNewsEditorial_Promo%5D-%5BPS_IPLAYER~N~m001jwb5~P_ElonMuskPanoMS%5D>In the wake of Mr Musk's tweets about me, the International Center for Journalists and the University of Sheffield confirmed that the hate had increased again - to the highest levels in the past year.And the tools the team used could not even pick up all the abuse. Some of it didn't use my name directly or was in response to Mr Musk's original tweet, which attracted more than 14,000 replies.Others were private messages - which included a video of a woman being tied up and held at gunpoint, and another showing hangings. There were also some which included talking about my time ending \"in a horrible way\" and wanting me to \"burn in hell\".Many combined misogynistic slurs with abusive and sexualised language. I was repeatedly called a bitch and much nastier insults. Most of the messages were received on Twitter, with a small number sent to me on other sites following Mr Musk's tweets.During my original investigation, I had looked into profiles sending out abuse on Twitter. Many had become more active on the social media site since Elon Musk decided to restore thousands of suspended accounts.This time, I looked into the accounts sending me abuse. Many of the accounts had become more active since the takeover, and several openly rejoiced how their profiles had returned since Mr Musk bought the platform.Some were prominent conspiracy theorists brought back by Mr Musk. Several had the new paid-for blue \"verified\" ticks.Whenever I've been on the receiving end of a deluge of hate in the past year, I've used social media features to protect myself. This time around, those tools on Twitter didn't appear to be working the same way.Safety mode, which automatically blocks abusive accounts, was blocking some accounts sharing hate - but it was also, in error, blocking users who were posting supportively.This matches up with what current and former employees at Twitter told me about how features - like the \"harmful reply nudge\", intended to protect Twitter users from trolling and harassment - are proving difficult to maintain and are working inconsistently.At least half of Twitter's workforce have been sacked or chosen to leave since Mr Musk bought it.When I went back to those insiders to ask what they thought about the new wave of online abuse, several said it further confirmed concerns they had raised about Twitter under Mr Musk.I have approached Elon Musk and Twitter several times to ask about his vision for the social media site. I've been in touch with both Twitter and Mr Musk again to seek their response to the additional spike in hate I've received since his tweets. They have not responded.Since then, the email account for the Twitter press office now automatically sends out poo emojis in response to requests. Twitter policies, which are publicly available online, say that \"defending and respecting the user's voice\" remains one of its \"core values\".This latest episode raises questions about what freedom of expression really means on the new Twitter, where trolling seems to be fair game and even journalists looking to hold the social media platform to account become the targets."}