{"author":"","title":"Charles Bronson: Who is he and why is he in prison?","news_category":"general","content":"Charles Bronson, one of the UK's longest serving prisoners, has lost his bid to be freed from jail. A public parole hearing took place earlier this month, and the board decided the 70-year-old was not suitable for release. So who is Bronson and why has he been in prison for so long?The notorious prisoner was born in Luton, Bedfordshire, in December 1952 as Michael Peterson.He was convicted of armed robbery in 1974 and has earned a reputation as a violent and dangerous inmate, which has led to him spending most of his life behind bars.The former bare-knuckle boxer changed his name to the widely-known Charles Bronson during a brief spell of freedom in the 1980s, but he now uses the name Charles Salvador.He chose the surname not because of his fondness for art and surrealist Salvador Dali, but because it means \"man of peace\" in Spanish - though a more usual translation is \"saviour\".While in prison, Bronson has created a number of artworks and many have been sold, with some proceeds donated to charity.In 2014, a sale of 200 of his pieces raised more than £30,000 at auction <https:\/\/www.bbc.co.uk\/news\/uk-england-northamptonshire-29570513>. His works in total haveraised about £100,000 <https:\/\/www.bbc.co.uk\/news\/uk-england-beds-bucks-herts-64888459>, his parole hearing was told.He has had several books published, including ones about his prison fitness regime and his time atBroadmoor Hospital <https:\/\/www.bbc.co.uk\/news\/uk-england-berkshire-50802058>.A film starring Tom Hardy, released in 2009, also dramatised Bronson's time as an inmate.Bronson was first jailed aged 22 in 1974 for armed robbery and wounding.Since then he has only had brief spells outside and he is currently being held at a specialist close supervision centre at Woodhill Prison in Milton Keynes.Over the years he has become notorious for attacks on prison staff and other inmates.In 1975 he attacked a fellow prisoner with a glass jug and in 1985 he carried out a three-day rooftop protest.In 1994, Bronson held a prison librarian hostage and demanded an inflatable doll, a helicopter and a cup of tea as ransom.Four years later, he took three inmates hostage at Belmarsh Prison in London.Then 12 months on, he took a prison education worker hostage for 44 hours at HMP Hull and was sentenced to a discretionary life term, with a minimum of four years.He received a further two-year jail term in 2014 for holding a prison governor in a headlock at HMP Woodhill.In 2017 he was refused parole <https:\/\/www.bbc.co.uk\/news\/uk-england-beds-bucks-herts-42071674> while an inmate at HMP Wakefield in West Yorkshire.A year later, he was cleared of trying to seriously harm a prison governor <https:\/\/www.bbc.co.uk\/news\/uk-england-leeds-46227773>.During his trial, Bronson admitted he had been a \"very nasty man\" in the past, as he described to the jury how during his time in prison he had held 11 hostages in nine different sieges - including governors, doctors, staff and, on one occasion, his solicitor.Speaking at the latest parole hearing about his incidents in prison, Bronson said: \"I love a rumble. What man doesn't?\"It heard about a time he took half a tub of Lurpak and greased up his naked body to face prison guards in his cell.In 2020 Bronson won a court case arguing for a public parole hearing <https:\/\/www.bbc.co.uk\/news\/uk-england-beds-bucks-herts-63571514> and in 2022, rules were changed to allow such hearings to take place.His evidence was eventually heard at the Royal Courts of Justice in London on 6 March <https:\/\/www.bbc.co.uk\/news\/uk-england-beds-bucks-herts-64861518> and 8 March <https:\/\/www.bbc.co.uk\/news\/uk-england-beds-bucks-herts-64888459>.The hearing was told Bronson spent 23 hours a day in his cell and that he would not cope with being released.He told the panel: \"Of the 50 years I have been in prison I have probably deserved a good 35 of it.\"Because I have been very naughty. Not naughty-naughty but just naughty.\"He was described at the hearing as a \"retired prison activist\" and an independent psychologist, hired by Bronson's legal team, said he had signs of post traumatic stress disorder (PTSD), partly due to \"brutal and unacceptable treatment\" while in prison.Bronson's prison offender manager said his ability to control his emotions had improved and he had fewer outbursts.\"There's been no violence. There has been some flexibility with his thinking and willingness to engage,\" she said.The psychologist told the hearing Bronson might be safer in a less restrictive environment, suggesting a prison with \"open\" conditions might be the perfect place for him.Speaking of what he would like to do, if released, Bronson said: \"I dream of walking on grass, you know.\"I'd like to go to see art shows; I'd like to go swimming.\"He continued: \"Give me a chance, a break, to prove to you people that I am just a normal geezer wanting to get on with his life.\"In a document detailing its decision, the Parole Board said: \"After considering the circumstances of his offending, the progress that Mr Salvador has made while in custody and the evidence presented at the hearings, the panel was not satisfied that Mr Salvador was suitable for release.\"Nor did the panel recommend to the Secretary of State that he should be transferred to an open prison.\"The panel acknowledged Bronson \"genuinely wants to progress\" and that \"there was evidence of improved self-control and better emotional management\", but it said it was not satisfied he had \"the skills to manage his risk of future violence until he has been extensively tested outside of his current highly restricted environment\".It said that psychologists instructed by Bronson's team were \"unequivocal\" that he \"no longer requires the secure placement in his current prison\".The panel added that \"evidence supported such a move within a closed prison\".Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}