{"author":"By Heather Chen","title":"New Zealand's 'first cat' and other political pets","news_category":"general","content":"Cat lovers will be thrilled to know that New Zealand's new prime minister is one of their own.Meet \"First Cat\" Paddles, the beloved pet now serving as right paw feline to Jacinda Ardern, the country's newly-elected andyoungest-ever leader for 150 years <http:\/\/www.bbc.co.uk\/news\/world-asia-41675801>. Ms Ardern, who leads the Labour Party, has risen through the ranks of left-wing politics since entering parliament in 2008 at the age of 28.Paddles, Ms Ardern's special kitty that claims to have opposable thumbs, made her Twitter debut on 21 October, with the account@FirstCatofNZ <https:\/\/twitter.com\/FirstCatofNZ>.Although it is not clear who is behind the account, the cat has nonetheless been met with a warm welcome from supporters as well as animal-lovers on Twitter.\"Paddles is First Cat <https:\/\/twitter.com\/LWPurpose\/status\/920908779817799680> and Clarke Gayford is First Man. This is amazing,\" gushed one Twitter user, referring to Ms Ardern's partner.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.\"I, for one, welcome our polydactyl feline overlords,\" said another in response <https:\/\/twitter.com\/eSocSci\/status\/922612687644770305> to Paddle's introductory tweet.\"I love this photo! No wonder your mummy won,\" tweeted Amanda Hunt <https:\/\/twitter.com\/tuihunt\/status\/923281825413283842>. This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.While many rushed forward to introduce their pets <https:\/\/twitter.com\/FirstCatofNZ\/status\/921638253614178304>, other political feline counterparts also came forward, including chief mouser Larry, of 10 Downing Street fame in the UK.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.His fellow Westminster cat Evie <https:\/\/twitter.com\/HMCabinetCat\/status\/922738829525741568> also said hello: \"Welcome to the Twittersphere, Paddles! Have fun.\"Ms Ardern has told local media she has \"no idea\" who created the account, but added that she enjoyed the tweets.\"Keeping in mind Paddles has thumbs, I can't put it past her it's her own account as well,\" she joked, adding \"she's a polydactyl\".Polydactyl cats have more than the normal number of claws - which makes them look like they have opposable thumbs.Paddles joins the political ranks of other presidential cats around the region.Malaysia's Najib Razak is another known cat lover. He has four long-haired felines <https:\/\/www.instagram.com\/p\/BMIDDMRgTXS\/> which proudly roam his official residence.They are: Leo, Kiki, Tiger and Simba, all furry, pedigreed and very photogenic.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Pure-bred animals will always sit well among many. But over in Taiwan and South Korea, animal activists have lavished praise on leaders Tsai Ing-wen and Moon Jae-in, for choosing to adopt rescued animals instead of buying pets.Taiwanese leader Tsai's love for cats is well documented. The 59-year-old, who won a landslide victory in 2016 to become the island's first female president, has two adopted cats of her own named Think Think (a grey tabby taken in after a typhoon) and Ah Tsai (a farm cat and gift during the presidential election).While Ms Tsai has also taken in three retired guide dogs, both her cats have hada longer following <https:\/\/en.wikipedia.org\/wiki\/Think_Think_and_Ah_Tsai> among supporters, who regularly look forward to comic appearances from the adorable duo.To many South Koreans, their new president Moon Jae-in came as a breath of fresh air. Especially withhis choice of presidential animals, which has inspired fan art <https:\/\/www.instagram.com\/p\/BQZ7k-DDTKp\/?taken-by=moonjaein>. For starters, all of his pets were from shelters. A stark contrast with his disgraced predecessor Park Geun-hye, who ownednine pedigree Jindo dogs <http:\/\/www.bbc.co.uk\/news\/world-asia-39275886> but was accused of abandoning them when a widespread political corruption scandal uprooted her from office.Making good on one of his election promises, Mr Moon challenged a local taboo that has led to discrimination against black dogs, by adopting one from an animal sanctuary.He named the black mongrel Tory, and the move was hailed as supporting animal rights in South Korea.The lucky pooch joins the president's two other pets - a dog called \"Maru\" and a former shelter cat named \"Jjing-jjing\"."}