{"author":"","title":"Cafe bomb in St Petersburg kills military blogger","news_category":"general","content":"An explosion in a St Petersburg cafe has killed prominent Russian military blogger Vladlen Tatarsky, Russia's Interior Ministry has confirmed.At least 19 people were injured in the bomb blast at Street Food Bar No 1.Videos posted on social media show an explosion and injured people on the street. It is not clear who was responsible for the blast.Vladlen Tatarsky (real name Maxim Fomin) was a vocal supporter of Russia's war in Ukraine.He was a guest speaker at an event hosted by the cafe when the bomb went off.He had reported from the Ukraine frontline and gained particular notoriety last year after posting a video filmed inside the Kremlin in which he said \"We will defeat everyone, we will kill everyone, we will rob everyone as necessary. Just as we like it.\"The occasion for that was a Kremlin ceremony hosted by President Vladimir Putin, who proclaimed Russia's annexation of four partly-occupied regions of Ukraine. That land grab was internationally condemned. St Petersburg is President Putin's home city, where he first rose to prominence.Interior Ministry sources quoted by Russia's RIA news agency said a bomb was hidden in a statue presented to Tatarsky in a box as a gift.The cafe targeted on Sunday was previously owned by Yevgeny Prigozhin, the head of Russia's notorious Wagner mercenary group, the St Petersburg news site Fontanka reports.Tatarsky's following on Telegram numbers more than 500,000. He and other military bloggers have criticised aspects of the Russian campaign in Ukraine.A group called Cyber Front Z, calling itself \"Russia's information troops\" on Telegram, said it had hired out the cafe for the evening.\"There was a terrorist attack. We took certain security measures but unfortunately they were not enough,\" its post on Telegram said. \"Condolences to everyone who knew the excellent war correspondent and our friend Vladlen Tatarsky,\" it said."}