{"author":"By Steffan Powell","title":"E3 2021: Forza Horizon 5 - is bigger also better?","news_category":"general","content":"From the rolling hills and thatched roofs of the Cotswolds <https:\/\/www.bbc.co.uk\/news\/av\/newsbeat-45672370> to the searing heat of Mexico.The Forza Horizon franchise has found its new home and it promises to be its biggest yet.Mike Brown, creative director of the series, tells Newsbeat that was the aim from the start of the project.\"If you make a bigger world it gives players so much more to go and discover,\" he explains.Forza Horizon 5 was announced at Microsoft's 2021 E3 showcase and will be playable for PC and Xbox gamers in November this year.Speaking to Newsbeat ahead of the announcement, Mike explains why size was important for the team: \"We see the way that our players play.\"The way they interact with the game sees them spending time just exploring these worlds we've built.\"With fans spending their time racing around every corner of the maps built by Mike and his team, he says they were keen to utilise the power of the latest generation of consoles to give them more to see.Games that allow you to explore open worlds at your leisure, like Forza Horizon, have grownmassively in scope recently <https:\/\/screenrant.com\/biggest-open-world-video-games-ranked-size\/> as consoles have become more powerful.However, not all fans have enjoyed the growth.Console games like Ghost of Tshushima, <https:\/\/metro.co.uk\/2020\/08\/29\/open-world-games-are-big-need-smaller-13193834\/>Assassin's Creed <https:\/\/www.thegamer.com\/assassins-creed-valhalla-is-big-almost-too-big-but-its-unique-structure-makes-it-manageable\/>and others likeFallout 76 <https:\/\/www.gameskinny.com\/8hr4y\/in-defense-of-smaller-world-maps-bigger-isnt-necessarily-better> have frustrated some, for having massive maps to explore that they claim are too big.Often the criticism is they can feel empty or repetitive, trying to make up for a lack of depth of content - with sheer size.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Forza is unique compared to these titles because it's a racing game with an emphasis on multiplayer action. Mike says it's one of the reasons Mexico was chosen as the new setting.\"You don't get that far down the path of trying to make a big world for players before realising there's no point making it - if it's just going to have more of the same.\"We need diversity in our game and Mexico is almost like the whole world in one country.\"It's got snowy mountains, volcanoes, epic canyons and beautiful historic cities - it also has farmland, deserts and jungles.\"And so when asked if bigger is always better, Mike replies: \"I think so. \"When we look at how people play horizon, they explore the open world and they hang out with their friends.\"The bigger space they can hang out, the more they can explore - I do think that a bigger horizon game will be more fun for people.\"With such an emphasis on playing together, more companies like Forza Horizon developer, Playground Games, are coming up with ways for making sure online interactions are not toxic.\"A goal that we have is that every interaction you have with another person should be at least neutral but ideally positive,\" says Mike.\"We do a lot to try and try and get in the mind of a troll, to see how people interact with each other.\"We've developed some features that use artificial intelligence to link you with others - and because it knows about the players, it's able to suggest gameplay based on the things it is confident you're going to want to do together.\"Mike says that many of their game modes don't have negative outcomes and these positive experiences, alongside the new AI technology, will help create a \"friendly, accessible and inclusive online space.\"Players will get to find out in November how much of an impact these new features will make.It's also when Mike and the team will get to see if players agree that bigger really does mean better in gaming.For more gaming content head to Press X To Continue on BBC Sounds. <https:\/\/www.bbc.co.uk\/sounds\/search?q=press+x>"}