{"author":"","title":"Gambling on credit cards to be banned","news_category":"general","content":"People are to be banned from using credit cards to place bets, in an attempt to curb problem gambling, the Gambling Commission has said.The ban, which starts on 14 April, comes after reviews of the industry by the commission and the government.A total of 24 million adults in Britain gamble, with 10.5 million of those doing so online.Separate commission research shows that 22% of online gamblers using credit cards are classed as problem gamblers.Neil McArthur, Gambling Commission chief executive, said: \"Credit card gambling can lead to significant financial harm. The ban that we have announced today should minimise the risks of harm to consumers from gambling with money they do not have.\"We also know that there are examples of consumers who have accumulated tens of thousands of pounds of debt through gambling because of credit card availability.\"There is also evidence that the fees charged by credit cards can exacerbate the situation because the consumer can try to chase losses to a greater extent.\"Culture Minister Helen Whately said: \"Whilst millions gamble responsibly, I have also met people whose lives have been turned upside down by gambling addiction.\"There is clear evidence of harm from consumers betting with money they do not have, so it is absolutely right that we act decisively to protect them.\"One problem gambler, Chris Murphy, told the BBC that he's lost more than £100,000.He's been trying to stop for more than 10 years, but says being able to gamble on a credit card made it easy have re-lapses.\"There have been times when I've been gambling-free for months, and then borrowed some money from say a payday loan site or a credit card, and woke up the next day having lost all my money and created a few thousand pound worth of debt.\"\"It made me feel like I would never get free,\" he said.The ban will apply to all online and offline gambling products except lotteries that are run for good causes. These lotteries will have to provide a significant layer of additional protection to vulnerable people.The commission said that tickets for these lotteries, as well as for the National Lottery, can be bought using credit cards in supermarkets and newsagents as long as they are purchased with other products.It said it would be a \"disproportionate burden on retailers\" to stop credit card payments if the tickets were part of a wider shop, but said lotteries had the lowest problem gambling rate.When Josh, 27, found himself £600 down after just a few days gambling online using his credit card, he says he did \"the worst thing possible\".\"I chased the loss, which everyone says not to do, they say stop, don't chase losses, you're always going to be down in the long run,\" he says.\"But I didn't believe it so I just carried on going. It progressed without me even realising to between £20,000 and £25,000, all on credit cards.\"I feel I'm someone that's more intelligent than that, someone that wouldn't do that. I'm not that person. But I was.\"Now, Josh is facing the fact that his debts will have a long-term effect on his life.\"I'm looking at eight to 10 years to pay this off,\" he says.Share prices for betting companies fell in early trading on Tuesday, but then recovered quickly.Under the new regulations, all online gambling operators will have to participate in the Gamstop self-exclusion scheme and offer it to all customers from 31 March.People who sign up for Gamstop are prevented from using British gambling websites and apps for a chosen period of time.Brigid Simmonds, chairwoman of the Betting and Gaming Council (BGC), said the industry body \"strongly\" welcomed the requirement for all companies to join GamStop.She added: \"We will implement a ban on credit cards which adds to measures such as age verification, markers of harm and affordability checks, additional funding for research, education and treatment and new codes of conduct to protect the consumer.\"Adam Bradford, co-founder of the Safer Online Gambling Group, said that while the credit card ban was \"welcome\", it was \"not a silver bullet to solve the problem as the gambling industry still needs to improve in many areas - for instance, performing better affordability checks on players and being more careful with its advertising\"."}