{"author":"By Simon Read","title":"Coronavirus: Why are planes still flying?","news_category":"general","content":"You've only got to look up to see there's still a fair amount of activity in the air, despite all the airline cutbacks. Why is that?Surprisingly, a number of global airlines are still running passenger flights, including British Airways (BA).That's despite aviation largely grinding to a halt as the coronavirus crisis hit passenger traffic numbers and governments banned flights.But tens of thousands of Britons stranded abroad will be flown home <https:\/\/www.bbc.co.uk\/news\/uk-52099252> under a new government agreement, while many planes carry essential cargo.Passenger flights are believed to have been cut by up to 95%, but that still means one in 20 are taking off.Airlines say they are keeping vital links open.\"We are working with European Union (EU) governments to try to keep some minimum flight links open for emergency reasons, even though the passenger loads on these flights will be very low,\" said Ryanair.But other flights are to bring stranded people home.BA, Virgin Atlantic, EasyJet, Jet2 and Titan are among airlines that have agreed to fly Britons back to the UK.\"We are doing everything we can to bring customers home, including critical workers,\" BA told the BBC.\"Not all governments are allowing flights. We are working with the Foreign Office to open routes where we can.\"The UK government has also pledged £75m to help provide charter flights to bring UK nationals back from countries where commercial flights aren't available.BA is already operating a number of repatriation flights chartered by the Foreign Office from Lima, Peru.Heathrow Airport said it is working closely with Public Health England officials \"to facilitate their access to the airport so that they can implement their enhanced monitoring measures as a precaution.\"In line with the latest Public Health England advice, we are encouraging passengers and colleagues to maintain good hand hygiene.\"Meanwhile, Ryanair said all its aircraft \"are disinfected daily\".\"With low loads, social distancing will be optimised on-board,\" the airline said.That's difficult to find out, but you can check at any airport's website to see how many planes are flying in and out at any given time.When the BBC checked Heathrow Airport - heathrow.com\/departures - on Monday morning, for instance, there were flights scheduled in the following hour or so to Dublin, Copenhagen, Bahrain, Manchester, Helsinki, Amsterdam, Warsaw, Madrid, Hamburg, Moscow, Barcelona, Doha, Berlin, Paris, Kuala Lumpur, Valencia, Boston and Stockholm.You can also see at-a-glance live data of how many flights are in the air at any one time through flight tracker website flightradar24.com.But many flights you see in the sky will be cargo planes. The amount of cargo handling via Heathrow Airport has doubled in recent days, it told the BBC.They often carry vital supplies, including food and medical equipment.For example, two-fifths of the UK's pharmaceutical products such as medicines, vaccines and respirators are imported via Heathrow Airport.The airport is the UK's largest port by value, with 34% of the country's cargo passing through.Normally 95% of the cargo that comes into Heathrow Airport is carried in the belly-hold of passenger planes, but the airport is currently \"repurposing its operation and scaling up its cargo offering\".It has temporarily increased the number of dedicated cargo flights.\"These will bring in vital supplies of food and medical equipment to help Britain weather this storm,\" said Heathrow boss John Holland-Kaye.Last week it reported a 243% increase in the number air traffic movements carrying only cargo.During normal operations, the airport usually handles 47 cargo-only planes a week, on average. On Tuesday 31 March, it is forecast to have 48 cargo-only planes in just one day."}