{"author":"By Eimear Flanagan","title":"Menopause: Speaking up to end the stigma","news_category":"general","content":"Are women's career prospects negatively affected by a lack of workplace understanding about the menopause?Many women begin to experience symptoms of the menopause in their mid-to-late 40s, a time when most professionals are at or reaching the peak of their careers.Not all women suffer from problems commonly associated with the menopause <https:\/\/www.bbc.co.uk\/news\/health-48258910>, such as hot flushes, night sweats, insomnia, fatigue, anxiety and mood changes.But for those with severe symptoms, the debilitating effects can last for years, badly affecting their personal and professional lives.\"Lots of gifted women give up work because of it,\" a Northern Ireland MP has said.Michelle Gildernew was among several high-profile women who shared their personal experiences of the menopause on social media this week.For the Sinn Féin MP, the \"worst bit is loss of memory and brain fog\". \"We need to end the stigma and help more people understand the challenges,\" she added.Her party colleague, Northern Ireland's Deputy First Minister Michelle O'Neill agreed, tweeting that hot flushes were a \"permanent feature\" of her daily life.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Alliance assembly member Kellie Armstrong said she too was \"riding the menopause rollercoaster\".\"My internal furnace likes to kick in at the most inopportune moments. Such fun.\"The politicians were responding to a tweet from BBC News NI's health correspondent Marie-Louise Connolly, who listed her own menopausal struggles.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.by Marie-Louise Connolly, BBC News NI health correspondentIt wasn't the first time I'd composed a tweet about my menopause. But this time I hit send.And despite the ungodly hour, just 4am, the likes and comments flooded in - mostly from like-minded women also craving sleep.The reaction has been phenomenal.While many, including some high-profile names commented publicly, others messaged privately.Some said they were too embarrassed to admit reaching the \"M\" stage, others saluted me for embracing it.So what made me tweet? As a health correspondent, I ask people to talk about their health issues every single day - so I shouldn't be afraid to talk about mine.I'm not the first woman to experience the menopause and certainly won't be the last.However, in my position I know I can reach out to more people, including men. The menopause doesn't just affect women - it affects their partners and families too.Women should understand what's happening to their bodies and those living with them need to know what to expect.Knowledge is power.For many women, it happens at the peak of their career or when tumultuous changes are happening in family life.I hope my honesty can help others.Our correspondent's candid tweet certainly drew attention to the issue at Stormont and further afield.\"The more we talk about it, the more we help end the stigma,\" the deputy first minister added.But how easy is it for women in positions of power and responsibility to admit they are struggling to cope because of the menopause?Dr Anne Carson, a senior hospital doctor for over 30 years, had no choice but to speak out.\"Menopause just hit me like a train, I couldn't cope,\" she told BBC News NI. \"I found it very difficult to be able to do the normal things of daily living, never mind being able to work and the other roles that I had at the time.\"The mother-of-two is a full-time consultant radiologist and a carer for her elderly father.She is also deputy chair of the Northern Ireland council of the British Medical Association (BMA) <https:\/\/www.bma.org.uk\/what-we-do\/uk-national-and-regional-councils\/uk-and-national\/northern-ireland-council>.Ten years ago, she began to suffer severe menopausal symptoms, with night sweats so bad she regularly had to get up in the middle of the night to shower.\"I think the sleep deprivation is possibly the worst, certainly it was for me as a practising doctor,\" she said.\"I just didn't expect it to turn my life upside down the way it did.\"Insomnia is a significant problem in a pressurised job - as a hospital consultant she had to make \"life and death decisions\" during long, often anti-social hours.Unable to avoid nightshifts, her symptoms deteriorated to the point where she had to take sick leave.\"I know when I can't do my job safely - I had no choice but to take time off,\" she recalled.Dr Carson sought treatment and was able to go back to work, but shortly after her return, she felt a \"responsibility to highlight it as a huge issue\" and decided toshare her own story publicly <https:\/\/www.theguardian.com\/society\/2020\/aug\/06\/female-doctors-in-menopause-retiring-early-due-to-sexism-says-study>.She said more support is needed to ensure women do not have to give up careers they spent their professional lives building.\"A lot of women just retire early from medicine,\" she said. The consultant has concerns not only for her peers, but also for the future of her profession, because more than 50% of newly-qualified doctors are women.\"That's going to have a huge effect, if the sort of job I do isn't more flexible,\" she said.Dr Carson points out that, like pregnancy and maternity leave, the menopause is only a temporary stage during a woman's overall working lifetime.Therefore short-term support, such as flexible hours, is not an \"insurmountable\" solution to retain this section of the workforce.But last year, the BMA surveyed 2,000 doctors <https:\/\/www.bma.org.uk\/bma-media-centre\/bma-report-says-there-is-a-fear-to-speak-out-about-menopause> and more than a third (36%) of respondents had made changes to their working lives as a result of the menopause.Almost half (47%) of those medics did not feel comfortable discussing menopause issues with their manager.There are several reasons why women are reluctant to ask management for help during the menopause, according to Anne McGale.\"Possibly, they're worried about the impact it would have on their status within the workplace,\" she said.They may also fear a \"lack of understanding\" from a male manager, or from a younger female boss, she added.Ms McGale has worked as an NHS nurse for 38 years, but outside that role she trains organisations on how to support workers during the menopause.It is a subject she is passionate about because of her own traumatic menopause experience.At the age of 51, she began suffering from \"horrendous anxiety\" and lost two-and-a-half stone.\"I was just very tearful... I just kept saying to people: 'This is not me, I've lost the person that I am'.\"Ms McGale, who became a trainer to smooth the path for other women, said a lack of support for workers with severe symptoms can affect career progression.\"They will not go for promotion, because they are dealing with so much.\"She said having a good workplace menopause policy can benefit employers as well as their staff, as it can help retain experienced employees.\"These are people that you have invested a lot of your time and your training into.... if you look after them, they will be very loyal.\"Ms McGale also said it is important to include male staff in menopause awareness training, because it can improve relationships not only in the workplace but in workers' personal lives too.\"Men haven't a clue what's going on - they don't know what's going on with their wives.\"They can't say right for saying wrong, they're damned if they do and damned if they don't and it's really just about an understanding.\"This video can not be playedMenopause: what are the symptoms and why does it happen?When it comes to employment legislation, there are written rules to protect women when they are pregnant or breastfeeding, but there is no specific mention of the menopause.However, the Equality Commission for Northern Ireland has said that while the law \"does not expressly provide protection for menopause\", women are already protected in the workplace by a range of equality laws.Women who believe they have been treated unfairly at work in relation to the menopause may be able to take legal action on the grounds of sex, disability or age discrimination, depending on the facts of their case, the commission's spokeswoman explained.\"There have been several successful tribunal cases which provide employers with important lessons in how to support women affected by menopause,\" she said.\"It's important that employers include women going through the menopause in their normal employment policies, or develop a separate menopause policy - the important thing is that managers and staff know there is protection and how to avail of it.\""}