{"author":"By Nikki Fox","title":"Man dies waiting in ambulance outside Norfolk and Norwich Hospital","news_category":"general","content":"A man has died in the back of an ambulance after waiting six hours to be admitted to hospital.The elderly patient died outside the Norfolk and Norwich University Hospital on 22 August.The hospital said the man, who \"had abdominal pain and was in a stable condition\", was \"assessed by a doctor within 30 minutes of arrival\" on site.Chief nurse, Prof Nancy Fontaine, said the patient was brought to the hospital \"on an extremely busy day\".Prof Fontaine said the man \"remained in the ambulance due to significant pressure on our emergency department and inpatient wards.\"Sadly, the patient suddenly deteriorated and died in the ambulance,\" she said.At the time, there were more than 200 patients in the hospital who were medically fit to be discharged.Three days after the death, Health Secretary Steve Barclay visited the hospital and said tackling ambulance delays was \"the government's number one priority\".\"A lot of the issue with the ambulances, is the fact that people are not being discharged from hospital,\" he said.\"It's the people on hospital wards who are medically fit, but are waiting for domiciliary care packages or beds in care homes.\"That creates a blockage in the system from the emergency department onto the ward, which in turn, then causes delays for our ambulance crews, which is hugely frustrating for them and obviously means you have unmet risk in terms of the community.\"A spokesman for the East of England Ambulance Service said it had a rapid response vehicle with the patient eight minutes after a call was received.This was followed shortly after by an ambulance, which transported the patient to the Norfolk and Norwich University Hospital.\"Unfortunately, the patient's condition deteriorated while waiting to enter hospital and he passed away.\"We would like to pass our sincere condolences to the patient's family for their loss and invite them to contact us directly if they wish to discuss further.\"Prof Fontaine said: \"Our deepest condolences are with the family and we are liaising directly with them following their loss.\"We are looking into the circumstances following the death.\"A spokesman for the Department of Health and Social Care said: \"No one should have to wait longer than necessary to access emergency care and we are identifying all the opportunities in our integrated health and social system to alleviate pressures on the ambulance service.\"Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk"}