{"author":"","title":"Turkey earthquake: Relatives tell of family members trapped","news_category":"general","content":"Relatives of victims of the Turkey earthquake have spoken of how their loved ones are trapped under rubble or living on the streets.Millions have been left without homes in freezing conditions and in need of blankets, shelter, food and water.The Welsh government has pledged £300,000 to victims of Monday's disaster in Turkey and Syria.It committed the cash to the Disasters Emergency Committee (DEC) appeal <https:\/\/www.dec.org.uk\/appeal\/turkey-syria-earthquake-appeal> as the death toll topped 19,000.Emir Cecen, a barista at Newport's Cafe Unwind, is from Adiyaman in Turkey, where his family have been left homeless.He has helped fill a van of donations, which left Newport on Tuesday.He said: \"It is a very difficult time. \"I woke up and I'd received 20 or 30 missed calls from friends, family, friends over here.\"It was really devastating.\"His family were \"on the streets\", he added. Mr Cecen said: \"My mother is sleeping in a school, alongside my uncle, my auntie and my nan.\"My dad is also outside in his car. My hometown is nearly 80% wiped out and there's still a lot of people underneath the rubble.\"One of my close friends, who lives with me here in Newport, his mother is also underneath the rubble as well. He hasn't been able to get in touch with her and it's been so long now.\"Yusuf Sanli, 35, Nagihan Alturk Sanli, 33, and Hade Turkmen, 42, who live in Cardiff, all have friends who have been affected by the earthquake.Some of Yusuf's friends have lost half of their family and others are trapped in devastated buildings.\"We have friends in Kahramanmaras, which is at the centre of the earthquake, and their families are under the rubble,\" he said.\"We also have friends that we can't get any information from.\"His wife Nagihan said her family was safe, but friends had lost loved ones.\"It is a very hard situation for us, because we are not able to help from here a lot,\" she said.\"It's very hard to handle this situation. It's a very big area.\"The people affected by the earthquake, it's 10 cities. And it's not only the cities, it's the towns and the villages.\"Hade said friends were living outside without adequate shelter.\"There will be more horrific stories we are going to hear because of the weather conditions there,\" she said.Five firefighters from Mid and West Wales Fire Service and South Wales Fire Service have been sent to Turkey to help.The team have specialist search equipment including seismic listening devices, concrete cutting and breaking equipment and propping and shoring tools.The DEC's Sian Stephen said: \"The scale of the disaster is enormous.\"Fifteen thousand people have lost their lives, so many more are injured, and thousands of buildings have collapsed.\"We know there are 17,000,000 people in the affected area, and people who survived this terrible experience need urgent help.\"We've heard that in the north-west of Syria, people living in tents because they have been displaced by the war are now hosting families who have lost their homes, and many others are living in cars.\"But the freezing conditions are hampering rescue efforts and also making it making it very dangerous for survivors.\"Wales' Social Justice Minister Jane Hutt offered her condolences to those who had lost loved ones and said her thoughts were also with Turkish and Syrian people in Wales waiting apprehensively for news.\"The scale of destruction is vast, and I'd like to thank the brave search and rescue teams who continue to search through the rubble for survivors,\" she said."}