{"author":"","title":"Court translators protest against new contract system","news_category":"general","content":"Interpreters are protesting outside Parliament over a new contract privatising court translation services in England and Wales.The Professional Interpreters Alliance said poorer pay and conditions had seen 60% of its members boycott court work.They say incompetent interpreters are now being used and courts should return to using registered freelancers instead of going via a single agency.The Ministry of Justice said the new system would be more efficient.Members of the Professional Interpreters Alliance (PIA) have claimed that the contract could lead to miscarriages of justice.The interpreters claim some translators either lack the competence for the job or fail to turn up at all.Speaking to the BBC as protesters moved from outside the Ministry of Justice towards Westminster, PIA director and Dutch interpreter Madeleine Lee said they were \"hoping people might sit up and take notice\".She said officials had provided \"absolutely no clarity\" about the state of interpreting in the courts since the new contract came into force - to the extent that questions were being asked in the House of Lords.\"We just want the ministry to stop being in complete denial and to put figures out there,\" she said.Before the protest, Ms Lee told the BBC: \"We're hearing reports of people seeing not just one terrified face sitting in the dock but the defendant and the interpreter next to them looking terrified and mute and not doing what an interpreter is supposed to do which is actually talk.\"Previously interpreters received a flat fee of £85, a quarter-hourly rate after three hours, and were paid for travel time and expenses - but this has been replaced by hourly fees in three tiers of £16, £20 and £22 plus no travel time and reduced expenses.\"You may find yourself spending an entire day at court and actually only taking home the one hour minimum that they undertake to pay you, which could be as low as £16,\" Ms Lee said.The interpreters have compiled a 49-page log of issues over the past six weeks. It highlights 194 incidents where they believe things have gone wrong - for example when interpreters have failed to show up.By mid-February such problems led the Ministry of Justice to advise courts to revert for a time to the previous system.A ministry spokesman acknowledged that there had been an unacceptable number of problems in the first few weeks but said there had been a \"marked improvement\" since.Speaking on BBC Radio 4's Today programme, Justice Minister Crispin Blunt also acknowledged there had been problems with the start of the new contract.\"But we are replacing a system that was administratively decrepit frankly, and very expensive and very open to abuse,\" he said.\"So I'm satisfied that we are now rapidly improving the delivery of the new arrangements and we will get over this bedding-in period.\"He said interpreters were unhappy with \"a system they can no longer take advantage of\".\"Under the old system there were reports of interpreters earning six figure sums from this - where they were getting a fixed fee for three hours work in court when they might only be there for a five minute hearing,\" he said.The company awarded the contract - Applied Language Solutions (ALS) - has promised to cut the annual £60m translation bill by a third.Mr Blunt said he believed ALS would still be able to make a profit while meeting the conditions of its contract.\"Obviously our contract is with ALS. ALS are then going to have to find the right market rate for supply and demand for interpreters to make the system work satisfactorily. We hold them to their contracted price with us,\" he said.\"We will actually get to a place where interpreters are being much more efficiently administered.\"A spokesman for ALS - recently bought by the outsourcing firm Capita - said there would be a transitional period while the company addressed \"previous inefficient practices\".Chairman of the Lincolnshire branch of the Magistrates Association David Evans told Today that issues with translators could severely disrupt the work of the courts.\"Everybody's entitled to a fair hearing in court - if they can't understand fully what's happening, it's not a fair hearing - it can't go ahead,\" he said.\"Cases have to be adjourned, people have to be released sometimes several times before the case is finally heard. I have heard words like 'disaster' and 'chaos' used - and I don't think they're too strong at the moment.\"Mr Evans said that the contract had been in place since 1 February \"surely that's time for a large company to get its act together\"."}