{"author":"By Vikki Blake","title":"Tom Grennan: Online gaming is a lockdown 'godsend'","news_category":"general","content":"Online gaming isn't just entertainment or a way to while away a few hours in lockdown - it can be much more than that.For singer Tom Grennan, games haven't just kept him busy during the pandemic, they've kept him connected to his mates.\"It's a different type of socialising,\" he tells BBC Sounds podcast Press X to Continue.\"Right now, man, it's a godsend, to be honest.\"Thanks to group text chats and the magic of online co-operative games, Tom is staying in touch with his friends, including some he doesn't get to see so often in his day-to-day life.\"We've got this group chat with all my mates. And we're like, 'do you fancy a game of FIFA?'\"And to be honest, it's nice to catch up like that and play something and not be on FaceTime or something like that, you know what I mean?\"It's a place where we can actually have some fun, some competitiveness and jokes.When he's not in the game's prison section, called the Gulag, Tom's been using the time online to catch up with friends he'd lost touch with recently.\"That's what I love about it,\" he says. \"I'm playing with people that are old schoolmates who I don't chat to much anymore, but we've reconnected through playing.\"And we're catching up now. I'm interested in them. I'm like, 'what are you doing?' and all that kind of stuff.\"And they're interested in what I'm doing and, I'm telling them different stories and all this kind of stuff, so it's good.\"He adds: \"When Friday night hits, and all my mates in the group chat are like 'coming on Call of Duty?' I'm like… 'Yeah, go on, then'.\"And then it's hours and hours just in the Gulag.\"Tom says games have been a welcome distraction in a time when gigs, tours and shows have all been cancelled.But with the vaccine rollout gathering pace and a new album coming in March, he's hopeful he'll spend less time in the Gulag in 2021.\"They're smashing the vaccine, as we know, so I feel hopeful. \"There's light at the end of the tunnel. And I feel like it's coming, man.Tom says he has his eyes set on planned live shows this September in Alexandra Palace in London, and hopes it will be to a capacity crowd.\"I want to wait until we can do it right, man. To be honest, I don't want to be at Ally Pally with 25% capacity.\"Whether the gig will happen or not, I'm not too sure, but we've got our fingers crossed.\"I don't want to just play, I want to hang out with my mates and just enjoy life again.\"Until then, Tom plans on keeping connected with old friends and new online - while at the same time playing as his favourite team Manchester United on FIFA or fighting to escape the Gulag.Follow Newsbeat on Instagram <https:\/\/www.instagram.com\/bbcnewsbeat\/>, Facebook <https:\/\/www.facebook.com\/bbcnewsbeat\/>, Twitter <https:\/\/twitter.com\/BBCNewsbeat> and YouTube <https:\/\/www.youtube.com\/channel\/UCe1Ef-K5jpnRsmVY5hCBhOw>.Listen to Newsbeat live <https:\/\/www.bbc.co.uk\/sounds\/play\/live:bbc_radio_one> at 12:45 and 17:45 weekdays - or listen backhere <http:\/\/www.bbc.co.uk\/programmes\/b006wkry\/episodes\/player>. "}