{"author":"","title":"The Easter egg that's gone uneaten for more than 70 years","news_category":"general","content":"This video can not be playedIs this the oldest uneaten Easter egg?A grandmother has revealed a family treasure: an uneaten Easter egg that could be one of the oldest in Wales.Sally Evans's brother was just 14 when he bought her the egg in 1951 as an Easter gift.\"It was just something that was too valuable to eat,\" Sally, now 83, said.At the time war rationing was still in force, making chocolate hard to come by. So the egg was tucked away in a cupboard, first by her mother, and since 2002 in her own home.\"I don't know why, I guess it was just for sentimental reasons,\" she said.\"It's been living in a cupboard in the bedroom since my mother died, who kept it in the bottom of her wardrobe.\"Sally, of Newport, was 11 when she got the egg, and her mother wouldn't even let her hold it, let alone eat it.Her brother Ron had just left school, taking a job at the colliery in nearby Risca, in Caerphilly county... \"and he bought me this with his first pay packet\".Sally remembers at Easter her grandmother would melt down chocolate into cups to make \"half eggs\".\"Chocolate was very scarce so this was absolutely, totally and utterly decadent,\" she said, adding that her brother must have \"really scrounged\" to buy it for her.\"My mother wouldn't have dreamed of letting us eat it,\" she said. \"It was something to be treasured and valued because you never knew when you were going to get anything like it again.\"Until this year, the box hadn't been opened for nearly a decade.\"I wrap it up to keep the air out of it,\" she said, pulling back the cling film plastic wrapping, to reveal a Sharps label on top of the box.\"They made creamy toffees, that's what they were famous for.\" Inside the box, the egg is beneath another layer of plastic.It is decorated with red, yellow and pink roses, and green bows made of icing. The colours have faded a little over the years, but she was surprised to still be able to catch the scent of chocolate.Sally got in touch with the BBC Radio Wales Breakfast programme <https:\/\/www.bbc.co.uk\/programmes\/m00050lj> to talk about her family's egg after hearing reports about another old Easter egg in the news.\"I really didn't realise it would be that important,\" she said. \"To eat it would be sacrilege... destroying all this wonderful work.\"It's inedible now, isn't it? But having said that, it looks pretty well alright.\""}