{"author":"By Danny Fullbrook and Sarah Jenkins","title":"Tetris: Granddaughter shocked by film depicting Robert Stein","news_category":"general","content":"A woman whose grandfather \"found Tetris\" said she was \"shocked\" a film had been made about the game's development without her knowledge.Apple TV+ has released the film Tetris <https:\/\/www.bbc.com\/culture\/article\/20230329-why-tetris-is-the-perfect-video-game>, starring Taron Egerton and Toby Jones.Jones plays Robert Stein, from Digswell in Hertfordshire, who thought he had secured the rights to Tetris from Russian computer engineers in 1986.His granddaughter, Claire Stein, said her family should have been consulted. Apple has been contacted for comment.Ms Stein said: \"No-one [in the west] had spotted Tetris until my grandfather had.\"He walked into this gaming convention and there was this little game being played that really caught his attention.\"He was mesmerised. He spoke to the creator and really wanted to get the rights licence and send it out to the world. He was just fascinated with the game.\"Mr Stein died as a result of heart failure aged 83 in 2018, having been unwell for some time.The film depicts the issues surrounding the licensing of the game, created by Russian software engineer Alexey Pajitnov, and getting it licensed outside the USSR during the Cold War.At that time, intellectual property rights did not exist in the communist USSR - individual inventions or creations were owned by the state, theoretically to be shared among everyone.In previous reports, Mr Stein, had been depicted as the man who \"stole\" Tetris.Ms Stein said her grandfather \"had the best intentions of licensing Tetris legitimately\".\"When he made that agreement, he thought he had the rights,\" she said.\"He was not quite understanding there was much more at play when it comes to Russia.\"Mr Stein secured some of the rights to sell the game on some platforms such as Commodore, but not the big ones such as Nintendo.Ms Stein said she and her family feared her grandfather would be depicted as \"the villain or the crook\" in the film, as he had been in previous reports.\"It didn't surprise me they would want to make a movie because the back story is very interesting,\" she said.\"It's fascinating and deserves to be told, but the way they're telling the story, I don't think it's going to be factual.\"Ms Stein said she wished her family could have spoken to producers ahead of the film being made.\"We had no involvement,\" she said.\"I think it would've been the right thing to do, to at least reach out to us.\"It was very much a shock when we heard about it.\"When I found out about the film, it floored me, it really shook me to my core.\"My grandfather was everything to me and it filled me with fear and dread.\"I wish we had a part in controlling some of the narrative.\"She has not yet had the time to watch the film, but hoped to do so on Saturday.Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}