{"author":"","title":"Comedian Janey Godley reveals she has ovarian cancer","news_category":"general","content":"Comedian Janey Godley, who found viral fame with her dubbed sketches about First Minister Nicola Sturgeon, has revealed she has ovarian cancer.The 60-year-old Glaswegian shared the news on social media and published a picture of herself in a hospital bed.Godley said she arranged an appointment at hospital on Thursday after suffering from a bloated feeling in her stomach.She said she had \"done nothing but cry and cry and cry\" since being diagnosed but thanked the \"brilliant\" NHS.She tweeted: \"Sorry but my last weekend of the tour can't go ahead in Edinburgh and Musselburgh as I am in hospital with ovarian cancer. Look after each other. #MentalHealthMatters.\"Godley was due to appear at the Festival Theatre in Edinburgh on Friday and The Brunton in Musselburgh on Saturday.The comedian, who is being treated in hospital in Glasgow, urged anyone with symptoms to get them checked out.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.She said: \"If you have any symptoms like I had, which was I felt as though I was full before I was eating a meal, I felt as though I had no real energy and there was a big bloatingness inside my stomach, I got it checked out and it's ovarian cancer.\"So onwards and upwards, I want everybody to know that I really appreciate them for being behind me for so long and we will see what happens next.\"She added: \"Onto the next step of my journey and what is that journey? I don't know if I'm going to be one of these people who battle bravely, who fight every step, I don't know.\"That doesn't feel how I've been the last day, I've done nothing but cry and cry and cry but I'm going to use science, I'm going to use technology and I'm going to try and cope with this next step on the journey.\"The comedian's pastiches of Nicola Sturgeon's coronavirus news briefings gained her a massive social media following during the pandemic.She featured in Scottish government coronavirus adverts but they were pulled after offensive historical tweets by her came to light.A number of posts, the most recent of which was from 2017, were highlighted by theScottish Sun <https:\/\/www.thescottishsun.co.uk\/news\/scottish-news\/7677071\/janey-godley-tweet-scandal-racist-black-celebrities\/>.The Daily Beast followed up by publishing several tweets from 2011 and 2012 about black performers.Godley apologised for the tweets and donated the £12,000 fee she was paid by the Scottish government to charity."}