{"author":"By Noor Nanji","title":"People face biggest fall in spending power for 70 years","news_category":"general","content":"This video can not be playedThe UK is expected to avoid a technical recession in 2023, Jeremy Hunt tells the Commons.People face their biggest fall in spending power for 70 years as the surging cost of living eats into wages.The government's independent forecaster said that household incomes - once rising prices were taken into account - would drop by 6% this year and next.Living standards won't recover to pre-pandemic levels until 2027, it warned.It came as Chancellor Jeremy Hunt said the economy would shrink this year but avoid recession.Energy and food bills have shot up due to the war in Ukraine and pandemic, and are squeezing household budgets.Inflation - the rate at which prices are rising - is currently in double digits.It is set to more than halve to 2.9% by the end of this year, according to the Office for Budget Responsibility (OBR). But for now, the figure remains very high, and well ahead of average wages.The drop in real household disposable income would represent \"the largest two-year fall in living standards since records began in the 1950s,\" Richard Hughes, chairman of the OBR, said.\"We think households are going to dip into some of their savings to help manage the squeeze on living standards and that supports growth in the near term,\"he added.The OBR looks at the government's tax and spending plans in the Budget and then predicts how the country will perform over the next five years.Previously it had expected the UK to fall into recession at the end of last year and continue to shrink all of this year.A recession is usually defined as when an economy gets smaller for two three-month periods - or quarters - in a row.The last time the UK's economy went into recession was in 2020, at the height of the coronavirus pandemic.The OBR now expects:Chancellor Jeremy Hunt said the predictions from the OBR were \"proving the doubters wrong\".But Labour criticised the announcements made during the Budget as \"dressing up stagnation as stability\".Adrian Hanrahan, managing director of chemicals firm Robinson Brothers in the West Midlands, says that while the forecast is for inflation to fall, at the moment it is very high.That's a huge challenge for the business, he told the BBC.\"I would love to consider growth and we all aspire to growth,\" he said.\"However, the challenges right now are for us to cope with high energy costs, lack of resources, and labour shortages. Every penny we've got is going into manufacturing, not investing.\"The biggest issue Robinson Brothers is grappling with currently is high energy prices, and Mr Hanrahan was disappointed not to hear anything in the Budget to address that.\"All very well talking about growth in two or three years time. It's the here and now that we want, and that wasn't available from the Budget today.\"Independent research group the Institute for Fiscal Studies (IFS) said the economic picture had not changed \"enormously since the autumn\".IFS director Paul Johnson said the OBR \"expects the economy to grow a bit faster in the short-term, and a bit slower in the medium-term\".This would combine to create an economy that was \"0.6% larger in real-terms in 2027-28 than under the autumn forecast,\" he said.Meanwhile, Labour leader Sir Keir Starmer accused the government of being \"out of touch\" and putting the country \"on a path of managed decline\".The chancellor also said the UK was on track to meet the government's self-imposed spending rules.According to these rules, government debt must be falling as a percentage of growth in five years' time.The chancellor has announced that the economy will avoid a \"technical recession\" this year, but that doesn't mean we're out of the woods.The size of the economy - the value of everything we make and produce this year - is set to fall by about 0.2% according to the chancellor's figures.It becomes a \"technical recession\" if the economy shrinks for two seasons (three-month periods) in a row. So it's possible to avoid the technical definition even if the economy is doing badly if it shrinks in the spring and autumn but rises in the summer.A forecast of a 0.2% shrinkage may be better than we thought last autumn (shrinking by 1.4%) but it's hardly anyone's definition of doing well.Additional reporting by Oliver Smith."}