{"author":"By Conor Macauley","title":"NI can become 'leader' in hydrogen technology', says economy minister","news_category":"general","content":"Northern Ireland can become a leader in hydrogen technology, Economy Minister Diane Dodds has said.She said it would also allow us to get more efficient use of our onshore windfarms.There are already plans to introduce three hydrogen-fuelled <https:\/\/www.bbc.co.uk\/news\/science-environment-53238512> buses to Belfast later this year.The company building them has ambitions to set up a facility to make hydrogen fuel. Ballymena-basedWrightbus has orders for 80 of its hydrogen buses. <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-51296312>Twenty of them are in production at present.The buses work by passing hydrogen into a fuel cell where a chemical reaction creates an electrical current to drive the bus.The only thing that comes out of the tailpipe is water.Wrightbus was bought last year by UK industrialist Jo Bamford, whose family owns JCB. <https:\/\/www.bbc.co.uk\/news\/uk-northern-ireland-50143581>He also has extensive interests in the hydrogen industry.The main issue with hydrogen buses is the price. At £500,000, the double-deckers cost twice as much as a diesel equivalent.Wrightbus chief executive Buta Atwal said government support will be needed to drive down costs.\"If we have guaranteed volume, we'll need less support. Without that volume, we'll need more support,\" he said.\"The supply chain, the components coming into it, need that volume to reduce their prices, for us to reduce our prices.\"Generating the fuel is another issue. It can be made from natural gas, but that is a fossil fuel.There is a green alternative which uses unused capacity from windfarms.At present, windfarms are switched off when there is no demand for their power, like at night.That so-called constraint can account for up to 10% of their potential output.A County Antrim windfarm near Dunloy ,owned by Energia, will use its excess capacity to generate hydrogen for the Belfast buses.Electricity will be passed through water in an electrolyser to split it into hydrogen and oxygen.The hydrogen will be taken to Belfast where it will run Translink's new buses.Energia's David Macartney said with more wind capacity coming on stream, new ways must be found of circumventing problems caused by the grid's capacity to take that power.\"There are a number of solutions, one of which is hydrogen,\" he said."}