{"author":"","title":"Are asylum suicides an unfolding national tragedy?","news_category":"general","content":"After fleeing his native Eritrea as a child and living for years as a refugee, Henok Zaid Gebrsslasie hoped to make a life for himself in the UK. Aged 23, he was found dead at a mental health facility in Coventry, West Midlands, and is thought to have taken his own life. His death is one of a growing number among young asylum seekers which a charity said could just be the \"tip of the iceberg\".Henok was a friendly and kind, football-loving young man, according to his brother.\"If someone was in distress or needed help, he would be the first to jump in to offer it,\" said Tewelde Zaid.Always the joker, the 23-year-old was also seen by friends as a very honest and principled man.Having fled Eritrea as a 14-year-old boy to avoid persecution and compulsory military service, he had crossed the border to Sudan where he lived for some time as a refugee.But he dreamed of a life in the UK. Travelling solo through the Sahara Desert and Libya, he made it over the Mediterranean and eventually arrived in Coventry in May 2020, aged 21.\"He went through a lot of pain on that journey, but he never gave up. He was always hopeful that one day he would find a safe place to stay,\" said Mr Zaid.He describes being called by his \"ecstatic\" brother on his arrival in the UK. \"[He was] so hopeful after so much trouble of his journey,\" he said. Like many young asylum seekers arriving in the UK, Henok's journey would have taken a \"heavy toll\" on his mental health, according to charity worker Benny Hunter, and his experience of negotiating the UK's asylum system would have been very difficult.Mr Hunter works for the Da'aro Youth Project, which was set up by the Eritrean community following the deaths of four young friends.\"Many of the people that we work with have witnessed violence, rape, death or have experienced violence themselves,\" he said. The experience of being a refugee \"is in itself, very traumatic,\" he added.\"Being housed in a hotel and not being able to work, having to rely on very small amounts of money every week, it's very difficult for a lot of people especially if you're here alone and especially if you're young.\"Asylum seekers often face social isolation, discrimination and sometimes even hostility, said Mr Hunter.\"The issues that we have tried to highlight are the impact of the asylum system on people going through the process, particularly vulnerable people such as young people,\" he explained.The \"overwhelming majority\" of people from Eritrea arriving in the UK are granted refugee status, he said, \"and yet we still see asylum seekers waiting very often several years for a decision on their claim\".Henok had sought refuge in the UK to make a better life, said Mr Zaid. \"He was trying his best. He was telling me 'I'm going to make myself a better person, to follow through with my education, to get work rather than depend on anyone'\".The last time he spoke to his brother was on 4 August.\"We talked for a long time - he wanted to see photos from my wedding in Sudan,\" he said.But eight days later, Henok was dead in a suspected suicide at the Caludon Centre in Coventry, an adult mental health facility.He may have accessed mental health services \"at a moment of crisis\", said Mr Hunter, who said his organisation had been working to highlight the issues the asylum system has on the minds of young people.His death was \"difficult to believe\", said Mr Zaid, and a delay in repatriating his body back to Eritrea had left the family feeling very stressed.\"Until the burial is done, the close family, we cannot let go,\" he said. \"My parents, they will still suffer forever because they have lost their son, but they have a terrible mourning right now, without closure because they haven't buried Henok,\" he said.\"We have complied with everything the authorities have asked for. I am concerned why they are making it complicated - especially why the police have taken so long to finish their investigation. I am angry and disappointed with the way the authorities have treated us.\"The London-based charity is one of 46 organisations to have written to the government earlier this year raising the alarm over the suicides of young asylum seekers, including the death of a 19-year-old Afghan living in Birmingham who feared he would be deported.An inquest last month was told the teenager had arrived in the UK as a 13-year-old, being cared for by the local authority until turning 18.He had only been granted temporary leave to stay in the country as a minor and feared being returned to Afghanistan.Mr Hunter, who attended the inquest, said the teenager - like most of the deaths - was a young person who had arrived in the country as an unaccompanied child.In April this year, another inquest heard 19-year-old Eritrean Mulubrhane Medhane Kfleyosus took his own life in February 2019.Known as Mulu, he became the fourth of a group of Eritrean friends to die within a 16-month period after arriving in the UK,the Guardian has previously reported. <https:\/\/www.theguardian.com\/society\/2021\/apr\/07\/teenage-refugee-killed-himself-uk-mental-health-care-failings>The serious nature of his mental illness was not recognised, the inquest concluded.Filmon Yemane, 18, died in November 2017 and friend Alexander Tekle, also 18, two weeks later.Osman Ahmed Nur, 19, was found dead in his local authority accommodation in Camden, London, in May 2018.An inquest heard how he was deeply affected by the self-inflicted deaths of his two friends.Olivia Anness, of Bhatt Murphy solicitors, who represented three of the four families involved, described the deaths as alarming.\"This raises serious questions about the care they're receiving in the UK and the extent to which social services and the NHS are aware of, and capable of caring for, their specific vulnerabilities,\" she said.\"These are children fleeing war and persecution who have arrived in the UK seeking refuge, and we need to know why so many are dying in our care.\"It's clear that there needs to be a public judicial inquiry into these deaths: every day that that's delayed risks further tragic and unnecessary deaths,\" she said.\"We do not know how many young people have died and [the government] do not seem to know either - so how can you be aware of the scale of this issue, how can you prevent further deaths if you're not sure how many people it affects?\" added Mr Hunter.An investigation by the charity has found more than a dozen deaths in recent years, which it describes as an \"unfolding national tragedy\".These could just be the \"tip of the iceberg\", Mr Hunter explained, as there is no requirement for coroners to record the nationality or immigration status of the people whose deaths they deal with.The government has yet to give an official response to the charities' call for an urgent independent inquiry into deaths in the asylum system. But a spokesperson said it had a dedicated team \"who are responsible for identifying vulnerable asylum seekers and supporting them with their health and social care needs\".\"Our thoughts and condolences are with Mr Gebrsslasie's family and friends at this difficult time,\" the spokesperson said.The Coventry and Warwickshire Partnership NHS Trust, which runs the Caludon Centre, said: \"We would like to express our deepest sadness for the incident that occurred on one of our inpatient wards earlier this year.\"A full investigation was under way, it added. An inquest will be heard into Henok's death in due course, said Coventry Coroner's office.Follow BBC West Midlands on Facebook <https:\/\/www.facebook.com\/MidlandsBBC\/>, Twitter <https:\/\/twitter.com\/bbcmtd> and Instagram <https:\/\/www.instagram.com\/bbc_midlands\/?hl=en>. Send your story ideas to: newsonline.westmidlands@bbc.co.uk <mailto:newsonline.westmidlands@bbc.co.uk>"}