{"author":"","title":"Birmingham Commonwealth Games: Council faces £25m shortfall","news_category":"general","content":"Commonwealth Games host city Birmingham faces a £25m shortfall, six months before the competition is due to start.Documents reveal the city council will likely be forced to use contingency funds if gap is not met in the next couple of months.Committee papers show the council was expecting to raise £75m from partners but has so far secured £50m.The council and partners are expected to provide £184.2m for the Games, with the overall cost around £778m.The Resources Overview and Scrutiny committee is due to discuss the shortfall at a meeting on Thursday.\"The council's initial expectation was that partner funding contributions towards the council's £184.2m share of the cost of the Games would be secured to the value of at least £75m,\" papers say.\"Despite extensive engagement over a number of years at both political and senior officer levels, to date it has only been possible to secure partner contributions amounting to £50m.\"The committee document also suggests it is \"extremely unlikely that any further partner contributions will be secured\".It goes on to say cabinet agreed in 2021 that the shortfall would be set aside from the council's corporate capital contingency in preparation for such an event.The Games get under way with an opening ceremony due to take place on 28 July at Alexander Stadium and thecouncil said the construction projects are on schedule. <https:\/\/www.bbc.co.uk\/news\/uk-england-birmingham-60001904>Council leader Ian Ward said earlier this month that the authority was \"determined that we will deliver not only the best Commonwealth Games but the most accessible Commonwealth Games there has ever been\".Follow BBC West Midlands on Facebook <https:\/\/www.facebook.com\/MidlandsBBC\/>, Twitter <https:\/\/twitter.com\/bbcmtd> and Instagram <https:\/\/www.instagram.com\/bbc_midlands\/?hl=en>. Send your story ideas to: newsonline.westmidlands@bbc.co.uk"}