{"author":"","title":"The thriller writers who are making a killing with crime fiction","news_category":"general","content":"British readers have become more gripped by crime and thriller novels, with sales up by 19% between 2015 and 2017, new figures suggest.The rise has been fuelled by the growth of psychological thrillers and the success of big names likeLee Child, James Patterson and Dan Brown.Last year, 18.7 million crime books were sold - 19% more than in 2015, data company Nielsen Bookscan says.They overtook sales for general and literary fiction, which were down 16%.Relative newcomer Shari Lapena is among the female authors to enjoy the boom. Her book The Couple Next Door was the bestselling novel in the genre last year.Overall, Child topped the UK crime sales chart in 2017, selling 1.2 million books worth £7.5m - followed by Patterson and Brown.Paula Hawkins, whose 2015 novel The Girl on the Train led the recent wave of psychological thrillers, was in fourth place after publishing her follow-up Into the Water.She's one of a number of authors who have enjoyed recent success with intense personal stories centred on troubled female characters. They include:A Canadian author who switched from comedy to thrillers with 2016's The Couple Next Door, about Anne and Marco whose baby goes missing while they're having dinner with neighbours. Her follow-up, A Stranger in the House, came out last year.2017 UK sales: 445,005.The former police officer's 2014 debut I Let You Go, which starts when a boy slips out of his mother's grasp and runs into the road - and is knocked down by a hit-and-run driver -was a huge success <http:\/\/www.bbc.co.uk\/news\/entertainment-arts-36855775>. Her second book I See You arrived in 2016.2017 UK sales: 233,719.After establishing herself as a fantasy author (and screenwriter for the BBC's Torchwood), Pinborough switched to psychological thrillers. The twist-tastic Behind Her Eyes took her career to the next level at the start of 2017.2017 UK sales: 135,459.Julia Wisdom, crime and thriller publisher for HarperCollins, said the rise in sales of crime fiction was mostly down to the \"phenomenal popularity\" of psychological thrillers.\"People have got sucked into these stories which are told from the first person, usually, and often with an unreliable narrator. It immerses you straight into someone's psyche rather than seeing them from the outside,\" she said.\"They often don't have very complicated plots but it's all about the build-up of suspense and fear, and you have to be completely immersed in the voice.\"Wisdom, who is also on the programming committee for the annual Theakston Old Peculier Crime Writing Festival, which takes place in Harrogate in July, said big names like Lee Child and David Baldacci \"just get bigger and bigger\".And people \"still take comfort from crime novels where bad is punished and good comes through in the end\", she said.\"There's also intrigue, suspense and mystery solving en route. But in the end, right wins out. There's some comfort in that. Those sorts of stories tax your brain a bit but they're not miserablist. In the end they make you feel better.\"Source: Nielsen BookscanCrime author Ian Rankin said that as well as having fascinating characters and gripping stories, crime fiction can show us \"the darker side of ourselves\".He told BBC News: \"Crime tells us a lot about our society, it tells us a lot about ourselves as human beings... All we human beings are capable of doing good, but we're also capable of doing terrible things to each other.\"There is a rise in these domestic noir novels, where it's pretty much ordinary people caught in these extraordinary situations. So the reader goes, well, that could be me.\"Follow us on Facebook <https:\/\/www.facebook.com\/BBCEntsNews\/>, on Twitter @BBCNewsEnts <https:\/\/twitter.com\/BBCNewsEnts>, or on Instagram at bbcnewsents <https:\/\/www.instagram.com\/BBCNewsEnts\/>. If you have a story suggestion email entertainment.news@bbc.co.uk."}