{"author":"By Vicky Baker","title":"Rainbow Caravan: The long journey to LGBT freedom","news_category":"general","content":"Two years ago, a \"rainbow caravan\" of gay men and trans women from Central America and Mexico arrived in the US to seek refuge. This is the story of their journey - and what happened next.\"Are you ready?\" says the voice behind the smartphone, which pans along a queue.Six gay men and 11 transgender women stand together in single file, clutching their papers. Just metres ahead are the revolving grilled gates of the US-Mexico border.Each member of the group looks nervous, and each has dressed for the occasion. One of the trans women, in a lacy white dress and diamanté tiara, exhales deeply and looks up at the ceiling. One of the gay men, wearing a checked shirt and smart black trousers with bleached blond hair gelled firmly into place, takes an anxious glance at a guard standing behind them.Together they have formed a caravan, an informal group of people, travelling together for safety as is common for people fleeing dangers across Central America. Theirs is the \"first Rainbow Caravan\", as they branded it.This side of the gate is in Nogales, Mexico. The other is in Nogales, Arizona. The two Nogales, as they are called, are \"united by love\", according to the local motto, but the Rainbow Caravan is not expecting a warm welcome.Among the group is Joselyn, a trans woman from Nicaragua, and Jerson, a gay man in his twenties from Honduras.The camera cuts as they step into the unknown. Jerson grew up in Honduras' industrial second city, San Pedro Sula. In 2015, it was known as the murder capital of the world.Here, he lived a double life. He had a circle of gay friends, but had to meet them in safe houses. If he saw one of them in public, he would have to pretend he did not know them.At work - in the distribution department of a pharmaceutical company - he made sure to keep his sexuality a secret.Then one day, he was called in for a routine medical check. The doctor asked a list of conventional tick-box questions. But then he asked: \"Do you like men or women?\"The question surprised Jerson. He was not sure why the doctor needed to know, but he felt he must have had his best interests at heart, so Jerson mustered the courage to answer honestly for one of the first times in his life. \"Men.\"Ten minutes after leaving the room, he got a call from human resources. They fired him. For Jerson, the connection was clear. \"I thought I will never, ever tell anyone I am gay again.\"Losing that job was not a deciding factor in leaving the county, but the surrounding fear was.Jerson's family had long been targeted by a gang for extortion. His father and his brother had already been killed. If his sexuality was known, he thought he was even more likely to be next.\"Join us or die\" is a typical threat heard from gangs in Honduras and neighbouring El Salvador. Many young men are involuntarily recruited, and for gay men this process can be even more terrifying.\"The maras [gangs] codes of conduct are very macho,\" says Adeline Neau, who has led Amnesty International's reporting on LGBT issues in the region. \"Gay men may be abused for not being 'real men', or the leaders could say they don't want them in their territory because they are not complying with the traditional rules of society.\"According to data compiled by Honduran NGO Cattrachas, 264 LGBT people were murdered in the country between 2009 and 2017. In most cases, those responsible were never brought to justice.It was December 2015 when Jerson decided he had to leave. Going to the US was not the goal at this point; he thought he could build a new life in Mexico.But first he had to find safe places to stay on the journey, and this was especially tough in other countries where homophobia was also rife. He came into luck just across the Guatemalan border, in southern Mexico, at a shelter called La 72.In 2016, La 72 opened two dormitories particularly for LGBT residents, simple rooms of six beds each, next to the general sleeping quarters.\"We noticed a growing number of LGBT migrants,\" says director Ramón Márquez. It was unclear why, he adds. Perhaps people had simply been identifying themselves more readily, as La 72 was known for offering support and security.The shelter is in the riverside town of Tenosique in Tabasco state. These borderlands have long been dangerous for migrants, as they form bottlenecks of people where criminals try to find vulnerable targets.\"What we do is just a first step,\" Ramón says. \"A few other places are opening up now too, but, importantly, minds are also opening.\"Some future participants in the Rainbow Caravan, including Jerson, managed to get some funds together to travel onward from La 72 by bus. Others had to take their chances on La Bestia, or The Beast, the notoriously dangerous train that passes through Tabasco state en route to the US border.Though the Rainbow Caravan did not fully form at La 72, crucial connections were made. Various members stayed there at different times, forming a network of wider friendships which would ultimately bring them together.Joselyn was eight when a group of elders threatened to throw her into a volcano.She had been born into an indigenous tribe, on the autonomously ruled Corn Island, 70km (43 miles) off Nicaragua's coast. Life there was even more traditional than on the highly conservative mainland.She remembers being hounded by other islanders because of the way she dressed and acted.Moving to the mainland offered no respite. At school in the western city of León, she was repeatedly bullied. She was sexually abused on the streets. And yet whenever she sought help, from school teachers or the police, she says she was not taken seriously.She says the final straw came aged 17, when she witnessed the murder of a trans friend. Fearing the perpetrator would come for her next, she fled. \"What else could I do?\" she says. \"The police would not listen. They never filed reports. I felt like nobody.\"A decade passed before she eventually became one of the first invitees to the Rainbow Caravan. The idea was mooted in an apartment in Mexico City, where various ex-residents of La 72 were staying.Joselyn was initially far from keen. \"I did not feel I had the spirit to continue,\" she says. Mexico had been no safe haven either - she had been kidnapped and sex trafficked in Jalisco state.The others in the group rallied around her. They started contacting other LGBT people - friends and vague contacts - asking if they wanted to join. It was not just about the overland journey at this point, it was about solidarity and support in putting together their asylum cases when they reached the border.\"Que tiembla los machistas!\" (Let the chauvinists tremble.) This is what the caravan chanted, with their fists in the air, when they arrived in Nogales in July 2017.The group had now fully formed. There were 16 members, plus another gay man who joined at the last minute, having seen the group parading through the streets.The caravan wanted to be seen. They knew that when they crossed the border, they would become a nine-digit number in a detention centre and the treatment would be tough. They wanted to put themselves on the NGOs' radars, so people would check in on them.The Transgender Law Centre, a Californian NGO, was numerous organisations that supported them. They helped prepare a 655-page parole request on the Rainbow Caravan's behalf, detailing the dangers they faced at home and in detention, and the reasons why they felt they were not a flight risk.For the trans women, there was some small hope back in 2017 that parole might be granted. For the men, it was unlikely.Jerson says he felt compelled to join the group after his asylum claim in Mexico was rejected.Just before crossing, he called his mother back home to tell her he might be entering detention for an indeterminable length of time. She, having already lost a husband and a son, and with two other children who had emigrated, said she understood.It was during this phone call that he came out to her. She cried and told him she loved him.\"It was torture,\" says Joselyn of what happened as soon as they crossed the border. \"First we had take our clothes off in a freezing room. Then we had to stay there for hours without any food of drink.\"The group was split in two and sent to two privately run detention facilities. The six gay men were sent to Otero County Processing Center, about an hour and a half north of El Paso, Texas, while the 11 trans women were sent to Cibola County Correctional Center, an hour west of Albuquerque in New Mexico.Joselyn says the guards used male slurs against her and told her to walk like a man. \"They said the mistreatment was our fault and when I complained, they put me into solitary confinement for six days.\"Immigration Equality, an LGBTQ immigrant rights organisation that also assisted members of the caravan, says they have heard many similar stories about Cibola. They have filed a list of recommendations for improving its conditions, including better health provisions. They say many trans women have been denied medication, such as HIV treatment and hormone supplements.The US Immigration and Customs Enforcement agency told the BBC that it has worked \"closely with the healthcare provider at Cibola to ensure the facility is able to provide appropriate treatment and medications\".More broadly, Immigration Equality has also been concerned about LGBT migrants reporting abuse in detention. According to a report by the liberal research organisation, Center for American Progress, LGBT migrants are also 97 times more likely to experience sexual assault in immigration detention than the general population.Treatment was also tough for the gay men, who were split up again and sometimes woken in the middle of the night to be moved.\"Being in detention destroys you mentally,\" says Jerson. To occupy his mind, he says he accepted a job in the centre's kitchen, getting paid a dollar a day. \"You had to sign a form to say you were doing it out of choice, but it felt like slave labour.\"Of the 17 members of the Rainbow Caravan, four of the gay men and one trans woman self-deported, because they felt the conditions in detention were so miserable and hopeless.Another gay man from the caravan was just about to start this process when he came into contact with a lawyer who insisted his case was strong. A judge later agreed and he was granted asylum. The 21-year-old remains traumatised by the experiences in his home country and in detention.Two more gay caravan members were later granted asylum after a long period of detention; the rest of the trans women were eventually released on parole. Three of them, including Joselyn, were later granted asylum, while the rest are still waiting.In a kitchen in an un-gentrified part of Brooklyn, a group of gay men are singing Latin music while cooking lunch together on a humid summer day. Among them is Jerson.He was one of the three gay caravan members to be granted asylum, somewhat to his own surprise. On the day he faced the judge, he thought: \"Everything has been so bad so far. Can anything really ever go right for me?\"It is now two years since the Rainbow Caravan crossed through the border gate in Nogales.The others members that remain in the US have scattered far and wide. One trans woman has got a job in McDonald's in California's Bay Area. The 21-year-old is in Texas, taking English lessons at a local library.All their stories would have unfolded very differently had they started in 2019.The Trump administration now insists migrants wait on the Mexican side of the border during the course of their US asylum hearings. In July 2019, it went further, declaring that those travelling from El Salvador and Honduras would not be considered for US asylum if they had passed through Guatemala first. They were told they would have to make their claims there instead.Jerson, now 31, says he was astounded by New York City when he first arrived. He was amazed he could catch the subway in the early hours of the morning, after work, without being attacked.The job he has found is in a Mexican restaurant in Manhattan, but what most motivates him is his sideline in activism with an organisation called the Queer Detainee Empowerment Project, where he has built a circle of friends.Joselyn is similarly committed to helping others and has started a safe house for trans migrants in New Mexico. \"I do not want to leave a single sister behind,\" she says.Like Jerson, she says life in the US is not easy. It can be very lonely and many businesses still don't want to employ trans people in customer-facing roles.\"But I do feel a bit protected now,\" she says. \"At least I can go to the shop.\""}