{"author":"","title":"In pictures: King Charles III's first visit to Wales as monarch","news_category":"general","content":"Families, furry friends and protestors have all turned out to meet King Charles III on his first official visit to Wales as monarch.The King, along with Camilla, the Queen Consort, attended a service in Llandaff Cathedral in Cardiff, visited the Senedd and greeted crowds at Cardiff Castle.Crowds had been gathering since the early hours to catch a glimpse of the former Prince of Wales.And it wasn't just humans who joined the crowds in the Welsh capital.Deb brought her two Jack Russell terriers down to Llandaff Cathedral to see the King in their finest attire.She said: \"He was speaking to all the children, which was beautiful and I never thought he'd come over to me.\"He came over and said 'I want to see the dogs' and asked their names. Camilla said 'I love Jack Russells' and said she's got two.\"She overwhelmed me, she's incredible. We're gonna have some Champagne to celebrate meeting the king.\"Claire, 47, has travelled with twin sons Jack and Andrew, 8, from Flintshire. They got the train at 04:22 BST.Claire said: \"It's a part of history, and I wanted to bring the boys to be a part of that because it won't happen again. Their head teacher gave them a day off.\"It's a sad occasion. [King Charles] has waited his whole life for this, but it's still really sad. I hope he will be a good King, we'll just have to wait and see.\"Elaine Rhys, 83, Ynysybwl, Rhondda Cynon Taf, said: \"I'm very fond of the royal family and I just had to be here today to welcome our new king. I can't wait to see him.\"She said she met the Queen a few years ago at a garden party. \"It's been very sad, I've had a few tears,\" added Elaine.Although most people were excited to welcome the new King, some had a different message, with one protestor among a number of anti-monarchists holding up a placard reading \"abolish the monarchy\".Mike and Justine Tone, from near Windsor in Berkshire, were at the Senedd despite having a chance to pay their respects far closer to home.Mike, 67, said: \"We live near Windsor and went down to lay flowers and will go down again Monday.\"We happened to be here by chance as we went to see Liam Gallagher in Cardiff last night so thought we should come.\"Justine, 56, believed King Charles would be outspoken about issues such as climate change.This video can not be playedGrace said she felt really excited and really pleased that she got the opportunity to meet the kingTwo young pupils from Ysgol y Wern in Cardiff, both called Grace, got the chance to see the King.The first said: \"He walked past and he talked a bit and then he laughed and carried on walking and shook hands with everyone. He was talking to my teacher and was looking at everyone he was passing.\"I felt really excited and I felt really pleased that I got this opportunity to meet the King.\"The other said: \"I didn't really expect for him to talk to us.\"He asked about exams and if we have a lot of homework and he asked if we have to go back to school and I said yes because we do have to.\"Osian, 11, from Ysgol Hamadryad in Cardiff Bay, was selected to hand the new King a posy of flowers as he welcomed him with the rest of his school.He said: \"It was really exciting but I was a bit nervous. I had to wait for ages as he talked to a lot of people.\"Tegan Skyrme, from Pembrokeshire, said the King asked her about her role in the Welsh Youth Parliament and asked about her work supporting people with learning disabilities.\"The King was talkative and he put all of us at ease. It was a huge honour to be selected to attend such a momentous occasion in history,\" she said."}