{"author":"By Yogita Limaye","title":"Afghanistan: 'I drug my hungry children to help them sleep'","news_category":"general","content":"Afghans are giving their hungry children medicines to sedate them - others have sold their daughters and organs to survive. In the second winter since the Taliban took over and foreign funds were frozen, millions are a step away from famine.\"Our children keep crying, and they don't sleep. We have no food,\" Abdul Wahab said.\"So we go to the pharmacy, get tablets and give them to our children so that they feel drowsy.\"He lives just outside Herat, the country's third largest city, in a settlement of thousands of little mud houses that has grown over decades, filled with people displaced and battered by war and natural disasters.Abdul is among a group of nearly a dozen men who gathered around us. We asked, how many were giving drugs to their children to sedate them?\"A lot of us, all of us,\" they replied. Ghulam Hazrat felt in the pocket of his tunic and pulled out a strip of tablets. They were alprazolam - tranquilisers usually prescribed to treat anxiety disorders.Ghulam has six children, the youngest a year old. \"I even give it to him,\" he said.Others showed us strips of escitalopram and sertraline tablets they said they were giving their children. They are usually prescribed to treat depression and anxiety.Doctors say that when given to young children who do not get adequate nutrition, drugs such as these can cause liver damage, along with a host of other problems like chronic fatigue, sleep and behaviour disorders.At a local pharmacy, we found that you can buy five tablets of the drugs being used for 10 Afghanis (about 10 US cents), or the price of a piece of bread.Most families we met were sharing a few pieces of bread between them each day. One woman told us they ate dry bread in the morning, and at night they dipped it in water to make it moist.The UN has said a humanitarian \"catastrophe\" is now unfolding in Afghanistan.A majority of the men in the area outside Herat work as daily wage labourers. They have been leading difficult lives for years.But when the Taliban took over last August, with no international recognition for the new de-facto government, foreign funds flowing into Afghanistan were frozen, triggering an economic collapse which left the men with no work on most days.On the rare day they do find work, they make roughly 100 Afghanis, or just over $1 (£0.83).Everywhere we went, we found people being forced to take extreme steps to save their families from hunger.Ammar (not his real name) said he had surgery to remove his kidney three months ago and showed us a nine-inch scar - stitch marks still a bit pink - running across his abdomen from the front of his body to the back.He's in his twenties, in what should have been the prime of his life. We're hiding his identity to protect him.\"There was no way out. I had heard you could sell a kidney at a local hospital. I went there and told them I wanted to. Some weeks later I got a phone call asking me to come to the hospital,\" he said.\"They did some tests, then they injected me with something that made me unconscious. I was scared but I had no option.\"Ammar was paid about 270,000 Afghanis ($3,100) for it, most of which went into repaying money he had borrowed to buy food for his family.\"If we eat one night, we don't the next. After selling my kidney, I feel like I'm half a person. I feel hopeless. If life continues like this, I feel I might die,\" he said.Selling organs for money is not unheard of in Afghanistan. It used to happen even before the Taliban takeover. But now, even after making such a painful choice, people are finding that they still cannot find the means to survive.In a bare, cold home we met a young mother who said she sold her kidney seven months ago. They also had to repay debt - money they had borrowed to buy a flock of sheep. The animals died in a flood a few years ago and they lost their means of earning a living.The 240,000 Afghanis ($2,700) she got for the kidney are not enough. \"Now we are being forced to sell our two-year-old daughter. The people we have borrowed from harass us every day, saying give us your daughter if you can't repay us,\" she said.\"I feel so ashamed of our situation. Sometimes I feel it's better to die than to live like this,\" her husband said.Over and over again, we heard of people selling their daughters. \"I sold my five-year-old daughter for 100,000 Afghanis,\" Nizamuddin said. That's less than half what a kidney goes for, according to what we found on the ground. He bit his lip, and his eyes welled up.The dignity that people here led their lives with has been broken by hunger. \"We understand it's against Islamic laws, and that we're putting our children's lives in danger, but there's no other way,\" Abdul Ghafar, one of the heads of the community, said.In one home we met four-year-old Nazia, a cheerful little girl who made funny faces as she played with her 18-month-old brother Shamshullah.\"We have no money to buy food, so I announced at the local mosque that I want to sell my daughter,\" her father Hazratullah said.Nazia has been sold to be married to a boy from a family in the southern province of Kandahar. At 14, she will be sent away. So far Hazratullah has received two payments for her.\"I used most of it to buy food, and some for medicine for my younger son. Look at him, he's malnourished,\" Hazratullah said, pulling up Shamsullah's shirt to show us his bloated belly.The staggering rise in malnutrition rates is evidence of the impact that hunger is already having on children under the age of five in Afghanistan.Médecins Sans Frontières (MSF) has seen the rate of admissions at their facilities treating malnutrition across the country increase by as much as 47% this year over the last.MSF's feeding centre in Herat is the only well-equipped malnutrition facility catering not just to Herat, but also to the neighbouring provinces of Ghor and Badghis, where malnutrition rates have gone up by 55% over the last year.Since last year, they've increased the number of beds they have to cope with the number of sick children they're having to admit. But even so, the facility is almost always more than full. Increasingly the children arriving have to be treated for more than one disease.Omid is malnourished, and has hernia and sepsis. At 14 months, he weighs just 4kg (9lb). Doctors told us a normal baby at that age would weigh at least 6.6kg. His mother Aamna had to borrow money to make the journey to the hospital when he began to vomit profusely.We asked Hameedullah Motawakil, spokesman of the Taliban's provincial government in Herat, what they were doing to tackle hunger.\"The situation is a result of international sanctions on Afghanistan and the freezing of Afghan assets. Our government is trying to identify how many are in need. Many are lying about their conditions because they think they can get help,\" he said. It's a stance he persisted with despite being told that we have seen overwhelming evidence of how bad the situation is.He also said the Taliban were trying to create jobs. \"We are looking to open iron ore mines and a gas pipeline project.\"It's unlikely that will happen soon. People told us they felt abandoned, by the Taliban government and the international community.Hunger is a slow and silent killer, its effects not always immediately visible.Away from the attention of the world, the scale of the crisis in Afghanistan might never truly come to light, because no one is counting.Additional reporting by Imogen Anderson and Malik Mudassir"}