{"author":"","title":"Hemsby erosion: Digger drags cliff edge home inland","news_category":"general","content":"A clifftop homeowner says it is a \"miracle\" his home has been moved 2m (6.6ft) inland preventing it from being demolished.Erosion on the coastline at Hemsby, Norfolk, has destroyed homes and washed away part of an access road.Attempts to move Lance Martin's home failed on Wednesday but he said he hoped the move would buy him some time.\"It has been absolutely fantastic and we've achieved what we needed to,\" he said.The coastal stretch at The Marrams has been battered by storm surges and spring tides during the course of the last 14 days.A 2,000-tonne consignment of granite has begun to arrive, which will be installed as a revetment defence on the shoreline.Demolition work by Great Yarmouth Borough Council is taking place on the north side of Hemsby Gap, a break in the dunes used by lifeboat crews to access the beach.One more home on the clifftop has been demolished following the three homes torn down at the weekend, with another due for demolition on Friday.Mr Martin, whose home is on the south side of the gap, said: \"The impossible has been done... It's just a miracle.\"He hopes to move his home further from the cliff edge once some land can be cleared, but said he believed it would take \"about five years\" before it is habitable again.\"It'll give me a future, I just love it down here, I love the people,\" he added.James Wilson, head of environment and sustainability at Great Yarmouth Borough Council, said the house had been moved \"some significant distance\".\"There's more to go and we're continuing to monitor the situation but he's moved it away from imminent danger,\" he said.Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}