{"author":"By Andrew Sinclair","title":"Ukraine refugees: Essex charity calls for more help","news_category":"general","content":"A charity has warned that finding homes for refugees should be seen as a long-term commitment, as the UK prepares to house people fleeing Ukraine.On Monday, the government is expected to announce a sponsorship scheme allowing more people to come to the UK from the war-torn country.Refugee Action in Colchester, Essex, which has helped house Afghan refugees, said more support was needed.The government said it was working to improve the intake of Ukrainians.The charity has 850 people on its books - refugees and asylum seekers from 97 countries.Upstairs at the charity's building, case workers help them with accommodation and building a new life; downstairs there is help for those struggling and a food bank.The government often uses north Essex as a first temporary home for refugees arriving in the UK.More than 200 Afghans arrived in Essex last summer. Many were later settled in other parts of the country, but some are still here and still in need of support.Case worker Shelley Braddock-Overbury said: \"We do have a handful of families who are settled in houses.\"But we still have over 100 people still living in hotels; some of them have been living there for seven months now - including 65 children, which is really quite sad.\"The scheme that was set up by the government seemed like it was very supportive, but we know there is a housing shortage everywhere and our area is no different.\"It is shame there can't be something put in place - better than people living full-time in a hotel.\"She said more support was needed from the government.\"The government support ended after a couple of months,\" she said.Dr Laith Al-Jobouri, director of the Essex branch of Refugee Action, said Ukrainians coming to this country would need a lot of help.\"They don't speak English, they have left their home, left their future, and left their jobs,\" he said.He added that many would have mental health issues which could take time to heal.\"They may have seen a bombing, people being killed or dead bodies,\" he said.\"Refugee status is not an option you choose. It is not a holiday you go and book.\"Next week, the government is expected to announce details of its sponsorship scheme for refugees from Ukraine.The BBC believes it will allow people with no connections to the UK to come here if an individual or organisation agrees to cover their costs.A government spokesman said: \"The secretary of state for levelling-up will set out a route by which the British people can offer a home to people fleeing Ukraine.\"We will be sharing further details on this over the course of the next few days.\"This is alongside our expanded family route which has already seen thousands of people apply, as well as changes to visas so that people can stay in the UK safely.\"Politics East airs on BBC One in the East on Sunday, 13 March at 10:00 GMT and can be viewed on theBBC iPlayer <https:\/\/www.bbc.co.uk\/programmes\/b019cd6x> afterwards.Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}