{"author":"By Claire Kendall","title":"Jo Wilson legacy: 'I want the world to talk about dementia'","news_category":"general","content":"Dr Jo Wilson was a respected international businesswoman and author when she was diagnosed with dementia in 2020 at the age of 66. Following her death, the BBC caught up with her husband to discuss his campaign inspired by her.\"I want the whole world to talk about dementia,\" Bill Wilson says, adding: \"I'm really not going to be happy until that happens.\"Since losing his wife in January <https:\/\/www.bbc.co.uk\/news\/uk-england-tyne-64379404>, Bill has made it his mission to campaign for better understanding of the disease.He is sure Jo is looking down on him telling him he has \"got to succeed\".The BBC has followed the couple from Newcastle since the summer of 2022 as Bill fought for support and highlighted failings with the social care system.Dementia: Fighting For My Wife <https:\/\/www.bbc.co.uk\/programmes\/p0fcl5sk>The story of Bill and his wife Jo as they fought against the system for dementia support. Charities in England are calling on the government to prioritise dementia care.Watch now on BBC iPlayer (UK Only) <https:\/\/www.bbc.co.uk\/programmes\/p0fcl5sk>The couple were waiting for weeks for Jo to be able to move into The Bradbury Centre in Newcastle, a specialist dementia care home, because of delays due to regulation and red tape.\"The system is literally on the brink of crisis,\" says Professor Martin Green of Care England.He represents care providers and believes there needs to be a \"clear national strategy\" that is funded as well as the NHS \"as the current system tends to exploit carers, rather than support them\".The Care Quality Commission says it does prioritise registrations which help provide more beds.During her wait, Jo's health deteriorated and Bill's mental and physical health suffered.Jo had only been in the home for three days before doctors said she needed end of life care.This was supposed to be a new chapter for them both, where Jo would get the support she needed and Bill would get some rest.Sadly Jo died less than a week after moving there with Bill by her side.\"I remember the strong, independent woman who knew exactly what she wanted,\" Bill says, adding: \"It was my job to make sure that she had that right up until the end.\"Bill and Jo met when they were teenagers over 50 years ago. It was a special love story, Bill says: \"Because it didn't matter what kind of adversity came our way we would get through it together and that's what we did.\"After Jo's diagnosis, she started going to the day centre at The Bradbury, run by the charity Dementia Matters. Because Bill and Jo had savings they didn't qualify for local authority funding and so they had to pay for Jo's care.During some of the toughest times caring for Jo, the staff and the chief executive Bev Reid went above and beyond to support both Jo and Bill.Jo used to have carers who helped at home each morning and night. After their visits were cancelled due to lack of staff, Bev arranged for carers at the centre to give Jo her tea and get her ready for bed so Bill could collect her and take her home each night.\"I owe my life to Bev,\" Bill says, adding: \"I may well not have been here now had it not been for her.\"She knew when I was hitting the bottom and did something about it. To me she's just an absolute star.\"Jo's funeral was on 21 February. She was 69 years old. Two weeks later Bill returned to The Bradbury Centre, the place where Jo died. A photo of Jo sits next to a vase of flowers on the counter in reception. This is a new start and a new challenge for Bill. He has teamed up with Bev to campaign, fundraise and increase awareness of dementia - all in Jo's name.\"It's a cruel and awful disease,\" Bev says. She and Bill are now focussing on supporting as many patients and families as they can saying \"nobody should be suffering this dreadful and difficult time on their own\".They are now planning to speak out for families and dementia patients, talk at conferences, fundraise and offer guidance on available benefits and support.They both feel frustrated that government policies haven't led to more improvements.\"How many years now have we heard that dementia is going to be given greater priority?\" Bev says, adding: \"That things are going to change? But nothing has, it feels, so far.\"We need some political will, Bill says, to cut through that fog of \"it's too big\" and \"too expensive\".Alzheimer's Society says it is very concerned that diagnosis rates have dropped and said dementia needed to be a government priority.\"The care and support is not there and what happens is that people will end up in hospital often in crisis,\" says Fiona Carragher, the charity's director of research, adding: \"We need support and focus on now.\"Minister for Health, Helen Whately, said she wanted the government to \"do everything possible to help those\" with the \"cruel disease\" and the families.\"That means early diagnosis for those who seek it, care and support for those who need it, and easy to find information and advice for everyone,\" she said.Ms Whately said £7.5bn was being invested into social care over the next two years with £17m allocated in 2022 to tackle dementia waiting lists and increasing diagnosis rates.Bev's desire for change is all rooted in the families they see and hear from every day, she says, adding: \"I always feel that I should do my very best every day for the people that need us.\"For Bill, Jo's memory is always at the forefront of his mind.\"There is more to life than this disease,\" he says, adding: \"Look beyond it. Look at the person that you love so dearly.\"As Bill said at Jo's funeral, they never spent a day without love and laughter.Follow BBC North East & Cumbria on Twitter <https:\/\/twitter.com\/BBCNEandCumbria>, Facebook <https:\/\/www.facebook.com\/bbcneandcumbria> and Instagram <https:\/\/www.instagram.com\/bbcneandcumbria\/>. Send your story ideas to northeastandcumbria@bbc.co.uk <mailto:northeastandcumbria@bbc.co.uk>."}