{"author":"","title":"How are 'kamikaze' drones being used by Russia and Ukraine?","news_category":"general","content":"Russia is planning to \"exhaust\" Ukraine with attacks using Iranian-made drones, President Volodymyr Zelensky has said.It has been accused of launching waves of so-called \"kamikaze\" drones against Ukrainian cities and power stations in recent months.Ukraine's government and Western intelligence agencies say Russia has been usingIranian-made Shahed-136 drones in the conflict since autumn last year <https:\/\/www.bbc.co.uk\/news\/world-europe-63294698>.Also called the Geranium-2 by Russia, it has explosives in a warhead on its nose and is designed to loiter over a target until it is instructed to attack.The Shahed-136 has a wingspan of about 2.5m (8.2ft) and can be hard to detect on radar.Iran's government says it supplied \"a small number\" of drones to Russia before the war <https:\/\/www.reuters.com\/world\/iran-acknowledges-drone-shipments-russia-before-ukraine-war-2022-11-05\/>.But the US and the European Union have accused Iran of sending regular deliveries of drones to Russia, andthe EU has imposed sanctions in response <https:\/\/www.reuters.com\/world\/eu-agrees-new-iran-sanctions-over-drone-deliveries-russia-eu-presidency-2022-10-20\/>.Defence experts think Russia may be using Shahed-136 drones rather than cruise missiles for air attacks because they are relatively cheap - about $20,000 (£17,800) each.Russia was first reported to have used a Shahed-136 drone on 13 September, attacking military targets in the Kharkiv region in the east of the country.Since then, Russia has made repeated attacks with drones on both military and civilian targets in the areas of Kyiv, Odesa and Mykolaiv.Ukraine says Russia launched more than 80 Iranian-made Shahed drones on 1 January and 2 January, but claims to have shot all of them down.Russia often targets power stations, to deprive Ukraine's population of electricity and heating during the winter months.Ukrainian armed forces have used small arms fire, heavy machine guns, portable anti-air missiles and electronic jamming devices to try and shoot down drones.This can be difficult when they are sent in large numbers, or \"swarms\".However, Ukraine says its air defences have managed to shoot down over 80% of all the drones Russia has sent against it.The US has said it is supplying Ukraine with 700 of its Switchblade kamikaze drones, but it is not known whether any have yet been used.Experts say Ukraine used kamikaze drones of some sort last autumn to attack a Russian military base in western Crimea, an airbase near Sevastopol, and ships in Sevastopol harbour.Russia says Ukraine also used kamikaze drones in December for three separate attacks on airbases at Saratov and Ryazan - both hundreds of miles inside Russian territory.Ukraine's main military drone is the Turkish-made Bayraktar TB2. It is about the size of a small plane, has cameras on board, and can be armed with laser-guided bombs.A Bayraktar drone was used in the attack which sank the Russian warship Moskva in the Black Sea <https:\/\/www.bbc.co.uk\/news\/world-europe-61103927> in April 2022.Russia also uses the smaller, more basic Orlan-10, which has cameras and can carry small bombs.For both sides - Russia and Ukraine - drones have been effective for locating enemy targets and guiding artillery fire toward them.In the past, observers might have had to spend 20 or 30 minutes pinpointing a target, says Dr Jack Watling, defence analyst at the Royal United Services Institute.Now, however, he says: \"Russian forces can bring their guns to bear on the enemy within only three to five minutes of an Orlan-10 drone spotting the target.\"Dr Marina Miron, defence researcher at Kings College London, says drones have allowed Ukraine to stretch its limited forces.\"If you wanted to seek out enemy positions in the past, you would have had to send out special forces units... and you might have lost some troops,\" she says. \"Now, all you're risking is a drone.\"The main problem in using military drones is that they are large and slow moving, and are easy to shoot down.They are also expensive to replace - a single Bayraktar TB2 costs about $2m (£1.7m).Both sides in the war - but especially Ukraine - have increasingly been using small, cheap commercial models of drone <https:\/\/www.bbc.co.uk\/news\/world-europe-62090791> such as the DJI Mavic 3, which costs about £1,700.These can be fitted with small bombs, but are mainly used to spot enemy troops and to direct attacks.However, commercial drones are much less capable than military ones. For example, the DJI Mavic's total flying distance is only 30km, and it can only fly for a maximum of 46 minutes.Russia is using electronic devices to counter them, says Dr Miron.\"Russian forces have the Stupor rifle, which shoots electromagnetic pulses,\" she says. This stops commercial drones from being able to navigate using GPS, she explains.Russian forces have also used online systems, such as Aeroscope, <https:\/\/www.bbc.co.uk\/news\/world-europe-62090791> to detect and interrupt communications between commercial drones and their operators.These systems can cause a drone to crash or return to base, and can stop it sending back information."}