{"author":"","title":"Charles Bronson cleared of trying to attack prison governor","news_category":"general","content":"Notorious inmate Charles Bronson has been cleared of trying to seriously harm a prison governor.Bronson, 66, had been accused of attacking Mark Docherty and threatening to gouge his eyes out at HMP Wakefield.He told Leeds Crown Court he had meant to give the governor a \"gentle bear hug\" but tripped and fell.Bronson did a celebratory jig as jurors found him not guilty and he then described British justice as \"the best in the world\".After the verdict, judge Tom Bayliss QC said to Bronson, who has changed his named to Charles Salvador: \"You seem pleased with that, Mr Salvador.\"Appearing on video link from HMP Frankland, Bronson, who is currently serving a life term for robbery and kidnap, smiled and replied: \"British justice, best in the world. Thank you.\"Mr Docherty told the court that Bronson, who represented himself, had attacked him at the start of a welfare meeting at the jail on 25 January before prison officers restrained the inmate.More news from across Yorkshire <https:\/\/www.bbc.co.uk\/news\/live\/uk-england-leeds-46140845>Bronson admitted that he partly blamed the governor after he was told photographs of his prison wedding to Paula Williamson in November 2017 would not be allowed to leave the jail until his release.But he denied attacking the governor and said he intended to whisper \"where's my wife's photos\" in what he described as a \"wake-up call\" to the prison chief to not mess with his family.During his trial, Bronson admitted he had been a \"very nasty man\" in the past, as he described to the jury how in his 44 years in prison he had held 11 hostages in nine different sieges - including governors, doctors, staff and, on one occasion, his solicitor.But giving evidence, he told jurors that for the first time in his life he was an \"innocent man\".Bronson said: \"Since when is it a crime to hug your fellow man? There is not enough man hugs in this insane world today.\"I say from my heart and my soul, it's a sure way of bonding and bringing peace on earth.\"It should not be a criminal offence to show a little humanity, especially inside our prisons and asylums.\"He told the court that he was in a Category A prison \"still in isolation, probably will be for years to come\" but his \"life was picking up\" in recent times.Jurors found Bronson not guilty of attempting to cause grievous bodily harm with intent after deliberating for less than three hours."}