{"author":"By Huw Thomas","title":"Ukraine conflict: Tanker with Russian oil diverted from Wales","news_category":"general","content":"A tanker carrying Russian oil has changed course from a Welsh port to one in Belgium for the second time.MT Louie was heading from the Russian port of Primorsk to Milford Haven in Pembrokeshire, but has changed course twice amid confusion over sanctions.It is off the south-east coast of England and shipping data shows its destination has reverted to Antwerp.It was due to dock on Friday at the Puma Energy terminal, but the firm said it would not be calling there now.It was diverted to Antwerp amid confusion over sanctions on Tuesday, then it was back on course to Milford Haven, but has now diverted once again to Antwerp.While the UK has banned vessels associated with Russia, there is no ban on cargo such as oil and gas that has originated in the country.Wales' First Minister Mark Drakeford said it was \"inevitable\" companies would try to find ways around the UK ban on Russian-linked vessels.\"Those with other interests will look for loopholes in those arrangements and try to find ways of working around them,\" he said, calling for action at UK level to \"close any loopholes\".Mr Drakeford said he would raise the issue with UK ministers in the coming days.Conservative MP Stephen Crabb, whose constituency includes Milford Haven, wants all Russian cargo banned from Welsh ports.A UK government spokesman said current sanctions only affected ships which were owned, controlled or operated by people connected to Russia, \"designated persons\", or ships which are Russian flagged or registered.\"Ships carrying cargo to or from Russia are not within the scope of the current transport sanctions,\" the spokesman said.Preseli Pembrokeshire MP Mr Crabb said it was \"simply not acceptable\" that Russian cargo could still enter UK waters.Transport Secretary Grant Shapps wrote to ports on Monday <https:\/\/twitter.com\/grantshapps\/status\/1498324731635843074>, telling them to block access to Russian \"flagged, registered, owned, controlled, chartered or operated vessels.\"Adam Price, leader of Plaid Cymru has also said the ship should not be allowed to dock at a Welsh port and its cargo must not be offloaded into Wales. \"There can be no ambiguity on the matter,\" he said.\"There must be a complete and total economic, political, diplomatic and cultural isolation of Russia - the gravity of the situation demands it and the lives of the citizens of Ukraine may well depend on it.\"Mr Crabb said the Louie should be blocked from entering Welsh waters because of its cargo.The tanker sails under the flag of the Marshall Islands, but carries cargo from the Russian oil-loading port of Primorsk.\"Many people in the community feel strongly that even accepting cargo that has come from Russia is just simply not acceptable given the appalling situation in Ukraine,\" Mr Crabb said.He supported the UK government moves to ban Russian ships, but said it \"needs to go further\".He said: \"The source of the cargo needs to be included in the government's sanctions.\"Today, I have written to the Transport Minister Grant Shapps, asking for more action to extend the legislation to take the cargo into consideration.\"The Louie was due to deliver its cargo of oil to the Puma Energy refinery in Pembrokeshire.In a statement, Puma Energy said: \"We will continue to comply with all applicable sanctions and regulatory requirements.\"At present, sanctions imposed by the UK government have not targeted the import of fuels into the UK, however, this ship has been diverted and it will not be calling at Milford Haven.\""}