{"author":"","title":"Australia trade deal will not hit UK farmers, says Liz Truss","news_category":"general","content":"A new trade deal between the UK and Australia will not harm British farmers' livelihoods, the trade secretary has told the BBC.Liz Truss denied that imports of Australian beef would flood the UK and said British export markets would grow.The pact - the first to be built from scratch since the UK left the EU - will cover British goods such as cars, Scotch whisky, biscuits and ceramics.But some UK farmers fear they may be undercut on price and standards.Speaking to the BBC's World at One programme, Ms Truss said: \"At the moment there are extremely small quantities of Australian beef coming into the UK.\"So what we'd be looking at here is over time some of the EU imports [lost due to Brexit] being replaced by Australian imports.\"She added that the deal - which is seen as an important step towards the UK joining a wider Asia Pacific free-trade agreement - would also create opportunities.\"We can see the evidence, that sales of British beef international are growing to places like Asia-Pacific and the United States because people want to buy high quality British products produced in a high animal welfare way,\" Ms Truss said.She said by 2030, 66% of the world's middle classes will be in Asia and they want to buy products such as whisky, cars, beef, and lamb from the UK. \"We need to be positive about what we've got to sell rather than being defensive,\" she said.However, Dominic Goudie, head of international trade at the Food and Drink Federation, expressed concern about the lack of detail in the deal.\"It is now vital that we know the detail of what has been agreed to help businesses understand and begin to prepare for the new terms of trade,\" he said.\"The terms must also ensure that consumers have continued confidence that any agreement maintains the highest food safety and animal welfare standards.\"National Farmers' Union president President Minette Batters said: \"While the government has previously been keen to highlight how our free trade agreements will uphold our high standards of food production, there has always been a question mark over how this can be achieved while opening up our markets to food produced to different standards.\"We will need to know more about any provisions on animal welfare and the environment to ensure our high standards of production are not undermined by the terms of this deal.\"This video can not be played'We don't have enough beef to flood the UK market'Under the deal with Australia, the government says farmers will be protected by a cap on tariff-free imports for 15 years, using tariff rate quotas and other safeguards.But some UK farmers have concerns there will be no meaningful safeguards in place to stop them being undercut by cheap imports.Farmers in Australia are allowed to use some hormone growth promoters, pesticides, and feed additives that are banned in the UK.The UK Trade and Business Commission is worried that Australian farming operates on a scale that UK counterparts cannot compete with, saying Australia contains eight of the 10 largest farms in the world, including one which is larger than Israel.According to the UK's National Farmers Union, Australian farmers are able to produce beef at a lower cost of production, and could undercut farmers in the UK.But Ms Truss said the deal would be fully scrutinised by the Trade and Agriculture Commission and MPs could block it if they were not happy.She added that it would create better access for UK digital and financial services and better arrangements for UK citizens who want to work in Australia.Welsh lamb and Australian wine are said to have been on the menu as Boris Johnson and Scott Morrison settled the deal over dinner - but ultimately this deal is more significant in symbolic than economic terms.For the government's own estimates say the new arrangements may add just 0.02% to our GDP, and the impact on prices is negligible.But this, the first bespoke deal of the post-Brexit era, signifies global Britain's ambitions. The hope is that this paves the way for more alliances beyond the EU - starting with a group of trans-Pacific nations, the CPTPP. They only buy 8% of our exports - and we have deals already with the majority of members. But the ultimate hope is that key partners - such as the US - might also join.It also symbolises though, the sacrifices that may be needed to get deals. British farmers fear they will face more competition from Australian counterparts on their home soil. Australian farmers say they won't be flooding the market. The UK is so far away that even the 80% increase in Australian imports the government predicts equates to 0.1% of total UK imports.It'll be a while before the detail of this deal can be publicly scrutinised - even by those who'll be affected. But the concern is that this sets a marker, that agriculture may be up for grabs when it comes to compromise in future and far bigger trade deals.The UK government has signed a long list of trade deals <https:\/\/www.bbc.co.uk\/news\/uk-47213842> over the past year, but they have been rollovers of those the UK already had as part of the EU.In 2019-20, trade in goods and services between Australia and the UK was valued at £20.1bn. <https:\/\/www.dfat.gov.au\/trade\/agreements\/negotiations\/aukfta> The government says the deal will boost UK industries that employ 3.5 million people across the country.Metals, wine and machines <https:\/\/www.ons.gov.uk\/businessindustryandtrade\/internationaltrade\/articles\/uktradingpartnersananalysisoftraderelationships\/2020> have formed the biggest goods exports from Australia to the UK, while Australia'smain UK imports <https:\/\/www.dfat.gov.au\/geo\/united-kingdom\/Pages\/united-kingdom-country-brief> are cars, medicines and alcoholic drinks.Trade in meat between the two countries is small at present, with 14% of sheep meat imports to the UK coming from Australia and just 0.15% of all Australian beef exports going to the UK.\"A deal would be good for my exports if there's a drop in the tariffs but if we start importing more I might be faced with more competition here,\" says Mary Quicke, owner of Devon-based artisan cheesemaker Quicke's.She exports about 10% of her produce to Australia, but is more concerned about Europe. \"I would rather they had another look at the Brexit deal and ironed out a lot of the problems there.\"There's a dreadful amount of paperwork for exporting to the EU right now, it's a complete nightmare.\"I want to preserve our beautiful patchwork of British farms, so I'm cautious. Our milk is produced with half the carbon footprint of milk worldwide so it's really important that we don't just create a worse environmental footprint.\"The deal marks the end of what has essentially been a 50-year lock-out for Australian farmers, who have struggled to navigate Brussels' restrictions, tariffs and quotas.The president of the Australian National Farmers' Federation said it had been very difficult to break into the UK because it was \"way too expensive and way too far\".Australian farmers have also been looking to diversify due to the increased tensions between Australia and China. In the past year, China has imposed tariffs and restrictions on everything from Australian beef, barley and wine, to rock lobster and coal."}