{"author":"By Brandon Drenon","title":"14 whale deaths along US East Coast remain a mystery","news_category":"general","content":"Local officials and environmentalists are trying to find out what is behind the mysterious death of 14 whales along the US east coast since 1 December.Some are blaming the deaths on the development of an offshore wind farm in the area.Officials, however, say they have found no evidence to suggest wind farms are to blame.Since 2016, they have been tracking the \"unusual mortality\" of humpback whales along the eastern shores.Over the past six years, the National Oceanographic and Atmospheric Administration (NOAA) tallied 178 dead humpback whales from Florida to Maine.NOAA performed necropsies on about half the whales and found that of those, 40% of the deaths were caused by human interaction, either being caught in fishing gear or struck by vessels.Sperm whales, an endangered species, have also been found dead along the eastern coasts.The most recent death of a humpback whale, which washed ashore in Maryland on 16 January, prompted a press conference by NOAA officials and the Bureau of Ocean Energy Management (BOEM), as it came amid mounting concerns a local wind farm development was to blame.\"There is no information supporting that any of the equipment used in support of offshore wind development could directly lead to the death of a whale,\" said Benjamin Laws, deputy chief for permits and conservation with NOAA Fisheries Office of Protected Resources.\"There are no known connections between any offshore wind activities and any whale stranding.\"There are multiple factors possibly contributing to an increase in whale stranding along the mid-Atlantic coast, federal officials and local experts said. They noted the humpback whale population has increased and that more of them are swimming into New York and New Jersey while following menhaden, a fish the whales eat.Menhaden swim in an area where there is a major shipping lane for freights coming into New York and New Jersey ports, which can increase the chances of being struck.Also, climate change and warming oceans can effect the migration pattern of whales as they follow their food or move to waters with more favourable conditions, said Lauren Gaches, director of public affairs for NOAA Fisheries.Sarah Wilkin, coordinator of the Marine Mammal Health and Stranding Response Program in NOAA Fisheries' Office of Protected Resources said there have been several years of elevated large whale strandings but \"we are still concerned about the pulse over the past six weeks or so\".\"We want to know the answers.\"Federal regulations require vessels conducting offshore wind activities to meet several requirements designed to avoid whales and other marine mammals, officials said.One requirement is that there be observers on board whose sole purpose is to watch out for marine mammals.This video can not be played\"Oh my gosh!\"Most of the survey work currently being done for the wind farm is to examine the ocean floor for the suitability of future wind turbines and for laying cables. It is not known to seriously harm whales, said Brian Hooker, leader of a biology team with BOEM's Office of Renewable Energy Programs.Mr Laws also denied that sonar equipment - used to map the ocean floor by wind companies - was harming the animals, since the use of sonar levels loud enough to be fatal to whales and other marine life is prohibited.That has not stopped some, including federal and state Republican lawmakers, from calling to halt development of the wind farm off the coast of New Jersey and New York.Clean Ocean Action, a local campaign organisation focused on protecting waterways, has called for an investigation into the \"unprecedented whale deaths\"."}