{"author":"","title":"Social care: 'The worst it's been in my 36 years in care'","news_category":"general","content":"Home care providers say care workers are leaving their jobs because of the rising costs of fuel and reluctance to work long hours after the pandemic.At the same time the demand for social care is rising and hospitals are facing backlogs as they say they havepatients they cannot discharge without care in place <https:\/\/www.bbc.co.uk\/news\/uk-england-norfolk-62155110>.How are care providers coping and what can be done to solve the issues?Prema Fairbourn, is chair of the Suffolk association of independent care providers and runs Primary Homecare, which provides carers to go into people's homes.\"All care agencies are having that same problem that they do not have enough staff,\" she says.\"At one point I had about 80 members of staff but that has dropped now to about 47, that's a big drop.\"I think staff have had a big rethink since the pandemic and their work\/life balance is more important to them.\"So they are look at the unsocial hours they have to do in the care sector and they don't want to do it.\"Fuel costs are also an issue she says. \"Whatever we pay them a lot of it is swallowed up.\"While there are fewer carers in the industry, Ms Fairbourn says: \"The demand is great and the backlog in the hospital lists is huge and I don't know how they are going to service all those [care] packages.\"She says falling staff numbers and rising demand is \"impossible to reconcile\".\"I've been in the industry for 36 years and I've never come across anything like this, it's the worst that it's been.\"I'm ready to throw in the towel.\"She says the government needs to \"cut the red tape\" to find more carers and also provide more money to the sector so providers can \"pay our staff realistic wages\".Elaine Bolton is a home care worker and has worked for nearly 10 years in the care industry.\"We're a lot busier but the only thing we're having trouble with is the price of petrol because we go all over,\" she says.She explains carers are saying \"they just can't afford\" the fuel for home visits.\"It isn't justifying working when you're spending a chunk of your wages on petrol,\" she says.But she adds: \"I do love it. You've always got time to talk to them and you get to know them and get to know their family.\"We go the extra mile, do extra things for people.\"She says patients are grateful to be able to get care at home \"because they've got happy memories in their homes\".One those who is getting care at home is Anne Nunn, who lives in Bury St Edmunds.The 88-year-old returned home this week after spending nearly a month in hospital recovering following breaking her leg in a fall in Spain.She says \"the trauma\" of having to receive care \"has affected me rather the actual break\".\"It's made me feel I've just lost my independence and confidence, which is not like me,\" she says.But after an assessment at home she says: \"I feel I'll be able to do more than I thought I would, my mind tells me I should do more, my body doesn't always agree.\"Ms Nunn will receive four visits a day as part of her care plan, which will last for six to seven weeks.\"I'll do my upmost to make sure I can go out for walks like I used to. I'm determined to be able to look after myself,\" she says.In an effort to get patients out of hospital and back home, the NHS in Suffolk and the county council areworking together to assess people in their own home <https:\/\/www.suffolk.gov.uk\/care-and-support-for-adults\/help-to-stay-at-home\/returning-home-from-hospital\/home-first\/>.Ian Markham, a NHS occupational therapist, says the team step in \"when someone is medically well within the hospital but the therapists say they need additional support on coming home\".He says: \"Hospital are a great place but if you can come home into your own environment, you can be supported around your things.\"It's a much better environment for you to get well in, with the support.\"He says the approach of assessing people in their own homes \"works in terms of getting people home and them being able to be supported\".But he adds: \"People aren't necessarily aware of how things are going to be when they get home and they have great aspirations of how it's going to be and that means we need to bring in additional care.\"Department of Health and Social Care said in a statement it was \"investing £5.4bn over the next three years to end spiralling care costs and support the workforce.\"This includes £3.6bn to reform the social care charging system and enable all local authorities to move towards paying providers a fair cost of care, and a further £1.7bn to begin major improvements across adult social care in England, funded by the Health and Social Care Levy.\"This funding was additional to money \"to help councils respond to rising demands and cost pressures\", it added.Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}