{"author":"By Clodagh Rice","title":"Giant's Park: £25m virtual production studio to be built","news_category":"general","content":"A £25m cutting-edge virtual production studio is to be built at Belfast's Giant's Park by 2024.The project, called Studio Ulster, has been funded by money from the Belfast Region City Deal.It will be developed in partnership with Belfast Harbour, Ulster University and NI Screen.It aims to build on the global reputation Northern Ireland has developed as a location for the film and TV industry.Speaking at the launch, Economy Minister Gordon Lyons said: \"The industry is now a major contributor to our economy, with estimates by Northern Ireland Screen suggesting the last three film and TV productions have together been worth more than £100m to the economy.\"It is estimated the project will support 461 direct and indirect jobs in the screen sector.It will be used not only by industry, but also by students to help grow the talent pool for the creative industries.Ulster University vice chancellor Paul Bartholomew said: \"For many years we have been responding to industry reports of skills requirements and shortages through the Ulster Screen Academy, offering students innovative film and broadcast, animation, games and immersive technologies courses to help deliver the much needed skilled workforce to drive the screen industries forward.\"It is hoped the project will be completed by the second quarter of 2024.Chief executive of Belfast Harbour Joe O'Neill said: \"The UK market for film and content production has continued to strengthen and this project will serve to further increase Northern Ireland's global competitiveness in the creative industries sector and help to attract leading production companies to both the traditional stages and the virtual production facility.\"The new virtual production stage is set be the first dedicated studio of its kind in Northern Ireland.Northern Ireland Screen chief executive Richard Williams said: \"Virtual production has really shaken up the screen industries and Studio Ulster will be transformative for our industry here in Northern Ireland.\""}