{"author":"By Katherine Sellgren","title":"Coronavirus: Young carers say they can't get a break","news_category":"general","content":"Anxiety over the coronavirus and the restrictions of lockdown have increased the burden on young carers, a study by the University of East Anglia finds.The research says young carers, who might have to look after their parents, are unable to get enough support.It says school closures have hit young carers hard, with the lack of routine increasing pressure at home and robbing them of somewhere they \"can feel safe\".\"I can't get a break, I can't even get five minutes,\" says 17-year-old Olivia.She told the University of East Anglia (UEA) researchers that her mother's need for emotional support during the pandemic was relentless.\"She becomes anxious, then annoyed, then angry and neither of us can walk away now, so I just have to take it.\"Another young carer, Elizabeth, aged 19, said: \"Being locked in together like this is a difficult thing\" and that when her father has a bad day, it turns \"into my bad day too\".The researchers carried out in-depth interviews with 20 participants, some of whom cared for two or three members of their household with a wide range of both physical and mental health needs.The tasks for young carers ranged from cooking, cleaning, organising bills and managing medication, to providing emotional support - \"keeping him happy and calm\" and \"making sure mum doesn't hurt herself\".The study <https:\/\/www.caringtogether.org\/wp-content\/uploads\/2020\/06\/UEA-young-carer-CRCF-COVID-19-final-findings-v1.0.pdf> found that school-age young carers missed the routine and respite that school provided, describing it as a break away from home and their caring role and a place where they felt they could focus on themselves.Olivia said that attending sixth form was a release for her because \"school has always been a place away that I can feel safe\".For Grace, aged 15, teachers who knew her well would \"pick up on when things were bad at home\" and this, alongside their willingness to listen, made her feel that \"someone noticed and someone cared\".Ethan, 17, described schools as the only place where he could \"get breathing space\".The report says the loss of school and established routine also had an impact on the physical and mental health of parents, which in turn often increased the burden on the young carer.The study found informal support had been withdrawn - such as shopping deliveries, childcare and cleaning services - with the additional tasks \"taken on, in many cases, by the young carers\".They were also fearful of going out and passing on the virus to other members of their household.The lack of support from friends and wider family was difficult for the young carers and their families.Katie, aged 18, told researchers that the speed of the lockdown restrictions gave young carers and their families limited time to adapt to the changes.\"The restrictions of lockdown increased the young carers' caring load, preventing them from getting a break or from turning to their established coping strategies such as spending time with friends, engaging in a hobby or going for a long walk,\" the report says.Despite the difficult circumstances, many of the young carers felt that to \"moan\" about the pressures would be \"selfish\" and insensitive towards the person they were caring for.The study says the pandemic will have \"far-reaching implications for young carers\".\"While it would seem that children and young people are less likely to experience significant physiological effects from the virus itself, the indirect impact of attempts to counter the spread of the virus are highly likely to have a major impact on their psychological well-being.\"Alongside this, the support systems in place are struggling under increased pressure, potentially drawing the focus away from the needs of these marginalised young carers.\"Lead researcher Dr Kate Blake-Holmes said the increase of pressure and stress for young carers was \"palpable\" during many of the interviews.Andy McGowan, from the charity Caring Together, which supported the research, said: \"The Covid-19 pandemic has caused additional problems for young carers, while at the same time making it harder for them to access support to help them in their caring roles or get a break from their responsibilities.\"A government spokeswoman said: \"We want to make sure that young carers get the support they need and are able to take advantage of opportunities beyond their caring responsibilities.\"That's why we're investing in the See, Hear, Respond <https:\/\/www.barnardos.org.uk\/support-hub> service, which will provide targeted support to vulnerable children, including young carers.\"There are an estimated 800,000 young carers in the UK providing care for their families.Follow Katherine on Twitter <https:\/\/twitter.com\/KESellgren>"}