{"author":"","title":"Gary Lineker: BBC Radio Wales' Call Rob Phillips show replaced","news_category":"general","content":"A BBC Radio Wales football programme was not broadcast as BBC sports coverage faces major disruption due to the Gary Lineker impartiality row.The station's Call Rob Phillips show <https:\/\/www.bbc.co.uk\/programmes\/b038rqjx> was replaced by a replay of a classical concert celebrating 100 years of the BBC in Wales.It came after Welsh presenter Jason Mohammad tweeted to say he would not be presenting Final Score <https:\/\/twitter.com\/jasonmohammad\/status\/1634502438064648192> on BBC One.Lineker was told to \"step back\" from presenting Match of the Day <https:\/\/www.bbc.co.uk\/news\/uk-64920557> on Friday. Several BBC TV and radio sports shows have been cancelled as presenters stood in solidarity with Lineker.The BBC said Lineker had breached its social media guidelines by tweeting about the government's new migration law <https:\/\/twitter.com\/GaryLineker\/status\/1633111662352891908>.He was told to step back from presenting Match of the Day until an agreement is reached on his social media use.The move has led to Saturday's Match of the Day going ahead without presenters or pundits - as one by one contributors ruled themselves out.First, Ian Wright said he would not appear, tweeting: \"Everybody knows what Match of the Day means to me, but I've told the BBC I won't be doing it tomorrow. Solidarity.\"Other presenters on the show, Alan Shearer, Jermaine Jenas and Micah Richards, soon followed suit.Lineker has not yet publicly commented but while presenting 5News earlier, former BBC presenter Dan Walker read out a text live on air from the 62-year-old.Walker said he had messaged Lineker asking: \"What is happening. Are you stepping back?\"He said he had received a reply saying: \"No, they've [the BBC] told me I have to step back.\"A BBC spokesman said: \"The BBC will only be able to bring limited sport programming this weekend and our schedules will be updated to reflect that.\"We are sorry for these changes which we recognise will be disappointing for BBC sport fans.\"We are working hard to resolve the situation and hope to do so soon.\"There was support for Lineker in the crowd among Swansea City supporters on Saturday.Fans supporting the team in their game against Middlesbrough were seen holding up a sign reading \"Gary, Gary, Gary Lineker - stand up to racism\"."}