{"author":"","title":"'Why I recreate famous movie scenes online'","news_category":"general","content":"On a windswept Welsh beach, Thomas Duke is searching for the perfect shot. As he pauses and looks to sea, a photo is retrieved from somewhere about his person. He holds it up to the horizon. This is the place.For a few days, almost a decade ago, the beach was a hive of activity - home to a film crew and a newly-constructed cottage as the penultimate instalment of the Harry Potter series was filmed.The cottage and the film crew are long gone but Thomas, a 20-year-old film student, is paying homage to the scene by pinpointing the spot where it was filmed and recreating it photographically.In the last 18 months, Thomas estimates he's visited 150 film locations. He posts the results to Instagram <https:\/\/www.instagram.com\/steppingthroughfilm\/>, where he's built an audience of nearly 15,000 followers.\"The idea's always been in my head,\" he explained to the BBC. \"I just love exploring places and linking that with my passion for film. It was my first time in Wales. I'd heard it was beautiful and it really was. I took the coastal bus.\"I always want to visit the scenes that mean the most to me. I can visit the places that I've only seen on screen.\"\"This was a really long day. I got up at 4am and went down to Heathrow to try and find the right terminal for a different Love Actually scene.\"From there I went back into central London to do the rest of the scenes. The film is so influential and memorable. Plus it was nearly Christmas, so I really wanted to do it.\"\"I really wanted to capture a scene from Les Miserables. This scene is so powerful with the iconic song. It builds and builds... until the cast slowly trickle out the words 'Do you hear the people sing?'\"The naval college is really prolific in film location and it was a really nice place to shoot.\"\"I try to give a meaning to each post I do and each film I visit. I took this on the weekend of Armistice Day 2018.\"Dunkirk is a beautiful film. So I thought, why not go to Dunkirk?\"\"This was my childhood really. When I was younger I'd wake up every morning at 5am and watch Mary Poppins, Bedknobs and Broomsticks or Chitty Chitty Bang Bang.\"I was going through looking at all the different doors and windows and they all looked the same.\"It was lovely.\"\"It's a lovely place, and because Cambridge is quite local to me it was quite easy to do.\"It's very picturesque.\"You can sit on the green bank and it's so quiet.\"\"I love Wonder Woman. I've done a few scenes from the movie.\"Hatfield House is quite nearby and such an amazing location.\"I got there and the gold roof was mesmerising. It worked really well with the photo.\"I'd love to go back as it's also where The Favourite, for which Olivia Colman just won an Oscar, was filmed.\"\"This was really hard to do. I knew I wasn't going to find the exact same carriage as they used.\"I saw that the Jubilee Line was like that and it was a case of waiting for a train with yellow poles and getting on. I had to wait until it reached the end of the line so I could take the picture without being in people's way.\"\"The most to come out of this has been Edgar Wright and his films. He shared <https:\/\/www.instagram.com\/p\/Bt3YE9IHiBI\/> a scene I did from Shaun of the Dead on his Instagram.\"Letchworth is an amazing little place. It's so beautiful.\"\"I wanted to do the opening scene from Mission: Impossible - Rogue Nation but I'm still trying to get access to the airfield where it was filmed.\"This was an obvious one to do. Mission Impossible is one of my favourite franchises.\"I went to the Mission: Impossible - Fallout premiere last summer. I took this a couple of weeks before so the cast could sign it.\"Images copyright as stated."}