{"author":"By Helen Catt","title":"HRT: 'The menopause made me feel I was disappearing inside myself'","news_category":"general","content":"\"I am a Wednesday and a Sunday person. Don't laugh, but I deep condition my hair, put on a face pack and change my HRT patch. It's all self-care in one go.\"Fifty-one year-old Adelle Martin is sitting in the pub she runs in Rochester in Kent, showing us the HRT patches she sticks on her hip twice a week.Now post-menopausal, she coaches other women through a life stage which can be extremely challenging.Adelle's menopausal symptoms started very early, when she was just 39, and working in finance. She went through the menopause itself three years later and says the experience affected everything about her life.\"It was like I was disappearing inside myself - I could be really, really tearful or really, really grumpy and that was really difficult for the people around me.\"When I was at work and with my team, I had to try hard not to cry and not to scream.\"She lost her confidence, suffered from mood swings and \"brain fog\". She also had the classic symptom associated with menopause - the hot flush.\"It is the most burning feeling ever. What people see is the sweat. For me, it was burning and tightening of my chest and the feeling of suffocating sometimes and wanting to get out.\"Adelle says she even had one of the stranger of the 34 symptoms of menopause - the sensation of getting electric shocks.She laughs. \"That was quite funny\"Overall, what was happening to her though was anything but funny.Her voice starts to crack as she recalls having to take time out of her job.\"The hardest thing was looking in the mirror and not recognising yourself and that's what took me out of the boardroom.\"The confidence had gone, I felt hot all the time, my skin, my hair... everything lacked. I felt like I just completely lost myself. At the time I didn't know what it was. It was the menopause.\"Relief came when Adelle asked to be put on hormone replacement therapy (HRT) which, she says, stopped her hot flushes and helped her think more clearly.Nine years on, she still uses the patches to guard against any possible weakening of her bones.Each prescription costs £9.35 on the NHS. Adelle currently gets one box every three months but used to pay for it every month before asking her GP for a longer prescription.She has one patch that contains two hormones - oestrogen and progesterone. Some women have to buy them separately, which means they pay twice.In Scotland, Wales and Northern Ireland, prescriptions are free on the NHS.Labour MP Carolyn Harris has put forward a Private Members' Bill to Parliament calling for that to be extended to England too.She acknowledges HRT is \"not for everyone\" but says there should be choice.\"We're talking about 51% of the population who are suffering this and need the choices to make this decision if they want HRT.\"She is putting the bill forward as part of a wider campaign to raise awareness of the menopause.\"It's not just about the HRT, it's about education, it's about employment, it's about relationships, it's about sharing, it's about talking about it.\"The bill certainly has got Westminster talking about the menopause.Health Minister Maria Caulfield has promised it will be a priority in the government's forthcoming Women's Health Strategy.She made the commitment in a debate to mark World Menopause Month.Several female MPs had earlier shared their personal experiences, symptoms and all.With millions of women eligible, the cost of making HRT free in England would be significant.It's not just menopausal women who have to pay regularly for prescriptions. People with long-term health conditions have been campaigning for their medications to become free in England too.The Prescription Charges Coalition is a group of 51 organisations calling on the government to scrap charges for those with long-term conditions.Coalition chair Laura Cockram says the cost of buying multiple items can prove difficult. \"If you're somebody who has Parkinson's, you could have eight or nine medications each month so it's really expensive to live with a long-term condition like that,\" she says.\"You can buy a pre-payment certificate - for three months, it costs just over £30. For 12 months, it costs just over £108. But some people have told us, particularly those with long-term conditions, that actually that is quite a lot of money to find to pay that upfront cost.\"According to the Menopause Charity, only 12% of menopausal women in the UK take HRT.Some argue that misinformation and a lack of knowledge can be more of a barrier for women than cost.A flawed study conducted in the US in the early 2000s led to misleading publicity about the possible risks of HRT, which is still blamed by some for putting women off taking it.The government says it is \"crucial\" the menopause is \"taken seriously and women get the support they need\".It says it is \"deeply committed to ensuring women are able to access high quality menopause treatment, including HRT, which can be a lifeline for women who are experiencing severe symptoms.\""}