{"author":"By Clare Hutchinson & Max Evans","title":"Taking HIV drug PrEP 'doesn't mean you're promiscuous'","news_category":"general","content":"This video can not be played'People think using PrEP means you put it about'\"Just because you're using PrEP, it doesn't mean you're putting it about.\"For thousands of people like Chris Hicks, a 35-year-old DJ from Cardiff, HIV-prevention drug Pre-exposure prophylaxis (PrEP) has diminished the fear around sex.New studies are looking at whether the drug could increase \"risky behaviour\" and infection rates for other STIs.Chris says that, while he's \"not always 100% safe\", he'd like to see some stigma around the drug disappear.\"Some people will automatically assume that, because you're on PrEP, you put it about quite a lot and you're very promiscuous, when really it's not,\" he said.\"You're just taking an extra precaution towards protecting yourself. It's just an added thing to go toward your usual safe-sex practices.\"PrEP is provided on the NHS in Scotland, with a study being run in Wales <https:\/\/www.bbc.co.uk\/news\/uk-wales-45436514> and an impact trial involving thousands of people <https:\/\/www.bbc.co.uk\/news\/uk-england-46653462> being rolled out in England.The drug has been hailed as a \"milestone\" in the battle against HIV. But some research <https:\/\/www.bbc.co.uk\/news\/uk-scotland-47369728> has suggested its use could lead tomore cases of other STIs, such as syphilis and gonorrhoea <https:\/\/www.bbc.co.uk\/news\/uk-scotland-47369728>. One study by the University of New South Wales in Australia found HIV-negative men <https:\/\/www.hiv.gov\/hiv-basics\/hiv-testing\/learn-about-hiv-testing\/understanding-hiv-test-results> using PrEP were more likely to have unprotected sex.Chris said that as a gay man who grew up in the 1980s, HIV was a lingering spectre which left him \"more wary\" of certain sexual activities.He said using PrEP made him feel \"more relaxed and not as scared\" about sex and, \"like everyone\", he was not always entirely safe.\"I am in a relationship and we don't use condoms and I still take PrEP as well, just because sometimes we might decide we want to open up our relationship.\"We have that as well as a back up. Then it's our decision among me, my partner and who else we might engage with. That's then something else we need to discuss. We always say that we're on PrEP.\"While no-one has criticised him directly, Chris has seen people slamming PrEP users online and on dating apps.\"That's about them not being fully educated on it - they're just making their own opinions\".This video can not be playedCould the PrEP drug help to eliminate HIV?As of February, 841 people had been prescribed PrEP in Wales since July 2017 - as part of the study, Public Health Wales (PHW) is researching whether there is evidence PrEP increases infection rates and antimicrobial resistance for other STIs.Dr Giri Shankar, of PHW, said some groups \"exhibiting risky behaviour\" might be at a greater risk and the organisation was \"monitoring that closely\".\"At this point in time, we do not have conclusive data to say there is an increase in sexually transmitted diseases among our PrEP users,\" he said.Screenings show of the 841 people taking PrEP, 137 had gonorrhoea, 112 had chlamydia and 25 had syphilis, although there was no indication whether these numbers had increased since the study began.Dr Shankar said PHW recommended those having unprotected sex and with multiple partners should use preventive measures and have regular screenings.Ceri Dunstan, of the Terrence Higgins Trust said: \"There may be some reports of increases in other STIs but the point is the people on PrEP are actually seeing sexual health specialists, they are going into clinics for regular check-ups, which they might not have been doing otherwise.\"We're always been very clear as a trust that PrEP will only prevent HIV, it doesn't prevent anything else, but that at the very least is one big step forward.\"Ms Dunstan said as the study in Wales progressed, the trust would like to see more demographic information collected about those accessing the service in order to \"target messages a bit more effectively\".For Chris, the experience of taking PrEP has been overwhelmingly positive. \"It's made me a lot more relaxed and less scared to go out and have some fun because it does give you that extra protection,\" he said.\"[But] taking it isn't the be-all and end-all of protecting yourself, because there are other STIs out there.\""}