{"author":"","title":"Jack Smith: Why a war crimes expert will decide whether to charge Trump","news_category":"general","content":"This video can not be playedWatch: US attorney general announces appointment of special counselMerrick Garland is the master of understatement. In a press conference announcing his decision to appoint a special counsel to investigate former President Donald Trump, the US attorney general said that the criminal investigations in question \"have received significant public attention\".A former president has never been investigated in the way that the justice department has been looking into Mr Trump.There's never been a surprise FBI search of a former president's residence like the one at Mar-a-Lago in August.There's never been allegations that a former president has violated the Espionage Act by illegally possessing classified documents.There's never been a grand jury investigating a former president and his allies for involvement in a plot to disrupt the transfer of power to his successor.But then there's never been a president quite like Donald Trump.Mr Garland's move indicates that this administration is painfully aware the investigation into Mr Trump's handling of classified documents after his presidency and the efforts to overturn the 2020 presidential election results involve the highest of political stakes.A move by Joe Biden's justice department to indict a man who could be facing off against him in the 2024 presidential general election would be viewed by as much as half the country as suspicious - regardless of the traditional assurances that the justice department operates independently of the White House and its political concerns.\"Based on recent developments, including the former president's announcement that he is a candidate for president in the next election, and the sitting president's stated intention to be a candidate as well, I have concluded that it is in the public interest to appoint a special counsel,\" Mr Garland said in announcing the move.Handing this off to a special counsel, and giving that counsel power to do as he sees fit, provides the Biden administration with at least a measure of insulation against such allegations. It also may indicate that the justice department believes there is sufficient evidence to prosecute Mr Trump, as a case without merit could have been simply dropped without further action.The special counsel Mr Garland named, Jack Smith, worked on high-stakes political prosecutions in the justice department during the Barack Obama administration, but his current role investigating Kosovo war crimes at The Hague gives him a certain amount of detachment from current domestic US politics.His background as a New York organised-crime prosecutor also suggests he has the temperament for high-pressure criminal cases.\"If I were the sort of person who could be cowed... I would find another line of work,\" Mr Smith told the New York Times in 2010. \"I can't imagine how someone who does what I do or has worked with me could think that.\"All this is serious business for Mr Trump and his closest allies, just days after he launched his third bid for the White House.Although a Trump representative called it a \"totally expected political stunt\", it presents a new, difficult-to-ignore legal threat to the former president.Special counsel inquiries tend to take on lives of their own, and find new prosecutorial avenues to explore.Robert Mueller's Russia inquiry stretched on for nearly two years and led to 34 criminal indictments and eight convictions or guilty pleas. The final Mueller report, which concluded that Russia had attempted to subvert the US 2016 presidential elections but found no conclusive ties between that nation and the Trump campaign, stretched to 448 pages.Similar investigations conducted separately from usual justice department operations during the George W Bush and Bill Clinton presidencies resulted in similar headline-grabbing revelations and prosecutions.They led to the conviction of a top aide to Vice-President Dick Cheney and to Mr Clinton's 1998 impeachment.Mr Garland has set in motion a whirlwind whose ultimate course will be difficult to predict."}