{"author":"","title":"Doncaster Sheffield Airport: Travellers, workers and businesses hit by closure","news_category":"general","content":"The closure of Sheffield Doncaster Airport has been confirmed by the site's owners. Peel Group said it would begin winding down operations at the end of October. BBC News spoke to people who will be affected by the end of commercial flying at the South Yorkshire airport.Leiah Marie Herring was planning to fly as part of a party of 10 to Benidorm in June 2023.Ms Herring, who lives in the village of Cantley, less than three miles from the airport, said this would have been her children's first time abroad\"I'm devastated. The location of the airport was the whole reason for booking the trip,\" she said.\"I don't drive and we had budgeted for the holiday, not for travel to the airport, but now our nearest airport is a couple of hours away and with such a big group, we'd need at least two taxis, maybe more.\"I just can't afford that.\"Ms Herring added: \"I don't know what we'll do now.\"One caller to BBC Radio Sheffield <https:\/\/www.bbc.co.uk\/sounds\/play\/p0d2rcl4?at_custom4=E06CBBD0-3DB3-11ED-9455-22BF96E8478F&at_custom1=link&at_custom3=LR+BBC+Radio+Sheffield+&at_medium=custom7&at_campaign=64&at_custom2=facebook_page&fbclid=IwAR0lu99XvFYYETfoFYQHm9sWEnPdHSke2dxXjxezOFBDgxgYKhMkv_SRyYI> said he believed everything about Doncaster Sheffield Airport (DSA) had been \"first class\".\"It's just so sad that they're shutting it down. It was so easy to get to,\" he added.Meanwhile Wiola Rychlowska, who regularly uses the airport to travel to see family in Poland and Lithuania, said in future she would have to travel to Birmingham Airport or \"other airports far away from here\".She said the closure of DSA was \"not good news - it's a real problem for us now, I'm very sad\".Less Dobbs, senior organiser for the GMB union, said he was \"devastated and amazed\" by the news of the airport's closure.Mr Dobbs' union represents many of the 800 workers who face losing their job when the airport shuts its doors.He said: \"I've had discussions today with members and with our shop stewards on-site and they're absolutely devastated and angry.\"Angry that the offer of public money, well, it hasn't even been considered.\"Mr Dobbs said he believed Peel Group's intention had \"always been to shut the airport\".He said the union would \"continue to fight and campaign to the bitter end\".Manchester Airports Group has offered guaranteed interviews for affected staff at its airport sin East Midlands, London Stansted and Manchester.A series of jobs fairs are due to run over the next week and a spokesperson said: \"All affected staff from DSA are invited to attend, to learn more about available opportunities and the recruitment process.\"Craig Dowie runs the Crown Hotel in Bawtry, close to DSA. He said more than 35% of the hotel's bedrooms were used by airport staff.Mr Dowie said everything he had done in the last 20 years had revolved around the airport: \"We even refurbished our hotel to fit in line with cabin crew and pilot requirements.\"\"We were told this was going to be the economic driver for the whole region, that song has been sung for the last 20 years of how it's going to get bigger and better - every single economic report that's been done, central and pivotal to the whole success of the region was the airport,\" he said.\"This is a massive blow to the accommodation side of our business, we're going to have to cast the net much wider now and will fight tooth and nail for the staff working around here and the local companies that rely on the airport as will probably every other business in Doncaster.\"Twenty years of talking and hot air from Peel and never really coming up with the goods.\"The firm said \"no tangible proposals\" had been received around the ownership of the airport or which addressed a lack of \"financial viability\".It said it had been \"actively engaging with politicians locally and nationally since it began its review into the airport's future in July.A spokesperson for Peel also said the firm's board had concluded \"that it cannot responsibly accept public money for this highly uncertain process\" in response to an offer by South Yorkshire politicians to help fund the airport while a buyer could be found.Robert Hough, chairman of Peel Airports Group, said: \"The intractable problem remains the fundamental and insufficient lack of current or prospective revenue streams, together with the airport's high operating costs.\"Our employees have always been DSA's greatest asset, and we are grateful to them all, past and present, for their dedication and diligence over the years.\"The immediate priority remains to continue engaging closely with them over the next few weeks.\"As such, DSA will now begin a formal process of consulting with team members. \"We will do everything we can to minimise the impact of these proposals and work closely with local authorities and agencies to support our employees through what we know will be an extremely difficult period.\"Follow BBC Yorkshire on Facebook <https:\/\/www.facebook.com\/BBCYorkshire\/>, Twitter <https:\/\/twitter.com\/bbclooknorth> and Instagram <https:\/\/www.instagram.com\/bbcyorkshire\/>. Send your story ideas to yorkslincs. Newsyorkslincs.news@bbc.co.uk <mailto:yorkslincs.news@bbc.co.uk>."}