{"author":"","title":"Torfaen care leavers' council tax exemption to be Wales first","news_category":"general","content":"Torfaen council will become the first in Wales to exempt all care leavers from paying council tax up to the age of 21.Torfaen councillor Colette Thomas proposed the motion <http:\/\/moderngov.torfaen.gov.uk\/documents\/s26929\/Motion%2017%20October%202017%20-%20Cllr%20C%20Thomas%20WordVersion.pdf> at a meeting of the full council on Tuesday.The motion was unanimously accepted, and the new exemption will come into effect next April.About 30 care leavers will be affected in the Torfaen council area.Ms Thomas, a Labour councillor, said: \"Care leavers who were looked after by the local authority are amongst the most vulnerable groups in our community.\"As a corporate parent the council should aim to keep young people safe and improve their life chances.\"Plans to exempt care leavers up to the age of 26 in Scotland <http:\/\/www.bbc.co.uk\/news\/uk-scotland-scotland-politics-41584218> were revealed last week .Thirty-seven councils in England also exempt care leavers up to varying ages.Of the 21 other local authorities contacted by BBC Wales, 13 said they did not currently offer such an exemption, although Gwynedd said it was considering it. The others did not respond.This video can not be playedAlex Sommerville said it was \"easy for care leavers to get into debt\"Alex Sommerville, from Swansea, was 17 when she moved into her first flat after leaving care.She said she was \"paranoid about getting into debt\" because she did not have a \"safety net\", and that she would often go without things.\"I would really have to save and scrimp to buy bits to make my flat look like a home,\" she said.\"Council tax, for me, was the second highest bill after rent and I was really panicky about making sure it was paid on time.\"It was about £70 a month. That would go really far in sorting those basics out, things you can buy for yourself you know are going to last a few years.\"My budget strategy was 'don't buy anything'. I didn't go to the cinema, I didn't go out with friends.\"Luckily, I did alright financially. I didn't get into debt, but I think that was just because I was so neurotic about it.\"Miss Sommerville, now a substance misuse worker, said: \"I'm supporting young people who are in their first place and they don't have any kind of social network to get those little essentials: 'I've got some old furniture' or 'I'll give you a tenner towards some kitchen stuff'.\"There's young people I know who only have one towel or they've not got a wardrobe so all their clothes are just in black bags on the floor.\"The Children's Commissioner for Wales, Sally Holland, said in her Hidden Ambitions report <https:\/\/www.childcomwales.org.uk\/wp-content\/uploads\/2017\/02\/Hidden-Ambitions.pdf> that young people leaving care should be given priority in work by the Welsh Government to see what can be done to make council tax fairer.Ms Holland also said consideration should be given to \"schemes used in England, such as allowing an initial period of time when it doesn't have to be paid or a reduced amount to be paid\".And a report by the Children's Society in 2016 <https:\/\/www.childrenssociety.org.uk\/sites\/default\/files\/pcr073_care-leavers-financial-exclusion-final.pdf> recommended that care leavers should be exempt from paying council tax until the age of 25.Deborah Jones, boss of Voices from Care Cymru, said Torfaen council will \"be creating a leading corporate parenting milestone and setting an example which should be considered by all the remaining local authorities in Wales\".A Welsh Government spokesperson said it was \"pleased to see this important issue\" being considered and that the Welsh Local Government Association and local authorities were being asked to \"look at using discretionary powers to grant care leavers a full dispensation from council tax\" regardless of personal circumstances.The WLGA will discuss the issue later this month."}