{"author":"","title":"Christopher Alder death: New blow for body mix-up family","news_category":"general","content":"The exhumation of a body mistakenly buried in the grave of a former paratrooper will also disturb the remains of the ex-soldier's niece.Police are investigating the mix-up in Hull after Christopher Alder's body was found in a mortuary 11 years after his family thought they had buried him.It is now believed the body of a woman, Grace Kamara, was buried in his place.Mr Alder's brother Richard said his daughter Laura's ashes had been scattered on his grave after she died.The ex-paratrooper died in police custody in Hull in 1998.Mrs Kamara is understood to have died from natural causes in 1999 but her burial was delayed and finally schedule for Friday.It is believed the mix-up was only discovered because her friends and family asked to see the body and Mr Alder's remains were found in its place in the mortuary.His brother said the fact his daughter's ashes would be disturbed had added to the family's \"horror and pain\".He said his 25-year-old daughter died in 2006 and she had requested her ashes be scattered on her uncle's grave.Mr Alder said: \"We are distraught that Christopher's body was left for 11 years in a mortuary after we thought we had buried him.\"This has come as a sickening blow after everything we went through when Christopher died in police custody in 1998.\"\"The police have told us that the body of whoever is buried in Christopher's grave will have to be exhumed.\"This means that Laura's remains will also be disturbed and this just adds to our horror and pain at this time.\"Mr Alder has called for a full independent inquiry, adding: \"This should never have happened and it must never be allowed to happen again.\"The mix-up is being investigated by South Yorkshire Police instead of Humberside Police because of the Humberside force's links with Mr Alder's death.Ten years ago, a coroner's jury decided Mr Alder was unlawfully killed.In 2002, five Humberside Police officers went on trial accused of manslaughter and misconduct in public office but they were cleared of all charges on the orders of the judge.Four years later, an Independent Police Complaints Commission report said four of the officers present in the custody suite when Mr Alder died were guilty of the \"most serious neglect of duty\".The Police Federation said the officers involved \"strongly disputed\" the report's conclusions."}