{"author":"By Charlotte Hayward","title":"Concerns over new 'menopause delay' procedure","news_category":"general","content":"Experts have raised concern over a new medical procedure that claims to allow women to delay the onset of the menopause by over a decade.Its long-term safety and success remains untested - but some women have already paid at least £6,000 for the procedure.Prof Simon Fishel, the leading IVF expert behind ProFam, the Birmingham-based company that has created the procedure, says it increases their chances of having a baby in later life and can combat health issues associated with the menopause - such as heart conditions and bone weakening.The procedure involves surgically removing a small portion of one of the ovaries - which is then formed into tiny strips and frozen.They can then be thawed, and grafted back into the body.According to the private doctors providing the procedure, if the patient wants the section of the ovary put back inside her to help her have a child, it can be reinserted near her fallopian tube later in life.If her wish is to slow down the menopause, it can be placed in a site where there is good blood supply - usually the armpit.The earlier in life the initial procedure to remove part of the ovary is carried out, Prof Fishel says, the greater the benefits - as there will be more eggs and the ovary will be more \"hormone-packed\".But so far, only 11 women have had the procedure.Prof Fishel accepts the procedure is \"experimental\" as a whole but says its component parts are not.A similar procedure has been used successfully by doctors to help women at risk of losing their ovarian function as a result of cancer treatment.And there is now \"enough information\" to say the procedure is safe.But Dr Melanie Davies, who chairs Fertility Preservation UK, warns against \"healthy women going through surgery that would not otherwise be needed... in the hope of preserving future fertility and hormone replacement\".\"We know that fertility can be restored in a proportion of women that have had cancer,\" she says.\"But no healthy women have gone through this yet and there is no evidence that graft will last more than 10 years.\"So it will be of limited help for hormone replacement.\"Existing hormone replacement therapy (HRT) is \"well researched and widely available for women who choose to take it\", Dr Davies says.And for women who want to increase their chances of having a baby later in life egg freezing is a \"far better established procedure\" than Prof Fishel's \"unproven technique\".Dr Davies, sits on the British Menopause Society's Medical Advisory Committee, which says the potential impact of removing ovarian tissue on long-term ovarian function, including fertility, requires \"further assessment and evaluation\" - and Prof Fishel's has a number of \"limitations\".Not all women want treatment to relieve symptoms of the menopause but options are available.The main treatment is hormone replacement therapy, which can relieve many associated symptoms, especially hot flushes and night sweats - although it is not advisable for some.Further steps can also be taken:Source: NHS and Dr Heather Currie, former chair of the British Menopause SocietyDespite the concerns, Prof Simon Fishel's own daughter, Savannah, 22, is keen to pursue the procedure.She is \"definitely not wanting to pop out babies anytime soon\", Savannah tells the BBC's Today and Victoria Derbyshire programmes.\"One thing I'm definitely not focused on now is having kids,\" she says.\"I love my job and there's so many other things I want to do before then.\"I don't want in the back of my mind that if I do want kids, I've got to get it done now, get a ring on my finger.\"Follow the BBC's Victoria Derbyshire programme on Facebook <https:\/\/www.facebook.com\/VictoriaDerbyshire> and Twitter <https:\/\/twitter.com\/VictoriaLIVE> - and see more of our stories here <https:\/\/www.bbc.co.uk\/programmes\/b05qqk5c\/clips>. "}