{"author":"","title":"Dorset sea swimmers say sewage discharge made them sick","news_category":"general","content":"Open water swimmers say repeated discharges of raw sewage into the sea are making them ill.Sewage was discharged at 17 Dorset beaches last week after heavy rainfall.Jude Harford from Poole believes it was to blame for an ear infection she developed after going in the sea on Friday. She said others in her swimming group have also suffered ailments.Wessex Water said sewage from storm overflows was \"heavily diluted\" and had \"no impact on the environment\".Ms Harford, a nurse, regularly swims with a group of people throughout the year.She said: \"Several of us have experienced health problems, from ear infections to stomach upsets.\"I even know of someone who had an eye infection that has permanently affected their vision because of it.\"I swam on Friday morning and I've had earache since then. \"Given that I've had ear infections a lot of times when there has been a sewage dump, it wouldn't be surprising if it was down to that.\"Ms Harford said she would now try to keep her head out of the water and avoid going in the sea after heavy rainfall.Charity Surfers Against Sewage said there had been 400,000 sewage discharges into UK waterways in 2020, and it had collated more than 150 health reports of people getting sick after entering the water.Wessex Water said storm overflows acted as \"relief valves\" during wet weather, releasing excess water into rivers or the sea to prevent flooding.A spokesperson said: \"As any sewage included is heavily diluted by the storm water, it has no impact on the environment and it's rare for it to cause pollution.\"The sea contains bacteria from a number of sources - some natural, such as wildlife faeces - and after it rains, bacteria levels may increase due to agriculture run-off or other sources.\"Last Wednesday, MPs rejected a Lords amendment to the Environment Bill <https:\/\/www.bbc.co.uk\/news\/uk-politics-59040175> that would have placed legal duties on companies to reduce discharges.Follow BBC South on Facebook <https:\/\/www.facebook.com\/bbcsouthnews\/>, Twitter <https:\/\/twitter.com\/bbcsouthnews>, or Instagram <https:\/\/www.instagram.com\/bbcsouthnews>. Send your story ideas to south.newsonline@bbc.co.uk <mailto:south.newsonline@bbc.co.uk>."}