{"author":"","title":"Liversedge: Beau, 5, closes in on clinical trial cancer target","news_category":"general","content":"The mother of a girl with an aggressive form of cancer has praised her \"amazing\" local community for raising £290,000 towards pioneering treatment.Five-year-old Beau, from Liversedge, Kirklees, was diagnosed with high-risk neuroblastoma in December 2020.Her family are trying to raise £317,000 to allow her to take part in a specialist clinical trial in the US.Shirley Hepworth, Beau's mother, said the aim of the new treatment was to reduce the chance of relapse.If they reach their target, the funds will allow Beau to take part in the Bivalent Vaccine clinical trial at the Memorial Sloan Kettering Cancer Centre in New York, once her NHS treatment ends in April.Ms Hepworth said Beau's \"relentless and unforgiving\" chemotherapy, stem cell transplant and immunotherapy treatments had gone well so far, with the focus now on preventing relapse.\"To see a child go through what she's been through the last year, you don't want to see your child do it once, let alone go through it again,\" she told BBC Breakfast.\"If the vaccine can reduce the risk of it coming back, it's massive for us.\"The Solving Kids' Cancer charity said neuroblastoma returns in almost 50% of children and if this happens, fewer than one in 10 will survive.Beau's family also aims to help further research of potential NHS treatment options in the UK, with their MP Kim Leadbeater planning on raising it in Parliament.Ms Leadbeater, Labour MP for Batley & Spen, said: \"We've had cake bakes, own clothes 'rainbow' school days, one guy ran round the community every hour for 24 hours, we've got a midnight walk coming up,\" she said.\"People have organised these events in tiny little villages and the word has just spread beyond and beyond - it shows you how people pull together when times are really tough.\"Ms Hepworth added: \"The success of the campaign is down to the community, everybody has been so amazing and they've jumped on the back of it and recognised Beau, a child of that community, and done everything.\"Follow BBC Yorkshire on Facebook <https:\/\/www.facebook.com\/BBCYorkshire\/>, Twitter <https:\/\/twitter.com\/bbclooknorth> and Instagram <https:\/\/www.instagram.com\/bbcyorkshire\/>. Send your story ideas to yorkslincs.news@bbc.co.uk <mailto:yorkslincs.news@bbc.co.uk>."}