{"author":"","title":"Ron DeSantis still hasn't said he's running for president. What's he waiting for?","news_category":"general","content":"This video can not be playedWatch: Five things to know about Ron DeSantisFlorida Governor Ron DeSantis isn't running for the Republican Party's 2024 presidential nomination yet. But he kind of is.The conservative firebrand, who public opinion surveys suggest is the most popular Republican choice not named Donald Trump, has not officially announced his candidacy, but he's taking all the steps one would expect of a politician on the verge of a presidential plunge.He's made recent appearances outside his state, including to law enforcement groups in New York, Pennsylvania and Illinois. He has upcoming party fundraising events scheduled for Alabama, California and Texas. His political action committee is hiring staff with national campaign experience. And his aspirationally titled new memoir - The Courage to Be Free - will hit the stands on Tuesday, for which he has a full slate of promotional media appearances scheduled.So what is he waiting for? By this time four years ago, there were 11 Democratic candidates vying for their party's nomination, including future (for a time) front-runners Bernie Sanders and Elizabeth Warren. Two candidates had already announced and subsequently dropped out. The race for the Democratic nomination was in full swing.According to Florida-based conservative columnist Myra Adams, the answer is straightforward. Mr DeSantis has every reason to launch a bid - he either wins and gets the nomination or loses and is well positioned for another shot in 2028. But because he was just inaugurated to a second four-year term as governor last month, he needs to wait to enter the race until after the Florida legislative session ends, which could come as late as May.\"Announcing now wouldn't be a good idea,\" she says. \"He just got re-elected, and having six months of breathing room makes sense. Then he can leverage the Florida legislative session to show off his leadership skills to a national audience.\"On Monday, the governor signed a law curtailing the ability of Disney <https:\/\/www.bbc.com\/news\/world-us-canada-64792926>, which operates a theme park in central Florida, to run the local government and infrastructure services around its property. Mr DeSantis has sparred with the California-based entertainment giant over his conservative education policies, including a law limiting how public-school teachers can discuss LGBT issues. The confrontation made national headlines.He has appointed prominent conservatives to positions overseeing Florida universities and supported legislation that would defund diversity programmes, curtail faculty tenure, set new general education requirements and target gender and race studies in colleges.Mr DeSantis also has a major address to the state on 7 March, which will give him a platform to further tout the kind of conservative governing bona fides that will appeal to Republican primary voters outside of Florida.He's hit the road to promote the kind of political memoir typically released by prospective White House candidates. On Sunday, he gave his first media interview on the topic, to Mark Levin of Fox News.During the interview, he decried the political influence of big corporations, accused federal bureaucrats of undermining conservative policies and defended what some have criticised as his overly aggressive brand of politics.\"If you're not on offence, then you're basically a sitting duck and you let these people come and just take pot shots at you all the time,\" he said.He also said he considered himself a Midwesterner at heart - identifying with a region that's a key battleground in presidential elections.The DeSantis book itself is the kind of cautious work typical of politicians with national ambitions who don't want the written word to come back to haunt them.In excerpts published in the New York Post, the Florida governor touts his accomplishments in Florida and speaks warmly of his potential opponent, Mr Trump and the \"good relationship\" they had while he represented a Florida district in Congress.He also credits the former president with helping him win the Florida governor job - up to a point.\"I knew a Trump endorsement would provide me with the exposure to [Republican] primary voters across the state of Florida, and I was confident that many would see me as a good candidate once they learned about my record,\" he said.If Mr DeSantis and the former president had a good relationship, it has become strained - to say the least - with the former considering a 2024 bid and the latter already in the race. Mr Trump has lobbed a bevy of attacks against the Florida governor in recent weeks, deriding him with nicknames and accusing him of being a globalist, of supporting an endless war in Ukraine, and of being too quick to shut down the state during the Covid-19 pandemic.Mr DeSantis has so far declined to return fire. And he is staying away from the Conservative Political Action Conference (CPAC) near Washington DC later this week, where he would have shared a stage with his rival. According to Myra Adams, taking a pass at CPAC - and holding his tongue when it comes to Mr Trump - is a wise move at this point.\"He's going to create more buzz by not being there,\" she says. \"CPAC is TPAC - it is a Trump rally. Why would DeSantis even want to put himself in that situation? Instead, it sets up a clear divide - Trump's camp and DeSantis's camp.\"But, she says, a fight is coming - because both Mr Trump and Mr DeSantis think they can come out on top in the Republican nomination contest.Public opinion polls provide evidence for both sides to feel confident - and nervous. In multi-candidate contests, Mr Trump usually leads. A recent Fox News poll puts the former president at 43%, with Mr DeSantis at 28% and everyone else - formally announced or otherwise - in single digits. In a head-to-head survey conducted by the Club For Growth earlier this month, however, Mr DeSantis led Mr Trump 49% to 40%.\"Neither one believes that they can lose,\" Ms Adams says. \"Each one thinks the other is completely beatable. They know their weak points. They know how to attack them. Neither one is going to back down. It's going to be brutal.\""}