{"author":"","title":"Ilkley river clean-up: Bathing water status plan opposed","news_category":"general","content":"Plans to designate a West Yorkshire river a bathing water have been opposed by councillors, angering campaigners.Ilkley Clean River Group asked the Department for Environment, Food and Rural Affairs (Defra) for the status to reduce sewage discharges into the River Wharfe.District councillors Mike Gibbons, Anne Hawkesworth and Kyle Green have said the river is not safe for swimmers.They added it would make overcrowding at the river in summer much worse.More stories from around Yorkshire <https:\/\/www.bbc.co.uk\/news\/live\/uk-england-leeds-54027279>Ilkley Clean River Group said it was \"shocked\" at the move. Writing on Twitter, it said: \"Bathing status gets us the management plan these councillors say is needed.\"It gets us improved facilities. It makes it safer. Source: DefraIn a joint statement due to be read out at a town council meeting next week, Mr Gibbons, Mrs Hawksworth and Mr Green said they agreed the water needed to be cleaned up, but that they did not want to \"promote\" or \"encourage\" bathing at the River Wharfe.They said: \"All rivers are dangerous and the River Wharfe especially so. Over the years there has been loss of life and \"near misses\" in the Wharfe on many, many occasions.\"Mrs Hawksworth added that any decision to swim in the river should be an individual's decision. \"I am not opposing. I am not supporting. However by supporting the application it appears to me we would be encouraging people to swim there- that must be their decision,\" she said.Mr Green said: \"I am committed to ending the discharge of raw sewage into rivers and believe that the way to do so is by supporting proposed legislation that looks to ban this occurring rather than by granting bathing status which may have unintended consequences that further exacerbate existing issues in the riverside area in Ilkley.\"The councillors mentioned issues over the summer, when hundreds of people flocked to the river bank to swim, ignoring social distancing guidelines.The crowds led to problems with litter, and the lack of toilet facilities meanttoilet roll and nappies were left in nearby woodland. <https:\/\/www.bbc.co.uk\/news\/uk-england-52867696>Campaigners have been working towards cleaning up the river for about two years however, as sewage, including solid waste and sanitary products, can spill into the river from an overflow outlet at a nearby treatment plant. <https:\/\/www.bbc.co.uk\/news\/uk-england-leeds-45008347>Yorkshire Water has said the amount released from its site on Ashlands Road was within the conditions permitted by the Environment Agency (EA).Members of the public are able to comment on the Bathing Water Status application on theDefra website.  <https:\/\/www.gov.uk\/government\/consultations\/bathing-waters-designation-of-an-area-of-the-river-wharfe-ilkley>Follow BBC Yorkshire on Facebook <https:\/\/www.facebook.com\/BBCYorkshire\/>, Twitter <https:\/\/twitter.com\/bbclooknorth> and Instagram <https:\/\/www.instagram.com\/bbcyorkshire\/>. Send your story ideas to yorkslincs.news@bbc.co.uk or send video here <https:\/\/www.bbc.co.uk\/send\/u49571818>."}