{"author":"","title":"Ukraine war: 250 Ukrainians offered refuge with Urdd","news_category":"general","content":"The youth organisation Urdd Gobaith Cymru says it will offer short-term accommodation for up to 250 Ukrainians.It is part of Welsh government plans to act as a \"super sponsor\" for refugees from the country, starting on 26 March.It is hoped it can help refugees arrive quickly without needing to demonstrate a link to Wales first.More than 10,000 people <https:\/\/www.bbc.co.uk\/news\/uk-wales-60792449> have expressed an interest in housing refugees in Wales through a separate part of the Homes for Ukraine scheme.Under the super sponsor plans Welsh officials want to set up welcome centres to house refugees for three months.The first will involve an Urdd centre. The Welsh government has not published its location for security reasons.\"Wrap-around\" services have been promised, with healthcare, food, case workers and education on site.This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.It comes after the Urdd housed refugees from Afghanistan last year.Unlike previous schemes funded by the Home Office, the centres will be paid for by the Welsh government, as similar facilities will not be set up in England.The Welsh government will also be ultimately responsible for finding the refugees homes.It is not clear at the moment when people will arrive to Wales through the super-sponsor route, although ministers hope to support a minimum of 1,000 people.The Scottish government is also planning to act as a super sponsor.Sian Lewis, chief executive of the Urdd, said: \"The Urdd would like to wholeheartedly thank all pupils, schools and groups who have given their place in the gwersyll [camp] to support the refugees in their time of great need.\""}