{"author":"By Shazia Ali","title":"Diversity: Does the National Eisteddfod reflect modern Wales?","news_category":"general","content":"This video can not be playedMaggi Noggi, S4C presenter and drag queen has praised the diversity of the eventIt's a celebration of all things Welsh: Culture, music and language. But how is a festival rooted in tradition going to adapt and appeal to a modern, diverse Wales?The National Eisteddfod aims to be inclusive, welcoming people who aren't as familiar with the Welsh language as it moves around the country.Now in Tregaron, Ceredigion, questions have been raised about how it can successfully achieve inclusivity in its rural location.This year marks the fifth year of Mas ar y Maes (out on the Maes in Welsh), the Eisteddfod's celebration of LGBTQ culture involving a series of workshops, panels, and events.For the first time, culminating in Thursday's Parti Pinc, there was an introduction to ballroom culture - an underground LGBTQ subculture involving black and Latino people that originated in New York - from the Welsh Ballroom Community.S4C presenter and drag queen Maggi Noggi, from Anglesey, praised the diversity of the event.\"Eisteddfod is a celebration not only of language, but celebration of people,\" she said.\"It's a beautifully inclusive place where everybody's welcome, to express themselves.\"My experience in Wales is generally a very tolerant and accepting culture.\"She also believes Wales' history is important, adding: \"We've been oppressed, we've been supressed, and I don't think we ever want to be in a position where we're doing that to somebody else.\"Because there are people in deepest, darkest, rural Wales who might never come across queer people or people of colour, or people who are different until they come here and they see them.\"When you see those things happening here, especially here at the National Eisteddfod, that then seeps out into the wider culture.Mas ar Maes launched in 2018 by Stonewall, and local LGBTQ communities of the National Eisteddfod locations.Iestyn Wyn, who is the complaints, policy and research manager at Stonewall Cymru, said it was an event that has been integral and an expected part of the wider National Eisteddfod.\"Eisteddfod-goers have welcomed the events that have been held over the years. And the more we hold events, the more we get to learn about our own histories as well,\" he said.\"Within Wales we have our own histories and own records of LGBTQ+ people, campaigning for equality that we don't necessarily hear about, in comparison to the fight for equality and social justice we hear from other parts of the UK. So celebrating and bringing that to the forefront is vital.\"Leena Sarah Farhat, who is from an Asian background and is 24, said she believed there was further work to do when it comes to including minority communities.\"As a woman of colour I am treated differently to the other people working on my stall,\" she said.\"It is strange because people will come to you assume that you don't speak Welsh, I do and I work through the medium of Welsh, and that can be quite alienating. So I'm really glad to see a lot of diversity in the musical acts and the stages on the Eisteddfod.\"Ashok Ahir is the chairman of the National Eisteddfod board, and said they were committed to making improvements, but \"they won't happen overnight\".\"What we need to do, particularly in the Eisteddfod, like in any other cultural organisation, is not just open the doors, but go out and grab people and bring them to the door,\" he said.\"For me, part of the challenge always has to be, do you put race and diversity in with other equalities matters.\"I think you can. I think the challenge we have at the moment is so big, that actually you need to be doing that as a central plank on its own. And that's something we'll be doing in the next 12 months.\"It was my first time at the National Eisteddfod, and I was overwhelmed at the sights and sounds.Every corner of The Maes was buzzing with music, dance and some form of wacky and wonderful performance art.It was an amazing representation of Welsh culture, but for me, having lived my whole life in south Wales, Welsh life has always been a myriad of cultures and identities, made up of people who feel Welsh - whether they speak the language or not.Welsh Language is of course the integral facet of the Eisteddfod, a space that celebrates the language that has a history of fighting to survive - as have many minority and marginalised communities.I agree with Maggi Noggi who said the fight for Welsh culture to survive, makes us a people who are inclusive.And people at the Eisteddfod are definitely patient with English speakers, or those of us with a primary school level of Welsh.Mas ar yr Maes is proof that events like this are embracing all types of people in Wales, but there is always room to go further in representing that people of colour are just as proud of being Welsh as anyone else.And with everything else that should make us a modern nation; making things accessible for people with disabilities should be at the centre of planning."}