{"author":"","title":"Bloody Sunday: McCarron family call for prosecution","news_category":"general","content":"The daughter of a man wounded on Bloody Sunday is calling for the prosecution of a soldier accused of firing the shot that caused her father's injuries.Pius McCarron was struck by masonry after members of the Army's Parachute Regiment opened fire on civil rights demonstrators in Londonderry in 1972.Maureen McCarron said a soldier, known only as Sergeant O, should now be prosecuted.The Telegraph <https:\/\/www.telegraph.co.uk\/news\/2018\/07\/31\/betrayal-british-soldier-interrogated-police-bloody-sunday-attempted\/> has reported Sergeant O could face an attempted murder charge.The new head of the UK armed forces said on Friday he would not allow British soldiers to be \"chased\" by people making \"vexatious claims\" about their conduct in the Troubles <https:\/\/www.bbc.co.uk\/news\/uk-45050693>.Chief of the Defence Staff General Sir Nick Carter told the BBC serving and former service personnel should face action for \"genuine\" wrongdoing, but said groundless cases \"will not happen on my watch\".Thirteen people were shot dead on Bloody Sunday.The 76-year-old former soldier is alleged to have fired the shot that struck masonry that injured Mr McCarron and another protestor.The Saville Inquiry <https:\/\/www.bbc.co.uk\/news\/10319881> report found that Mr McCarron and Patrick McDaid were injured by debris sent flying by shots fired as they were attempting to run away from the south-eastern area of the Rossville Flats car park.A year after he was injured, Mr McCarron suffered a brain haemorrhage. His family believe that is directly linked to the injuries he sustained on Bloody Sunday.Mr McCarron's daughter Maureen told BBC Radio Foyle: \"Everyone says daddy was left the way he was because of Bloody Sunday.\"We know deep down it was Bloody Sunday, he was bleeding that day from the ears and that indicates brain damage, a brain injury.\"She said the brain haemorrhage changed her father. He became \"a very different man\" who was prone to lashing out, said Ms McCarron.\"Even my daddy knew he was not the man he was supposed to be,\" she said.Ms McCarron said prosecuting Sergeant O was the right thing to do.\"That masonry that bounced off that wall and hit my father's head was caused by Soldier O. I think he should be prosecuted.\"It was his decision to pull that trigger, to fire that bullet, and he should face the consequences.\"\"We want justice. But I don't think my family will ever get justice for what happened to my father.\"The BBC has contacted Sergeant O's solicitor but has yet to receive a response.Sergeant O was interviewed by police under caution for attempted murder more than two years ago over events at Bloody Sunday.He told The Telegraph on Friday: <https:\/\/www.telegraph.co.uk\/news\/2018\/08\/02\/head-armed-forces-troops-did-bloody-good-job-row-grows-hounding\/> \"Nick Carter's comments are helpful but he must now do something. He must press the government to act. It can't go on like this.\"A spokesperson for the Ministry of Defence (MOD) said the \"relative peace and stability that Northern Ireland enjoys today\" is \"due to the courageous efforts of our security forces\".\"We are now consulting on new legacy institutions to replace the current processes and ensure that there is no unfair and disproportionate focus on former members of the Armed Forces and police officers,\" the spokesperson added.The MOD also said it provides \"legal and pastoral support to any veteran who requires it\".Clarification 9 April 2019: This article was amended to remove a reference to the death of John Johnston. This reflects the Bloody Sunday Inquiry's finding about Mr Johnston's death several months after he was wounded in Derry on 30 January 1972. The inquiry report states that his death was \"not the result of any of the wounds he sustained on Bloody Sunday\"."}