{"author":"","title":"Thursford Christmas Spectacular organisers ecstatic at return","news_category":"general","content":"Organisers of annual Christmas shows that were cancelled last year by the Covid pandemic said they were \"nervous but ecstatic\" for them to resume.The Thursford Christmas Spectacular in Norfolk said 101,000 tickets from a possible 110,000 had been sold.George Cushing said the company had seen \"a slight decline\" from coach bookings, with people further away \"perhaps wary\" of travelling too far.He said anti-Covid measures had been introduced to help keep audiences safe. Mr Cushing, an associate producer, said most people travelling to the shows were preferring to travel as smaller groups in cars.He said while there were no legal government restrictions that the shows had to comply with, they would be \"doing much as we can to keep everybody safe\" including \"vigorous cleaning\" between performances.\"We've upgraded our ventilation systems in the whole building. We've put in new air-exchangers in the auditorium and in the cast changing rooms, which is a huge undertaking,\" said Mr Cushing.The company has asked people to be double-vaccinated or at least take a lateral flow test before arriving, although no proof would be required.\"We are trusting people will respect everyone else in the audience, especially our cast,\" said Mr Cushing.\"The theatre industry is very fragile at the moment and we can't afford and don't want to shut down.\"Jason Loates, who runs the Wensum Lodge Hotel in nearby Fakenham, said guests who had been forced to cancel last year had re-booked.He said the spectacular was \"a great boost\" for the hospitality industry in what is normally a quiet month and \"helps on the road to recovery\".Eastons Coaches, which operates in Norfolk and Suffolk, said it had also moved all of last year's cancelled bookings across to this season, and had sold 1,000 tickets.Claire Smith said: \"We are fortunate that sales have been very strong for the festive period.\"The annual event, which began at the Thursford site in 1977 and has had distinguished guests including royalty, employs about 300 people.Find BBC News: East of England on Facebook <https:\/\/www.facebook.com\/bbcnewseast\/>, Instagram <https:\/\/www.instagram.com\/bbceastofengland\/> and Twitter <https:\/\/twitter.com\/bbclookeast>. If you have a story suggestion email eastofenglandnews@bbc.co.uk <mailto:eastofenglandnews@bbc.co.uk>"}