{"author":"By Sam Gruet","title":"Cost of living: The care leavers struggling to find university accommodation","news_category":"general","content":"Growing up in care, Jess had no idea her background would make it so difficult for her to find somewhere to live at university.That's because the majority of university and private rented accommodation ask for a guarantor.Most students can get a parent or family member to be the person who promises to cover the rent if they're unable to make repayments.But for 16,000 UK university students - like Jess - who are care leavers or estranged from their families, that isn't an option.Jess started looking for her second-year accommodation during her first term at Birmingham City University because of the competition for properties.\"I don't have any family, I don't have a support network,\" she tells BBC Newsbeat.\"I'm pretty much on my own, apart from the friends I have which are also 18-year-olds at university and they can't really agree to take on thousands of pounds of debt if I didn't pay my rent.\"I'm having to borrow extra money on top of my student loan and I'm living off a £26 a week budget for everything I need.\"Jess says looking for somewhere to live also started to affect her studies.\"I couldn't focus on my uni work and I have to practically beg my university for an extension because of the situation.\"It's terrifying because if something goes wrong here, I'm not going to have a place to live any more.\"Birmingham City University told Newsbeat it doesn't comment on individual cases and circumstances.But, a spokesman said, it works with private providers to \"ensure all students who require accommodation are able to secure it\".He said the uni doesn't require a guarantor for its own accommodation, and if a student can't provide one for a private landlord \"the university signposts them to services that can act as a guarantor\".Hearing from people like Jess has led to charity Unite Foundation calling on universities to provide a rent guarantor service for students.Without that, they can be asked to pay six or 12 months' rent in advance.Unite Foundation's director Fiona Ellison says it's putting people from a care background off going to uni.\"In the current cost-of-living crisis, it's just not really a feasible option,\" she says.\"Some students don't feel like they're able to ask friends or extended family, they might decide that they can't stay at university, and will drop out.\"Nehaal Bajwa, from the National Union of Students, agrees with the charity that more needs to be done, saying \"it is difficult or impossible to get a guarantor\".\"They can be asked to pay up to six months or the whole year's accommodation fees in advance, despite loans only coming in once a term, and risk substandard housing at best and homelessness at worst.\"For University of Strathclyde student Sam, finding somewhere to live has also been a struggle.\"It has a huge impact on my mental health, you're stressed out all the time,\" she says.\"You get anxiety about whether you're going to find somewhere secure to live.\" She says having to ask friends to be a guarantor has made her feel ashamed. \"I had to ask one of my friends who has a mortgage, he had to divulge really sensitive information.\"I just found really embarrassing to have to ask somebody to do that. And the landlord still said no.\"I think universities need to look at this issue immediately, it's one of the main issues that stops people from getting into university and achieving what everybody else has.\"The University of Strathclyde says it's \"committed to welcoming and supporting our care-experienced students\".It says it has partnered with the Unite Foundation and encourages eligible students to apply for the Unite Accommodation scholarship which offers free accommodation for care-experienced students in Glasgow.Follow Newsbeat on Twitter <https:\/\/twitter.com\/BBCNewsbeat> and YouTube <https:\/\/www.youtube.com\/channel\/UCe1Ef-K5jpnRsmVY5hCBhOw>.Listen to Newsbeat live <https:\/\/www.bbc.co.uk\/sounds\/play\/live:bbc_radio_one> at 12:45 and 17:45 weekdays - or listen backhere <http:\/\/www.bbc.co.uk\/programmes\/b006wkry\/episodes\/player>."}