{"author":"By Antoinette Radford","title":"Ukraine war: Germany won't block export of its Leopard 2 tanks, foreign minister says","news_category":"general","content":"Germany's Foreign Minister Anna Baerbock has said she \"would not stand in the way\" of Poland if it were to send Leopard 2 tanks to Ukraine.Ukraine has called on the West to provide the German-made tanks which they say will help them defeat Russia.Ukraine's Foreign Minister Dmytro Kuleba told the BBC that Germany had the power to \"save the lives of many Ukrainian soldiers\".But Germany is yet to agree and its export laws have stood in Poland's way.On Sunday, Ms Baerbock said Poland had not yet asked for export permission.\"For the moment the question has not been asked, but if we were asked we would not stand in the way,\" she told France's LCI TV.Poland's Prime Minister Mateusz Morawiecki said on Monday the government would request authorisation from Berlin. But he said Poland would send the tanks to Ukraine, even if it was not granted.\"Even if ultimately we did not get this consent, within the framework of a small coalition... we will still hand over our tanks, together with others, to Ukraine,\" Mr Morawiecki said.The European Union's foreign policy chief, Josep Borrell, said Germany would not stop other EU countries exporting Leopard tanks.He added that discussions of support for Ukraine should not solely revolve around tanks.In a BBC interview Ukraine's Dmytro Kuleba appealed to all countries willing to send Leopard 2 tanks to \"immediately, officially request the German government to allow delivery of these tanks to Ukraine\".\"This is the move that will make the whole situation crystal clear and we will see where it takes Germany. This is something that needs to be done right away and everything will become obvious,\" he added.Mr Kuleba also told national TV on Monday that he was \"confident\" Germany would supply the tanks eventually: \"We already received British Challenger. They said it would be impossible... Every time in the end we obtained the desired result. We will have it this time as well.\"A spokesperson for the German government said it had not yet received any requests to authorise delivery of the Leopard 2 tanks.Last week, Mr Morawiecki said Poland was ready to provide 14 Leopard 2s for Kyiv.On Monday, the Polish president's foreign policy adviser, Marcin Przydacz, said he welcomed Ms Baerbock's announcement, but would prefer to hear Germany's position confirmed by Chancellor Olaf Scholz.\"It turns out that through talks and diplomatic actions, Poland is able to change the German position,\" Mr Przydacz told Polish Radio.However, Poland ultimately wants Berlin and Nato allies to also send their own Leopards, because government officials admit that 14 tanks will have a limited impact on Ukraine's fighting capacity.Meanwhile, Vyacheslav Volodin, Speaker of Russia's Duma lower house of parliament, warned that the United States and Nato support of Ukraine would risk sparking a \"terrible war\", and supplying weapons that Ukraine could use to \"strike civilian cities and attempt to seize our territories\" would lead to \"retaliatory measures using more powerful weapons\".The Leopard 2 tanks were specifically designed to compete with the Russian T-90 tanks, which are being used in the invasion.There are believed to be more than 2,000 of them worldwide and Ukraine President Volodymyr Zelensky said about 300 of them would help ensure a Russian defeat.Many allied countries have become frustrated with Germany over its reluctance to send its own Leopard 2 tanks.Under current regulations, Germany must also sanction any re-export of its tanks by other countries, such as Poland.Following a meeting of more than 50 allied countries on Friday, Germany had not yet committed to supplying the tanks nor releasing their export licence. But it denied unilaterally blocking the tanks' export.In a joint statement on Saturday the foreign ministers of Estonia, Latvia and Lithuania told Germany \"to provide Leopard tanks to Ukraine now\".By Chris Partridge, BBC weapons analystThe Leopard 2 tank is a world-class weapon used by more than a dozen countries.Ukraine sees tanks as another vital part of its defence against Russian forces and Leopards have seen combat action in Afghanistan and Syria.What makes them particularly attractive to Kyiv is that nearly two-thirds of all Leopards produced are still in Europe. So physically getting Leopards to the fight is relatively straightforward. That also makes maintenance and repair - vital aspects of any weapons system - easier too.It is worth remembering in all this that Germany is giving Ukraine vital air defence systems, such as IRIS-T and Patriot surface-to-air missiles, as well as armoured personnel carriers.Mr Scholz has traditionally been sceptical of German involvement in military conflicts, and concerned about triggering an escalation from Russia.The chancellor met French president Emmanuel Macron at the weekend to reiterate the two countries' post-war alliance.France has already committed to sending light tanks to Ukraine, and Mr Macron suggested it was possible that French-made Leclerc heavy tanks may also be delivered to Ukraine.Other countries have committed to sending tanks, including the UK, which will send 14 Challenger 2s."}