{"author":"","title":"Daniel Boulton trial: Accused was on 'autopilot'","news_category":"general","content":"A man accused of the murder of a woman and her nine-year-old son said he was \"on autopilot\" when he stabbed them, a psychiatrist has told a court.Bethany Vincent and Darren Henson were found fatally injured at their home in Louth, Lincolnshire, on 31 May 2021.At his trial at Lincoln Crown Court, a jury has heard that Daniel Boulton, 30, had developed a \"hatred\" for Darren, his former partner's son.Mr Boulton denies murder but has admitted their manslaughter.He was said to have travelled 28 miles (45km) from his home in Skegness on foot to stab Ms Vincent and her son \"numerous times\".Dr Pablo Vandenabeele, a psychiatrist instructed by the defence, told the court Mr Boulton had \"no control\" when he killed the pair.Giving evidence, Dr Vandenabeele told the court: \"In his words, he went into autopilot.\"He said, 'It is like I wasn't there and autopilot did the job for me'.\"Describing the moment Ms Vincent was stabbed, Dr Vandenabeele said Mr Boulton had told him: \"It is like she went into the knife.\"He added Mr Boulton had also said: \"The initial few stabs wasn't me.\"Cross-examining Dr Vandenabeele, prosecutor Katherine Goddard QC asked him if he believed the defendant had lost control.\"The ferocity of the attack, to me, indicates he lost control of his actions,\" the doctor replied.Ms Goddard then asked: \"But could it also be consistent with someone expressing rage in the form of pure violence?\"\"I guess that's a matter for the jury to decide, but, in my opinion, he did lose control,\" he replied.Ms Goddard listed the occasions ahead of the killings where it was agreed the defendant had control, such as his walk to the property and the fact he waited outside and had a cigarette outside the property afterwards.She then asked Dr Vandenabeele: \"But you say no control in the few moments it took to kill?\"\"That is my understanding, yes,\" he replied.The trial continues.Follow BBC East Yorkshire and Lincolnshire on Facebook <https:\/\/www.facebook.com\/BBCLookNorth\/>, Twitter <https:\/\/twitter.com\/looknorthBBC>, and Instagram <https:\/\/www.instagram.com\/bbclooknorth\/>. Send your story ideas to yorkslincs.news@bbc.co.uk <mailto:yorkslincs.news@bbc.co.uk>."}