{"author":"By Paul Glynn","title":"Gay writers 'still new', says Russell T Davies","news_category":"general","content":"Russell T Davies has said openly gay writers are \"still very new\" to society, meaning bringing gay issues to the screen is \"rich open territory\".Speaking to BBC Radio 4's Desert Island Discs <https:\/\/www.bbc.co.uk\/programmes\/b006qnmr>, The Queer as Folk and Years and Years creator joked \"we've always been there\", adding it's time to \"celebrate\" that fact in TV and literature.When quizzed by host Lauren Laverne on why he was happy to be described as \"a gay writer\", the Welshman replied: \"Well it's unexplored territory, and it is still.\"Any sense of queerness, any sense of otherness is still very very new as a society.\"We've always been there, behind the scenes, making the sensible decisions for thousand of years. Just saying: 'If you built that on the left it would all be so much better'... [or] 'Hadrian just move that wall a little bit' - there was undoubtedly a gay man there saying: 'Just don't go all the way!'\"\"But now as an out society we are less than 50 years old really, and that's nothing,\" he went on. \"That's tiny little babies and there are things that we've felt, things that we've said, emotions in our hearts that have not been put on screen yet or on the page or into fiction.\"The 56-year-old suggested it was as important for modern writers to show there are things that gay people feel, say and do \"that are identical to other people\".\"That needs saying as well, that we are exactly the same,\" he declared.\"It's all there to celebrated. It's wonderful, it's rich open territory.\"Growing up as a \"wimpish gay boy\" in Swansea in the '60s and '70s, Davies told Laverne that his father was \"brilliant\" about the fact he didn't want to play rugby like a lot of the other lads.He also spoke about finding a passion for drama when he joined the West Glamorgan Youth Theatre company, and his recent TV hits, including A Very English Scandal and the dystopian series Years and Years.\"The world itself is getting madder and faster and stranger and I wanted to capture that on screen.\"His song selections to take to that famous mythical island, included Kate Bush's Wuthering Heights and \"the greatest club track of all\" - Hold That Sucker Down (builds like a skyscraper mix) by OT Quartet, which featured in his ground-breaking and semi-autobiographical Channel 4 series, about the lives of three gay young men in Manchester.ELO's Mr Blue Sky also featured as it was the track that was playing when he and his late husband Andrew walked down the aisle. Or at least is was before the record cut out, hilariously.Davies spoke movingly about stopping work to look after his \"truly extraordinary\" partner, who died of brain cancer last year.\"It was hard and also it was an honour to be the person doing that,\" he said of becoming Andrew's carer, following a series of debilitating operations.Doctors had given him just 18 months to live but he survived for another eight years - \"the happiest years\" of their marriage. \"They were so intimate and honest and everything else just falls away and there's no nonsense - there's it's just you and him.\"Davies added: \"If you'd have asked me at the time what's it like to be a carer, thinking 'year four', I'd have been going [it's] 'driving me a bit mad, I wouldn't mind a bit of freedom'.\"Now I've got the freedom, I'd chuck away that freedom away in an instant just to have five more minutes sitting watching the television with him.\"Davies confirmed it had been a boyhood dream come true when he was asked to re-launch Dr Who in the mid-noughties for a new generation.He daydreamed that if he had his own personal Tardis now, he'd go back to 1998 to the \"magic moment\" he and Andrew - \"the nicest man in the world\" - met in a nightclub in Manchester's Canal Street.\"He will be in every good man I ever write now.\"Finally, as is tradition on the show, this week's castaway was allowed to select a book and a luxury item. He plumped for \"the finest book ever made\", Asterix and the Roman Agent, as well as a box of black Ball Pentel pens - \"for the artist in me\".Desert Island Discs is on Radio 4 at 11.15 GMT on Sunday 3 NovemberFollow us on Facebook <https:\/\/www.facebook.com\/BBCEntsNews\/>, or on Twitter @BBCNewsEnts <https:\/\/twitter.com\/BBCNewsEnts>. If you have a story suggestion emailentertainment.news@bbc.co.uk <mailto:entertainment.news@bbc.co.uk>."}