{"author":"By Lyse Doucet","title":"Afghans face pivotal moment as US prepares to 'close the book'","news_category":"general","content":"\"We need to close the book on a 20-year war,\" is how a US official put it when he broke the news on Tuesday that the last US troops would be out of Afghanistan by 11 September.Two decades on, what does this \"book\" say about the country that some 10,000 US-led Nato forces will soon leave behind?It's a dramatically different country than the shattered land and pariah state of the Taliban toppled in the US-led invasion of 2001 after the 9\/11 attacks.But this withdrawal window is decisive. It could accelerate a push towards peace, or a descent into violence that shreds the more open society which has been taking root - however slowly and unevenly - over the past two decades.\"The best possible outcome to expect is that this withdrawal timeline serves as a catalyst and a mechanism to pressure Afghan parties to reach a political settlement by September or face a bloody Syrian-style civil war,\" warns Tamim Asey, Executive Chairman of the Institute of War and Peace Studies in Kabul.Few would have expected this last chapter of the US military mission to read like this: a triumphal Taliban poised to return to power on the battlefield or through peace talks where they hold most of the cards; much-vaunted \"gains\" slipping away by the day in a wave of targeted killings of the educated, active, and ambitious lifeblood of an emerging society.Many Afghans now fear a terrible tumbling towards civil war in a conflict already described as one of the most violent in the world.\"I worry most when timelines are attached to their pullout, but not conditions,\" regrets an Afghan human rights activist. \"The Taliban will just wait them out and won't get into substantive issues.\"It's a view echoed by others. \"I wish President Biden had conditioned the troop withdrawal timeline with zero killings on the ground by all parties between May and September,\" reflects Orzala Nemat, director of the Afghanistan Research and Evaluation Unit (AREU).But the senior administration official who briefed journalists on the pullout was adamant: \"The president has judged that a conditions-based approach, which has been the approach of the past two decades, is a recipe for staying in Afghanistan forever.\"There's also a pledge to \"use our full toolkit to ensure the future that the Afghan people are seeking has the best chance of coming about\".But Washington's best bargaining chip has been its military might. The departure of all foreign troops now bolstering Afghan government forces has been the Taliban's single-minded pursuit as their fighters keep inching back, district by district, across a growing number of provinces.There were no good options on President Joe Biden's desk when he inherited last year's US Taliban deal which committed Washington to a 1 May troop pullout in exchange for Taliban security guarantees and a vaguer commitment to reduce violence and pursue peace talks.This video can not be playedIs peace with the Taliban possible? (2019 report)The security of the United States - the reason that first brought its troops in - had to be a deciding factor. And other Nato forces are expected to follow the US lead.\"This is not 2001, it is 2021,\" was how a senior US official replied when questioned about the continuing threat posed by groups like al-Qaeda and Islamic State which still have a presence in Afghanistan.\"We judge the threat against the homeland now emanating from Afghanistan to be at a level we can address without a persistent military footprint in the country and without remaining at war with the Taliban.\"\"The decision was always going to come down to a broader political judgment about American interests writ large and from that perspective, the decision makes sense,\" says Laurel Miller, director of the Asia Programme at the International Crisis Group and a former US State Department official.But regret quickly creeps in.\"It's a tragedy that the US didn't get serious about trying to stitch together a peace process in Afghanistan much earlier, before the thread ran out,\" comments Miller, who had been involved in some of the first tentative efforts exploring negotiated solutions.Now it's the seriousness of Afghan leaders, on all sides of this conflict, which is paramount.\"The voices of the Afghan people are very clear and unified in calling for peace, justice, and the preservation of national and democratic values,\" emphasises Nemat of AREU. \"But the political elite are still trying to maximise their share of power in a power-grabbing opportunity just like 1992.\"History throws a long dark shadow in Afghanistan. Many of the same power brokers and warlords who turned their guns on each other in a frenzy of infighting after the Soviet troop pullout of 1988 have been given pride of place in a new negotiating process which has been taking shape.There's an argument that only they have the clout to strike a deal with the Taliban. But there's also anxiety that they can't and won't speak for the Afghanistan of 2021 including victims of war crimes, women's activists, and broader civil society.There's a jumble of peace plans from political rivals, including a grand blueprint from President Ashraf Ghani's office. A High Council for National Reconciliation has to first reconcile competing perspectives in Kabul.As for the Taliban, they're still fixated on the US's broken pledge to pull out completely by 1 May.\"Until all foreign forces completely withdraw from our homeland, the Islamic Emirate will not participate in any conference that shall make decisions about Afghanistan,\" announced Taliban spokesman Dr Mohammed Naeem in a Twitter post a few hours after news of the US decision broke.The conference in question now is a \"high level and inclusive conference\" hosted by Turkey, Qatar, and the United Nations, set for Istanbul on 24 April. It's a crucial piece in the Biden administration's new Afghan jigsaw. The UN is being brought centre stage as efforts are stepped up to jump-start peace talks as well as forge a consensus among regional powers, each with their own Afghan proxies.In the Gulf state of Qatar, where teams of Taliban and Afghan government negotiators have been meeting on and off since September, some Taliban were heard using the English idiom \"the ball's now in our court\" in reaction to news of a delayed US pullout. They've always insisted they're in pursuit of peace.\"The Taliban leadership has shown no sign of wanting peace, and every sign of wanting to pursue a route to power through war,\" assesses Kate Clark, Co-Director of the Afghanistan Analysts Network.The traditional \"fighting season\" looms amid reports of a blistering Taliban campaign in store; Afghan government forces are also braced for battle.\"Who preserves the gains of the last 20 years if there's worsening civil war or where the Taliban capture territory?\" asks Clark. \"Where there's conflict, freedoms evaporate; where the Taliban rule they are as authoritarian as before, and few girls go to school above primary age in Taliban-controlled areas.\"Mindful of this hot button issue, the US is at pains to point it will \"work with other countries using diplomatic, economic, and humanitarian tools to protect the gains made by Afghan women\".\"Biden wants to get out of the Afghan war, but not Afghanistan,\" says Asey of the Institute of War and Peace Studies in an effort to present a brave face at this pivotal juncture.As the US seeks to \"close the book\" on its longest war, Afghan minds are now sharply focused on the next chapter of their own longer war without end."}