{"author":"","title":"Dr Carl Clowes, a 'visionary' who revived Welsh language learning","news_category":"general","content":"Tributes have been paid to Dr Carl Clowes, founder of Nant Gwrtheyrn, the Welsh language centre.Nant Gwytheyrn Trust was established in 1978, based in the abandoned quarry village near Llithfaen, Gwynedd.Dr Clowes worked as a GP in the area and said people were initially sceptical about buying and renovating a whole village to teach adults Welsh.Huw Jones, Chair of Nant Gwrtheyrn <https:\/\/nantgwrtheyrn.org\/>, said Wales had \"lost one of the great benefactors of the Welsh language\".The centre now has more than 30,000 visitors a year and offers a wide range of residential courses for anyone wishing to learn Welsh.As well as promoting the Welsh language, the establishment of the centre provided long-term employment, and offered solutions for public sector employers who require staff with Welsh language skills.\"Carl Clowes was a visionary in the true sense - a man who had dreams, succeeded in inspiring thousands of others to share them, and with the practical ability and stubbornness to turn them into a reality,\" added Mr Jones.\"In the case of Nant Gwrtheyrn, the symbolic sadness of the village in ruins was known to a whole nation.\"But Carl saw how life could be brought back to the Nant by creating a language centre there.\"The intention from the outset was a development that would create thousands of new Welsh speakers, while creating significant employment for Welsh speakers in an area where work was scarce, following the closure of the quarries.\"And he succeeded.\"This article contains content provided by Twitter. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readTwitter’s cookie policy, external <https:\/\/help.twitter.com\/en\/rules-and-policies\/twitter-cookies> and privacy policy, external <https:\/\/twitter.com\/en\/privacy> before accepting. To view this content choose‘accept and continue’.Dr Clowes and his wife Dorothy had four children, daughters Rhiannon and Angharad, and Cian Ciaran and Dafydd Ieuan, who became members of theSuper Furry Animals <http:\/\/www.superfurry.com\/> group.He was a member of the Gorsedd, where he was honoured for his \"local, national and international service\".His philanthropic nature also took him in many directions.He chaired organisations such as Antur Aelhaern, the first Community Co-operative in the UK in 1974. In 1985 he became chair of Dolen Cymru, a charity which built community links between Wales and Lesotho.He was awarded an OBE in 2011 for his services to the community on Anglesey.Among the tributes paid, Welsh language commissioner Aled Roberts said Dr Carl Clowes will be remembered \"as one of the greatest pioneers of the Welsh language over the last 40 years\".\"A man with an ambitious vision, an extraordinary business and organisational sense to turn the vision into a reality,\" he said.\"By re-opening the doors to abandoned buildings and bringing new life to an empty village in the foothills of Yr Eifl, he welcomed thousands of new Welsh speakers, and gave new energy the language.\"As we work together to reach the target of one million Welsh speakers and double the daily use of the language, Carl Clowes's great contribution will continue. The continuation of the residential classes and entertaining evenings for learners at Nant Gwrtheyrn will commemorate to his work.\"On Twitter, Anglesey MS Rhun ap Iorwerth said his contribution was \"invaluable to Wales, the Welsh language and its community\".\"The nation will benefit greatly from his vision and tenacity.\"Mabon ap Gwynfor, MP for Dwyfor Meirionnydd, added that his death was a \"tremendous loss\".\"He was a bit of a hero to me - a principled man with a clear vision and strong beliefs,\" he said.\"What he did in Llanaelhaearn and the area was well ahead of his time the community and the nation owes him a great debt.\""}